*     * FO5238 * 06/26/11 PROYECTO REBORN
000001*----------------------------------------------------------------*
000002*   DATE    INIT   CHGID                 REASON                  *
000003* --------  ----  -------  ------------------------------------- *
000004* 02/05/11   GSA  ~~~0143  APPLIED RSEC FIX FOR IM0143           *
000099*----------------------------------------------------------------*
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. IM31RWEX.
000300*REMARKS. THE REPORT WRITER PROGRAM (IM31RWEX) MATCHES CONDITION
000400*         CODES AND VALUES TO THE ACCOUNT MASTER RECORD AND
000500*         WRITES THE REPORT EXTRACT RECORD.
000600
000700 ENVIRONMENT DIVISION.
000800 DATA DIVISION.
000900 WORKING-STORAGE SECTION.
000901 77  SI-MODULE-INFO      PIC X(64)
000902     VALUE 'IM31RWEX  -----TSD-             05/10/07  15.36.26'.
000903*    THIS PROGRAM CONTAINS TRADE SECRETS THAT BELONG
000904*    TO FIDELITY INFORMATION SERVICES AND IS
000905*    LICENSED BY AN AGREEMENT.  ANY UNAUTHORIZED ACCESS,
000906*    USE, DUPLICATION, OR DISCLOSURE IS UNLAWFUL.
000907*    COPYRIGHT FIDELITY INFORMATION SERVICES
000908*    2007, ALL RIGHTS RESERVED.
001000 77  PROGRAM-NAME                PIC X(8)    VALUE 'IM31RWEX'.
001100 77  TSD-CHANGE                  PIC X(12)   VALUE '05/01/98,000'.
001200 77  DC-CHANGE                   PIC X(12)   VALUE '00/00/00,000'.
001300 77  MAINT-LENGTH                PIC S9(4)   VALUE +0 COMP SYNC.
001400 77  HX                          PIC S9(4)   VALUE +0 COMP SYNC.
001500 77  X                           PIC S9(5)   VALUE +0 COMP-3.
001600 77  Y                           PIC S9(5)   VALUE +0 COMP-3.
001700 77  Z                           PIC S9(5)   VALUE +0 COMP-3.
001800 77  W77-L1                      PIC S9(3)   VALUE +0 COMP-3.
001900 77  W77-L2                      PIC S9(3)   VALUE +0 COMP-3.
002000 77  W77-L3                      PIC S9(3)   VALUE +0 COMP-3.
002100 77  W77-OPEN                    PIC X       VALUE 'N'.
002200 77  W77-ERR-SW                  PIC X       VALUE 'F'.
002300 77  INIT-SW                     PIC X       VALUE 'N'.
002400
002500     COPY SIWSCNTL.
002600
002700     COPY IMMANTTB.
002800
002900     COPY IMWSMLNG.
003000
003100     COPY SADSCMAC.
003200
003300     COPY SADSMCMC.
003400
003500     COPY SAD9DSMC.
003600
003700 01  READ-ONLY-OPEN               PIC X(12) VALUE 'OPENR;     '.
003800 01  DICTIONARY-ELEMENT-COMMAND-E PIC X(04) VALUE 'END;'.
003900 01  DICTIONARY-ELEMENT-COMMAND-G PIC X(10) VALUE 'AUXIO GET;'.
004000
004100     COPY IMWSRWFN.
004200
004300 01  WORK-AREA.
004400     03  WK-DP.
004500         05  WK-DP9                  PIC S9 COMP-3.
004600     03  WK-DECIMAL-POS              PIC 9(04) COMP.
004700     03  WK-DEC-POSX REDEFINES WK-DECIMAL-POS.
004800         05  FILLER                  PIC X(1).
004900         05  WK-DEC-POS              PIC X(1).
005000     03  WK-EXC-CODE.
005100         05  WK-EXC-CODE9            PIC 99.
005200     03  WK-DATE.
005300         05  WK-MO                   PIC XX.
005400         05  WK-DA                   PIC XX.
005500         05  WK-YR                   PIC XX.
005600     03  WK-DMT-TABLE.
005700         05  WK-DMT-TRAN-TR.
005800             07  WK-DMT-START        PIC 9(5).
005900             07  WK-DMT-LENGTH       PIC 99.
006000             07  WK-DMT-TYPE         PIC X.
006100             07  WK-DMT-CK-SPACES    PIC X.
006200             07  WK-DMT-RECALC       PIC X.
006300             07  WK-DMT-ALLOW        PIC X.
006400     03  EXTRACT-DATA                PIC X(35).
006500     03  FILLER REDEFINES EXTRACT-DATA.
006600         05  EXTRACT-BYTE            PIC X OCCURS 35 TIMES.
006700     03  D1-DATA                     PIC X(35).
006800     03  FILLER REDEFINES D1-DATA.
006900         05  D1-DATA-SIGN            PIC X.
007000         05  D1-DATA-COMP            PIC X(34).
007100     03  FILLER REDEFINES D1-DATA.
007200         05  D1-DATE.
007300             07  D1-CC               PIC XX.
007400             07  D1-YR               PIC XX.
007500             07  D1-MO               PIC XX.
007600             07  D1-DA               PIC XX.
007700         05  FILLER                  PIC X(27).
007800     03  D2-DATA                     PIC X(35).
007900     03  FILLER REDEFINES D2-DATA.
008000         05  D2-DATA-SIGN            PIC X.
008100         05  D2-DATA-COMP            PIC X(34).
008200     03  FILLER REDEFINES D2-DATA.
008300         05  D2-DATE.
008400             07  D2-CC               PIC XX.
008500             07  D2-YR               PIC XX.
008600             07  D2-MO               PIC XX.
008700             07  D2-DA               PIC XX.
008800         05  FILLER                  PIC X(27).
008900     03  FILLER REDEFINES D2-DATA.
009000         05  D2-DATA-BYTE            PIC X OCCURS 35 TIMES.
009100     03  GO-TO-EDIT-FLD              PIC X(35).
009200
009300 01  REPORT-WRITER-RECORD.
009400     03  RWR-RECORD.
009500         05  RWR-RPT-NAME            PIC X(30).
009600         05  RWR-FIELDS.
009700             07  RWR-FIELD-NBR       PIC X(4)    OCCURS 6 TIMES.
009800             07  RWR-COND-CODE       PIC X(1)    OCCURS 6 TIMES.
009900             07  RWR-DATA-VALUE      PIC X(16)   OCCURS 6 TIMES.
010000
010100 LINKAGE SECTION.
010200     COPY IMAWKMST.
010300 01  FILLER REDEFINES MASTER-AREA.
010400     03  FILLER                  PIC XXXX.
010500*    03  MASTER-BYTE             PIC X OCCURS 16126 TIMES.
010502     03  MASTER-BYTE             PIC X OCCURS 16626 TIMES.        ~~~0143
010600
010700     COPY IMWRKBC1.
010800
010900     COPY IMWRKBC2.
011000
011100     COPY IMWSEXWK.
011200 66  IMEX-INFO    RENAMES IMEX-REC-NO   THRU EX13-REJ-RESN.
011300 66  IMEX-REC-13A RENAMES EX13-REJ-PROG THRU EX13-TRACE.
011400 66  IMEX-REC-13B RENAMES EX13-TR-TYPE  THRU EX13-RMDR.
011500
011600 01  EXCEPTION-LENGTH-TABLE          COMP.
011700     03  EX-LENGTH-TBL.
011800         05  EX-01                   PIC S9999.
011900         05  EX-02                   PIC S9999.
012000         05  EX-03                   PIC S9999.
012100         05  EX-04                   PIC S9999.
012200         05  EX-05                   PIC S9999.
012300         05  EX-06                   PIC S9999.
012400         05  EX-07                   PIC S9999.
012500         05  EX-08                   PIC S9999.
012600         05  EX-09                   PIC S9999.
012700         05  EX-10                   PIC S9999.
012800         05  EX-11                   PIC S9999.
012900         05  EX-12                   PIC S9999.
013000         05  EX-13                   PIC S9999.
013100         05  EX-14                   PIC S9999.
013200         05  EX-15                   PIC S9999.
013300         05  EX-16                   PIC S9999.
013400         05  EX-17                   PIC S9999.
013500         05  EX-18                   PIC S9999.
013600         05  EX-19                   PIC S9999.
013700         05  EX-20                   PIC S9999.
013800         05  EX-21                   PIC S9999.
013900         05  EX-22                   PIC S9999.
014000         05  EX-23                   PIC S9999.
014100         05  EX-24                   PIC S9999.
014200         05  EX-25                   PIC S9999.
014300         05  EX-26                   PIC S9999.
014400         05  EX-27                   PIC S9999.
014500         05  EX-28                   PIC S9999.
014600         05  EX-29                   PIC S9999.
014700         05  EX-30                   PIC S9999.
014800         05  EX-31                   PIC S9999.
014900         05  EX-32                   PIC S9999.
015000         05  EX-33                   PIC S9999.
015100         05  EX-34                   PIC S9999.
015200         05  EX-35                   PIC S9999.
015300         05  EX-36                   PIC S9999.
015400         05  EX-37                   PIC S9999.
015500         05  EX-38                   PIC S9999.
015600         05  EX-39                   PIC S9999.
015700         05  EX-40                   PIC S9999.
015800         05  EX-41                   PIC S9999.
015900         05  EX-42                   PIC S9999.
016000         05  EX-43                   PIC S9999.
016100         05  EX-44                   PIC S9999.
016200         05  EX-45                   PIC S9999.
016300         05  EX-46                   PIC S9999.
016400         05  EX-47                   PIC S9999.
016500         05  EX-SRC-INFO-LENGTH      PIC S9999.
016600     03  FILLER                      REDEFINES EX-LENGTH-TBL.
016700         05  EX-REC-LENGTH           PIC S9999 OCCURS 48 TIMES.
016800
016900 01  EX-SEQ-CTR                      PIC S999        COMP-3.
017000
017100 01  EX-MST-CTL                      PIC X.
017200
017300 PROCEDURE DIVISION USING MASTER-AREA
017400                          DDA-WRKBCR-1
017500                          DDA-WRKBCR-2
017600                          EXCEPTION-AREA
017700                          EXCEPTION-LENGTH-TABLE
017800                          EX-SEQ-CTR
017900                          EX-MST-CTL.
018000
018100 A0010.
018200     PERFORM X0010 THRU X0010-EXIT.
018300     IF  W77-ERR-SW EQUAL 'N'
018400         GO TO Z0010-RETURN.
018500     MOVE SPACES TO RWR-RECORD.
018600     MOVE ZERO TO X.
018700     MOVE 'N'  TO INIT-SW.
018800
018900 K0001.
019000     ADD +1 TO X.
019100     IF  X GREATER THAN +6
019200           GO TO S0010-WRITE-EXC.
019300     IF  WBC-RW-COND-CODE (X) EQUAL ' '
019400         GO TO K0001.
019500     MOVE WBC-RW-FIELD-NBR (X) TO Y.
019600     MOVE DMT-DATA (Y) TO WK-DMT-TABLE.
019700     IF  WK-DMT-START NOT GREATER THAN WS-MSTR-MAINT-PORTION
019800         GO TO K0002.
019900     IF  WK-DMT-START NOT LESS THAN WS-TRL-DATA-CNTR-STRT
020000         IF  WMS-DC-TRLR EQUAL TO '1'
020100             GO TO K0002
020200         ELSE
020300             MOVE +0 TO X
020400             MOVE 'N' TO INIT-SW
020500             GO TO Z0010-RETURN.
020600     IF  WK-DMT-START NOT LESS WS-TRL-PLAN-STRT
020700         IF  WMS-PLAN-TRLR EQUAL '1'
020800             GO TO K0002
020900         ELSE
021000             MOVE +0 TO X
021100             MOVE 'N' TO INIT-SW
021200             GO TO Z0010-RETURN.
021300     IF  WK-DMT-START NOT LESS THAN WS-TRL-DUAL-YR-STRT
021400         IF  WMS-DUAL-YEAR-TRLR EQUAL TO '1'
021500             GO TO K0002
021600         ELSE
021700             MOVE +0 TO X
021800             MOVE 'N' TO INIT-SW
021900             GO TO Z0010-RETURN.
022000     IF  WK-DMT-START NOT LESS THAN WS-TRL-EXTR-SC-STRT
022100         IF  WMS-EXT-SC-DATA-TRLR EQUAL TO '1'
022200             GO TO K0002
022300         ELSE
022400             MOVE +0 TO X
022500             MOVE 'N' TO INIT-SW
022600             GO TO Z0010-RETURN.
022700     IF  WK-DMT-START NOT LESS THAN WS-TRL-RATE-STRT
022800         IF  WMS-RATE-TRLR EQUAL TO '1'
022900             GO TO K0002
023000         ELSE
023100             MOVE +0 TO X
023200             MOVE 'N' TO INIT-SW
023300             GO TO Z0010-RETURN.
023400     IF  WK-DMT-START NOT LESS THAN WS-TRL-INVEST-STRT
023500         IF  WMS-INVESTMENT-TRLR EQUAL TO '1'
023600             GO TO K0002
023700         ELSE
023800             MOVE +0 TO X
023900             MOVE 'N' TO INIT-SW
024000             GO TO Z0010-RETURN.
024100     IF  WK-DMT-START NOT LESS THAN WS-TRL-CSH-AVAIL-STRT
024200         IF  WMS-CASH-AVAIL-TRLR EQUAL TO '1'
024300             GO TO K0002
024400         ELSE
024500             MOVE +0 TO X
024600             MOVE 'N' TO INIT-SW
024700             GO TO Z0010-RETURN.
024800     IF  WK-DMT-START NOT LESS THAN WS-TRL-FND-AVAIL-STRT
024900         IF  WMS-EFA-TRLR EQUAL TO '1'
025000             GO TO K0002
025100         ELSE
025200             MOVE +0 TO X
025300             MOVE 'N' TO INIT-SW
025400             GO TO Z0010-RETURN.
025500     IF  WK-DMT-START NOT LESS THAN WS-TRL-KITING-STRT
025600         IF  WMS-KITING-SUSP-TRLR EQUAL TO '1'
025700             GO TO K0002
025800         ELSE
025900             MOVE +0 TO X
026000             MOVE 'N' TO INIT-SW
026100             GO TO Z0010-RETURN.
026200     IF  WK-DMT-START NOT LESS THAN WS-TRL-EXTR-DEP-STRT
026300         IF  WMS-EXTRNL-DEPOSIT-TRLR EQUAL TO '1'
026400             GO TO K0002
026500         ELSE
026600             MOVE +0 TO X
026700             MOVE 'N' TO INIT-SW
026800             GO TO Z0010-RETURN.
026900     IF  WK-DMT-START NOT LESS THAN WS-TRL-INFO-STRT
027000         IF  WMS-INFO-TRLR EQUAL TO '1'
027100             GO TO K0002
027200         ELSE
027300             MOVE +0 TO X
027400             MOVE 'N' TO INIT-SW
027500             GO TO Z0010-RETURN.
027600     IF  WK-DMT-START NOT LESS THAN WS-TRL-OD-ACRUAL-STRT
027700         IF  WMS-OD-ACCRUAL-TRLR EQUAL TO '1'
027800             GO TO K0002
027900         ELSE
028000             MOVE +0 TO X
028100             MOVE 'N' TO INIT-SW
028200             GO TO Z0010-RETURN.
028300     IF  WK-DMT-START NOT LESS THAN WS-TRL-DEC-TAX-STRT
028400         IF  WMS-DCD-TAX-DATA-TRLR EQUAL TO '1'
028500             GO TO K0002
028600         ELSE
028700             MOVE +0 TO X
028800             MOVE 'N' TO INIT-SW
028900             GO TO Z0010-RETURN.
029000     IF  WK-DMT-START NOT LESS THAN WS-TRL-LMT-TRNFR-STRT
029100         IF  WMS-LIMIT-TRANSFER EQUAL TO '1'
029200             GO TO K0002
029300         ELSE
029400             MOVE +0 TO X
029500             MOVE 'N' TO INIT-SW
029600             GO TO Z0010-RETURN.
029700     IF  WK-DMT-START NOT LESS THAN WS-TRL-TARGT-BAL-STRT
029800         IF  WMS-TARGET-AMT-TRLR EQUAL TO '1'
029900             GO TO K0002
030000         ELSE
030100             MOVE +0 TO X
030200             MOVE 'N' TO INIT-SW
030300             GO TO Z0010-RETURN.
030400     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT15
030500         IF  WMS-COMBINED-STAT GREATER THAN +14
030600             GO TO K0002
030700         ELSE
030800             MOVE +0 TO X
030900             MOVE 'N' TO INIT-SW
031000             GO TO Z0010-RETURN.
031100     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT14
031200         IF  WMS-COMBINED-STAT GREATER THAN +13
031300             GO TO K0002
031400         ELSE
031500             MOVE +0 TO X
031600             MOVE 'N' TO INIT-SW
031700             GO TO Z0010-RETURN.
031800     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT13
031900         IF  WMS-COMBINED-STAT GREATER THAN +12
032000             GO TO K0002
032100         ELSE
032200             MOVE +0 TO X
032300             MOVE 'N' TO INIT-SW
032400             GO TO Z0010-RETURN.
032500     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT12
032600         IF  WMS-COMBINED-STAT GREATER THAN +11
032700             GO TO K0002
032800         ELSE
032900             MOVE +0 TO X
033000             MOVE 'N' TO INIT-SW
033100             GO TO Z0010-RETURN.
033200     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT11
033300         IF  WMS-COMBINED-STAT GREATER THAN +10
033400             GO TO K0002
033500         ELSE
033600             MOVE +0 TO X
033700             MOVE 'N' TO INIT-SW
033800             GO TO Z0010-RETURN.
033900     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT10
034000         IF  WMS-COMBINED-STAT GREATER THAN +9
034100             GO TO K0002
034200         ELSE
034300             MOVE +0 TO X
034400             MOVE 'N' TO INIT-SW
034500             GO TO Z0010-RETURN.
034600     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT9
034700         IF  WMS-COMBINED-STAT GREATER THAN +8
034800             GO TO K0002
034900         ELSE
035000             MOVE +0 TO X
035100             MOVE 'N' TO INIT-SW
035200             GO TO Z0010-RETURN.
035300     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT8
035400         IF  WMS-COMBINED-STAT GREATER THAN +7
035500             GO TO K0002
035600         ELSE
035700             MOVE +0 TO X
035800             MOVE 'N' TO INIT-SW
035900             GO TO Z0010-RETURN.
036000     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT7
036100         IF  WMS-COMBINED-STAT GREATER THAN +6
036200             GO TO K0002
036300         ELSE
036400             MOVE +0 TO X
036500             MOVE 'N' TO INIT-SW
036600             GO TO Z0010-RETURN.
036700     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT6
036800         IF  WMS-COMBINED-STAT GREATER THAN +5
036900             GO TO K0002
037000         ELSE
037100             MOVE +0 TO X
037200             MOVE 'N' TO INIT-SW
037300             GO TO Z0010-RETURN.
037400     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT5
037500         IF  WMS-COMBINED-STAT GREATER THAN +4
037600             GO TO K0002
037700         ELSE
037800             MOVE +0 TO X
037900             MOVE 'N' TO INIT-SW
038000             GO TO Z0010-RETURN.
038100     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT4
038200         IF  WMS-COMBINED-STAT GREATER THAN +3
038300             GO TO K0002
038400         ELSE
038500             MOVE +0 TO X
038600             MOVE 'N' TO INIT-SW
038700             GO TO Z0010-RETURN.
038800     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT3
038900         IF  WMS-COMBINED-STAT GREATER THAN +2
039000             GO TO K0002
039100         ELSE
039200             MOVE +0 TO X
039300             MOVE 'N' TO INIT-SW
039400             GO TO Z0010-RETURN.
039500     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT2
039600         IF  WMS-COMBINED-STAT GREATER THAN +1
039700             GO TO K0002
039800         ELSE
039900             MOVE +0 TO X
040000             MOVE 'N' TO INIT-SW
040100             GO TO Z0010-RETURN.
040200     IF  WK-DMT-START NOT LESS THAN WS-TRL-COMB-STMT-STRT
040300         IF  WMS-COMBINED-STAT GREATER THAN +0
040400             GO TO K0002
040500         ELSE
040600             MOVE +0 TO X
040700             MOVE 'N' TO INIT-SW
040800             GO TO Z0010-RETURN.
040900     IF  WK-DMT-START NOT LESS THAN WS-TRL-CUS-AVAIL-STRT
041000         IF  WMS-CUST-AVAIL-TRLR EQUAL TO '1'
041100             GO TO K0002
041200         ELSE
041300             MOVE +0 TO X
041400             MOVE 'N' TO INIT-SW
041500             GO TO Z0010-RETURN.
041600     IF  WK-DMT-START NOT LESS THAN WS-TRL-BNK-AVAIL-STRT
041700         IF  WMS-BANK-AVAIL-TRLR EQUAL TO '1'
041800             GO TO K0002
041900         ELSE
042000             MOVE +0 TO X
042100             MOVE 'N' TO INIT-SW
042200             GO TO Z0010-RETURN.
042300     IF  WK-DMT-START NOT LESS THAN WS-TRL-SAVINGS-STRT
042400         IF  WMS-SAVINGS-TRLR EQUAL TO '1'
042500             GO TO K0002
042600         ELSE
042700             MOVE +0 TO X
042800             MOVE 'N' TO INIT-SW
042900             GO TO Z0010-RETURN.
043000     IF  WK-DMT-START NOT LESS THAN WS-TRL-OD-NSF-STRT
043100         IF  WMS-OD-NSF-TRLR EQUAL TO '1'
043200             GO TO K0002
043300         ELSE
043400             MOVE +0 TO X
043500             MOVE 'N' TO INIT-SW
043600             GO TO Z0010-RETURN.
043700     IF  WK-DMT-START NOT LESS THAN WS-TRL-TRNS-AFFL-STRT9
043800         IF  WMS-TRNSFR-AFFL-TRLR GREATER THAN +8
043900             GO TO K0002
044000         ELSE
044100             MOVE +0 TO X
044200             MOVE 'N' TO INIT-SW
044300             GO TO Z0010-RETURN.
044400     IF  WK-DMT-START NOT LESS THAN WS-TRL-TRNS-AFFL-STRT8
044500         IF  WMS-TRNSFR-AFFL-TRLR GREATER THAN +7
044600             GO TO K0002
044700         ELSE
044800             MOVE +0 TO X
044900             MOVE 'N' TO INIT-SW
045000             GO TO Z0010-RETURN.
045100     IF  WK-DMT-START NOT LESS THAN WS-TRL-TRNS-AFFL-STRT7
045200         IF  WMS-TRNSFR-AFFL-TRLR GREATER THAN +6
045300             GO TO K0002
045400         ELSE
045500             MOVE +0 TO X
045600             MOVE 'N' TO INIT-SW
045700             GO TO Z0010-RETURN.
045800     IF  WK-DMT-START NOT LESS THAN WS-TRL-TRNS-AFFL-STRT6
045900         IF  WMS-TRNSFR-AFFL-TRLR GREATER THAN +5
046000             GO TO K0002
046100         ELSE
046200             MOVE +0 TO X
046300             MOVE 'N' TO INIT-SW
046400             GO TO Z0010-RETURN.
046500     IF  WK-DMT-START NOT LESS THAN WS-TRL-TRNS-AFFL-STRT5
046600         IF  WMS-TRNSFR-AFFL-TRLR GREATER THAN +4
046700             GO TO K0002
046800         ELSE
046900             MOVE +0 TO X
047000             MOVE 'N' TO INIT-SW
047100             GO TO Z0010-RETURN.
047200     IF  WK-DMT-START NOT LESS THAN WS-TRL-TRNS-AFFL-STRT4
047300         IF  WMS-TRNSFR-AFFL-TRLR GREATER THAN +3
047400             GO TO K0002
047500         ELSE
047600             MOVE +0 TO X
047700             MOVE 'N' TO INIT-SW
047800             GO TO Z0010-RETURN.
047900     IF  WK-DMT-START NOT LESS THAN WS-TRL-TRNS-AFFL-STRT3
048000         IF  WMS-TRNSFR-AFFL-TRLR GREATER THAN +2
048100             GO TO K0002
048200         ELSE
048300             MOVE +0 TO X
048400             MOVE 'N' TO INIT-SW
048500             GO TO Z0010-RETURN.
048600     IF  WK-DMT-START NOT LESS THAN WS-TRL-TRNS-AFFL-STRT2
048700         IF  WMS-TRNSFR-AFFL-TRLR GREATER THAN +1
048800             GO TO K0002
048900         ELSE
049000             MOVE +0 TO X
049100             MOVE 'N' TO INIT-SW
049200             GO TO Z0010-RETURN.
049300     IF  WK-DMT-START NOT LESS THAN WS-TRL-TRNS-AFFL-STRT
049400         IF  WMS-TRNSFR-AFFL-TRLR GREATER THAN +0
049500             GO TO K0002
049600         ELSE
049700             MOVE +0 TO X
049800             MOVE 'N' TO INIT-SW
049900             GO TO Z0010-RETURN.
050000     IF  WK-DMT-START NOT LESS THAN WS-TRL-MRKTNG-STRT
050100         IF  WMS-MARKET-TRLR EQUAL TO '1'
050200             GO TO K0002
050300         ELSE
050400             MOVE +0 TO X
050500             MOVE 'N' TO INIT-SW
050600             GO TO Z0010-RETURN.
050700     IF  WK-DMT-START NOT LESS THAN WS-TRL-LOAN-STRT
050800         IF  WMS-LOAN-TRLR EQUAL TO '1'
050900             GO TO K0002
051000         ELSE
051100             MOVE +0 TO X
051200             MOVE 'N' TO INIT-SW
051300             GO TO Z0010-RETURN.
051400     IF  WK-DMT-START NOT LESS THAN WS-TRL-SOC-SEC-STRT
051500         IF  WMS-SOC-SEC-NA EQUAL TO '1'
051600             GO TO K0002
051700         ELSE
051800             MOVE +0 TO X
051900             MOVE 'N' TO INIT-SW
052000             GO TO Z0010-RETURN.
052100     IF  WK-DMT-START NOT LESS THAN WS-TRL-NME-ADD-2-STRT
052200         IF  WMS-NME-ADDR-TLRS GREATER THAN +1
052300             GO TO K0002
052400         ELSE
052500             MOVE +0 TO X
052600             MOVE 'N' TO INIT-SW
052700             GO TO Z0010-RETURN.
052800     IF  WK-DMT-START NOT LESS THAN WS-TRL-NME-ADD-1-STRT
052900         IF  WMS-NME-ADDR-TLRS GREATER THAN +0
053000             GO TO K0002
053100         ELSE
053200             MOVE +0 TO X
053300             MOVE 'N' TO INIT-SW
053400             GO TO Z0010-RETURN.
053500     GO TO Z0010-RETURN.
053600
053700 K0002.
053800     MOVE 'F' TO INIT-SW.
053900     IF  WBC-RW-COND-CODE (X) EQUAL 'D'
054000         GO TO K0001.
054100     MOVE SPACES TO GO-TO-EDIT-FLD
054200                    EXTRACT-DATA
054300                    D1-DATA
054400                    D2-DATA.
054500     MOVE WBC-RW-DATA-VALUE (X) TO GO-TO-EDIT-FLD.
054600     MOVE WK-DMT-LENGTH TO MAINT-LENGTH.
054700     CALL 'SIMVECHR' USING EXTRACT-DATA
054800                           MASTER-BYTE (WK-DMT-START)
054900                           MAINT-LENGTH.
055000     IF  WK-DMT-TYPE NOT EQUAL 'P'
055100         MOVE EXTRACT-DATA   TO D1-DATA
055200         MOVE GO-TO-EDIT-FLD TO D2-DATA
055300         GO TO K0018.
055400     CALL 'SIVARUNP'     USING D1-DATA
055500                               EXTRACT-DATA
055600                               MAINT-LENGTH.
055700     IF  D1-DATA-SIGN    EQUAL '-'
055800         MOVE '0'           TO D1-DATA-SIGN
055900     ELSE
056000         MOVE '1'           TO D1-DATA-SIGN.
056100     MOVE +0                TO Z.
056200
056300 K0005.
056400     ADD +1                 TO Z.
056500     IF  Z        GREATER THAN AUX-NUMBER-FIELDS
056600         MOVE +0            TO X
056700         MOVE 'N'           TO INIT-SW
056800         GO                 TO Z0010-RETURN.
056900     IF  AUX-ELEMENT-ID (Z) EQUAL TSMNT-ELE-ID (Y)
057000         GO TO K0010.
057100     GO TO K0005.
057200
057300 K0010.
057400     MOVE LOW-VALUES        TO WK-DEC-POSX.
057500     MOVE AUX-NUMBER-DECIMALS (Z) TO WK-DEC-POS.
057600     MOVE GO-TO-EDIT-FLD TO EXTRACT-DATA.
057700     MOVE +35 TO Z.
057800
057900 K0011.
058000*----------------------------------------------------------------*
058100*    LOCATE FIRST NON-SPACE CHARACTER                            *
058200*----------------------------------------------------------------*
058300     IF  Z EQUAL ZERO
058400         GO TO K0001.
058500     IF  EXTRACT-BYTE (Z) EQUAL ' '
058600         SUBTRACT +1 FROM Z
058700         GO TO K0011.
058800     MOVE Z TO W77-L1.
058900
059000 K0012.
059100*----------------------------------------------------------------*
059200*    LOCATE DECIMAL POINT                                        *
059300*----------------------------------------------------------------*
059400     IF  Z EQUAL ZERO
059500         GO TO K0015.
059600     IF  EXTRACT-BYTE (Z) NOT EQUAL '.' AND ','
059700         SUBTRACT +1 FROM Z
059800         GO TO K0012.
059900     SUBTRACT Z FROM W77-L1 GIVING W77-L2.
060000     IF  W77-L2 NOT LESS WK-DECIMAL-POS
060100         GO TO K0014.
060200     SUBTRACT W77-L2 FROM WK-DECIMAL-POS GIVING W77-L3.
060300     MOVE +0 TO Y.
060400
060500 K0013.
060600*----------------------------------------------------------------*
060700*    INSERT MISSING DECIMAL POSITIONS                            *
060800*----------------------------------------------------------------*
060900     ADD +1 TO Y.
061000     IF  Y GREATER THAN W77-L3
061100         GO TO K0014.
061200     ADD +1 TO W77-L1.
061300     MOVE '0' TO EXTRACT-BYTE (W77-L1).
061400     GO TO K0013.
061500
061600 K0014.
061700*----------------------------------------------------------------*
061800*    REMOVE DECIMAL POINT                                        *
061900*----------------------------------------------------------------*
062000     MOVE EXTRACT-BYTE (Z + +1) TO EXTRACT-BYTE (Z).
062100     IF  Z LESS THAN W77-L1
062200         ADD +1 TO Z
062300         GO TO K0014.
062400
062500 K0015.
062600*----------------------------------------------------------------*
062700*    CALCULATE FIELD LENGTH                                      *
062800*----------------------------------------------------------------*
062900     IF  WK-DECIMAL-POS GREATER THAN +0
063000         SUBTRACT +1 FROM W77-L1.
063100     COMPUTE W77-L2 = (WK-DMT-LENGTH * +2) - +1.
063200     SUBTRACT W77-L1 FROM W77-L2 GIVING W77-L3.
063300     IF  W77-L3 LESS THAN +2
063400         GO TO K0017.
063500     MOVE +0 TO Z.
063600
063700 K0016.
063800*----------------------------------------------------------------*
063900*    INSERT LEADING ZEROS                                        *
064000*----------------------------------------------------------------*
064100     ADD +1 TO Z.
064200     MOVE '0' TO D2-DATA-BYTE (Z).
064300     IF  Z LESS THAN W77-L3
064400         GO TO K0016.
064500     MOVE ZERO TO Y.
064600
064700 K0017.
064800*----------------------------------------------------------------*
064900*    MOVE REMAINING COMPARE DATA                                 *
065000*----------------------------------------------------------------*
065100     ADD +1 TO Z, Y.
065200     MOVE EXTRACT-BYTE (Y) TO D2-DATA-BYTE (Z).
065300     IF  Y LESS THAN W77-L1
065400         GO TO K0017.
065500     MOVE D2-DATA TO EXTRACT-DATA.
065600     MOVE '1'     TO D2-DATA-SIGN.
065700     MOVE EXTRACT-DATA TO D2-DATA-COMP.
065800
065900 K0018.
066000*----------------------------------------------------------------*
066100*    CHECK FOR MMDDYY YEARS AND ADD CENTURY FOR COMPARE          *
066200*----------------------------------------------------------------*
066300     IF  WK-DMT-TYPE NOT EQUAL 'D'
066400         GO TO R0001.
066500     IF  WK-DMT-LENGTH EQUAL 08
066600         GO TO R0001.
066700     MOVE D1-DATA TO WK-DATE.
066800     MOVE WK-MO TO D1-MO.
066900     MOVE WK-DA TO D1-DA.
067000     MOVE WK-YR TO D1-YR.
067100     IF  WK-YR GREATER THAN WBC-NEXT-CENT-YR
067200         MOVE '19' TO D1-CC
067300     ELSE
067400         MOVE '20' TO D1-CC.
067500     MOVE D2-DATA TO WK-DATE.
067600     MOVE WK-MO TO D2-MO.
067700     MOVE WK-DA TO D2-DA.
067800     MOVE WK-YR TO D2-YR.
067900     IF  WK-YR GREATER THAN WBC-NEXT-CENT-YR
068000         MOVE '19' TO D2-CC
068100     ELSE
068200         MOVE '20' TO D2-CC.
068300
068400 R0001.
068500*----------------------------------------------------------------*
068600*    COMPARE DATA                                                *
068700*----------------------------------------------------------------*
068800     IF  WBC-RW-COND-CODE (X) EQUAL 'E'
068900         IF  D1-DATA EQUAL D2-DATA
069000             GO TO K0001.
069100     IF  WBC-RW-COND-CODE (X) EQUAL 'G'
069200         IF  D1-DATA GREATER THAN D2-DATA
069300             GO TO K0001.
069400     IF  WBC-RW-COND-CODE (X) EQUAL 'L'
069500         IF  D1-DATA LESS THAN D2-DATA
069600             GO TO K0001.
069700     MOVE +0 TO X.
069800     MOVE 'N' TO INIT-SW.
069900     GO TO Z0010-RETURN.
070000
070100 S0010-WRITE-EXC.
070200*----------------------------------------------------------------*
070300*    WRITE EXCEPTION RECORD                                      *
070400*----------------------------------------------------------------*
070500     IF  INIT-SW EQUAL 'N'
070600         GO TO Z0010-RETURN.
070700     MOVE '14' TO IMEX-REC-NO.
070800     MOVE EX-REC-LENGTH (IMEX-REC-NO9) TO IMEX-LENGTH.
070900     MOVE LOW-VALUES TO IMEX-BIN0.
071000     MOVE WMS-CONTROL-KEY TO IMEX-KEY.
071100     MOVE 'RW' TO IMEX-CODE-1.
071200     MOVE SPACES TO IMEX-CODE-2.
071300     ADD +1 TO EX-SEQ-CTR.
071400     MOVE EX-SEQ-CTR TO IMEX-SEQUENCE.
071500     MOVE WBC-RW-RPT-NAME TO RWR-RPT-NAME.
071600     MOVE +0 TO X.
071700
071800 S0010-LOOP.
071900     ADD +1 TO X.
072000     MOVE WBC-RW-FIELD-NBR (X) TO RWR-FIELD-NBR (X).
072100     MOVE WBC-RW-COND-CODE (X) TO RWR-COND-CODE (X).
072200     MOVE WBC-RW-DATA-VALUE (X) TO RWR-DATA-VALUE (X).
072300     IF  X LESS THAN +6
072400         GO TO S0010-LOOP.
072500     MOVE RWR-RECORD TO IMEX-RECORD.
072600     MOVE '1' TO EX-MST-CTL.
072700     MOVE 'L' TO I-O-CONTROL-OPERATOR.
072800     CALL 'IMTAGTS' USING I-O-CONTROL-AREA
072900                          EXCEPTION-AREA.
073000     MOVE SPACES TO IMEX-INFO.
073100     MOVE +0 TO X.
073200     MOVE 'N' TO INIT-SW.
073300     GO TO Z0010-RETURN.
073400
073500*----------------------------------------------------------------*
073600*    GET DICTIONARY DATA                                         *
073700*----------------------------------------------------------------*
073800 X0010.
073900     IF  W77-OPEN             EQUAL 'F'
074000         GO TO X0010-EXIT.
074100     MOVE 'F'                    TO W77-OPEN.
074200     MOVE LOW-VALUES             TO DICCAREA.
074300     CALL 'SADSNUCB'          USING DICCAREA
074400                                    READ-ONLY-OPEN
074500                                    AUXILIARY-TABLE-AREA.
074600     IF  DI-STATUS        NOT EQUAL ZEROS
074700         MOVE 'N'                TO W77-ERR-SW
074800         GO TO X0010-EXIT.
074900     MOVE LOW-VALUES             TO AUXILIARY-TABLE-AREA.
075000     MOVE 'DSM'                  TO AUX-TABLE-TYPE.
075100     MOVE 'IMACT'                TO AUX-TABLE-NAME.
075200     MOVE AUX-TABLE-KEY          TO DI-PREVIOUS-KEY.
075300     MOVE 'N'                    TO DI-DICTIONARY-MORE.
075400     MOVE ZEROS                  TO DI-STATUS.
075500     CALL 'SADSNUCB' USING       DICCAREA
075600                                 DICTIONARY-ELEMENT-COMMAND-G
075700                                 AUXILIARY-TABLE-AREA.
075800     IF  DI-STATUS     NOT EQUAL ZEROS
075900         MOVE 'N'             TO W77-ERR-SW
076000         GO TO X0010-EXIT.
076100     MOVE LOW-VALUES          TO SADSM-DATA.
076200     MOVE 'EXPAND'            TO SADSM-COMMAND.
076300     CALL 'SADSMCXB' USING SADSM-DATA
076400                            AUXILIARY-TABLE-AREA.
076500     IF  SADSM-RTN-CODE NOT EQUAL ZEROS
076600         MOVE 'N'             TO W77-ERR-SW
076700         GO TO X0010-EXIT.
076800     MOVE 'N'                 TO DI-DICTIONARY-MORE.
076900     CALL 'SADSNUCB' USING       DICCAREA
077000                                 DICTIONARY-ELEMENT-COMMAND-E
077100                                 AUXILIARY-TABLE-AREA.
077200 X0010-EXIT.
077300     EXIT.
077400
077500*----------------------------------------------------------------*
077600*    RETURN TO IM31                                              *
077700*----------------------------------------------------------------*
077800 Z0010-RETURN.
077900     GOBACK.
