*     * FO5238 * 06/26/11 PROYECTO REBORN
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. IM31TAX.
000300*REMARKS.
000380*    THIS SUB-ROUTINE CALCULATES TAX WITHHOLDING AT A BACKUP RATE
000460*    ON INTEREST FOR IOD AND SAVINGS ACCOUNTS AND INSERTS THE TAX
000540*    AMOUNT IN THE FIELD TAX-CALC-AMOUNT.  IT ALSO CALCULATES     2012254
000545*    STATE AND LOCAL TAX WITHHOLDING AND INSERTS THE TAX AMOUNT   2012254
000550*    IN THE FIELDS TAX-CALC-AMOUNT-ST AND TAX-CALC-AMOUNT-LOC.    2012254
000555*    THE OTHER FIELDS IN IMWSTXCL COPYBOOK ARE SUPPLIED BY THE    2012254
000620*    IMWSTXCL COPYBOOK ARE SUPPLIED BY THE CALLING PROGRAM        2012254
000700*    AS DEFINED BELOW:
000780*    1.  TAX-CALC-REASON
000860*        0 - SCHEDULED INTEREST PAYMENT OR CLOSING ACCOUNT
000940*        1 - PROJECTED ACCRUALS
001020*    2.  TAX-CALC-IOD-FLAG
001100*        N - CALCULATING WITHHOLDING FOR IOD
001180*        F - CALCULATING WITHHOLDING FOR SAVINGS
001260*    3.  TAX-CALC-DAYS
001340*        NUMBER OF DAYS IN INTEREST PAYMENT CYCLE
001420*    4.  TAX-CALC-PAYMENT
001500*        IF TAX-CALC-REASON IS 0 - INTEREST PAYMENT AMOUNT
001580*        IF TAX-CALC-REASON IS 1 - PROJECTED ACCRUAL AMOUNT
001660*
002100 ENVIRONMENT DIVISION.
002200 DATA DIVISION.
002300     SKIP3
002400 WORKING-STORAGE SECTION.
002401 77  SI-MODULE-INFO      PIC X(64)
002402     VALUE 'IM31TAX   -----TSD-             08/08/00  18.32.18'.
002405*    THIS PROGRAM CONTAINS TRADE SECRETS THAT BELONG
002406*    TO ALLTEL INFORMATION SERVICES, INC. AND IS
002407*    LICENSED BY AN AGREEMENT.  ANY UNAUTHORIZED ACCESS,
002408*    USE, DUPLICATION, OR DISCLOSURE IS UNLAWFUL.
002409*    COPYRIGHT ALLTEL INFORMATION SERVICES, INC.
002410*    2000, ALL RIGHTS RESERVED.
002500     SKIP3
002600 77  PROGRAM-NAME            PIC X(8)            VALUE 'IM31TAX'.
002700     SKIP3
003400 LINKAGE SECTION.
003500     SKIP3
003600     COPY  IMWSTXCL.                                              2012254
004200     SKIP3
004300     COPY  IMAWKMST.
004400     SKIP3
004900 PROCEDURE DIVISION USING TAX-CALC-WORK-FIELDS
005000                          MASTER-AREA.
005400     COPY IMPDTAX.
008100 Z0010-GOBACK.
008200     GOBACK.
008300     STOP RUN.
