*     * FO5238 * 06/26/11 PROYECTO REBORN
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. IMBCRM.
000300*REMARKS.  THIS PROGRAM WILL RETRIEVE A IMPACS BANK CONTROL 'B1'  IM004
000370*         RECORD WHEN THE CONTROL LEVEL OF THE BCR IS             IM004
000440*         UNKNOWN.  THE BCR MUST BE INITIALIZED WITH CONTROLS 1, 2IM004
000510*         AND 3 OF AN OBJECT RECORD. IN ADDITION, THE RECORD ID   IM004
000580*         MUST CONTAIN LOW-VALUES.  WHEN THE RECORD-ID CONTAINS   IM004
000650*         A VALUE OTHER THAN LOW-VALUES THE ROUTINE IMBCRMV IS    IM004
000720*         PERFORMED AS IF IT WERE CALLED FROM THE CALLING PROGRAM.IM004
001000 ENVIRONMENT DIVISION.
001100 INPUT-OUTPUT SECTION.
001200 FILE-CONTROL.
001300 DATA DIVISION.
001400 WORKING-STORAGE SECTION.
001401 77  SI-MODULE-INFO      PIC X(64)                                100
001402     VALUE 'IMBCRM    -----TSD-IM010        03/03/94  18.36.29'.  100
001403*    THIS PROGRAM CONTAINS TRADE SECRETS THAT BELONG              100
001404*    TO SYSTEMATICS INFORMATION SERVICES, INC. AND IS             100
001405*    LICENSED BY AN AGREEMENT. ANY UNAUTHORIZED ACCESS,           100
001406*    USE, DUPLICATION, OR DISCLOSURE IS UNLAWFUL.                 100
001407*    COPYRIGHT SYSTEMATICS INFORMATION SERVICES, INC.             100
001408*    1995, ALL RIGHTS RESERVED.                                   100
001500 01  HOLD-CONTROL-KEY.
001600     03  HD-CONTROL-1             PIC XX.
001700     03  HD-CONTROL-2             PIC XXX.
001800     03  HD-CONTROL-3             PIC XXX.
001900 LINKAGE SECTION.
002000     COPY SIWSCNTL.
002100     COPY IMWRKBC1.
002200 PROCEDURE DIVISION USING I-O-CONTROL-AREA
002300                          DDA-WRKBCR-1.
002400     IF I-O-CONTROL-OPERATOR NOT EQUAL '1'
002500         PERFORM A0100 THRU A0100-EXIT
002600         GO TO W1200.
002700 A0010.
002800     MOVE WBC1-CONTROL-KEY TO HOLD-CONTROL-KEY.
002900     MOVE LOW-VALUES       TO WBC1-CONTROL-KEY
003000                              WBC1-RECORD-ID.
003100     MOVE HD-CONTROL-1     TO WBC1-CONTROL-1.
003200     MOVE 'T'              TO I-O-CONTROL-OPERATOR.
003300     PERFORM A0100 THRU A0100-EXIT.
003400     IF I-O-88-NOT-FOUND OR I-O-88-END-OF-FILE
003500         GO TO W1200.
003600     MOVE 'R'              TO I-O-CONTROL-OPERATOR.
003700 A0100.
003800     CALL 'IMBCRMV' USING I-O-CONTROL-AREA
003900                          DDA-WRKBCR-1.
004000 A0100-EXIT.
004100     EXIT.
004200 C0010.
004300     IF I-O-88-NOT-FOUND OR I-O-88-END-OF-FILE OR
004400         HD-CONTROL-1 NOT EQUAL WBC1-CONTROL-1
004500         MOVE +8 TO I-O-RETURN-CODE
004600         GO TO W1200.
004700     IF WBC-CTL2-FLAG NOT EQUAL '2'
004800         MOVE '000' TO WBC1-CONTROL-2
004900         GO TO C0020.
005000     MOVE HD-CONTROL-2 TO WBC1-CONTROL-2.
005100 C0020.
005200     IF WBC-CTL3-FLAG NOT EQUAL '2'
005300         MOVE '000' TO WBC1-CONTROL-3
005400         GO TO Y0010.
005500     MOVE HD-CONTROL-3 TO WBC1-CONTROL-3.
005600 Y0010.
005700     MOVE 'B1' TO WBC1-RECORD-ID.
005800     MOVE 'K' TO I-O-CONTROL-OPERATOR.
005900     PERFORM A0100 THRU A0100-EXIT.
006000 W1200.
006100     GOBACK.
