*     * FO5238*12/05/11 JCTE PROYECTO UPGRADE SYSTEMAT
000001*----------------------------------------------------------------*IMIB01A
000002*   DATE    INIT   CHGID                 REASON                  *IMIB01A
000003* --------  ----  -------  ------------------------------------- *IMIB01A
000004* 14/08/10   GSA  IMIB01A  REAPPLY CODE: DC-FIELDS AND TAX CODE  *IMIB01A
000005*                 IMIB004  REAPPLY CODE: ACCT STATUS HANDLING    *IMIB004
000006*                 IMIB58   REAPPLY CODE: DC-FIELDS               *IMIB58
000007*                 IMIB76   REAPPLY CODE: NEW FIELD FINALIDAD     *IMIB76
000008* 04/04/11   GSA  IMUP021  CHANGED TAX EDITS FROM ALPHA TO CHAR  *IMUP021
000009* 27/04/11   GSA  ~~~0169  APPLY RSEC FIX FOR IM0169             *~~~0169
000010* 28/04/11   GSA  ~~~0207  APPLY RSEC FIX FOR IM00207            *~~~0207
000011* 28/06/11   GSA  &I2806   FIX START POSITIONS OF 5009 5010 5011 *&I2806
000099*----------------------------------------------------------------*IMIB01A
000100*
000200*--------------------------------------------------------------*
000300*         IMPACS FILE MAINT TABLE COPYBOOK                     *
000400*--------------------------------------------------------------*
000500*
000600 01  DDA-FILE-MAINT-TABLE.
000700     03  MNT0001 PIC X(11)   VALUE '0003803CS  '.
000800     03  MNT0002 PIC X(11)   VALUE '0004103CS  '.
000900     03  MNT0003 PIC X(11)   VALUE '0004703CS  '.
001000     03  MNT0004 PIC X(11)   VALUE '0005005CS  '.
001100     03  MNT0005 PIC X(11)   VALUE '0019303CS  '.
001200     03  MNT0006 PIC X(11)   VALUE '0019603CS  '.
001300     03  MNT0007 PIC X(11)   VALUE '0019903CS  '.
001400*    03  MNT0008 PIC X(11)   VALUE '0021102C  C'.
001402     03  MNT0008 PIC X(11)   VALUE '0021104C  C'.                 IMIB004
001500     03  MNT0009 PIC X(11)   VALUE '0050101C   '.
001600     03  MNT0010 PIC X(11)   VALUE '0021301P   '.
001700     03  MNT0011 PIC X(11)   VALUE '0021401C   '.
001800     03  MNT0012 PIC X(11)   VALUE '0021501P   '.
001900     03  MNT0013 PIC X(11)   VALUE '0021601C   '.
002000     03  MNT0014 PIC X(11)   VALUE '0021701C   '.
002100     03  MNT0015 PIC X(11)   VALUE '0021801C   '.
002200     03  MNT0016 PIC X(11)   VALUE '0022101C   '.
002300     03  MNT0017 PIC X(11)   VALUE '0022301C   '.
002400     03  MNT0018 PIC X(11)   VALUE '0022201C   '.
002500     03  MNT0019 PIC X(11)   VALUE '0022401C   '.
002600     03  MNT0020 PIC X(11)   VALUE '0022501C   '.
002700     03  MNT0021 PIC X(11)   VALUE '0022601C   '.
002800     03  MNT0022 PIC X(11)   VALUE '0022703CS C'.
002900     03  MNT0023 PIC X(11)   VALUE '0023003C   '.
003000     03  MNT0024 PIC X(11)   VALUE '0023301C   '.
003100     03  MNT0025 PIC X(11)   VALUE '0023401C   '.
003200     03  MNT0026 PIC X(11)   VALUE '0023501C   '.                 0817665
003300     03  MNT0027 PIC X(11)   VALUE '0023601C   '.                 0817665
003400     03  MNT0028 PIC X(11)   VALUE '0024001C   '.
003500     03  MNT0029 PIC X(11)   VALUE '0024601C   '.
003600     03  MNT0030 PIC X(11)   VALUE '0024701C   '.
003700     03  MNT0031 PIC X(11)   VALUE '0033913CS  '.
003800     03  MNT0032 PIC X(11)   VALUE '0036908P  N'.
003900     03  MNT0033 PIC X(11)   VALUE '0038508P  N'.
004000     03  MNT0034 PIC X(11)   VALUE '0039308P  N'.
004100     03  MNT0035 PIC X(11)   VALUE '0040108P  N'.
004200     03  MNT0036 PIC X(11)   VALUE '0040908P  N'.
004300     03  MNT0037 PIC X(11)   VALUE '0041708P  N'.
004400     03  MNT0038 PIC X(11)   VALUE '0042604P  N'.
004500     03  MNT0039 PIC X(11)   VALUE '0051002P Y '.                 0817665
004600     03  MNT0040 PIC X(11)   VALUE '0051206DS  '.
004700     03  MNT0041 PIC X(11)   VALUE '0053102P Y '.                 0817665
004800     03  MNT0042 PIC X(11)   VALUE '0052003P Y '.                 0817665
004900     03  MNT0043 PIC X(11)   VALUE '0046103P Y '.                 0817665
005000     03  MNT0044 PIC X(11)   VALUE '0653502P Y '.                 0817665
005100     03  MNT0045 PIC X(11)   VALUE '0655902P Y '.                 0817665
005200     03  MNT0046 PIC X(11)   VALUE '0658302P Y '.                 0817665
005300     03  MNT0047 PIC X(11)   VALUE '0653702P Y '.                 0817665
005400     03  MNT0048 PIC X(11)   VALUE '0656102P Y '.                 0817665
005500     03  MNT0049 PIC X(11)   VALUE '0658502P Y '.                 0817665
005600     03  MNT0050 PIC X(11)   VALUE '0653902P Y '.                 0817665
005700     03  MNT0051 PIC X(11)   VALUE '0656302P Y '.                 0817665
005800     03  MNT0052 PIC X(11)   VALUE '0658702P Y '.                 0817665
005900     03  MNT0053 PIC X(11)   VALUE '0654102P Y '.                 0817665
006000     03  MNT0054 PIC X(11)   VALUE '0656502P Y '.                 0817665
006100     03  MNT0055 PIC X(11)   VALUE '0658902P Y '.                 0817665
006200     03  MNT0056 PIC X(11)   VALUE '0654302P Y '.                 0817665
006300     03  MNT0057 PIC X(11)   VALUE '0656702P Y '.                 0817665
006400     03  MNT0058 PIC X(11)   VALUE '0659102P Y '.                 0817665
006500     03  MNT0059 PIC X(11)   VALUE '0654502P Y '.                 0817665
006600     03  MNT0060 PIC X(11)   VALUE '0656902P Y '.                 0817665
006700     03  MNT0061 PIC X(11)   VALUE '0659302P Y '.                 0817665
006800     03  MNT0062 PIC X(11)   VALUE '0654702P Y '.                 0817665
006900     03  MNT0063 PIC X(11)   VALUE '0657102P Y '.                 0817665
007000     03  MNT0064 PIC X(11)   VALUE '0659502P Y '.                 0817665
007100     03  MNT0065 PIC X(11)   VALUE '0654902P Y '.                 0817665
007200     03  MNT0066 PIC X(11)   VALUE '0657302P Y '.                 0817665
007300     03  MNT0067 PIC X(11)   VALUE '0659702P Y '.                 0817665
007400     03  MNT0068 PIC X(11)   VALUE '0655102P Y '.                 0817665
007500     03  MNT0069 PIC X(11)   VALUE '0657502P Y '.                 0817665
007600     03  MNT0070 PIC X(11)   VALUE '0659902P Y '.                 0817665
007700     03  MNT0071 PIC X(11)   VALUE '0655302P Y '.                 0817665
007800     03  MNT0072 PIC X(11)   VALUE '0657702P Y '.                 0817665
007900     03  MNT0073 PIC X(11)   VALUE '0660102P Y '.                 0817665
008000     03  MNT0074 PIC X(11)   VALUE '0655502P Y '.                 0817665
008100     03  MNT0075 PIC X(11)   VALUE '0657902P Y '.                 0817665
008200     03  MNT0076 PIC X(11)   VALUE '0660302P Y '.                 0817665
008300     03  MNT0077 PIC X(11)   VALUE '0655702P Y '.                 0817665
008400     03  MNT0078 PIC X(11)   VALUE '0658102P Y '.                 0817665
008500     03  MNT0079 PIC X(11)   VALUE '0660502P Y '.                 0817665
008600     03  MNT0080 PIC X(11)   VALUE '0050208P Y '.                 0817665
008700     03  MNT0081 PIC X(11)   VALUE '0057308P  N'.
008800     03  MNT0082 PIC X(11)   VALUE '0056208P  N'.
008900     03  MNT0083 PIC X(11)   VALUE '0910201C   '.
009000     03  MNT0084 PIC X(11)   VALUE '0060402P Y '.                 0817665
009100     03  MNT0085 PIC X(11)   VALUE '0061005CS  '.                 0427044
009200     03  MNT0086 PIC X(11)   VALUE '0061605CS  '.
009300     03  MNT0087 PIC X(11)   VALUE '0062208P   '.
009400     03  MNT0088 PIC X(11)   VALUE '0063001C   '.
009500     03  MNT0089 PIC X(11)   VALUE '0063108P  N'.
009600     03  MNT0090 PIC X(11)   VALUE '0063908P  N'.
009700     03  MNT0091 PIC X(11)   VALUE '0068406DS C'.
009800     03  MNT0092 PIC X(11)   VALUE '0069006DS C'.
009900     03  MNT0093 PIC X(11)   VALUE '0069606DS C'.
010000     03  MNT0094 PIC X(11)   VALUE '0070206D  N'.
010100     03  MNT0095 PIC X(11)   VALUE '0070806D   '.
010200     03  MNT0096 PIC X(11)   VALUE '0071406DS  '.
010300     03  MNT0097 PIC X(11)   VALUE '0110308P  N'.
010400     03  MNT0098 PIC X(11)   VALUE '0072006DS  '.
010500     03  MNT0099 PIC X(11)   VALUE '0072606DS  '.
010600     03  MNT0100 PIC X(11)   VALUE '0090408DS  '.
010700     03  MNT0101 PIC X(11)   VALUE '0084701C   '.
010800     03  MNT0102 PIC X(11)   VALUE '0084909CS C'.                 0817719
010900     03  MNT0103 PIC X(11)   VALUE '0025001C  N'.
011000     03  MNT0104 PIC X(11)   VALUE '0091214CS  '.
011100     03  MNT0105 PIC X(11)   VALUE '0093414CS  '.
011200     03  MNT0106 PIC X(11)   VALUE '0142201P   '.
011300     03  MNT0107 PIC X(11)   VALUE '0098809P  N'.
011400     03  MNT0108 PIC X(11)   VALUE '0100608P YC'.                 0817665
011500     03  MNT0109 PIC X(11)   VALUE '0101408P YC'.                 0817665
011600     03  MNT0110 PIC X(11)   VALUE '0123901C   '.
011700     03  MNT0111 PIC X(11)   VALUE '0124010CS  '.
011800     03  MNT0112 PIC X(11)   VALUE '0129001C  N'.
011900     03  MNT0113 PIC X(11)   VALUE '0129101C  N'.
012000     03  MNT0114 PIC X(11)   VALUE '0129202CS N'.
012100     03  MNT0115 PIC X(11)   VALUE '0129402CS N'.
012200     03  MNT0116 PIC X(11)   VALUE '0129602CS N'.
012300     03  MNT0117 PIC X(11)   VALUE '0129802CS N'.
012400     03  MNT0118 PIC X(11)   VALUE '0130002CS N'.
012500     03  MNT0119 PIC X(11)   VALUE '0130202CS N'.
012600     03  MNT0120 PIC X(11)   VALUE '0130402CS N'.
012700     03  MNT0121 PIC X(11)   VALUE '0130602CS N'.
012800     03  MNT0122 PIC X(11)   VALUE '0130802CS N'.
012900     03  MNT0123 PIC X(11)   VALUE '0131002CS N'.
013000     03  MNT0124 PIC X(11)   VALUE '0131202CS N'.
013100     03  MNT0125 PIC X(11)   VALUE '0131402CS N'.
013200     03  MNT0126 PIC X(11)   VALUE '0131601C   '.
013300     03  MNT0127 PIC X(11)   VALUE '0131701C   '.
013400     03  MNT0128 PIC X(11)   VALUE '0131801P  C'.
013500     03  MNT0129 PIC X(11)   VALUE '0131901C   '.
013600     03  MNT0130 PIC X(11)   VALUE '0126402CS  '.
013700*    03  MNT0131 PIC X(11)   VALUE '0141301CS  '.
013702     03  MNT0131 PIC X(11)   VALUE '0141301C   '.                 ~~~0169
013800     03  MNT0132 PIC X(11)   VALUE '0133401P Y '.                 0817665
013900     03  MNT0133 PIC X(11)   VALUE '0133506DS  '.
014000     03  MNT0134 PIC X(11)   VALUE '0136308P  N'.
014100     03  MNT0135 PIC X(11)   VALUE '0137104P  N'.
014200     03  MNT0136 PIC X(11)   VALUE '0137508P  N'.
014300     03  MNT0137 PIC X(11)   VALUE '0138304P  N'.
014400     03  MNT0138 PIC X(11)   VALUE '0138708P  N'.
014500     03  MNT0139 PIC X(11)   VALUE '0139508P  N'.
014600     03  MNT0140 PIC X(11)   VALUE '0140304P  N'.
014700     03  MNT0141 PIC X(11)   VALUE '0140702P  N'.
014800     03  MNT0142 PIC X(11)   VALUE '0140903P  N'.
014900     03  MNT0143 PIC X(11)   VALUE '0141201P   '.
015000     03  MNT0144 PIC X(11)   VALUE '0145706DS  '.
015100     03  MNT0145 PIC X(11)   VALUE '0146501C   '.
015200     03  MNT0146 PIC X(11)   VALUE '0146601C   '.
015300     03  MNT0147 PIC X(11)   VALUE '0146701C  N'.
015400     03  MNT0148 PIC X(11)   VALUE '0146801C  C'.
015500     03  MNT0149 PIC X(11)   VALUE '0146901C  C'.
015600     03  MNT0150 PIC X(11)   VALUE '0147001C  C'.
015700     03  MNT0151 PIC X(11)   VALUE '0147102CS C'.
015800     03  MNT0152 PIC X(11)   VALUE '0147303CS  '.
015900     03  MNT0153 PIC X(11)   VALUE '0147601P   '.
016000     03  MNT0154 PIC X(11)   VALUE '0147701C   '.
016100     03  MNT0155 PIC X(11)   VALUE '0147802CS  '.
016200     03  MNT0156 PIC X(11)   VALUE '0148001C   '.
016300     03  MNT0157 PIC X(11)   VALUE '0148122CS  '.
016400     03  MNT0158 PIC X(11)   VALUE '0151709P YC'.                 0817665
016500     03  MNT0159 PIC X(11)   VALUE '0152609P YC'.                 0817665
016600     03  MNT0160 PIC X(11)   VALUE '0154409P YC'.                 0817665
016700     03  MNT0161 PIC X(11)   VALUE '0155302P YC'.                 0817665
016800     03  MNT0162 PIC X(11)   VALUE '0155508P YC'.                 0817665
016900     03  MNT0163 PIC X(11)   VALUE '0156304P YC'.                 0817665
017000     03  MNT0164 PIC X(11)   VALUE '0156704P YC'.                 0817665
017100     03  MNT0165 PIC X(11)   VALUE '0157104P YC'.                 0817665
017200     03  MNT0166 PIC X(11)   VALUE '0157508P YC'.                 0817665
017300     03  MNT0167 PIC X(11)   VALUE '1136804P YC'.                 0817665
017400     03  MNT0168 PIC X(11)   VALUE '1137204P YC'.                 0817665
017500     03  MNT0169 PIC X(11)   VALUE '1137604P YC'.                 0817665
017600     03  MNT0170 PIC X(11)   VALUE '1138004P YC'.                 0817665
017700     03  MNT0171 PIC X(11)   VALUE '1138408P YC'.                 0817665
017800     03  MNT0172 PIC X(11)   VALUE '1139208P YC'.                 0817665
017900     03  MNT0173 PIC X(11)   VALUE '1140008P YC'.                 0817665
018000     03  MNT0174 PIC X(11)   VALUE '1140804P YC'.                 0817665
018100     03  MNT0175 PIC X(11)   VALUE '1141204P YC'.                 0817665
018200     03  MNT0176 PIC X(11)   VALUE '0158302P YC'.                 0817665
018300     03  MNT0177 PIC X(11)   VALUE '0158504P YC'.                 0817665
018400     03  MNT0178 PIC X(11)   VALUE '0159502P YC'.                 0817665
018500     03  MNT0179 PIC X(11)   VALUE '0159704P YC'.                 0817665
018600     03  MNT0180 PIC X(11)   VALUE '0162508P YC'.                 0817665
018700     03  MNT0181 PIC X(11)   VALUE '0163308P YC'.                 0817665
018800     03  MNT0182 PIC X(11)   VALUE '0164102P  C'.
018900     03  MNT0183 PIC X(11)   VALUE '0164301C   '.
019000     03  MNT0184 PIC X(11)   VALUE '0897208P YC'.                 0817665
019100     03  MNT0185 PIC X(11)   VALUE '0178701C   '.
019200     03  MNT0186 PIC X(11)   VALUE '0178809P Y '.                 0817665
019300     03  MNT0187 PIC X(11)   VALUE '0179709P Y '.                 0817665
019400     03  MNT0188 PIC X(11)   VALUE '0182409P Y '.                 0817665
019500     03  MNT0189 PIC X(11)   VALUE '0183302P Y '.                 0817665
019600     03  MNT0190 PIC X(11)   VALUE '0184408P Y '.                 0817665
019700     03  MNT0191 PIC X(11)   VALUE '0186004P Y '.                 0817665
019800     03  MNT0192 PIC X(11)   VALUE '0186404P Y '.                 0817665
019900     03  MNT0193 PIC X(11)   VALUE '0186808P Y '.                 0817665
020000     03  MNT0194 PIC X(11)   VALUE '1141604P YC'.                 0817665
020100     03  MNT0195 PIC X(11)   VALUE '1142004P YC'.                 0817665
020200     03  MNT0196 PIC X(11)   VALUE '1142404P YC'.                 0817665
020300     03  MNT0197 PIC X(11)   VALUE '1142804P YC'.                 0817665
020400     03  MNT0198 PIC X(11)   VALUE '1143208P Y '.                 0817665
020500     03  MNT0199 PIC X(11)   VALUE '1144008P Y '.                 0817665
020600     03  MNT0200 PIC X(11)   VALUE '1144804P Y '.                 0817665
020700     03  MNT0201 PIC X(11)   VALUE '1145204P Y '.                 0817665
020800     03  MNT0202 PIC X(11)   VALUE '0187602P Y '.                 0817665
020900     03  MNT0203 PIC X(11)   VALUE '0187804P Y '.                 0817665
021000     03  MNT0204 PIC X(11)   VALUE '0188802P Y '.                 0817665
021100     03  MNT0205 PIC X(11)   VALUE '0189002P Y '.                 0817665
021200     03  MNT0206 PIC X(11)   VALUE '0189204P Y '.                 0817665
021300     03  MNT0207 PIC X(11)   VALUE '0189608P Y '.                 0817665
021400     03  MNT0208 PIC X(11)   VALUE '0190402P Y '.                 0817665
021500     03  MNT0209 PIC X(11)   VALUE '0190601C   '.
021600     03  MNT0210 PIC X(11)   VALUE '0203209P Y '.                 0817665
021700     03  MNT0211 PIC X(11)   VALUE '0204102P Y '.                 0817665
021800     03  MNT0212 PIC X(11)   VALUE '0205108P Y '.                 0817665
021900     03  MNT0213 PIC X(11)   VALUE '0295701P  N'.
022000     03  MNT0214 PIC X(11)   VALUE '0299401C  N'.
022100     03  MNT0215 PIC X(11)   VALUE '0295901C  N'.
022200     03  MNT0216 PIC X(11)   VALUE '0296001C  N'.
022300     03  MNT0217 PIC X(11)   VALUE '0296101P  N'.
022400     03  MNT0218 PIC X(11)   VALUE '0296301C  N'.
022500     03  MNT0219 PIC X(11)   VALUE '0296401C  N'.
022600     03  MNT0220 PIC X(11)   VALUE '0296501C  N'.
022700     03  MNT0221 PIC X(11)   VALUE '0296601C  N'.
022800     03  MNT0222 PIC X(11)   VALUE '0296702P  N'.
022900     03  MNT0223 PIC X(11)   VALUE '0296901C  N'.
023000     03  MNT0224 PIC X(11)   VALUE '0297001C  N'.
023100     03  MNT0225 PIC X(11)   VALUE '0300001C  N'.
023200     03  MNT0226 PIC X(11)   VALUE '0300101C  N'.
023300     03  MNT0227 PIC X(11)   VALUE '0300240C  N'.
023400     03  MNT0228 PIC X(11)   VALUE '0304201C  N'.
023500     03  MNT0229 PIC X(11)   VALUE '0304301C  N'.
023600     03  MNT0230 PIC X(11)   VALUE '0304440C  N'.
023700     03  MNT0231 PIC X(11)   VALUE '0308401C  N'.
023800     03  MNT0232 PIC X(11)   VALUE '0308501C  N'.
023900     03  MNT0233 PIC X(11)   VALUE '0308640C  N'.
024000     03  MNT0234 PIC X(11)   VALUE '0312601C  N'.
024100     03  MNT0235 PIC X(11)   VALUE '0312701C  N'.
024200     03  MNT0236 PIC X(11)   VALUE '0312840C  N'.
024300     03  MNT0237 PIC X(11)   VALUE '0316801C  N'.
024400     03  MNT0238 PIC X(11)   VALUE '0316901C  N'.
024500     03  MNT0239 PIC X(11)   VALUE '0317040C  N'.
024600     03  MNT0240 PIC X(11)   VALUE '0321001C  N'.
024700     03  MNT0241 PIC X(11)   VALUE '0321101C  N'.
024800     03  MNT0242 PIC X(11)   VALUE '0321240C  N'.
024900     03  MNT0243 PIC X(11)   VALUE '0164401C   '.
025000     03  MNT0244 PIC X(11)   VALUE '0164508P Y '.                 0817665
025100     03  MNT0245 PIC X(11)   VALUE '0165303P Y '.                 0817665
025200     03  MNT0246 PIC X(11)   VALUE '0165608P Y '.                 0817665
025300     03  MNT0247 PIC X(11)   VALUE '0191508P Y '.                 0817665
025400     03  MNT0248 PIC X(11)   VALUE '0192302P Y '.                 0817665
025500     03  MNT0249 PIC X(11)   VALUE '0192509P Y '.                 0817665
025600     03  MNT0250 PIC X(11)   VALUE '0295801C   '.
025700     03  MNT0251 PIC X(11)   VALUE '0299501P   '.
025800     03  MNT0252 PIC X(11)   VALUE '0440508P Y '.                 0817665
025900     03  MNT0253 PIC X(11)   VALUE '0371102P   '.
026000     03  MNT0254 PIC X(11)   VALUE '0371301CS  '.
026100     03  MNT0255 PIC X(11)   VALUE '0297101C   '.
026200     03  MNT0256 PIC X(11)   VALUE '0377501C  N'.
026300     03  MNT0257 PIC X(11)   VALUE '0377640C  N'.
026400     03  MNT0258 PIC X(11)   VALUE '0381640C  N'.
026500     03  MNT0259 PIC X(11)   VALUE '0385630C  N'.
026600     03  MNT0260 PIC X(11)   VALUE '0388610C  N'.
026700     03  MNT0261 PIC X(11)   VALUE '0037708P  N'.
026800     03  MNT0262 PIC X(11)   VALUE '0166408P Y '.                 0817665
026900     03  MNT0263 PIC X(11)   VALUE '0193408P Y '.                 0817665
027000     03  MNT0264 PIC X(11)   VALUE '0074406DS  '.
027100     03  MNT0265 PIC X(11)   VALUE '0391001C   '.
027200     03  MNT0266 PIC X(11)   VALUE '0391201C   '.
027300     03  MNT0267 PIC X(11)   VALUE '0391301C   '.
027400     03  MNT0268 PIC X(11)   VALUE '0391401C   '.
027500     03  MNT0269 PIC X(11)   VALUE '0391501C   '.
027600     03  MNT0270 PIC X(11)   VALUE '0391601C   '.
027700     03  MNT0271 PIC X(11)   VALUE '0391701C   '.
027800     03  MNT0272 PIC X(11)   VALUE '0391801C   '.
027900     03  MNT0273 PIC X(11)   VALUE '0391901C   '.
028000     03  MNT0274 PIC X(11)   VALUE '0392001C  C'.
028100     03  MNT0275 PIC X(11)   VALUE '0394406DS  '.
028200     03  MNT0276 PIC X(11)   VALUE '0511601C   '.
028300     03  MNT0277 PIC X(11)   VALUE '0511703CS  '.
028400     03  MNT0278 PIC X(11)   VALUE '0512005P   '.
028500     03  MNT0279 PIC X(11)   VALUE '0514501C   '.
028600     03  MNT0280 PIC X(11)   VALUE '0514603CS  '.
028700     03  MNT0281 PIC X(11)   VALUE '0514905P   '.
028800     03  MNT0282 PIC X(11)   VALUE '0404706DS  '.
028900     03  MNT0283 PIC X(11)   VALUE '0448301C   '.
029000     03  MNT0284 PIC X(11)   VALUE '0448408P Y '.                 0817665
029100     03  MNT0285 PIC X(11)   VALUE '0395201P   '.
029200     03  MNT0286 PIC X(11)   VALUE '0395301P   '.
029300     03  MNT0287 PIC X(11)   VALUE '0395402P   '.
029400     03  MNT0288 PIC X(11)   VALUE '0395602P   '.
029500     03  MNT0289 PIC X(11)   VALUE '0395808P Y '.                 0817665
029600     03  MNT0290 PIC X(11)   VALUE '0396805P   '.
029700     03  MNT0291 PIC X(11)   VALUE '0397308P  N'.
029800     03  MNT0292 PIC X(11)   VALUE '0398101C   '.
029900     03  MNT0293 PIC X(11)   VALUE '0398209P  N'.
030000     03  MNT0294 PIC X(11)   VALUE '0399101CS  '.
030100     03  MNT0295 PIC X(11)   VALUE '0399206DS  '.
030200     03  MNT0296 PIC X(11)   VALUE '0399806DS  '.
030300     03  MNT0297 PIC X(11)   VALUE '0400403CS  '.
030400     03  MNT0298 PIC X(11)   VALUE '0392805CS  '.
030500     03  MNT0299 PIC X(11)   VALUE '0401106DS  '.
030600     03  MNT0300 PIC X(11)   VALUE '0401706DS  '.
030700     03  MNT0301 PIC X(11)   VALUE '0402306DS  '.
030800     03  MNT0302 PIC X(11)   VALUE '0402906DS  '.
030900     03  MNT0303 PIC X(11)   VALUE '0403506DS  '.
031000     03  MNT0304 PIC X(11)   VALUE '0442906DS  '.
031100     03  MNT0305 PIC X(11)   VALUE '0447508P YC'.                 0817665
031200     03  MNT0306 PIC X(11)   VALUE '0423008P YC'.                 0817665
031300     03  MNT0307 PIC X(11)   VALUE '0423808P YC'.                 0817665
031400     03  MNT0308 PIC X(11)   VALUE '0510301C   '.
031500     03  MNT0309 PIC X(11)   VALUE '0407508P YC'.                 0817665
031600     03  MNT0310 PIC X(11)   VALUE '0408308P  N'.
031700     03  MNT0311 PIC X(11)   VALUE '0409108P  N'.
031800     03  MNT0312 PIC X(11)   VALUE '0409908P  N'.
031900     03  MNT0313 PIC X(11)   VALUE '0413103P  N'.
032000     03  MNT0314 PIC X(11)   VALUE '0413409P  N'.
032100     03  MNT0315 PIC X(11)   VALUE '0414309P  N'.
032200     03  MNT0316 PIC X(11)   VALUE '0415209P  N'.
032300     03  MNT0317 PIC X(11)   VALUE '0416109P  N'.
032400     03  MNT0318 PIC X(11)   VALUE '0417009P  N'.
032500     03  MNT0319 PIC X(11)   VALUE '0417909P  N'.
032600     03  MNT0320 PIC X(11)   VALUE '0418809P  N'.
032700     03  MNT0321 PIC X(11)   VALUE '0429501C  N'.
032800     03  MNT0322 PIC X(11)   VALUE '0429608P YC'.                 0817665
032900     03  MNT0323 PIC X(11)   VALUE '0435808P YC'.                 0817665
033000     03  MNT0324 PIC X(11)   VALUE '0436602P YC'.                 0817665
033100     03  MNT0325 PIC X(11)   VALUE '0055201C   '.
033200     03  MNT0326 PIC X(11)   VALUE '0055301C   '.
033300     03  MNT0327 PIC X(11)   VALUE '0430403P YC'.                 0817665
033400     03  MNT0328 PIC X(11)   VALUE '0430708P YC'.                 0817665
033500     03  MNT0329 PIC X(11)   VALUE '0431503P YC'.                 0817665
033600     03  MNT0330 PIC X(11)   VALUE '0431808P YC'.                 0817665
033700     03  MNT0331 PIC X(11)   VALUE '0438108P Y '.                 0817665
033800     03  MNT0332 PIC X(11)   VALUE '0432608P YC'.                 0817665
033900     03  MNT0333 PIC X(11)   VALUE '0433408P YC'.                 0817665
034000     03  MNT0334 PIC X(11)   VALUE '0434208P YC'.                 0817665
034100     03  MNT0335 PIC X(11)   VALUE '0435008P YC'.                 0817665
034200     03  MNT0336 PIC X(11)   VALUE '0394202P Y '.                 0817665
034300     03  MNT0337 PIC X(11)   VALUE '0445801CS  '.
034400     03  MNT0338 PIC X(11)   VALUE '0445901P   '.
034500     03  MNT0339 PIC X(11)   VALUE '0446001C   '.
034600     03  MNT0340 PIC X(11)   VALUE '0446102C   '.
034700     03  MNT0341 PIC X(11)   VALUE '0446301C   '.
034800     03  MNT0342 PIC X(11)   VALUE '0446402C   '.
034900     03  MNT0343 PIC X(11)   VALUE '0446601C   '.
035000     03  MNT0344 PIC X(11)   VALUE '0424608P Y '.                 0817665
035100     03  MNT0345 PIC X(11)   VALUE '0425408P Y '.                 0817665
035200     03  MNT0346 PIC X(11)   VALUE '0392201C   '.
035300     03  MNT0347 PIC X(11)   VALUE '0392301C   '.
035400     03  MNT0348 PIC X(11)   VALUE '          I'.
035500     03  MNT0349 PIC X(11)   VALUE '0446708P  N'.
035600     03  MNT0350 PIC X(11)   VALUE '0392401C   '.
035700     03  MNT0351 PIC X(11)   VALUE '0392501C   '.
035800     03  MNT0352 PIC X(11)   VALUE '0450105P  C'.
035900     03  MNT0353 PIC X(11)   VALUE '0450608P  N'.
036000     03  MNT0354 PIC X(11)   VALUE '0454008P  C'.
036100     03  MNT0355 PIC X(11)   VALUE '0451405P  C'.
036200     03  MNT0356 PIC X(11)   VALUE '0451908P  N'.
036300     03  MNT0357 PIC X(11)   VALUE '0454808P  C'.
036400     03  MNT0358 PIC X(11)   VALUE '0452705P  C'.
036500     03  MNT0359 PIC X(11)   VALUE '0453208P  N'.
036600     03  MNT0360 PIC X(11)   VALUE '0510405P   '.
036700     03  MNT0361 PIC X(11)   VALUE '0455601C   '.
036800     03  MNT0362 PIC X(11)   VALUE '0455709P Y '.                 0817665
036900     03  MNT0363 PIC X(11)   VALUE '0456602P Y '.                 0817665
037000     03  MNT0364 PIC X(11)   VALUE '0456808P Y '.                 0817665
037100     03  MNT0365 PIC X(11)   VALUE '0457608P Y '.                 0817665
037200     03  MNT0366 PIC X(11)   VALUE '0460008P Y '.                 0817665
037300     03  MNT0367 PIC X(11)   VALUE '0460808P Y '.                 0817665
037400     03  MNT0368 PIC X(11)   VALUE '0461608P Y '.                 0817665
037500     03  MNT0369 PIC X(11)   VALUE '0462408P Y '.                 0817665
037600     03  MNT0370 PIC X(11)   VALUE '0463209P  N'.
037700     03  MNT0371 PIC X(11)   VALUE '0464109P  N'.
037800     03  MNT0372 PIC X(11)   VALUE '0465009P  N'.
037900     03  MNT0373 PIC X(11)   VALUE '0511001C   '.
038000     03  MNT0374 PIC X(11)   VALUE '0467208P  N'.
038100     03  MNT0375 PIC X(11)   VALUE '0468001C  C'.
038200     03  MNT0376 PIC X(11)   VALUE '0468108P YC'.                 0817665
038300     03  MNT0377 PIC X(11)   VALUE '0469108P Y '.                 0817665
038400     03  MNT0378 PIC X(11)   VALUE '0469902P   '.
038500     03  MNT0379 PIC X(11)   VALUE '0470102P   '.
038600     03  MNT0380 PIC X(11)   VALUE '0470305P   '.
038700     03  MNT0381 PIC X(11)   VALUE '0470808P  N'.
038800     03  MNT0382 PIC X(11)   VALUE '0472808P  N'.
038900     03  MNT0383 PIC X(11)   VALUE '0420608P Y '.                 0817665
039000     03  MNT0384 PIC X(11)   VALUE '0421408P Y '.                 0817665
039100     03  MNT0385 PIC X(11)   VALUE '0422208P Y '.                 0817665
039200     03  MNT0386 PIC X(11)   VALUE '0487601C   '.
039300     03  MNT0387 PIC X(11)   VALUE '0487706DS  '.
039400     03  MNT0388 PIC X(11)   VALUE '0488502P Y '.                 0817665
039500     03  MNT0389 PIC X(11)   VALUE '0488702P Y '.                 0817665
039600     03  MNT0390 PIC X(11)   VALUE '0488902P Y '.                 0817665
039700     03  MNT0391 PIC X(11)   VALUE '0489102P Y '.                 0817665
039800     03  MNT0392 PIC X(11)   VALUE '0489302P Y '.                 0817665
039900     03  MNT0393 PIC X(11)   VALUE '0489508P Y '.                 0817665
040000     03  MNT0394 PIC X(11)   VALUE '0490308P  N'.
040100     03  MNT0395 PIC X(11)   VALUE '0543606DS  '.
040200     03  MNT0396 PIC X(11)   VALUE '0541001C  N'.
040300     03  MNT0397 PIC X(11)   VALUE '0541101C   '.
040400     03  MNT0398 PIC X(11)   VALUE '0541201C   '.
040500     03  MNT0399 PIC X(11)   VALUE '0541301C   '.
040600     03  MNT0400 PIC X(11)   VALUE '0541405CS  '.
040700     03  MNT0401 PIC X(11)   VALUE '0542301C   '.
040800     03  MNT0402 PIC X(11)   VALUE '0542402P   '.
040900     03  MNT0403 PIC X(11)   VALUE '0542602P   '.
041000     03  MNT0404 PIC X(11)   VALUE '0542806DS  '.
041100     03  MNT0405 PIC X(11)   VALUE '0544401CS  '.
041200     03  MNT0406 PIC X(11)   VALUE '0544501CS  '.
041300     03  MNT0407 PIC X(11)   VALUE '0544602P Y '.                 0817665
041400     03  MNT0408 PIC X(11)   VALUE '0545202P Y '.                 0817665
041500     03  MNT0409 PIC X(11)   VALUE '0545408P Y '.                 0817665
041600     03  MNT0410 PIC X(11)   VALUE '0546202P Y '.                 0817665
041700     03  MNT0411 PIC X(11)   VALUE '0546408P Y '.                 0817665
041800     03  MNT0412 PIC X(11)   VALUE '0547208P Y '.                 0817665
041900     03  MNT0413 PIC X(11)   VALUE '0548008P Y '.                 0817665
042000     03  MNT0414 PIC X(11)   VALUE '0548808P Y '.                 0817665
042100     03  MNT0415 PIC X(11)   VALUE '0549602P Y '.                 0817665
042200     03  MNT0416 PIC X(11)   VALUE '0549806P Y '.                 0817665
042300     03  MNT0417 PIC X(11)   VALUE '0551205CS  '.
042400     03  MNT0418 PIC X(11)   VALUE '0551805CS  '.                 0427044
042500     03  MNT0419 PIC X(11)   VALUE '0552403CS  '.
042600     03  MNT0420 PIC X(11)   VALUE '0552701C   '.
042700     03  MNT0421 PIC X(11)   VALUE '0552801CS  '.
042800     03  MNT0422 PIC X(11)   VALUE '0836701P   '.
042900     03  MNT0423 PIC X(11)   VALUE '0836901C   '.
043000     03  MNT0424 PIC X(11)   VALUE '0837001CS  '.
043100     03  MNT0425 PIC X(11)   VALUE '0837109C  C'.                 0817719
043200     03  MNT0426 PIC X(11)   VALUE '0838001CS  '.
043300     03  MNT0427 PIC X(11)   VALUE '0838506D   '.
043400     03  MNT0428 PIC X(11)   VALUE '0839308P YC'.                 0817665
043500     03  MNT0429 PIC X(11)   VALUE '0866206DS  '.
043600     03  MNT0430 PIC X(11)   VALUE '0368506DS  '.
043700     03  MNT0431 PIC X(11)   VALUE '0369102P  N'.
043800     03  MNT0432 PIC X(11)   VALUE '0369501CS  '.
043900     03  MNT0433 PIC X(11)   VALUE '0369601C   '.
044000     03  MNT0434 PIC X(11)   VALUE '0369711CS C'.                 0817719
044100     03  MNT0435 PIC X(11)   VALUE '0577102C   '.
044200     03  MNT0436 PIC X(11)   VALUE '0577335C  N'.
044300     03  MNT0437 PIC X(11)   VALUE '0580801C  N'.
044400     03  MNT0438 PIC X(11)   VALUE '0580902CS N'.
044500     03  MNT0439 PIC X(11)   VALUE '0581102CS N'.
044600     03  MNT0440 PIC X(11)   VALUE '0581302C  N'.
044700     03  MNT0441 PIC X(11)   VALUE '0582708P  N'.
044800     03  MNT0442 PIC X(11)   VALUE '0583508NS N'.
044900     03  MNT0443 PIC X(11)   VALUE '0584302P  N'.
045000     03  MNT0444 PIC X(11)   VALUE '0584502P  N'.
045100     03  MNT0445 PIC X(11)   VALUE '0581908N  N'.
045200     03  MNT0446 PIC X(11)   VALUE '0581501P  N'.
045300     03  MNT0447 PIC X(11)   VALUE '0577001C  N'.
045400     03  MNT0448 PIC X(11)   VALUE '0043201C   '.
045500     03  MNT0449 PIC X(11)   VALUE '0043302P Y '.                 0817665
045600     03  MNT0450 PIC X(11)   VALUE '0043501C   '.
045700     03  MNT0451 PIC X(11)   VALUE '0043602P Y '.                 0817665
045800     03  MNT0452 PIC X(11)   VALUE '0043801C   '.
045900     03  MNT0453 PIC X(11)   VALUE '0043902P Y '.                 0817665
046000     03  MNT0454 PIC X(11)   VALUE '0044101C   '.
046100     03  MNT0455 PIC X(11)   VALUE '0044202P Y '.                 0817665
046200     03  MNT0456 PIC X(11)   VALUE '0044401C   '.
046300     03  MNT0457 PIC X(11)   VALUE '0044508P Y '.                 0817665
046400     03  MNT0458 PIC X(11)   VALUE '0047401C   '.
046500     03  MNT0459 PIC X(11)   VALUE '0047508P Y '.                 0817665
046600     03  MNT0460 PIC X(11)   VALUE '0053301C   '.
046700     03  MNT0461 PIC X(11)   VALUE '0053408P Y '.                 0817665
046800     03  MNT0462 PIC X(11)   VALUE '0054202P Y '.                 0817665
046900     03  MNT0463 PIC X(11)   VALUE '0054408P Y '.                 0817665
047000     03  MNT0464 PIC X(11)   VALUE '0048401C   '.
047100     03  MNT0465 PIC X(11)   VALUE '0048508P Y '.                 0817665
047200     03  MNT0466 PIC X(11)   VALUE '0049308P Y '.                 0817665
047300     03  MNT0467 PIC X(11)   VALUE '0045308P Y '.                 0817665
047400     03  MNT0468 PIC X(11)   VALUE '0116808P Y '.                 0817665
047500     03  MNT0469 PIC X(11)   VALUE '0117602P Y '.                 0817665
047600     03  MNT0470 PIC X(11)   VALUE '0117801C   '.
047700     03  MNT0471 PIC X(11)   VALUE '0836801C   '.
047800     03  MNT0472 PIC X(11)   VALUE '0840108P YC'.                 0817665
047900     03  MNT0473 PIC X(11)   VALUE '0840908P YC'.                 0817665
048000     03  MNT0474 PIC X(11)   VALUE '0841708P YC'.                 0817665
048100     03  MNT0475 PIC X(11)   VALUE '0844108P YC'.                 0817665
048200     03  MNT0476 PIC X(11)   VALUE '0023701C   '.
048300     03  MNT0477 PIC X(11)   VALUE '0023901C   '.
048400     03  MNT0478 PIC X(11)   VALUE '0297201C  N'.
048500     03  MNT0479 PIC X(11)   VALUE '0297301C  N'.
048600     03  MNT0480 PIC X(11)   VALUE '0298001C  N'.
048700     03  MNT0481 PIC X(11)   VALUE '0297401C  N'.
048800     03  MNT0482 PIC X(11)   VALUE '0493508P Y '.                 0817665
048900     03  MNT0483 PIC X(11)   VALUE '0494308P Y '.                 0817665
049000     03  MNT0484 PIC X(11)   VALUE '0495108P Y '.                 0817665
049100     03  MNT0485 PIC X(11)   VALUE '0153509P YC'.                 0817665
049200     03  MNT0486 PIC X(11)   VALUE '0181509P Y '.                 0817665
049300*        **** FIELDS 487 THRU 494 USED FOR DATA CENTER TRAILER
049400     03  MNT0487 PIC X(11)   VALUE '1587702P  N'.                 0617360
049500     03  MNT0488 PIC X(11)   VALUE '15877     N'.                 0617360
049600*    03  MNT0489 PIC X(11)   VALUE '15877     N'.                 0617360
049602     03  MNT0489 PIC X(11)   VALUE '1588008CS N'.                 IMIB01A
049700     03  MNT0490 PIC X(11)   VALUE '15877     N'.                 0617360
049800     03  MNT0491 PIC X(11)   VALUE '15877     N'.                 0617360
049900     03  MNT0492 PIC X(11)   VALUE '15877     N'.                 0617360
050000     03  MNT0493 PIC X(11)   VALUE '15877     N'.                 0617360
050100     03  MNT0494 PIC X(11)   VALUE '15877     N'.                 0617360
050200     03  MNT0495 PIC X(11)   VALUE '0666501C  C'.
050300     03  MNT0496 PIC X(11)   VALUE '0666608P  N'.
050400     03  MNT0497 PIC X(11)   VALUE '0667401C  C'.
050500     03  MNT0498 PIC X(11)   VALUE '0667501P  C'.
050600     03  MNT0499 PIC X(11)   VALUE '0667602P  C'.
050700     03  MNT0500 PIC X(11)   VALUE '0668801P  C'.
050800     03  MNT0501 PIC X(11)   VALUE '0676202P  N'.                 9916070
050900     03  MNT0502 PIC X(11)   VALUE '0676409P  N'.                 9916070
051000     03  MNT0503 PIC X(11)   VALUE '0677309P  N'.                 9916070
051100     03  MNT0504 PIC X(11)   VALUE '0678209P  N'.                 9916070
051200     03  MNT0505 PIC X(11)   VALUE '0682508P YC'.                 0817665
051300     03  MNT0506 PIC X(11)   VALUE '0683304P Y '.                 0817665
051400     03  MNT0507 PIC X(11)   VALUE '0683708P Y '.                 0817665
051500     03  MNT0508 PIC X(11)   VALUE '0684504P Y '.                 0817665
051600     03  MNT0509 PIC X(11)   VALUE '0684908P Y '.                 0817665
051700     03  MNT0510 PIC X(11)   VALUE '0685708P  N'.                 9916070
051800     03  MNT0511 PIC X(11)   VALUE '0686508P YC'.                 0817665
051900     03  MNT0512 PIC X(11)   VALUE '0687308P  N'.                 9916070
052000     03  MNT0513 PIC X(11)   VALUE '0688908P YC'.                 0817665
052100     03  MNT0514 PIC X(11)   VALUE '0689708P YC'.                 0817665
052200     03  MNT0515 PIC X(11)   VALUE '0690508P YC'.                 0817665
052300     03  MNT0516 PIC X(11)   VALUE '0691303P Y '.                 0817665
052400     03  MNT0517 PIC X(11)   VALUE '0691608P Y '.                 0817665
052500     03  MNT0518 PIC X(11)   VALUE '0694201C  C'.                 9916070
052600     03  MNT0519 PIC X(11)   VALUE '0694308P YC'.                 0817665
052700     03  MNT0520 PIC X(11)   VALUE '0706808P  N'.                 9916070
052800     03  MNT0521 PIC X(11)   VALUE '0695908P YC'.                 0817665
052900     03  MNT0522 PIC X(11)   VALUE '0699109P  N'.                 9916070
053000     03  MNT0523 PIC X(11)   VALUE '0700008P YC'.                 0817665
053100     03  MNT0524 PIC X(11)   VALUE '0700808P YC'.                 0817665
053200     03  MNT0525 PIC X(11)   VALUE '0701603P Y '.                 0817665
053300     03  MNT0526 PIC X(11)   VALUE '0701908P Y '.                 0817665
053400     03  MNT0527 PIC X(11)   VALUE '0706008P  N'.                 9916070
053500     03  MNT0528 PIC X(11)   VALUE '0710008P YC'.                 0817665
053600     03  MNT0529 PIC X(11)   VALUE '           '.                 2012254
053700     03  MNT0530 PIC X(11)   VALUE '0682401C  N'.                 9916070
053800     03  MNT0531 PIC X(11)   VALUE '0714001C   '.                 9916070
053900     03  MNT0532 PIC X(11)   VALUE '0714108P Y '.                 0817665
054000     03  MNT0533 PIC X(11)   VALUE '0714903P Y '.                 0817665
054100     03  MNT0534 PIC X(11)   VALUE '0715208P Y '.                 0817665
054200     03  MNT0535 PIC X(11)   VALUE '0716003P Y '.                 0817665
054300     03  MNT0536 PIC X(11)   VALUE '0716308P Y '.                 0817665
054400     03  MNT0537 PIC X(11)   VALUE '0680808P Y '.                 0817665
054500     03  MNT0538 PIC X(11)   VALUE '0669001C   '.
054600     03  MNT0539 PIC X(11)   VALUE '0669102P Y '.                 0817665
054700     03  MNT0540 PIC X(11)   VALUE '0669301P   '.
054800     03  MNT0541 PIC X(11)   VALUE '0669408P Y '.                 0817665
054900     03  MNT0542 PIC X(11)   VALUE '0670202P Y '.                 0817665
055000     03  MNT0543 PIC X(11)   VALUE '0732508P  N'.
055100     03  MNT0544 PIC X(11)   VALUE '0738108P  N'.
055200     03  MNT0545 PIC X(11)   VALUE '0747702C  N'.
055300     03  MNT0546 PIC X(11)   VALUE '0747935C  N'.
055400     03  MNT0547 PIC X(11)   VALUE '0752201C  N'.
055500     03  MNT0548 PIC X(11)   VALUE '0816701C  N'.
055600     03  MNT0549 PIC X(11)   VALUE '0816822C   '.
055700     03  MNT0550 PIC X(11)   VALUE '0829201C  N'.
055800     03  MNT0551 PIC X(11)   VALUE '0829302C   '.
055900     03  MNT0552 PIC X(11)   VALUE '0829535C   '.
056000     03  MNT0553 PIC X(11)   VALUE '0833008P Y '.                 0817665
056100     03  MNT0554 PIC X(11)   VALUE '0048301C   '.
056200     03  MNT0555 PIC X(11)   VALUE '0299601C   '.
056300     03  MNT0556 PIC X(11)   VALUE '0024901C   '.
056400     03  MNT0557 PIC X(11)   VALUE '0898009P YC'.                 0817665
056500     03  MNT0558 PIC X(11)   VALUE '0898908P YC'.                 0817665
056600     03  MNT0559 PIC X(11)   VALUE '0024801C   '.
056700     03  MNT0560 PIC X(11)   VALUE '0396602P   '.
056800     03  MNT0561 PIC X(11)   VALUE '0126004P Y '.                 0817665
056900     03  MNT0562 PIC X(11)   VALUE '0126608P Y '.                 0817665
057000     03  MNT0563 PIC X(11)   VALUE '0127401C   '.
057100     03  MNT0564 PIC X(11)   VALUE '0141408P Y '.                 0817665
057200     03  MNT0565 PIC X(11)   VALUE '0205901C  C'.
057300     03  MNT0566 PIC X(11)   VALUE '0206001C  C'.
057400     03  MNT0567 PIC X(11)   VALUE '0206101P   '.
057500     03  MNT0568 PIC X(11)   VALUE '0206202C  C'.
057600     03  MNT0569 PIC X(11)   VALUE '0206402C   '.
057700     03  MNT0570 PIC X(11)   VALUE '0129224C  N'.
057800     03  MNT0571 PIC X(11)   VALUE '0132012C  N'.
057900     03  MNT0572 PIC X(11)   VALUE '0133202P  N'.
058000     03  MNT0573 PIC X(11)   VALUE '0095610C  C'.
058100     03  MNT0574 PIC X(11)   VALUE '0190708P YC'.                 0817665
058200     03  MNT0575 PIC X(11)   VALUE '0495908P Y '.                 0817665
058300     03  MNT0576 PIC X(11)   VALUE '0496701C   '.
058400     03  MNT0577 PIC X(11)   VALUE '0496801C   '.
058500     03  MNT0578 PIC X(11)   VALUE '0496901C   '.
058600     03  MNT0579 PIC X(11)   VALUE '0497001C   '.
058700     03  MNT0580 PIC X(11)   VALUE '0497108P Y '.                 0817665
058800     03  MNT0581 PIC X(11)   VALUE '0497901C   '.
058900     03  MNT0582 PIC X(11)   VALUE '0498001C   '.
059000     03  MNT0583 PIC X(11)   VALUE '0498101C   '.
059100     03  MNT0584 PIC X(11)   VALUE '0498201C   '.
059200     03  MNT0585 PIC X(11)   VALUE '0498308P Y '.                 0817665
059300     03  MNT0586 PIC X(11)   VALUE '0499101C   '.
059400     03  MNT0587 PIC X(11)   VALUE '0499201C   '.
059500     03  MNT0588 PIC X(11)   VALUE '0499301C   '.
059600     03  MNT0589 PIC X(11)   VALUE '0499401C   '.
059700     03  MNT0590 PIC X(11)   VALUE '0499508P Y '.                 0817665
059800     03  MNT0591 PIC X(11)   VALUE '0500301C   '.
059900     03  MNT0592 PIC X(11)   VALUE '0500401C   '.
060000     03  MNT0593 PIC X(11)   VALUE '0500501C   '.
060100     03  MNT0594 PIC X(11)   VALUE '0500601C   '.
060200     03  MNT0595 PIC X(11)   VALUE '0500708P Y '.                 0817665
060300     03  MNT0596 PIC X(11)   VALUE '0501501C   '.
060400     03  MNT0597 PIC X(11)   VALUE '0501601C   '.
060500     03  MNT0598 PIC X(11)   VALUE '0501701C   '.
060600     03  MNT0599 PIC X(11)   VALUE '0501801C   '.
060700     03  MNT0600 PIC X(11)   VALUE '0501908P Y '.                 0817665
060800     03  MNT0601 PIC X(11)   VALUE '0502701C   '.
060900     03  MNT0602 PIC X(11)   VALUE '0502801C   '.
061000     03  MNT0603 PIC X(11)   VALUE '0502901C   '.
061100     03  MNT0604 PIC X(11)   VALUE '0503001C   '.
061200     03  MNT0605 PIC X(11)   VALUE '0503108P Y '.                 0817665
061300     03  MNT0606 PIC X(11)   VALUE '0503901C   '.
061400     03  MNT0607 PIC X(11)   VALUE '0504001C   '.
061500     03  MNT0608 PIC X(11)   VALUE '0504101C   '.
061600     03  MNT0609 PIC X(11)   VALUE '0504201C   '.
061700     03  MNT0610 PIC X(11)   VALUE '0504308P Y '.                 0817665
061800     03  MNT0611 PIC X(11)   VALUE '0505101C   '.
061900     03  MNT0612 PIC X(11)   VALUE '0505201C   '.
062000     03  MNT0613 PIC X(11)   VALUE '0505301C   '.
062100     03  MNT0614 PIC X(11)   VALUE '0505401C   '.
062200     03  MNT0615 PIC X(11)   VALUE '0505508P Y '.                 0817665
062300     03  MNT0616 PIC X(11)   VALUE '0506301C   '.
062400     03  MNT0617 PIC X(11)   VALUE '0506401C   '.
062500     03  MNT0618 PIC X(11)   VALUE '0506501C   '.
062600     03  MNT0619 PIC X(11)   VALUE '0506601C   '.
062700     03  MNT0620 PIC X(11)   VALUE '0506708P Y '.                 0817665
062800     03  MNT0621 PIC X(11)   VALUE '0507501C   '.
062900     03  MNT0622 PIC X(11)   VALUE '0507601C   '.
063000     03  MNT0623 PIC X(11)   VALUE '0507701C   '.
063100     03  MNT0624 PIC X(11)   VALUE '0507801C   '.
063200     03  MNT0625 PIC X(11)   VALUE '0507908P Y '.                 0817665
063300     03  MNT0626 PIC X(11)   VALUE '0508701C   '.
063400     03  MNT0627 PIC X(11)   VALUE '0508801C   '.
063500     03  MNT0628 PIC X(11)   VALUE '0508901C   '.
063600     03  MNT0629 PIC X(11)   VALUE '0509001C   '.
063700     03  MNT0630 PIC X(11)   VALUE '0509108P Y '.                 0817665
063800     03  MNT0631 PIC X(11)   VALUE '0509901C   '.
063900     03  MNT0632 PIC X(11)   VALUE '0510001C   '.
064000     03  MNT0633 PIC X(11)   VALUE '0510101C   '.
064100     03  MNT0634 PIC X(11)   VALUE '0510201C   '.
064200     03  MNT0635 PIC X(11)   VALUE '0471602P Y '.                 0817665
064300     03  MNT0636 PIC X(11)   VALUE '0471802P Y '.                 0817665
064400     03  MNT0637 PIC X(11)   VALUE '0472002P Y '.                 0817665
064500     03  MNT0638 PIC X(11)   VALUE '0472202P Y '.                 0817665
064600     03  MNT0639 PIC X(11)   VALUE '0013630C  N'.                 0517306
064700     03  MNT0640 PIC X(11)   VALUE '          I'.
064800     03  MNT0641 PIC X(11)   VALUE '          I'.
064900     03  MNT0642 PIC X(11)   VALUE '          I'.
065000     03  MNT0643 PIC X(11)   VALUE '0019301CS  '.
065100     03  MNT0644 PIC X(11)   VALUE '0019401CS  '.
065200     03  MNT0645 PIC X(11)   VALUE '0019501CS  '.
065300     03  MNT0646 PIC X(11)   VALUE '0019601CS  '.
065400     03  MNT0647 PIC X(11)   VALUE '0019701CS  '.
065500     03  MNT0648 PIC X(11)   VALUE '0019801CS  '.
065600     03  MNT0649 PIC X(11)   VALUE '0019901CS  '.
065700     03  MNT0650 PIC X(11)   VALUE '0020001CS  '.
065800     03  MNT0651 PIC X(11)   VALUE '0020101CS  '.
065900     03  MNT0652 PIC X(11)   VALUE '0160904P Y '.                 0817665
066000     03  MNT0653 PIC X(11)   VALUE '0161304P Y '.                 0817665
066100     03  MNT0654 PIC X(11)   VALUE '0073806DS C'.
066200     03  MNT0655 PIC X(11)   VALUE '0064708P  N'.
066300     03  MNT0656 PIC X(11)   VALUE '0065508P  N'.
066400     03  MNT0657 PIC X(11)   VALUE '          I'.
066500     03  MNT0658 PIC X(11)   VALUE '          I'.
066600     03  MNT0659 PIC X(11)   VALUE '0098601C   '.
066700     03  MNT0660 PIC X(11)   VALUE '0097402P  C'.
066800     03  MNT0661 PIC X(11)   VALUE '0098701P   '.
066900     03  MNT0662 PIC X(11)   VALUE '0104609P  N'.
067000     03  MNT0663 PIC X(11)   VALUE '0105508P  N'.
067100     03  MNT0664 PIC X(11)   VALUE '0108708P  N'.
067200     03  MNT0665 PIC X(11)   VALUE '0109508P  N'.
067300     03  MNT0666 PIC X(11)   VALUE '0185208P Y '.                 0817665
067400     03  MNT0667 PIC X(11)   VALUE '0116008P Y '.                 0817665
067500     03  MNT0668 PIC X(11)   VALUE '0511105P   '.
067600     03  MNT0669 PIC X(11)   VALUE '0510901C   '.
067700     03  MNT0670 PIC X(11)   VALUE '0668901C   '.
067800     03  MNT0671 PIC X(11)   VALUE '0679108P  N'.                 9916070
067900     03  MNT0672 PIC X(11)   VALUE '0679909P  N'.                 2012914
068000     03  MNT0673 PIC X(11)   VALUE '0688108P  N'.                 9916070
068100     03  MNT0674 PIC X(11)   VALUE '0695108P YC'.                 0817665
068200     03  MNT0675 PIC X(11)   VALUE '0696708P  N'.                 9916070
068300     03  MNT0676 PIC X(11)   VALUE '0704902P YC'.                 0817665
068400     03  MNT0677 PIC X(11)   VALUE '0705109P YC'.                 0817665
068500     03  MNT0678 PIC X(11)   VALUE '0709208P Y '.                 0817665
068600     03  MNT0679 PIC X(11)   VALUE '0710808P YC'.                 0817665
068700     03  MNT0680 PIC X(11)   VALUE '0672501C   '.                 9916070
068800     03  MNT0681 PIC X(11)   VALUE '0673006D   '.                 9916070
068900     03  MNT0682 PIC X(11)   VALUE '0672601CS  '.                 9916070
069000     03  MNT0683 PIC X(11)   VALUE '0672702P   '.                 9916070
069100     03  MNT0684 PIC X(11)   VALUE '0672901CS  '.                 9916070
069200     03  MNT0685 PIC X(11)   VALUE '0673808P Y '.                 0817665
069300     03  MNT0686 PIC X(11)   VALUE '0674608P Y '.                 0817665
069400     03  MNT0687 PIC X(11)   VALUE '0675408P YC'.                 0817665
069500     03  MNT0688 PIC X(11)   VALUE '0681608P  N'.                 9916070
069600     03  MNT0689 PIC X(11)   VALUE '0097202P  C'.
069700     03  MNT0690 PIC X(11)   VALUE '0160104P YC'.                 0817665
069800     03  MNT0691 PIC X(11)   VALUE '0160504P YC'.                 0817665
069900     03  MNT0692 PIC X(11)   VALUE '0012402C   '.
070000     03  MNT0693 PIC X(11)   VALUE '0086301C  C'.
070100     03  MNT0694 PIC X(11)   VALUE '0086401CS  '.
070200     03  MNT0695 PIC X(11)   VALUE '0086501C   '.
070300     03  MNT0696 PIC X(11)   VALUE '0122201C   '.
070400     03  MNT0697 PIC X(11)   VALUE '0012610C  I'.
070500     03  MNT0698 PIC X(11)   VALUE '0020203CS  '.
070600     03  MNT0699 PIC X(11)   VALUE '0020201CS  '.
070700     03  MNT0700 PIC X(11)   VALUE '0020301CS  '.
070800     03  MNT0701 PIC X(11)   VALUE '0020401CS  '.
070900     03  MNT0702 PIC X(11)   VALUE '0020503CS  '.
071000     03  MNT0703 PIC X(11)   VALUE '0020501CS  '.
071100     03  MNT0704 PIC X(11)   VALUE '0020601CS  '.
071200     03  MNT0705 PIC X(11)   VALUE '0020701CS  '.
071300     03  MNT0706 PIC X(11)   VALUE '0020803CS  '.
071400     03  MNT0707 PIC X(11)   VALUE '0020801CS  '.
071500     03  MNT0708 PIC X(11)   VALUE '0020901CS  '.
071600     03  MNT0709 PIC X(11)   VALUE '0021001CS  '.
071700     03  MNT0710 PIC X(11)   VALUE '0021901C   '.
071800     03  MNT0711 PIC X(11)   VALUE '0024101C   '.
071900     03  MNT0712 PIC X(11)   VALUE '0024201C   '.
072000     03  MNT0713 PIC X(11)   VALUE '0024301C   '.
072100     03  MNT0714 PIC X(11)   VALUE '0024401C   '.
072200     03  MNT0715 PIC X(11)   VALUE '0024501C   '.
072300     03  MNT0716 PIC X(11)   VALUE '0025101C   '.
072400     03  MNT0717 PIC X(11)   VALUE '0025201C   '.
072500     03  MNT0718 PIC X(11)   VALUE '0025301C   '.
072600     03  MNT0719 PIC X(11)   VALUE '0025401C   '.
072700     03  MNT0720 PIC X(11)   VALUE '0055401C   '.
072800     03  MNT0721 PIC X(11)   VALUE '0660702P Y '.                 0817665
072900     03  MNT0722 PIC X(11)   VALUE '0660902P Y '.                 0817665
073000     03  MNT0723 PIC X(11)   VALUE '0661102P Y '.                 0817665
073100     03  MNT0724 PIC X(11)   VALUE '0661302P Y '.                 0817665
073200     03  MNT0725 PIC X(11)   VALUE '0661502P Y '.                 0817665
073300     03  MNT0726 PIC X(11)   VALUE '0661702P Y '.                 0817665
073400     03  MNT0727 PIC X(11)   VALUE '0661902P Y '.                 0817665
073500     03  MNT0728 PIC X(11)   VALUE '0662102P Y '.                 0817665
073600     03  MNT0729 PIC X(11)   VALUE '0662302P Y '.                 0817665
073700     03  MNT0730 PIC X(11)   VALUE '0662502P Y '.                 0817665
073800     03  MNT0731 PIC X(11)   VALUE '0662702P Y '.                 0817665
073900     03  MNT0732 PIC X(11)   VALUE '0662902P Y '.                 0817665
074000     03  MNT0733 PIC X(11)   VALUE '0848701C   '.
074100     03  MNT0734 PIC X(11)   VALUE '0880701C   '.
074200     03  MNT0735 PIC X(11)   VALUE '0848801C   '.
074300     03  MNT0736 PIC X(11)   VALUE '0849009P  N'.
074400     03  MNT0737 PIC X(11)   VALUE '0849909P  N'.
074500     03  MNT0738 PIC X(11)   VALUE '0850809P  N'.
074600     03  MNT0739 PIC X(11)   VALUE '0851708P  N'.
074700     03  MNT0740 PIC X(11)   VALUE '0852508P Y '.                 0817665
074800     03  MNT0741 PIC X(11)   VALUE '0853308P Y '.                 0817665
074900     03  MNT0742 PIC X(11)   VALUE '0854108P  N'.
075000     03  MNT0743 PIC X(11)   VALUE '0854908P  N'.
075100     03  MNT0744 PIC X(11)   VALUE '0855708P Y '.                 0817665
075200     03  MNT0745 PIC X(11)   VALUE '0863801CS  '.
075300     03  MNT0746 PIC X(11)   VALUE '0857502P   '.
075400     03  MNT0747 PIC X(11)   VALUE '0857705P   '.
075500     03  MNT0748 PIC X(11)   VALUE '0858202P   '.
075600     03  MNT0749 PIC X(11)   VALUE '0858405P   '.
075700     03  MNT0750 PIC X(11)   VALUE '0863908P   '.
075800     03  MNT0751 PIC X(11)   VALUE '0864706DS  '.
075900     03  MNT0752 PIC X(11)   VALUE '0858902P   '.
076000     03  MNT0753 PIC X(11)   VALUE '0859105P   '.
076100     03  MNT0754 PIC X(11)   VALUE '0865301CS  '.
076200     03  MNT0755 PIC X(11)   VALUE '0865408P   '.
076300     03  MNT0756 PIC X(11)   VALUE '0057003P  N'.
076400     03  MNT0757 PIC X(11)   VALUE '0058103P  N'.
076500     03  MNT0758 PIC X(11)   VALUE '0058408P  N'.
076600     03  MNT0759 PIC X(11)   VALUE '0059203P  N'.
076700     03  MNT0760 PIC X(11)   VALUE '0060301C   '.
076800     03  MNT0761 PIC X(11)   VALUE '0913709P Y '.                 0817665
076900     03  MNT0762 PIC X(11)   VALUE '0915008P Y '.                 0817665
077000     03  MNT0763 PIC X(11)   VALUE '0916208P Y '.                 0817665
077100     03  MNT0764 PIC X(11)   VALUE '0073206D  N'.
077200     03  MNT0765 PIC X(11)   VALUE '0891201CS  '.                 2016570
077300     03  MNT0766 PIC X(11)   VALUE '0891301C   '.
077400     03  MNT0767 PIC X(11)   VALUE '0891401CS  '.                 2016570
077500     03  MNT0768 PIC X(11)   VALUE '0891501CS  '.
077600     03  MNT0769 PIC X(11)   VALUE '0891605C   '.
077700     03  MNT0770 PIC X(11)   VALUE '0892106C   '.
077800     03  MNT0771 PIC X(11)   VALUE '0892701C   '.
077900     03  MNT0772 PIC X(11)   VALUE '0892810C   '.
078000     03  MNT0773 PIC X(11)   VALUE '0893802C   '.
078100     03  MNT0774 PIC X(11)   VALUE '0894003C   '.
078200     03  MNT0775 PIC X(11)   VALUE '0099709P  N'.
078300     03  MNT0776 PIC X(11)   VALUE '0102208P  N'.
078400     03  MNT0777 PIC X(11)   VALUE '0106308P  N'.
078500     03  MNT0778 PIC X(11)   VALUE '0112708P YC'.                 0817665
078600     03  MNT0779 PIC X(11)   VALUE '0115108P  N'.
078700     03  MNT0780 PIC X(11)   VALUE '0115901C   '.
078800     03  MNT0781 PIC X(11)   VALUE '0391101C   '.
078900     03  MNT0782 PIC X(11)   VALUE '0392101C   '.
079000     03  MNT0783 PIC X(11)   VALUE '0512508P  N'.
079100     03  MNT0784 PIC X(11)   VALUE '          N'.
079200     03  MNT0785 PIC X(11)   VALUE '          N'.
079300     03  MNT0786 PIC X(11)   VALUE '0515408P  N'.
079400     03  MNT0787 PIC X(11)   VALUE '          N'.
079500     03  MNT0788 PIC X(11)   VALUE '          N'.
079600     03  MNT0789 PIC X(11)   VALUE '0438908P  I'.
079700     03  MNT0790 PIC X(11)   VALUE '0439708P  I'.
079800     03  MNT0791 PIC X(11)   VALUE '0441308P  I'.
079900     03  MNT0792 PIC X(11)   VALUE '0442108P  I'.
080000     03  MNT0793 PIC X(11)   VALUE '          N'.
080100     03  MNT0794 PIC X(11)   VALUE '          N'.
080200     03  MNT0795 PIC X(11)   VALUE '          N'.
080300     03  MNT0796 PIC X(11)   VALUE '          N'.
080400     03  MNT0797 PIC X(11)   VALUE '0426201C  I'.
080500     03  MNT0798 PIC X(11)   VALUE '0426308P  I'.
080600     03  MNT0799 PIC X(11)   VALUE '0427108P  I'.
080700     03  MNT0800 PIC X(11)   VALUE '0427908P  I'.
080800     03  MNT0801 PIC X(11)   VALUE '0428708P  I'.
080900     03  MNT0802 PIC X(11)   VALUE '0158902P  C'.
081000     03  MNT0803 PIC X(11)   VALUE '0159104P  C'.
081100     03  MNT0804 PIC X(11)   VALUE '1156801C   '.                 2012254
081200     03  MNT0805 PIC X(11)   VALUE '1157701C   '.                 2012254
081300     03  MNT0806 PIC X(11)   VALUE '1158601C   '.                 2012254
081400     03  MNT0807 PIC X(11)   VALUE '1159501C   '.                 2012254
081500     03  MNT0808 PIC X(11)   VALUE '1160401C   '.                 2012254
081600     03  MNT0809 PIC X(11)   VALUE '1161301C   '.                 2012254
081700     03  MNT0810 PIC X(11)   VALUE '1162201C   '.                 2012254
081800     03  MNT0811 PIC X(11)   VALUE '1163101C   '.                 2012254
081900     03  MNT0812 PIC X(11)   VALUE '1164001C   '.                 2012254
082000     03  MNT0813 PIC X(11)   VALUE '1164901C   '.                 2012254
082100     03  MNT0814 PIC X(11)   VALUE '1165801C   '.                 2012254
082200     03  MNT0815 PIC X(11)   VALUE '1166701C   '.                 2012254
082300     03  MNT0816 PIC X(11)   VALUE '1167601C   '.                 2012254
082400     03  MNT0817 PIC X(11)   VALUE '1168501C   '.                 2012254
082500     03  MNT0818 PIC X(11)   VALUE '1169401C   '.                 2012254
082600     03  MNT0819 PIC X(11)   VALUE '1170301C   '.                 2012254
082700     03  MNT0820 PIC X(11)   VALUE '1171201C   '.                 2012254
082800     03  MNT0821 PIC X(11)   VALUE '1172101C   '.                 2012254
082900     03  MNT0822 PIC X(11)   VALUE '1173001C   '.                 2012254
083000     03  MNT0823 PIC X(11)   VALUE '1173901C   '.                 2012254
083100     03  MNT0824 PIC X(11)   VALUE '1174801C   '.                 2012254
083200     03  MNT0825 PIC X(11)   VALUE '1175701C   '.                 2012254
083300     03  MNT0826 PIC X(11)   VALUE '1176601C   '.                 2012254
083400     03  MNT0827 PIC X(11)   VALUE '1177501C   '.                 2012254
083500     03  MNT0828 PIC X(11)   VALUE '1178401C   '.                 2012254
083600     03  MNT0829 PIC X(11)   VALUE '1156908P Y '.                 0817665
083700     03  MNT0830 PIC X(11)   VALUE '1157808P Y '.                 0817665
083800     03  MNT0831 PIC X(11)   VALUE '1158708P Y '.                 0817665
083900     03  MNT0832 PIC X(11)   VALUE '1159608P Y '.                 0817665
084000     03  MNT0833 PIC X(11)   VALUE '1160508P Y '.                 0817665
084100     03  MNT0834 PIC X(11)   VALUE '1161408P Y '.                 0817665
084200     03  MNT0835 PIC X(11)   VALUE '1162308P Y '.                 0817665
084300     03  MNT0836 PIC X(11)   VALUE '1163208P Y '.                 0817665
084400     03  MNT0837 PIC X(11)   VALUE '1164108P Y '.                 0817665
084500     03  MNT0838 PIC X(11)   VALUE '1165008P Y '.                 0817665
084600     03  MNT0839 PIC X(11)   VALUE '1165908P Y '.                 0817665
084700     03  MNT0840 PIC X(11)   VALUE '1166808P Y '.                 0817665
084800     03  MNT0841 PIC X(11)   VALUE '1167708P Y '.                 0817665
084900     03  MNT0842 PIC X(11)   VALUE '1168608P Y '.                 0817665
085000     03  MNT0843 PIC X(11)   VALUE '1169508P Y '.                 0817665
085100     03  MNT0844 PIC X(11)   VALUE '1170408P Y '.                 0817665
085200     03  MNT0845 PIC X(11)   VALUE '1171308P Y '.                 0817665
085300     03  MNT0846 PIC X(11)   VALUE '1172208P Y '.                 0817665
085400     03  MNT0847 PIC X(11)   VALUE '1173108P Y '.                 0817665
085500     03  MNT0848 PIC X(11)   VALUE '1174008P Y '.                 0817665
085600     03  MNT0849 PIC X(11)   VALUE '1174908P Y '.                 0817665
085700     03  MNT0850 PIC X(11)   VALUE '1175808P Y '.                 0817665
085800     03  MNT0851 PIC X(11)   VALUE '1176708P Y '.                 0817665
085900     03  MNT0852 PIC X(11)   VALUE '1177608P Y '.                 0817665
086000     03  MNT0853 PIC X(11)   VALUE '1178508P Y '.                 0817665
086100     03  MNT0854 PIC X(11)   VALUE '0161708P YC'.                 0817665
086200     03  MNT0855 PIC X(11)   VALUE '          N'.
086300     03  MNT0856 PIC X(11)   VALUE '          N'.
086400     03  MNT0857 PIC X(11)   VALUE '          N'.
086500     03  MNT0858 PIC X(11)   VALUE '          N'.
086600     03  MNT0859 PIC X(11)   VALUE '          N'.
086700     03  MNT0860 PIC X(11)   VALUE '          N'.
086800     03  MNT0861 PIC X(11)   VALUE '          N'.
086900     03  MNT0862 PIC X(11)   VALUE '          N'.
087000     03  MNT0863 PIC X(11)   VALUE '          N'.
087100     03  MNT0864 PIC X(11)   VALUE '          N'.
087200     03  MNT0865 PIC X(11)   VALUE '          N'.
087300     03  MNT0866 PIC X(11)   VALUE '          N'.
087400     03  MNT0867 PIC X(11)   VALUE '0188202P Y '.                 0817665
087500     03  MNT0868 PIC X(11)   VALUE '0188404P Y '.                 0817665
087600     03  MNT0869 PIC X(11)   VALUE '0008801C   '.
087700     03  MNT0870 PIC X(11)   VALUE '0008935C   '.
087800     03  MNT0871 PIC X(11)   VALUE '          N'.
087900     03  MNT0872 PIC X(11)   VALUE '          N'.
088000     03  MNT0873 PIC X(11)   VALUE '          N'.
088100     03  MNT0874 PIC X(11)   VALUE '0007414CS  '.                 0427210
088200     03  MNT0875 PIC X(11)   VALUE '0043002P   '.
088300     03  MNT0876 PIC X(11)   VALUE '0329401C  N'.
088400     03  MNT0877 PIC X(11)   VALUE '0329501C  N'.
088500     03  MNT0878 PIC X(11)   VALUE '0329606DS  '.
088600     03  MNT0879 PIC X(11)   VALUE '0330202P  N'.
088700     03  MNT0880 PIC X(11)   VALUE '0330601CS  '.
088800     03  MNT0881 PIC X(11)   VALUE '0330701C   '.
088900     03  MNT0882 PIC X(11)   VALUE '0330811CS C'.                 0817719
089000     03  MNT0883 PIC X(11)   VALUE '0331902P   '.
089100     03  MNT0884 PIC X(11)   VALUE '0332101CS  '.
089200     03  MNT0885 PIC X(11)   VALUE '0392602C   '.
089300     03  MNT0886 PIC X(11)   VALUE '0473602P Y '.                 0817665
089400     03  MNT0887 PIC X(11)   VALUE '0485701C   '.
089500     03  MNT0888 PIC X(11)   VALUE '0485808P Y '.                 0817665
089600     03  MNT0889 PIC X(11)   VALUE '0449201C   '.
089700     03  MNT0890 PIC X(11)   VALUE '0449308P Y '.                 0817665
089800     03  MNT0891 PIC X(11)   VALUE '0404106DS  '.
089900     03  MNT0892 PIC X(11)   VALUE '0410708P  N'.
090000     03  MNT0893 PIC X(11)   VALUE '0411508P  N'.
090100     03  MNT0894 PIC X(11)   VALUE '0412308P  N'.
090200     03  MNT0895 PIC X(11)   VALUE '0468902C   '.
090300     03  MNT0896 PIC X(11)   VALUE '0486602P Y '.                 0817665
090400     03  MNT0897 PIC X(11)   VALUE '0491108P  N'.
090500     03  MNT0898 PIC X(11)   VALUE '0491908P  N'.
090600     03  MNT0899 PIC X(11)   VALUE '0492708P  N'.
090700     03  MNT0900 PIC X(11)   VALUE '0419709P  I'.
090800     03  MNT0901 PIC X(11)   VALUE '0752101C  I'.
090900     03  MNT0902 PIC X(11)   VALUE '0819001C   '.
091000     03  MNT0903 PIC X(11)   VALUE '0819708P Y '.                 0817665
091100     03  MNT0904 PIC X(11)   VALUE '0820501C   '.
091200     03  MNT0905 PIC X(11)   VALUE '0330402P   '.
091300     03  MNT0906 PIC X(11)   VALUE '0369302P   '.
091400     03  MNT0907 PIC X(11)   VALUE '0552901C   '.
091500     03  MNT0908 PIC X(11)   VALUE '0553001C   '.
091600     03  MNT0909 PIC X(11)   VALUE '0553102P Y '.                 0817665
091700     03  MNT0910 PIC X(11)   VALUE '0554102P Y '.                 0817665
091800     03  MNT0911 PIC X(11)   VALUE '0555102P Y '.                 0817665
091900     03  MNT0912 PIC X(11)   VALUE '0556102P Y '.                 0817665
092000     03  MNT0913 PIC X(11)   VALUE '0557102P Y '.                 0817665
092100     03  MNT0914 PIC X(11)   VALUE '0558102P Y '.                 0817665
092200     03  MNT0915 PIC X(11)   VALUE '0559102P Y '.                 0817665
092300     03  MNT0916 PIC X(11)   VALUE '0560102P Y '.                 0817665
092400     03  MNT0917 PIC X(11)   VALUE '0561102P Y '.                 0817665
092500     03  MNT0918 PIC X(11)   VALUE '0562102P Y '.                 0817665
092600     03  MNT0919 PIC X(11)   VALUE '0563102P Y '.                 0817665
092700     03  MNT0920 PIC X(11)   VALUE '0564102P Y '.                 0817665
092800     03  MNT0921 PIC X(11)   VALUE '0565102P Y '.                 0817665
092900     03  MNT0922 PIC X(11)   VALUE '0553308P Y '.                 0817665
093000     03  MNT0923 PIC X(11)   VALUE '0554308P Y '.                 0817665
093100     03  MNT0924 PIC X(11)   VALUE '0555308P Y '.                 0817665
093200     03  MNT0925 PIC X(11)   VALUE '0556308P Y '.                 0817665
093300     03  MNT0926 PIC X(11)   VALUE '0557308P Y '.                 0817665
093400     03  MNT0927 PIC X(11)   VALUE '0558308P Y '.                 0817665
093500     03  MNT0928 PIC X(11)   VALUE '0559308P Y '.                 0817665
093600     03  MNT0929 PIC X(11)   VALUE '0560308P Y '.                 0817665
093700     03  MNT0930 PIC X(11)   VALUE '0561308P Y '.                 0817665
093800     03  MNT0931 PIC X(11)   VALUE '0562308P Y '.                 0817665
093900     03  MNT0932 PIC X(11)   VALUE '0563308P Y '.                 0817665
094000     03  MNT0933 PIC X(11)   VALUE '0564308P Y '.                 0817665
094100     03  MNT0934 PIC X(11)   VALUE '0565308P Y '.                 0817665
094200     03  MNT0935 PIC X(11)   VALUE '0055502P Y '.                 0817665
094300     03  MNT0936 PIC X(11)   VALUE '0486802C   '.
094400     03  MNT0937 PIC X(11)   VALUE '0458408P YC'.                 0817665
094500     03  MNT0938 PIC X(11)   VALUE '0459208P YC'.                 0817665
094600     03  MNT0939 PIC X(11)   VALUE '0672401C   '.                 9916070
094700     03  MNT0940 PIC X(11)   VALUE '0875809P YC'.                 0817665
094800     03  MNT0941 PIC X(11)   VALUE '0876709P YC'.                 0817665
094900     03  MNT0942 PIC X(11)   VALUE '0877602P YC'.                 0817665
095000     03  MNT0943 PIC X(11)   VALUE '0877802P YC'.                 0817665
095100     03  MNT0944 PIC X(11)   VALUE '0878001C   '.
095200     03  MNT0945 PIC X(11)   VALUE '0878101C   '.
095300     03  MNT0946 PIC X(11)   VALUE '0878201C   '.
095400     03  MNT0947 PIC X(11)   VALUE '0878901C   '.
095500     03  MNT0948 PIC X(11)   VALUE '0894701C   '.
095600     03  MNT0949 PIC X(11)   VALUE '1145601C   '.                 2012254
095700     03  MNT0950 PIC X(11)   VALUE '0909701C   '.
095800     03  MNT0951 PIC X(11)   VALUE '0879006DS  '.
095900     03  MNT0952 PIC X(11)   VALUE '0670406DS  '.
096000     03  MNT0953 PIC X(11)   VALUE '0671206DS  '.
096100     03  MNT0954 PIC X(11)   VALUE '0025501C   '.
096200     03  MNT0955 PIC X(11)   VALUE '0055704P Y '.                 0817665
096300     03  MNT0956 PIC X(11)   VALUE '0167204P Y '.                 0817665
096400     03  MNT0957 PIC X(11)   VALUE '0167604P Y '.                 0817665
096500     03  MNT0958 PIC X(11)   VALUE '0332214CS  '.
096600     03  MNT0959 PIC X(11)   VALUE '0371114CS  '.
096700     03  MNT0960 PIC X(11)   VALUE '0566109P Y '.                 0817665
096800     03  MNT0961 PIC X(11)   VALUE '0142301CS N'.
096900     03  MNT0962 PIC X(11)   VALUE '0142401CS N'.
097000     03  MNT0963 PIC X(11)   VALUE '0142502CS N'.
097100     03  MNT0964 PIC X(11)   VALUE '0846501CS  '.
097200     03  MNT0965 PIC X(11)   VALUE '0025601C   '.
097300     03  MNT0966 PIC X(11)   VALUE '0032308P Y '.                 0817665
097400     03  MNT0967 PIC X(11)   VALUE '0033108P Y '.                 0817665
097500     03  MNT0968 PIC X(11)   VALUE '0142801C   '.
097600     03  MNT0969 PIC X(11)   VALUE '0194204P Y '.                 0817665
097700     03  MNT0970 PIC X(11)   VALUE '0194604P Y '.                 0817665
097800     03  MNT0971 PIC X(11)   VALUE '0487002P Y '.                 0817665
097900     03  MNT0972 PIC X(11)   VALUE '0142701C   '.
098000     03  MNT0973 PIC X(11)   VALUE '0389601C  N'.
098100     03  MNT0974 PIC X(11)   VALUE '0195002P YC'.                 0817665
098200     03  MNT0975 PIC X(11)   VALUE '0025701C   '.
098300     03  MNT0976 PIC X(11)   VALUE '0702702P YC'.                 0817665
098400     03  MNT0977 PIC X(11)   VALUE '0517401C   '.
098500     03  MNT0978 PIC X(11)   VALUE '0517502N   '.
098600     03  MNT0979 PIC X(11)   VALUE '0517701C   '.
098700     03  MNT0980 PIC X(11)   VALUE '0517802P Y '.                 0817665
098800     03  MNT0981 PIC X(11)   VALUE '0518002P  N'.
098900     03  MNT0982 PIC X(11)   VALUE '0518206D   '.
099000     03  MNT0983 PIC X(11)   VALUE '0518806D   '.
099100     03  MNT0984 PIC X(11)   VALUE '0519808P Y '.                 0817665
099200     03  MNT0985 PIC X(11)   VALUE '0520608P  N'.
099300     03  MNT0986 PIC X(11)   VALUE '0521408P  N'.
099400     03  MNT0987 PIC X(11)   VALUE '0465908P Y '.                 0817665
099500     03  MNT0988 PIC X(11)   VALUE '0066303CS  '.
099600     03  MNT0989 PIC X(11)   VALUE '0117904CS  '.                 2014079
099700     03  MNT0990 PIC X(11)   VALUE '0118304CS  '.                 2014079
099800     03  MNT0991 PIC X(11)   VALUE '0118701P   '.
099900     03  MNT0992 PIC X(11)   VALUE '0692404CS  '.                 2014079
100000     03  MNT0993 PIC X(11)   VALUE '0692804CS  '.                 2014079
100100     03  MNT0994 PIC X(11)   VALUE '0541902CS  '.
100200     03  MNT0995 PIC X(11)   VALUE '0025801C   '.
100300     03  MNT0996 PIC X(11)   VALUE '0437009P Y '.                 0817665
100400     03  MNT0997 PIC X(11)   VALUE '0437902P Y '.                 0817665
100500     03  MNT0998 PIC X(11)   VALUE '0914604P Y '.                 0817665
100600     03  MNT0999 PIC X(11)   VALUE '0915804P Y '.                 0817665
100700     03  MNT1000 PIC X(11)   VALUE '0910302P   '.
100800     03  MNT1001 PIC X(11)   VALUE '0910502P Y '.                 0817665
100900     03  MNT1002 PIC X(11)   VALUE '0910702P Y '.                 0817665
101000     03  MNT1003 PIC X(11)   VALUE '0910902P Y '.                 0817665
101100     03  MNT1004 PIC X(11)   VALUE '0911502P Y '.                 0817665
101200     03  MNT1005 PIC X(11)   VALUE '0912908P Y '.                 0817665
101300     03  MNT1006 PIC X(11)   VALUE '0911102P Y '.                 0817665
101400     03  MNT1007 PIC X(11)   VALUE '0911302P Y '.                 0817665
101500     03  MNT1008 PIC X(11)   VALUE '0918403P Y '.                 0817665
101600     03  MNT1009 PIC X(11)   VALUE '0918703P Y '.                 0817665
101700     03  MNT1010 PIC X(11)   VALUE '0919003P Y '.                 0817665
101800     03  MNT1011 PIC X(11)   VALUE '0919303P Y '.                 0817665
101900     03  MNT1012 PIC X(11)   VALUE '0919603P Y '.                 0817665
102000     03  MNT1013 PIC X(11)   VALUE '0919903P Y '.                 0817665
102100     03  MNT1014 PIC X(11)   VALUE '0920203P Y '.                 0817665
102200     03  MNT1015 PIC X(11)   VALUE '0920508P Y '.                 0817665
102300     03  MNT1016 PIC X(11)   VALUE '0921308P Y '.                 0817665
102400     03  MNT1017 PIC X(11)   VALUE '0922108P Y '.                 0817665
102500     03  MNT1018 PIC X(11)   VALUE '0922908P Y '.                 0817665
102600     03  MNT1019 PIC X(11)   VALUE '0923708P Y '.                 0817665
102700     03  MNT1020 PIC X(11)   VALUE '0924508P Y '.                 0817665
102800     03  MNT1021 PIC X(11)   VALUE '0925308P Y '.                 0817665
102900     03  MNT1022 PIC X(11)   VALUE '0926103P Y '.                 0817665
103000     03  MNT1023 PIC X(11)   VALUE '0926403P Y '.                 0817665
103100     03  MNT1024 PIC X(11)   VALUE '0926703P Y '.                 0817665
103200     03  MNT1025 PIC X(11)   VALUE '0927003P Y '.                 0817665
103300     03  MNT1026 PIC X(11)   VALUE '0927303P Y '.                 0817665
103400     03  MNT1027 PIC X(11)   VALUE '0927603P Y '.                 0817665
103500     03  MNT1028 PIC X(11)   VALUE '0927903P Y '.                 0817665
103600     03  MNT1029 PIC X(11)   VALUE '0928208P Y '.                 0817665
103700     03  MNT1030 PIC X(11)   VALUE '0929008P Y '.                 0817665
103800     03  MNT1031 PIC X(11)   VALUE '0929808P Y '.                 0817665
103900     03  MNT1032 PIC X(11)   VALUE '0930608P Y '.                 0817665
104000     03  MNT1033 PIC X(11)   VALUE '0931408P Y '.                 0817665
104100     03  MNT1034 PIC X(11)   VALUE '0932208P Y '.                 0817665
104200     03  MNT1035 PIC X(11)   VALUE '0933008P Y '.                 0817665
104300     03  MNT1036 PIC X(11)   VALUE '0466705P   '.
104400     03  MNT1037 PIC X(11)   VALUE '0393404C   '.
104500     03  MNT1038 PIC X(11)   VALUE '0245501C   '.                 0817665
104600     03  MNT1039 PIC X(11)   VALUE '0245608P YC'.                 0817665
104700     03  MNT1040 PIC X(11)   VALUE '0246409P YC'.                 0817665
104800     03  MNT1041 PIC X(11)   VALUE '0247309P YC'.                 0817665
104900     03  MNT1042 PIC X(11)   VALUE '0248209P YC'.                 0817665
105000     03  MNT1043 PIC X(11)   VALUE '0297601C  N'.
105100     03  MNT1044 PIC X(11)   VALUE '0297701C  N'.
105200     03  MNT1045 PIC X(11)   VALUE '0937701C   '.
105300     03  MNT1046 PIC X(11)   VALUE '0937801C   '.
105400     03  MNT1047 PIC X(11)   VALUE '0937901C   '.
105500     03  MNT1048 PIC X(11)   VALUE '0938001C   '.
105600     03  MNT1049 PIC X(11)   VALUE '0938101C   '.
105700     03  MNT1050 PIC X(11)   VALUE '0938208P Y '.                 0817665
105800     03  MNT1051 PIC X(11)   VALUE '0939002P Y '.                 0817665
105900     03  MNT1052 PIC X(11)   VALUE '0939208P Y '.                 0817665
106000     03  MNT1053 PIC X(11)   VALUE '0940301C   '.
106100     03  MNT1054 PIC X(11)   VALUE '0940408P Y '.                 0817665
106200     03  MNT1055 PIC X(11)   VALUE '0941201C   '.
106300     03  MNT1056 PIC X(11)   VALUE '0941308P Y '.                 0817665
106400     03  MNT1057 PIC X(11)   VALUE '0942102P   '.
106500     03  MNT1058 PIC X(11)   VALUE '0943906C   '.
106600     03  MNT1059 PIC X(11)   VALUE '0944506DS  '.
106700     03  MNT1060 PIC X(11)   VALUE '0945106DS  '.
106800     03  MNT1061 PIC X(11)   VALUE '0945701C   '.
106900     03  MNT1062 PIC X(11)   VALUE '0945806DS  '.
107000     03  MNT1063 PIC X(11)   VALUE '0946401C   '.
107100     03  MNT1064 PIC X(11)   VALUE '0946506DS  '.
107200     03  MNT1065 PIC X(11)   VALUE '0947101C   '.
107300     03  MNT1066 PIC X(11)   VALUE '0947206DS  '.
107400     03  MNT1067 PIC X(11)   VALUE '0947801C   '.
107500     03  MNT1068 PIC X(11)   VALUE '0947906DS  '.
107600     03  MNT1069 PIC X(11)   VALUE '0948501C   '.
107700     03  MNT1070 PIC X(11)   VALUE '0948606DS  '.
107800     03  MNT1071 PIC X(11)   VALUE '0949201C   '.
107900     03  MNT1072 PIC X(11)   VALUE '0894301CS  '.                 2012836
108000     03  MNT1073 PIC X(11)   VALUE '0894401CS  '.                 2012836
108100     03  MNT1074 PIC X(11)   VALUE '0393801C   '.
108200     03  MNT1075 PIC X(11)   VALUE '0083809P Y '.                 0817665
108300     03  MNT1076 PIC X(11)   VALUE '0249104CS  '.
108400     03  MNT1077 PIC X(11)   VALUE '0894502AS  '.
108500*    03  MNT1078 PIC X(11)   VALUE '0084801AS  '.
108510     03  MNT1078 PIC X(11)   VALUE '0084801CS  '.                 IMUP021
108600*    03  MNT1079 PIC X(11)   VALUE '0085801AS  '.
108610     03  MNT1079 PIC X(11)   VALUE '0085801CS  '.                 IMUP021
108700     03  MNT1080 PIC X(11)   VALUE '0177908P Y '.                 0817665
108800     03  MNT1081 PIC X(11)   VALUE '0704108P Y '.                 0817665
108900     03  MNT1082 PIC X(11)   VALUE '0672301P   '.                 9916070
109000     03  MNT1083 PIC X(11)   VALUE '0405306DS  '.
109100     03  MNT1084 PIC X(11)   VALUE '0436802P YC'.                 0817665
109200     03  MNT1085 PIC X(11)   VALUE '0567006CS  '.                 0266822
109300     03  MNT1086 PIC X(11)   VALUE '0143501CS N'.                 0527261
109400     03  MNT1087 PIC X(11)   VALUE '0672001C   '.
109500     03  MNT1088 PIC X(11)   VALUE '0672102P   '.
109600     03  MNT1089 PIC X(11)   VALUE '0879601C   '.
109700     03  MNT1090 PIC X(11)   VALUE '0879702P   '.
109800     03  MNT1091 PIC X(11)   VALUE '0060601C  C'.
109900     03  MNT1092 PIC X(11)   VALUE '0060702P   '.
110000     03  MNT1093 PIC X(11)   VALUE '          N'.
110100     03  MNT1094 PIC X(11)   VALUE '          N'.
110200     03  MNT1095 PIC X(11)   VALUE '0025901C   '.
110300     03  MNT1096 PIC X(11)   VALUE '0056101C   '.
110400     03  MNT1097 PIC X(11)   VALUE '0060901C   '.                 0437111
110500     03  MNT1098 PIC X(11)   VALUE '0118801CS  '.
110600     03  MNT1099 PIC X(11)   VALUE '0118901CS  '.
110700     03  MNT1100 PIC X(11)   VALUE '0144908NS  '.
110800     03  MNT1101 PIC X(11)   VALUE '0066601C   '.
110900     03  MNT1102 PIC X(11)   VALUE '0066701C  N'.
111000     03  MNT1103 PIC X(11)   VALUE '0487202P Y '.                 0817665
111100     03  MNT1104 PIC X(11)   VALUE '0487402P Y '.                 0817665
111200     03  MNT1105 PIC X(11)   VALUE '0018305C   '.
111300     03  MNT1106 PIC X(11)   VALUE '0018805C   '.
111400     03  MNT1107 PIC X(11)   VALUE '0075008NS  '.
111500     03  MNT1108 PIC X(11)   VALUE '0472402P Y '.                 0817665
111600     03  MNT1109 PIC X(11)   VALUE '0472602P Y '.                 0817665
111700     03  MNT1110 PIC X(11)   VALUE '0135508P  N'.                 0347045
111800     03  MNT1111 PIC X(11)   VALUE '          N'.
111900*    03  MNT1112 PIC X(11)   VALUE '0066802N   '.
111902     03  MNT1112 PIC X(11)   VALUE '0066802C  N'.                 IMIB004
112000     03  MNT1113 PIC X(11)   VALUE '0067002P Y '.                 0817665
112100     03  MNT1114 PIC X(11)   VALUE '          N'.
112200     03  MNT1115 PIC X(11)   VALUE '          N'.
112300     03  MNT1116 PIC X(11)   VALUE '          N'.
112400     03  MNT1117 PIC X(11)   VALUE '0866801CS  '.
112500     03  MNT1118 PIC X(11)   VALUE '0868301CS  '.
112600     03  MNT1119 PIC X(11)   VALUE '0869801CS  '.
112700     03  MNT1120 PIC X(11)   VALUE '0871301CS  '.
112800     03  MNT1121 PIC X(11)   VALUE '0872801CS  '.
112900     03  MNT1122 PIC X(11)   VALUE '0874301CS  '.
113000     03  MNT1123 PIC X(11)   VALUE '0866908P Y '.                 0817665
113100     03  MNT1124 PIC X(11)   VALUE '0868408P Y '.                 0817665
113200     03  MNT1125 PIC X(11)   VALUE '0869908P Y '.                 0817665
113300     03  MNT1126 PIC X(11)   VALUE '0871408P Y '.                 0817665
113400     03  MNT1127 PIC X(11)   VALUE '0872908P Y '.                 0817665
113500     03  MNT1128 PIC X(11)   VALUE '0874408P Y '.                 0817665
113600     03  MNT1129 PIC X(11)   VALUE '0859602P   '.
113700     03  MNT1130 PIC X(11)   VALUE '0860302P   '.
113800     03  MNT1131 PIC X(11)   VALUE '0861002P   '.
113900     03  MNT1132 PIC X(11)   VALUE '0861702P   '.
114000     03  MNT1133 PIC X(11)   VALUE '0862402P   '.
114100     03  MNT1134 PIC X(11)   VALUE '0863102P   '.
114200     03  MNT1135 PIC X(11)   VALUE '0859805P   '.
114300     03  MNT1136 PIC X(11)   VALUE '0860505P   '.
114400     03  MNT1137 PIC X(11)   VALUE '0861205P   '.
114500     03  MNT1138 PIC X(11)   VALUE '0861905P   '.
114600     03  MNT1139 PIC X(11)   VALUE '0862605P   '.
114700     03  MNT1140 PIC X(11)   VALUE '0863305P   '.
114800     03  MNT1141 PIC X(11)   VALUE '0878301C   '.
114900     03  MNT1142 PIC X(11)   VALUE '0878401C   '.
115000     03  MNT1143 PIC X(11)   VALUE '0878501C   '.
115100     03  MNT1144 PIC X(11)   VALUE '0878601C   '.
115200     03  MNT1145 PIC X(11)   VALUE '0878701C   '.
115300     03  MNT1146 PIC X(11)   VALUE '0878801C   '.
115400     03  MNT1147 PIC X(11)   VALUE '0848901CS  '.
115500     03  MNT1148 PIC X(11)   VALUE '0059508P  N'.
115600     03  MNT1149 PIC X(11)   VALUE '0297501C  N'.
115700     03  MNT1150 PIC X(11)   VALUE '0951008P  N'.
115800     03  MNT1151 PIC X(11)   VALUE '0951808P  N'.
115900     03  MNT1152 PIC X(11)   VALUE '0867706DS  '.
116000     03  MNT1153 PIC X(11)   VALUE '0869206DS  '.
116100     03  MNT1154 PIC X(11)   VALUE '0870706DS  '.
116200     03  MNT1155 PIC X(11)   VALUE '0872206DS  '.
116300     03  MNT1156 PIC X(11)   VALUE '0873706DS  '.
116400     03  MNT1157 PIC X(11)   VALUE '0875206DS  '.
116500     03  MNT1158 PIC X(11)   VALUE '0210301C  N'.
116600     03  MNT1159 PIC X(11)   VALUE '0210401C   '.
116700     03  MNT1160 PIC X(11)   VALUE '0172409P YC'.                 0817665
116800     03  MNT1161 PIC X(11)   VALUE '0173302P YC'.                 0817665
116900     03  MNT1162 PIC X(11)   VALUE '0173508P YC'.                 0817665
117000     03  MNT1163 PIC X(11)   VALUE '0174309P YC'.                 0817665
117100     03  MNT1164 PIC X(11)   VALUE '0175208P YC'.                 0817665
117200     03  MNT1165 PIC X(11)   VALUE '0176002P YC'.                 0817665
117300     03  MNT1166 PIC X(11)   VALUE '0176208P YC'.                 0817665
117400     03  MNT1167 PIC X(11)   VALUE '0177006D  C'.
117500     03  MNT1168 PIC X(11)   VALUE '0177801C  C'.
117600     03  MNT1169 PIC X(11)   VALUE '0703009P YC'.                 0817665
117700     03  MNT1170 PIC X(11)   VALUE '0703902P YC'.                 0817665
117800     03  MNT1171 PIC X(11)   VALUE '0717108P YC'.                 0817665
117900     03  MNT1172 PIC X(11)   VALUE '0717909P YC'.                 0817665
118000     03  MNT1173 PIC X(11)   VALUE '0718808P YC'.                 0817665
118100     03  MNT1174 PIC X(11)   VALUE '0719608P YC'.                 0817665
118200     03  MNT1175 PIC X(11)   VALUE '0026001C  C'.
118300     03  MNT1176 PIC X(11)   VALUE '0297801C  N'.
118400     03  MNT1177 PIC X(11)   VALUE '0693201C  N'.                 9916070
118500     03  MNT1178 PIC X(11)   VALUE '0693303CS  '.                 9916070
118600     03  MNT1179 PIC X(11)   VALUE '0693605P   '.                 9916070
118700     03  MNT1180 PIC X(11)   VALUE '0971409P Y '.                 0817665
118800     03  MNT1181 PIC X(11)   VALUE '0972309P  N'.
118900     03  MNT1182 PIC X(11)   VALUE '0973208P Y '.                 0817665
119000     03  MNT1183 PIC X(11)   VALUE '0974008P Y '.                 0817665
119100     03  MNT1184 PIC X(11)   VALUE '0974808P Y '.                 0817665
119200     03  MNT1185 PIC X(11)   VALUE '0975608P Y '.                 0817665
119300     03  MNT1186 PIC X(11)   VALUE '0976408P Y '.                 0817665
119400     03  MNT1187 PIC X(11)   VALUE '0977208P Y '.                 0817665
119500     03  MNT1188 PIC X(11)   VALUE '0694101C  I'.                 9916070
119600     03  MNT1189 PIC X(11)   VALUE '0473808DS C'.
119700     03  MNT1190 PIC X(11)   VALUE '0474608P YC'.                 0817665
119800     03  MNT1191 PIC X(11)   VALUE '0475401C  C'.
119900     03  MNT1192 PIC X(11)   VALUE '0475508DS C'.
120000     03  MNT1193 PIC X(11)   VALUE '0476308P YC'.                 0817665
120100     03  MNT1194 PIC X(11)   VALUE '0477101C  C'.
120200     03  MNT1195 PIC X(11)   VALUE '0477208DS C'.
120300     03  MNT1196 PIC X(11)   VALUE '0478008P YC'.                 0817665
120400     03  MNT1197 PIC X(11)   VALUE '0478801C  C'.
120500     03  MNT1198 PIC X(11)   VALUE '0478908DS C'.
120600     03  MNT1199 PIC X(11)   VALUE '0479708P YC'.                 0817665
120700     03  MNT1200 PIC X(11)   VALUE '0480501C  C'.
120800     03  MNT1201 PIC X(11)   VALUE '0480608DS C'.
120900     03  MNT1202 PIC X(11)   VALUE '0481408P YC'.                 0817665
121000     03  MNT1203 PIC X(11)   VALUE '0482201C  C'.
121100     03  MNT1204 PIC X(11)   VALUE '0482308DS C'.
121200     03  MNT1205 PIC X(11)   VALUE '0483108P YC'.                 0817665
121300     03  MNT1206 PIC X(11)   VALUE '0483901C  C'.
121400     03  MNT1207 PIC X(11)   VALUE '0484008DS C'.
121500     03  MNT1208 PIC X(11)   VALUE '0484808P YC'.                 0817665
121600     03  MNT1209 PIC X(11)   VALUE '0485601C  C'.
121700     03  MNT1210 PIC X(11)   VALUE '0096602C  N'.
121800     03  MNT1211 PIC X(11)   VALUE '0028110C  N'.
121900     03  MNT1212 PIC X(11)   VALUE '0029110C  N'.
122000     03  MNT1213 PIC X(11)   VALUE '0052308P Y '.                 0817665
122100     03  MNT1214 PIC X(11)   VALUE '0522203N   '.
122200     03  MNT1215 PIC X(11)   VALUE '0522501N   '.
122300     03  MNT1216 PIC X(11)   VALUE '0522601N   '.
122400     03  MNT1217 PIC X(11)   VALUE '0522708P Y '.                 0817665
122500     03  MNT1218 PIC X(11)   VALUE '0523508P Y '.                 0817665
122600     03  MNT1219 PIC X(11)   VALUE '0524308P Y '.                 0817665
122700     03  MNT1220 PIC X(11)   VALUE '0297901C  N'.
122800     03  MNT1221 PIC X(11)   VALUE '0983401C  N'.
122900     03  MNT1222 PIC X(11)   VALUE '0983501C  N'.
123000     03  MNT1223 PIC X(11)   VALUE '0983601C  N'.
123100     03  MNT1224 PIC X(11)   VALUE '0983701C  N'.
123200     03  MNT1225 PIC X(11)   VALUE '0984101C  N'.                 2012254
123300     03  MNT1226 PIC X(11)   VALUE '0984208C  N'.                 2012254
123400     03  MNT1227 PIC X(11)   VALUE '0985005P  N'.                 0927875
123500     03  MNT1228 PIC X(11)   VALUE '0985508P  N'.                 2012254
123600     03  MNT1229 PIC X(11)   VALUE '0986308C  N'.                 2012254
123700     03  MNT1230 PIC X(11)   VALUE '0987105P  N'.                 2012254
123800     03  MNT1231 PIC X(11)   VALUE '0987608P  N'.                 2012254
123900     03  MNT1232 PIC X(11)   VALUE '0984101C  N'.                 2012254
124000     03  MNT1233 PIC X(11)   VALUE '0984208C  N'.                 2012254
124100     03  MNT1234 PIC X(11)   VALUE '0985005P  N'.                 2012254
124200     03  MNT1235 PIC X(11)   VALUE '0985508P  N'.                 2012254
124300     03  MNT1236 PIC X(11)   VALUE '0996708P  N'.                 0927875
124400     03  MNT1237 PIC X(11)   VALUE '1003108C  N'.                 2012254
124500     03  MNT1238 PIC X(11)   VALUE '1003905P  N'.                 2012254
124600     03  MNT1239 PIC X(11)   VALUE '1004408P  N'.                 2012254
124700     03  MNT1240 PIC X(11)   VALUE '1005208C  N'.                 2012254
124800     03  MNT1241 PIC X(11)   VALUE '1006005P  N'.                 2012254
124900     03  MNT1242 PIC X(11)   VALUE '1006508P  N'.                 2012254
125000     03  MNT1243 PIC X(11)   VALUE '1017708P  N'.                 2012254
125100     03  MNT1244 PIC X(11)   VALUE '1024108C  N'.                 2012254
125200     03  MNT1245 PIC X(11)   VALUE '1024905P  N'.                 2012254
125300     03  MNT1246 PIC X(11)   VALUE '1025408P  N'.                 2012254
125400     03  MNT1247 PIC X(11)   VALUE '1026201C  N'.                 2012254
125500     03  MNT1248 PIC X(11)   VALUE '1026308C  N'.                 2012254
125600     03  MNT1249 PIC X(11)   VALUE '1027105P  N'.                 2012254
125700     03  MNT1250 PIC X(11)   VALUE '1027608P  N'.                 2012254
125800     03  MNT1251 PIC X(11)   VALUE '1028408C  N'.                 2012254
125900     03  MNT1252 PIC X(11)   VALUE '1029205P  N'.                 2012254
126000     03  MNT1253 PIC X(11)   VALUE '1029708P  N'.                 2012254
126100     03  MNT1254 PIC X(11)   VALUE '1030501C  N'.                 2012254
126200     03  MNT1255 PIC X(11)   VALUE '1030608C  N'.                 2012254
126300     03  MNT1256 PIC X(11)   VALUE '1031405P  N'.                 2012254
126400     03  MNT1257 PIC X(11)   VALUE '1031908P  N'.                 2012254
126500     03  MNT1258 PIC X(11)   VALUE '1049508C  N'.                 2012254
126600     03  MNT1259 PIC X(11)   VALUE '1050305P  N'.                 2012254
126700     03  MNT1260 PIC X(11)   VALUE '1050808P  N'.                 2012254
126800     03  MNT1261 PIC X(11)   VALUE '1051608C  N'.                 2012254
126900     03  MNT1262 PIC X(11)   VALUE '1052405P  N'.                 2012254
127000     03  MNT1263 PIC X(11)   VALUE '1052908P  N'.                 2012254
127100     03  MNT1264 PIC X(11)   VALUE '1070508P  N'.                 2012254
127200     03  MNT1265 PIC X(11)   VALUE '1071305P  N'.                 2012254
127300     03  MNT1266 PIC X(11)   VALUE '1071808P  N'.                 2012254
127400     03  MNT1267 PIC X(11)   VALUE '1072601C  N'.                 2012254
127500     03  MNT1268 PIC X(11)   VALUE '1072708C  N'.                 2012254
127600     03  MNT1269 PIC X(11)   VALUE '1073505P  N'.                 2012254
127700     03  MNT1270 PIC X(11)   VALUE '1074008P  N'.                 2012254
127800     03  MNT1271 PIC X(11)   VALUE '1074801C  N'.                 2012254
127900     03  MNT1272 PIC X(11)   VALUE '1074901C  N'.                 2012254
128000     03  MNT1273 PIC X(11)   VALUE '1075005P  N'.                 2012254
128100     03  MNT1274 PIC X(11)   VALUE '1077508P  N'.                 2012254
128200     03  MNT1275 PIC X(11)   VALUE '1080708C  N'.                 2012254
128300     03  MNT1276 PIC X(11)   VALUE '1081505P  N'.                 2012254
128400     03  MNT1277 PIC X(11)   VALUE '1082008P  N'.                 2012254
128500     03  MNT1278 PIC X(11)   VALUE '1082801C  N'.                 2012254
128600     03  MNT1279 PIC X(11)   VALUE '1082901C  N'.                 2012254
128700     03  MNT1280 PIC X(11)   VALUE '1083005P  N'.                 2012254
128800     03  MNT1281 PIC X(11)   VALUE '1085508P  N'.                 2012254
128900     03  MNT1282 PIC X(11)   VALUE '1072601C  N'.                 2012254
129000     03  MNT1283 PIC X(11)   VALUE '1072708C  N'.                 2012254
129100     03  MNT1284 PIC X(11)   VALUE '1073505P  N'.                 2012254
129200     03  MNT1285 PIC X(11)   VALUE '1074008P  N'.                 2012254
129300     03  MNT1286 PIC X(11)   VALUE '1077408P  N'.                 2012254
129400     03  MNT1287 PIC X(11)   VALUE '1079008C  N'.                 2012254
129500     03  MNT1288 PIC X(11)   VALUE '1079805P  N'.                 2012254
129600     03  MNT1289 PIC X(11)   VALUE '1080308P  N'.                 2012254
129700     03  MNT1290 PIC X(11)   VALUE '1083708P  N'.                 2012254
129800     03  MNT1291 PIC X(11)   VALUE '1072601C  N'.                 2012254
129900     03  MNT1292 PIC X(11)   VALUE '1072708C  N'.                 2012254
130000     03  MNT1293 PIC X(11)   VALUE '1073505P  N'.                 2012254
130100     03  MNT1294 PIC X(11)   VALUE '1074008P  N'.                 2012254
130200     03  MNT1295 PIC X(11)   VALUE '1074808C  N'.                 2012254
130300     03  MNT1296 PIC X(11)   VALUE '1075605P  N'.                 2012254
130400     03  MNT1297 PIC X(11)   VALUE '1076108P  N'.                 2012254
130500     03  MNT1298 PIC X(11)   VALUE '1088701C  N'.                 2012254
130600     03  MNT1299 PIC X(11)   VALUE '1088808C  N'.                 2012254
130700     03  MNT1300 PIC X(11)   VALUE '1089605P  N'.                 2012254
130800     03  MNT1301 PIC X(11)   VALUE '1090108P  N'.                 2012254
130900     03  MNT1302 PIC X(11)   VALUE '1093508P  N'.                 2012254
131000     03  MNT1303 PIC X(11)   VALUE '1095108C  N'.                 2012254
131100     03  MNT1304 PIC X(11)   VALUE '1095905P  N'.                 2012254
131200     03  MNT1305 PIC X(11)   VALUE '1096408P  N'.                 2012254
131300     03  MNT1306 PIC X(11)   VALUE '1099808P  N'.                 2012254
131400     03  MNT1307 PIC X(11)   VALUE '1088701C  N'.                 2012254
131500     03  MNT1308 PIC X(11)   VALUE '1088808C  N'.                 2012254
131600     03  MNT1309 PIC X(11)   VALUE '1089605P  N'.                 2012254
131700     03  MNT1310 PIC X(11)   VALUE '1090108P  N'.                 2012254
131800     03  MNT1311 PIC X(11)   VALUE '1090908C  N'.                 2012254
131900     03  MNT1312 PIC X(11)   VALUE '1091705P  N'.                 2012254
132000     03  MNT1313 PIC X(11)   VALUE '1092208P  N'.                 2012254
132100     03  MNT1314 PIC X(11)   VALUE '0031101C  N'.
132200     03  MNT1315 PIC X(11)   VALUE '0032003C  I'.
132300     03  MNT1316 PIC X(11)   VALUE '0042501C  N'.
132400     03  MNT1317 PIC X(11)   VALUE '0702901C  N'.                 9916070
132500     03  MNT1318 PIC X(11)   VALUE '0720606DS  '.                 9916070
132600     03  MNT1319 PIC X(11)   VALUE '          N'.
132700     03  MNT1320 PIC X(11)   VALUE '          N'.
132800     03  MNT1321 PIC X(11)   VALUE '0720402P Y '.                 0817665
132900     03  MNT1322 PIC X(11)   VALUE '0171608P YC'.                 0817665
133000     03  MNT1323 PIC X(11)   VALUE '0721408P YC'.                 0817665
133100     03  MNT1324 PIC X(11)   VALUE '0204308P YC'.                 0817665
133200*    03  MNT1325 PIC X(11)   VALUE '0529108P YC'.                 0817665
133202     03  MNT1325 PIC X(11)   VALUE '0528308P YC'.                 ~~~0207
133300     03  MNT1326 PIC X(11)   VALUE '0722208P YC'.                 0817665
133400     03  MNT1327 PIC X(11)   VALUE '0879908P YC'.                 0817665
133410     03  MNT1328 PIC X(11)   VALUE '0249501C   '.                 0266778
133420     03  MNT1329 PIC X(11)   VALUE '0249608P Y '.                 0817665
133500     03  MNT1330-1344                                             0266778
133600                 PIC X(165)  VALUE SPACES.                        0266778
133700     03  MNT1345 PIC X(11)   VALUE '0255303CS  '.
133800     03  MNT1346 PIC X(11)   VALUE '0255703CS  '.
133900     03  MNT1347 PIC X(11)   VALUE '0256103CS  '.
134000     03  MNT1348 PIC X(11)   VALUE '0256503CS  '.
134100     03  MNT1349 PIC X(11)   VALUE '0256903CS  '.
134200     03  MNT1350 PIC X(11)   VALUE '0285005CS  '.
134300     03  MNT1351 PIC X(11)   VALUE '0285605CS  '.
134400     03  MNT1352 PIC X(11)   VALUE '0286206DS C'.
134500     03  MNT1353 PIC X(11)   VALUE '0286806NS  '.
134600     03  MNT1354 PIC X(11)   VALUE '0287401C   '.
134700     03  MNT1355 PIC X(11)   VALUE '0287501C   '.
134800     03  MNT1356 PIC X(11)   VALUE '0287601CS  '.
134900     03  MNT1357 PIC X(11)   VALUE '0287740CS  '.
135000     03  MNT1358 PIC X(11)   VALUE '0250501C   '.
135100     03  MNT1359 PIC X(11)   VALUE '0250601C   '.
135200     03  MNT1360 PIC X(11)   VALUE '0250701C   '.
135300     03  MNT1361 PIC X(11)   VALUE '0250801C   '.
135400     03  MNT1362 PIC X(11)   VALUE '0250901C   '.
135500     03  MNT1363 PIC X(11)   VALUE '0251001C   '.
135600     03  MNT1364 PIC X(11)   VALUE '0251101C   '.
135700     03  MNT1365 PIC X(11)   VALUE '0251201C   '.
135800     03  MNT1366 PIC X(11)   VALUE '0251301C   '.
135900     03  MNT1367 PIC X(11)   VALUE '0195208P  N'.
136000     03  MNT1368 PIC X(11)   VALUE '0251401C   '.
136100     03  MNT1369 PIC X(11)   VALUE '0251501C   '.
136200     03  MNT1370 PIC X(11)   VALUE '0251601C   '.
136300     03  MNT1371 PIC X(11)   VALUE '0251701C   '.
136400     03  MNT1372 PIC X(11)   VALUE '0251801C  N'.
136500     03  MNT1373 PIC X(11)   VALUE '0251901C  N'.
136600     03  MNT1374 PIC X(11)   VALUE '0292201C  C'.                 2016148
136700     03  MNT1375 PIC X(11)   VALUE '0292306DS C'.
136800     03  MNT1376 PIC X(11)   VALUE '0292906DS C'.
136900     03  MNT1377 PIC X(11)   VALUE '0293506DS C'.
137000     03  MNT1378 PIC X(11)   VALUE '0294106DS C'.
137100     03  MNT1379 PIC X(11)   VALUE '0294702P   '.
137200     03  MNT1380 PIC X(11)   VALUE '0280240C   '.                 2010403
137300     03  MNT1381 PIC X(11)   VALUE '0284208P  N'.
137400     03  MNT1382 PIC X(11)   VALUE '0180609P Y '.                 0817665
137500     03  MNT1383 PIC X(11)   VALUE '0183509P Y '.                 0817665
137600     03  MNT1384 PIC X(11)   VALUE '0027701N  C'.                 0817657
137700     03  MNT1385 PIC X(11)   VALUE '0027801N  C'.                 0817657
137800     03  MNT1386 PIC X(11)   VALUE '0027901CS  '.                 0817662
137900     03  MNT1387 PIC X(11)   VALUE '0031208P Y '.                 0817665
138000*    03  MNT1388 PIC X(11)   VALUE '0264901CS  '.
138002     03  MNT1388 PIC X(11)   VALUE '0264901C   '.                 ~~~0169
138100     03  MNT1389 PIC X(11)   VALUE '0264801C   '.
138200     03  MNT1390 PIC X(11)   VALUE '          N'.
138300     03  MNT1391 PIC X(11)   VALUE '0168008P YC'.                 0817665
138400     03  MNT1392 PIC X(11)   VALUE '0168808P YC'.                 0817665
138500     03  MNT1393 PIC X(11)   VALUE '0119008P YC'.                 0817665
138600     03  MNT1394 PIC X(11)   VALUE '0143301N   '.
138700     03  MNT1395 PIC X(11)   VALUE '0143201CS  '.
138800     03  MNT1396 PIC X(11)   VALUE '0196008P  N'.
138900     03  MNT1397 PIC X(11)   VALUE '0142903CS  '.
139000     03  MNT1398 PIC X(11)   VALUE '0269801C   '.
139100     03  MNT1399 PIC X(11)   VALUE '0274006DS  '.
139200     03  MNT1400 PIC X(11)   VALUE '0265701C  C'.
139300     03  MNT1401 PIC X(11)   VALUE '0252008DS C'.
139400     03  MNT1402 PIC X(11)   VALUE '0252803CS  '.
139500     03  MNT1403 PIC X(11)   VALUE '0253108DS C'.
139600     03  MNT1404 PIC X(11)   VALUE '0253902CS  '.
139700     03  MNT1405 PIC X(11)   VALUE '0254208DS C'.
139800     03  MNT1406 PIC X(11)   VALUE '0255002CS  '.
139900     03  MNT1407 PIC X(11)   VALUE '0255201CS  '.
140000     03  MNT1408 PIC X(11)   VALUE '0255601CS  '.
140100     03  MNT1409 PIC X(11)   VALUE '0256001CS  '.
140200     03  MNT1410 PIC X(11)   VALUE '0256401CS  '.
140300     03  MNT1411 PIC X(11)   VALUE '0256801CS  '.
140400     03  MNT1412 PIC X(11)   VALUE '0257208DS C'.
140500     03  MNT1413 PIC X(11)   VALUE '0258001C   '.
140600     03  MNT1414 PIC X(11)   VALUE '0258108P  N'.
140700     03  MNT1415 PIC X(11)   VALUE '0258908P  N'.
140800     03  MNT1416 PIC X(11)   VALUE '0259708P  N'.
140900     03  MNT1417 PIC X(11)   VALUE '0260508P  N'.
141000     03  MNT1418 PIC X(11)   VALUE '0261308P  N'.
141100     03  MNT1419 PIC X(11)   VALUE '0262108P  N'.
141200     03  MNT1420 PIC X(11)   VALUE '0262901C  C'.
141300     03  MNT1421 PIC X(11)   VALUE '0263002P Y '.                 0817665
141400     03  MNT1422 PIC X(11)   VALUE '0263202P Y '.                 0817665
141500     03  MNT1423 PIC X(11)   VALUE '0263406DS  '.
141600     03  MNT1424 PIC X(11)   VALUE '0264201C   '.
141700     03  MNT1425 PIC X(11)   VALUE '0264302CS C'.
141800     03  MNT1426 PIC X(11)   VALUE '0264503CS  '.
141900     03  MNT1427 PIC X(11)   VALUE '0265101CS  '.
142000     03  MNT1428 PIC X(11)   VALUE '0265202N   '.
142100     03  MNT1429 PIC X(11)   VALUE '0265401C  N'.
142200     03  MNT1430 PIC X(11)   VALUE '0265801CS C'.
142300     03  MNT1431 PIC X(11)   VALUE '0265905P  C'.
142400     03  MNT1432 PIC X(11)   VALUE '0266401C  C'.
142500     03  MNT1433 PIC X(11)   VALUE '0266505P  C'.
142600     03  MNT1434 PIC X(11)   VALUE '0267009CS  '.
142700     03  MNT1435 PIC X(11)   VALUE '0267903P Y '.                 0817665
142800     03  MNT1436 PIC X(11)   VALUE '0268208P YC'.                 0817665
142900     03  MNT1437 PIC X(11)   VALUE '0269008P Y '.                 0817665
143000     03  MNT1438 PIC X(11)   VALUE '0269901CS  '.
143100     03  MNT1439 PIC X(11)   VALUE '0270002P Y '.                 0817665
143200     03  MNT1440 PIC X(11)   VALUE '0270208P  N'.
143300     03  MNT1441 PIC X(11)   VALUE '0271008P  N'.
143400     03  MNT1442 PIC X(11)   VALUE '0271804CS  '.
143500     03  MNT1443 PIC X(11)   VALUE '0271902P Y '.                 0817665
143600     03  MNT1444 PIC X(11)   VALUE '0272101CS  '.
143700     03  MNT1445 PIC X(11)   VALUE '0272206DS  '.
143800     03  MNT1446 PIC X(11)   VALUE '0272806DS C'.
143900     03  MNT1447 PIC X(11)   VALUE '0273406DS  '.
144000     03  MNT1448 PIC X(11)   VALUE '0275408P  N'.
144100     03  MNT1449 PIC X(11)   VALUE '0276205P  C'.
144200     03  MNT1450 PIC X(11)   VALUE '0276708P  N'.
144300     03  MNT1451 PIC X(11)   VALUE '0277508P Y '.                 0817665
144400     03  MNT1452 PIC X(11)   VALUE '0525108P Y '.                 0817665
144500     03  MNT1453 PIC X(11)   VALUE '0525908P Y '.                 0817665
144600     03  MNT1454 PIC X(11)   VALUE '0526708P Y '.                 0817665
144700     03  MNT1455 PIC X(11)   VALUE '0527508P Y '.                 0817665
144800     03  MNT1456 PIC X(11)   VALUE '0663102P Y '.                 0817665
144900     03  MNT1457 PIC X(11)   VALUE '0663302P Y '.                 0817665
145000     03  MNT1458 PIC X(11)   VALUE '0663502P Y '.                 0817665
145100     03  MNT1459 PIC X(11)   VALUE '0663702P Y '.                 0817665
145200     03  MNT1460 PIC X(11)   VALUE '0663902P Y '.                 0817665
145300     03  MNT1461 PIC X(11)   VALUE '0664102P Y '.                 0817665
145400     03  MNT1462 PIC X(11)   VALUE '0664302P Y '.                 0817665
145500     03  MNT1463 PIC X(11)   VALUE '0664502P Y '.                 0817665
145600     03  MNT1464 PIC X(11)   VALUE '0664702P Y '.                 0817665
145700     03  MNT1465 PIC X(11)   VALUE '0664902P Y '.                 0817665
145800     03  MNT1466 PIC X(11)   VALUE '0665102P Y '.                 0817665
145900     03  MNT1467 PIC X(11)   VALUE '0665302P Y '.                 0817665
146000     03  MNT1468 PIC X(11)   VALUE '0143401C  N'.
146100     03  MNT1469 PIC X(11)   VALUE '0820610C   '.
146200     03  MNT1470 PIC X(11)   VALUE '0819101C   '.
146300     03  MNT1471 PIC X(11)   VALUE '0077708NS  '.                 0837840
146400     03  MNT1472 PIC X(11)   VALUE '0819601C   '.
146500     03  MNT1473 PIC X(11)   VALUE '0821606C   '.
146600     03  MNT1474 PIC X(11)   VALUE '0819201C   '.
146700     03  MNT1475 PIC X(11)   VALUE '0819301C   '.
146800     03  MNT1476 PIC X(11)   VALUE '0819401CS  '.
146900     03  MNT1477 PIC X(11)   VALUE '0819501C   '.
147000     03  MNT1478 PIC X(11)   VALUE '0822222C   '.
147100     03  MNT1479 PIC X(11)   VALUE '          N'.
147200     03  MNT1480 PIC X(11)   VALUE '0067206P Y '.                 0827728
147300     03  MNT1481 PIC X(11)   VALUE '0035206P Y '.                 0827727
147400     03  MNT1482 PIC X(11)   VALUE '0005830CS  '.                 0827767
147500     03  MNT1483 PIC X(11)   VALUE '          N'.
147600     03  MNT1484 PIC X(11)   VALUE '          N'.
147700     03  MNT1485 PIC X(11)   VALUE '          N'.
147800     03  MNT1486 PIC X(11)   VALUE '          N'.
147900     03  MNT1487 PIC X(11)   VALUE '          N'.
148000     03  MNT1488 PIC X(11)   VALUE '          N'.
148100     03  MNT1489 PIC X(11)   VALUE '          N'.
148200     03  MNT1490 PIC X(11)   VALUE '          N'.
148300     03  MNT1491 PIC X(11)   VALUE '          N'.
148400     03  MNT1492 PIC X(11)   VALUE '          N'.
148500     03  MNT1493 PIC X(11)   VALUE '          N'.
148600     03  MNT1494 PIC X(11)   VALUE '0316801C  N'.
148700     03  MNT1495 PIC X(11)   VALUE '0316901C  N'.
148800     03  MNT1496 PIC X(11)   VALUE '0317040C  N'.
148900     03  MNT1497 PIC X(11)   VALUE '0254101C   '.
149000     03  MNT1498 PIC X(11)   VALUE '0265501C  N'.
149100     03  MNT1499 PIC X(11)   VALUE '0581603CS N'.
149200     03  MNT1500 PIC X(11)   VALUE '0265601CS  '.
149300     03  MNT1501 PIC X(11)   VALUE '1179301C   '.                 2012254
149400     03  MNT1502 PIC X(11)   VALUE '1179408P Y '.                 0817665
149500     03  MNT1503 PIC X(11)   VALUE '1180201C   '.                 2012254
149600     03  MNT1504 PIC X(11)   VALUE '1180308P Y '.                 0817665
149700     03  MNT1505 PIC X(11)   VALUE '1181101C   '.                 2012254
149800     03  MNT1506 PIC X(11)   VALUE '1181208P Y '.                 0817665
149900     03  MNT1507 PIC X(11)   VALUE '1182001C   '.                 2012254
150000     03  MNT1508 PIC X(11)   VALUE '1182108P Y '.                 0817665
150100     03  MNT1509 PIC X(11)   VALUE '1182901C   '.                 2012254
150200     03  MNT1510 PIC X(11)   VALUE '1183008P Y '.                 0817665
150300     03  MNT1511 PIC X(11)   VALUE '1183801C   '.                 2012254
150400     03  MNT1512 PIC X(11)   VALUE '1183908P Y '.                 0817665
150500     03  MNT1513 PIC X(11)   VALUE '1184701C   '.                 2012254
150600     03  MNT1514 PIC X(11)   VALUE '1184808P Y '.                 0817665
150700     03  MNT1515 PIC X(11)   VALUE '1185601C   '.                 2012254
150800     03  MNT1516 PIC X(11)   VALUE '1185708P Y '.                 0817665
150900     03  MNT1517 PIC X(11)   VALUE '1186501C   '.                 2012254
151000     03  MNT1518 PIC X(11)   VALUE '1186608P Y '.                 0817665
151100     03  MNT1519 PIC X(11)   VALUE '1187401C   '.                 2012254
151200     03  MNT1520 PIC X(11)   VALUE '1187508P Y '.                 0817665
151300     03  MNT1521 PIC X(11)   VALUE '1188301C   '.                 2012254
151400     03  MNT1522 PIC X(11)   VALUE '1188408P Y '.                 0817665
151500     03  MNT1523 PIC X(11)   VALUE '1189201C   '.                 2012254
151600     03  MNT1524 PIC X(11)   VALUE '1189308P Y '.                 0817665
151700     03  MNT1525 PIC X(11)   VALUE '1190101C   '.                 2012254
151800     03  MNT1526 PIC X(11)   VALUE '1190208P Y '.                 0817665
151900     03  MNT1527 PIC X(11)   VALUE '1191001C   '.                 2012254
152000     03  MNT1528 PIC X(11)   VALUE '1191108P Y '.                 0817665
152100     03  MNT1529 PIC X(11)   VALUE '1191901C   '.                 2012254
152200     03  MNT1530 PIC X(11)   VALUE '1192008P Y '.                 0817665
152300     03  MNT1531 PIC X(11)   VALUE '1192801C   '.                 2012254
152400     03  MNT1532 PIC X(11)   VALUE '1192908P Y '.                 0817665
152500     03  MNT1533 PIC X(11)   VALUE '1193701C   '.                 2012254
152600     03  MNT1534 PIC X(11)   VALUE '1193808P Y '.                 0817665
152700     03  MNT1535 PIC X(11)   VALUE '1194601C   '.                 2012254
152800     03  MNT1536 PIC X(11)   VALUE '1194708P Y '.                 0817665
152900     03  MNT1537 PIC X(11)   VALUE '1195501C   '.                 2012254
153000     03  MNT1538 PIC X(11)   VALUE '1195608P Y '.                 0817665
153100     03  MNT1539 PIC X(11)   VALUE '1196401C   '.                 2012254
153200     03  MNT1540 PIC X(11)   VALUE '1196508P Y '.                 0817665
153300     03  MNT1541 PIC X(11)   VALUE '1197301C   '.                 2012254
153400     03  MNT1542 PIC X(11)   VALUE '1197408P Y '.                 0817665
153500     03  MNT1543 PIC X(11)   VALUE '1198201C   '.                 2012254
153600     03  MNT1544 PIC X(11)   VALUE '1198308P Y '.                 0817665
153700     03  MNT1545 PIC X(11)   VALUE '1199101C   '.                 2012254
153800     03  MNT1546 PIC X(11)   VALUE '1199208P Y '.                 0817665
153900     03  MNT1547 PIC X(11)   VALUE '1200001C   '.                 2012254
154000     03  MNT1548 PIC X(11)   VALUE '1200108P Y '.                 0817665
154100     03  MNT1549 PIC X(11)   VALUE '1200901C   '.                 2012254
154200     03  MNT1550 PIC X(11)   VALUE '1201008P Y '.                 0817665
154300     03  MNT1551 PIC X(11)   VALUE '1201801C   '.                 2012254
154400     03  MNT1552 PIC X(11)   VALUE '1201908P Y '.                 0817665
154500     03  MNT1553 PIC X(11)   VALUE '1202701C   '.                 2012254
154600     03  MNT1554 PIC X(11)   VALUE '1202808P Y '.                 0817665
154700     03  MNT1555 PIC X(11)   VALUE '1203601C   '.                 2012254
154800     03  MNT1556 PIC X(11)   VALUE '1203708P Y '.                 0817665
154900     03  MNT1557 PIC X(11)   VALUE '1204501C   '.                 2012254
155000     03  MNT1558 PIC X(11)   VALUE '1204608P Y '.                 0817665
155100     03  MNT1559 PIC X(11)   VALUE '1205401C   '.                 2012254
155200     03  MNT1560 PIC X(11)   VALUE '1205508P Y '.                 0817665
155300     03  MNT1561 PIC X(11)   VALUE '1206301C   '.                 2012254
155400     03  MNT1562 PIC X(11)   VALUE '1206408P Y '.                 0817665
155500     03  MNT1563 PIC X(11)   VALUE '1207201C   '.                 2012254
155600     03  MNT1564 PIC X(11)   VALUE '1207308P Y '.                 0817665
155700     03  MNT1565 PIC X(11)   VALUE '1208101C   '.                 2012254
155800     03  MNT1566 PIC X(11)   VALUE '1208208P Y '.                 0817665
155900     03  MNT1567 PIC X(11)   VALUE '1209001C   '.                 2012254
156000     03  MNT1568 PIC X(11)   VALUE '1209108P Y '.                 0817665
156100     03  MNT1569 PIC X(11)   VALUE '1209901C   '.                 2012254
156200     03  MNT1570 PIC X(11)   VALUE '1210008P Y '.                 0817665
156300     03  MNT1571 PIC X(11)   VALUE '1210801C   '.                 2012254
156400     03  MNT1572 PIC X(11)   VALUE '1210908P Y '.                 0817665
156500     03  MNT1573 PIC X(11)   VALUE '1211701C   '.                 2012254
156600     03  MNT1574 PIC X(11)   VALUE '1211808P Y '.                 0817665
156700     03  MNT1575 PIC X(11)   VALUE '1212601C   '.                 2012254
156800     03  MNT1576 PIC X(11)   VALUE '1212708P Y '.                 0817665
156900     03  MNT1577 PIC X(11)   VALUE '1213501C   '.                 2012254
157000     03  MNT1578 PIC X(11)   VALUE '1213608P Y '.                 0817665
157100     03  MNT1579 PIC X(11)   VALUE '1214401C   '.                 2012254
157200     03  MNT1580 PIC X(11)   VALUE '1214508P Y '.                 0817665
157300     03  MNT1581 PIC X(11)   VALUE '1215301C   '.                 2012254
157400     03  MNT1582 PIC X(11)   VALUE '1215408P Y '.                 0817665
157500     03  MNT1583 PIC X(11)   VALUE '1216201C   '.                 2012254
157600     03  MNT1584 PIC X(11)   VALUE '1216308P Y '.                 0817665
157700     03  MNT1585 PIC X(11)   VALUE '1217101C   '.                 2012254
157800     03  MNT1586 PIC X(11)   VALUE '1217208P Y '.                 0817665
157900     03  MNT1587 PIC X(11)   VALUE '1218001C   '.                 2012254
158000     03  MNT1588 PIC X(11)   VALUE '1218108P Y '.                 0817665
158100     03  MNT1589 PIC X(11)   VALUE '1218901C   '.                 2012254
158200     03  MNT1590 PIC X(11)   VALUE '1219008P Y '.                 0817665
158300     03  MNT1591 PIC X(11)   VALUE '1219801C   '.                 2012254
158400     03  MNT1592 PIC X(11)   VALUE '1219908P Y '.                 0817665
158500     03  MNT1593 PIC X(11)   VALUE '1220701C   '.                 2012254
158600     03  MNT1594 PIC X(11)   VALUE '1220808P Y '.                 0817665
158700     03  MNT1595 PIC X(11)   VALUE '1221601C   '.                 2012254
158800     03  MNT1596 PIC X(11)   VALUE '1221708P Y '.                 0817665
158900     03  MNT1597 PIC X(11)   VALUE '1222501C   '.                 2012254
159000     03  MNT1598 PIC X(11)   VALUE '1222608P Y '.                 0817665
159100     03  MNT1599 PIC X(11)   VALUE '1223401C   '.                 2012254
159200     03  MNT1600 PIC X(11)   VALUE '1223508P Y '.                 0817665
159300     03  MNT1601 PIC X(11)   VALUE '1224301C   '.                 2012254
159400     03  MNT1602 PIC X(11)   VALUE '1224408P Y '.                 0817665
159500     03  MNT1603 PIC X(11)   VALUE '1225201C   '.                 2012254
159600     03  MNT1604 PIC X(11)   VALUE '1225308P Y '.                 0817665
159700     03  MNT1605 PIC X(11)   VALUE '1226101C   '.                 2012254
159800     03  MNT1606 PIC X(11)   VALUE '1226208P Y '.                 0817665
159900     03  MNT1607 PIC X(11)   VALUE '1227001C   '.                 2012254
160000     03  MNT1608 PIC X(11)   VALUE '1227108P Y '.                 0817665
160100     03  MNT1609 PIC X(11)   VALUE '1227901C   '.                 2012254
160200     03  MNT1610 PIC X(11)   VALUE '1228008P Y '.                 0817665
160300     03  MNT1611 PIC X(11)   VALUE '1228801C   '.                 2012254
160400     03  MNT1612 PIC X(11)   VALUE '1228908P Y '.                 0817665
160500     03  MNT1613 PIC X(11)   VALUE '1229701C   '.                 2012254
160600     03  MNT1614 PIC X(11)   VALUE '1229808P Y '.                 0817665
160700     03  MNT1615 PIC X(11)   VALUE '1230601C   '.                 2012254
160800     03  MNT1616 PIC X(11)   VALUE '1230708P Y '.                 0817665
160900     03  MNT1617 PIC X(11)   VALUE '1231501C   '.                 2012254
161000     03  MNT1618 PIC X(11)   VALUE '1231608P Y '.                 0817665
161100     03  MNT1619 PIC X(11)   VALUE '1232401C   '.                 2012254
161200     03  MNT1620 PIC X(11)   VALUE '1232508P Y '.                 0817665
161300     03  MNT1621 PIC X(11)   VALUE '1233301C   '.                 2012254
161400     03  MNT1622 PIC X(11)   VALUE '1233408P Y '.                 0817665
161500     03  MNT1623 PIC X(11)   VALUE '1234201C   '.                 2012254
161600     03  MNT1624 PIC X(11)   VALUE '1234308P Y '.                 0817665
161700     03  MNT1625 PIC X(11)   VALUE '1235101C   '.                 2012254
161800     03  MNT1626 PIC X(11)   VALUE '1235208P Y '.                 0817665
161900     03  MNT1627 PIC X(11)   VALUE '1236001C   '.                 2012254
162000     03  MNT1628 PIC X(11)   VALUE '1236108P Y '.                 0817665
162100     03  MNT1629 PIC X(11)   VALUE '1236901C   '.                 2012254
162200     03  MNT1630 PIC X(11)   VALUE '1237008P Y '.                 0817665
162300     03  MNT1631 PIC X(11)   VALUE '1237801C   '.                 2012254
162400     03  MNT1632 PIC X(11)   VALUE '1237908P Y '.                 0817665
162500     03  MNT1633 PIC X(11)   VALUE '1238701C   '.                 2012254
162600     03  MNT1634 PIC X(11)   VALUE '1238808P Y '.                 0817665
162700     03  MNT1635 PIC X(11)   VALUE '1239601C   '.                 2012254
162800     03  MNT1636 PIC X(11)   VALUE '1239708P Y '.                 0817665
162900     03  MNT1637 PIC X(11)   VALUE '1240501C   '.                 2012254
163000     03  MNT1638 PIC X(11)   VALUE '1240608P Y '.                 0817665
163100     03  MNT1639 PIC X(11)   VALUE '1241401C   '.                 2012254
163200     03  MNT1640 PIC X(11)   VALUE '1241508P Y '.                 0817665
163300     03  MNT1641 PIC X(11)   VALUE '1242301C   '.                 2012254
163400     03  MNT1642 PIC X(11)   VALUE '1242408P Y '.                 0817665
163500     03  MNT1643 PIC X(11)   VALUE '1243201C   '.                 2012254
163600     03  MNT1644 PIC X(11)   VALUE '1243308P Y '.                 0817665
163700     03  MNT1645 PIC X(11)   VALUE '1244101C   '.                 2012254
163800     03  MNT1646 PIC X(11)   VALUE '1244208P Y '.                 0817665
163900     03  MNT1647 PIC X(11)   VALUE '1245001C   '.                 2012254
164000     03  MNT1648 PIC X(11)   VALUE '1245108P Y '.                 0817665
164100     03  MNT1649 PIC X(11)   VALUE '1245901C   '.                 2012254
164200     03  MNT1650 PIC X(11)   VALUE '1246008P Y '.                 0817665
164300     03  MNT1651 PIC X(11)   VALUE '1246801C   '.                 2012254
164400     03  MNT1652 PIC X(11)   VALUE '1246908P Y '.                 0817665
164500     03  MNT1653 PIC X(11)   VALUE '1247701C   '.                 2012254
164600     03  MNT1654 PIC X(11)   VALUE '1247808P Y '.                 0817665
164700     03  MNT1655 PIC X(11)   VALUE '1248601C   '.                 2012254
164800     03  MNT1656 PIC X(11)   VALUE '1248708P Y '.                 0817665
164900     03  MNT1657 PIC X(11)   VALUE '1249501C   '.                 2012254
165000     03  MNT1658 PIC X(11)   VALUE '1249608P Y '.                 0817665
165100     03  MNT1659 PIC X(11)   VALUE '1250401C   '.                 2012254
165200     03  MNT1660 PIC X(11)   VALUE '1250508P Y '.                 0817665
165300     03  MNT1661 PIC X(11)   VALUE '1251301C   '.                 2012254
165400     03  MNT1662 PIC X(11)   VALUE '1251408P Y '.                 0817665
165500     03  MNT1663 PIC X(11)   VALUE '1252201C   '.                 2012254
165600     03  MNT1664 PIC X(11)   VALUE '1252308P Y '.                 0817665
165700     03  MNT1665 PIC X(11)   VALUE '1253101C   '.                 2012254
165800     03  MNT1666 PIC X(11)   VALUE '1253208P Y '.                 0817665
165900     03  MNT1667 PIC X(11)   VALUE '1254001C   '.                 2012254
166000     03  MNT1668 PIC X(11)   VALUE '1254108P Y '.                 0817665
166100     03  MNT1669 PIC X(11)   VALUE '1254901C   '.                 2012254
166200     03  MNT1670 PIC X(11)   VALUE '1255008P Y '.                 0817665
166300     03  MNT1671 PIC X(11)   VALUE '1255801C   '.                 2012254
166400     03  MNT1672 PIC X(11)   VALUE '1255908P Y '.                 0817665
166500     03  MNT1673 PIC X(11)   VALUE '1256701C   '.                 2012254
166600     03  MNT1674 PIC X(11)   VALUE '1256808P Y '.                 0817665
166700     03  MNT1675 PIC X(11)   VALUE '1257601C   '.                 2012254
166800     03  MNT1676 PIC X(11)   VALUE '1257708P Y '.                 0817665
166900     03  MNT1677 PIC X(11)   VALUE '1258501C   '.                 2012254
167000     03  MNT1678 PIC X(11)   VALUE '1258608P Y '.                 0817665
167100     03  MNT1679 PIC X(11)   VALUE '1259401C   '.                 2012254
167200     03  MNT1680 PIC X(11)   VALUE '1259508P Y '.                 0817665
167300     03  MNT1681 PIC X(11)   VALUE '1260301C   '.                 2012254
167400     03  MNT1682 PIC X(11)   VALUE '1260408P Y '.                 0817665
167500     03  MNT1683 PIC X(11)   VALUE '1261201C   '.                 2012254
167600     03  MNT1684 PIC X(11)   VALUE '1261308P Y '.                 0817665
167700     03  MNT1685 PIC X(11)   VALUE '1262101C   '.                 2012254
167800     03  MNT1686 PIC X(11)   VALUE '1262208P Y '.                 0817665
167900     03  MNT1687 PIC X(11)   VALUE '1263001C   '.                 2012254
168000     03  MNT1688 PIC X(11)   VALUE '1263108P Y '.                 0817665
168100     03  MNT1689 PIC X(11)   VALUE '1263901C   '.                 2012254
168200     03  MNT1690 PIC X(11)   VALUE '1264008P Y '.                 0817665
168300     03  MNT1691 PIC X(11)   VALUE '1264801C   '.                 2012254
168400     03  MNT1692 PIC X(11)   VALUE '1264908P Y '.                 0817665
168500     03  MNT1693 PIC X(11)   VALUE '1265701C   '.                 2012254
168600     03  MNT1694 PIC X(11)   VALUE '1265808P Y '.                 0817665
168700     03  MNT1695 PIC X(11)   VALUE '1266601C   '.                 2012254
168800     03  MNT1696 PIC X(11)   VALUE '1266708P Y '.                 0817665
168900     03  MNT1697 PIC X(11)   VALUE '1267501C   '.                 2012254
169000     03  MNT1698 PIC X(11)   VALUE '1267608P Y '.                 0817665
169100     03  MNT1699 PIC X(11)   VALUE '1268401C   '.                 2012254
169200     03  MNT1700 PIC X(11)   VALUE '1268508P Y '.                 0817665
169300     03  MNT1701 PIC X(11)   VALUE '1269301C   '.                 2012254
169400     03  MNT1702 PIC X(11)   VALUE '1269408P Y '.                 0817665
169500     03  MNT1703 PIC X(11)   VALUE '1270201C   '.                 2012254
169600     03  MNT1704 PIC X(11)   VALUE '1270308P Y '.                 0817665
169700     03  MNT1705 PIC X(11)   VALUE '1271101C   '.                 2012254
169800     03  MNT1706 PIC X(11)   VALUE '1271208P Y '.                 0817665
169900     03  MNT1707 PIC X(11)   VALUE '1272001C   '.                 2012254
170000     03  MNT1708 PIC X(11)   VALUE '1272108P Y '.                 0817665
170100     03  MNT1709 PIC X(11)   VALUE '1272901C   '.                 2012254
170200     03  MNT1710 PIC X(11)   VALUE '1273008P Y '.                 0817665
170300     03  MNT1711 PIC X(11)   VALUE '1273801C   '.                 2012254
170400     03  MNT1712 PIC X(11)   VALUE '1273908P Y '.                 0817665
170500     03  MNT1713 PIC X(11)   VALUE '1274701C   '.                 2012254
170600     03  MNT1714 PIC X(11)   VALUE '1274808P Y '.                 0817665
170700     03  MNT1715 PIC X(11)   VALUE '1275601C   '.                 2012254
170800     03  MNT1716 PIC X(11)   VALUE '1275708P Y '.                 0817665
170900     03  MNT1717 PIC X(11)   VALUE '1276501C   '.                 2012254
171000     03  MNT1718 PIC X(11)   VALUE '1276608P Y '.                 0817665
171100     03  MNT1719 PIC X(11)   VALUE '1277401C   '.                 2012254
171200     03  MNT1720 PIC X(11)   VALUE '1277508P Y '.                 0817665
171300     03  MNT1721 PIC X(11)   VALUE '1278301C   '.                 2012254
171400     03  MNT1722 PIC X(11)   VALUE '1278408P Y '.                 0817665
171500     03  MNT1723 PIC X(11)   VALUE '1279201C   '.                 2012254
171600     03  MNT1724 PIC X(11)   VALUE '1279308P Y '.                 0817665
171700     03  MNT1725 PIC X(11)   VALUE '1280101C   '.                 2012254
171800     03  MNT1726 PIC X(11)   VALUE '1280208P Y '.                 0817665
171900     03  MNT1727 PIC X(11)   VALUE '1281001C   '.                 2012254
172000     03  MNT1728 PIC X(11)   VALUE '1281108P Y '.                 0817665
172100     03  MNT1729 PIC X(11)   VALUE '1281901C   '.                 2012254
172200     03  MNT1730 PIC X(11)   VALUE '1282008P Y '.                 0817665
172300     03  MNT1731 PIC X(11)   VALUE '1282801C   '.                 2012254
172400     03  MNT1732 PIC X(11)   VALUE '1282908P Y '.                 0817665
172500     03  MNT1733 PIC X(11)   VALUE '1283701C   '.                 2012254
172600     03  MNT1734 PIC X(11)   VALUE '1283808P Y '.                 0817665
172700     03  MNT1735 PIC X(11)   VALUE '1284601C   '.                 2012254
172800     03  MNT1736 PIC X(11)   VALUE '1284708P Y '.                 0817665
172900     03  MNT1737 PIC X(11)   VALUE '1285501C   '.                 2012254
173000     03  MNT1738 PIC X(11)   VALUE '1285608P Y '.                 0817665
173100     03  MNT1739 PIC X(11)   VALUE '1286401C   '.                 2012254
173200     03  MNT1740 PIC X(11)   VALUE '1286508P Y '.                 0817665
173300     03  MNT1741 PIC X(11)   VALUE '1287301C   '.                 2012254
173400     03  MNT1742 PIC X(11)   VALUE '1287408P Y '.                 0817665
173500     03  MNT1743 PIC X(11)   VALUE '1288201C   '.                 2012254
173600     03  MNT1744 PIC X(11)   VALUE '1288308P Y '.                 0817665
173700     03  MNT1745 PIC X(11)   VALUE '1289101C   '.                 2012254
173800     03  MNT1746 PIC X(11)   VALUE '1289208P Y '.                 0817665
173900     03  MNT1747 PIC X(11)   VALUE '1290001C   '.                 2012254
174000     03  MNT1748 PIC X(11)   VALUE '1290108P Y '.                 0817665
174100     03  MNT1749 PIC X(11)   VALUE '1290901C   '.                 2012254
174200     03  MNT1750 PIC X(11)   VALUE '1291008P Y '.                 0817665
174300     03  MNT1751 PIC X(11)   VALUE '1291801C   '.                 2012254
174400     03  MNT1752 PIC X(11)   VALUE '1291908P Y '.                 0817665
174500     03  MNT1753 PIC X(11)   VALUE '1292701C   '.                 2012254
174600     03  MNT1754 PIC X(11)   VALUE '1292808P Y '.                 0817665
174700     03  MNT1755 PIC X(11)   VALUE '1293601C   '.                 2012254
174800     03  MNT1756 PIC X(11)   VALUE '1293708P Y '.                 0817665
174900     03  MNT1757 PIC X(11)   VALUE '1294501C   '.                 2012254
175000     03  MNT1758 PIC X(11)   VALUE '1294608P Y '.                 0817665
175100     03  MNT1759 PIC X(11)   VALUE '1295401C   '.                 2012254
175200     03  MNT1760 PIC X(11)   VALUE '1295508P Y '.                 0817665
175300     03  MNT1761 PIC X(11)   VALUE '1296301C   '.                 2012254
175400     03  MNT1762 PIC X(11)   VALUE '1296408P Y '.                 0817665
175500     03  MNT1763 PIC X(11)   VALUE '1297201C   '.                 2012254
175600     03  MNT1764 PIC X(11)   VALUE '1297308P Y '.                 0817665
175700     03  MNT1765 PIC X(11)   VALUE '1298101C   '.                 2012254
175800     03  MNT1766 PIC X(11)   VALUE '1298208P Y '.                 0817665
175900     03  MNT1767 PIC X(11)   VALUE '1299001C   '.                 2012254
176000     03  MNT1768 PIC X(11)   VALUE '1299108P Y '.                 0817665
176100     03  MNT1769 PIC X(11)   VALUE '1299901C   '.                 2012254
176200     03  MNT1770 PIC X(11)   VALUE '1300008P Y '.                 0817665
176300     03  MNT1771 PIC X(11)   VALUE '1300801C   '.                 2012254
176400     03  MNT1772 PIC X(11)   VALUE '1300908P Y '.                 0817665
176500     03  MNT1773 PIC X(11)   VALUE '1301701C   '.                 2012254
176600     03  MNT1774 PIC X(11)   VALUE '1301808P Y '.                 0817665
176700     03  MNT1775 PIC X(11)   VALUE '1302601C   '.                 2012254
176800     03  MNT1776 PIC X(11)   VALUE '1302708P Y '.                 0817665
176900     03  MNT1777 PIC X(11)   VALUE '1303501C   '.                 2012254
177000     03  MNT1778 PIC X(11)   VALUE '1303608P Y '.                 0817665
177100     03  MNT1779 PIC X(11)   VALUE '1304401C   '.                 2012254
177200     03  MNT1780 PIC X(11)   VALUE '1304508P Y '.                 0817665
177300     03  MNT1781 PIC X(11)   VALUE '1305301C   '.                 2012254
177400     03  MNT1782 PIC X(11)   VALUE '1305408P Y '.                 0817665
177500     03  MNT1783 PIC X(11)   VALUE '1306201C   '.                 2012254
177600     03  MNT1784 PIC X(11)   VALUE '1306308P Y '.                 0817665
177700     03  MNT1785 PIC X(11)   VALUE '1307101C   '.                 2012254
177800     03  MNT1786 PIC X(11)   VALUE '1307208P Y '.                 0817665
177900     03  MNT1787 PIC X(11)   VALUE '1308001C   '.                 2012254
178000     03  MNT1788 PIC X(11)   VALUE '1308108P Y '.                 0817665
178100     03  MNT1789 PIC X(11)   VALUE '1308901C   '.                 2012254
178200     03  MNT1790 PIC X(11)   VALUE '1309008P Y '.                 0817665
178300     03  MNT1791 PIC X(11)   VALUE '1309801C   '.                 2012254
178400     03  MNT1792 PIC X(11)   VALUE '1309908P Y '.                 0817665
178500     03  MNT1793 PIC X(11)   VALUE '1310701C   '.                 2012254
178600     03  MNT1794 PIC X(11)   VALUE '1310808P Y '.                 0817665
178700     03  MNT1795 PIC X(11)   VALUE '1311601C   '.                 2012254
178800     03  MNT1796 PIC X(11)   VALUE '1311708P Y '.                 0817665
178900     03  MNT1797 PIC X(11)   VALUE '1312501C   '.                 2012254
179000     03  MNT1798 PIC X(11)   VALUE '1312608P Y '.                 0817665
179100     03  MNT1799 PIC X(11)   VALUE '1313401C   '.                 2012254
179200     03  MNT1800 PIC X(11)   VALUE '1313508P Y '.                 0817665
179300     03  MNT1801 PIC X(11)   VALUE '1314301C   '.                 2012254
179400     03  MNT1802 PIC X(11)   VALUE '1314408P Y '.                 0817665
179500     03  MNT1803 PIC X(11)   VALUE '1315201C   '.                 2012254
179600     03  MNT1804 PIC X(11)   VALUE '1315308P Y '.                 0817665
179700     03  MNT1805 PIC X(11)   VALUE '1316101C   '.                 2012254
179800     03  MNT1806 PIC X(11)   VALUE '1316208P Y '.                 0817665
179900     03  MNT1807 PIC X(11)   VALUE '1317001C   '.                 2012254
180000     03  MNT1808 PIC X(11)   VALUE '1317108P Y '.                 0817665
180100     03  MNT1809 PIC X(11)   VALUE '1317901C   '.                 2012254
180200     03  MNT1810 PIC X(11)   VALUE '1318008P Y '.                 0817665
180300     03  MNT1811 PIC X(11)   VALUE '1318801C   '.                 2012254
180400     03  MNT1812 PIC X(11)   VALUE '1318908P Y '.                 0817665
180500     03  MNT1813 PIC X(11)   VALUE '1319701C   '.                 2012254
180600     03  MNT1814 PIC X(11)   VALUE '1319808P Y '.                 0817665
180700     03  MNT1815 PIC X(11)   VALUE '1320601C   '.                 2012254
180800     03  MNT1816 PIC X(11)   VALUE '1320708P Y '.                 0817665
180900     03  MNT1817 PIC X(11)   VALUE '1321501C   '.                 2012254
181000     03  MNT1818 PIC X(11)   VALUE '1321608P Y '.                 0817665
181100     03  MNT1819 PIC X(11)   VALUE '1322401C   '.                 2012254
181200     03  MNT1820 PIC X(11)   VALUE '1322508P Y '.                 0817665
181300     03  MNT1821 PIC X(11)   VALUE '1323301C   '.                 2012254
181400     03  MNT1822 PIC X(11)   VALUE '1323408P Y '.                 0817665
181500     03  MNT1823 PIC X(11)   VALUE '1324201C   '.                 2012254
181600     03  MNT1824 PIC X(11)   VALUE '1324308P Y '.                 0817665
181700     03  MNT1825 PIC X(11)   VALUE '1325101C   '.                 2012254
181800     03  MNT1826 PIC X(11)   VALUE '1325208P Y '.                 0817665
181900     03  MNT1827 PIC X(11)   VALUE '1326001C   '.                 2012254
182000     03  MNT1828 PIC X(11)   VALUE '1326108P Y '.                 0817665
182100     03  MNT1829 PIC X(11)   VALUE '1326901C   '.                 2012254
182200     03  MNT1830 PIC X(11)   VALUE '1327008P Y '.                 0817665
182300     03  MNT1831 PIC X(11)   VALUE '1327801C   '.                 2012254
182400     03  MNT1832 PIC X(11)   VALUE '1327908P Y '.                 0817665
182500     03  MNT1833 PIC X(11)   VALUE '1328701C   '.                 2012254
182600     03  MNT1834 PIC X(11)   VALUE '1328808P Y '.                 0817665
182700     03  MNT1835 PIC X(11)   VALUE '1329601C   '.                 2012254
182800     03  MNT1836 PIC X(11)   VALUE '1329708P Y '.                 0817665
182900     03  MNT1837 PIC X(11)   VALUE '1330501C   '.                 2012254
183000     03  MNT1838 PIC X(11)   VALUE '1330608P Y '.                 0817665
183100     03  MNT1839 PIC X(11)   VALUE '1331401C   '.                 2012254
183200     03  MNT1840 PIC X(11)   VALUE '1331508P Y '.                 0817665
183300     03  MNT1841 PIC X(11)   VALUE '1332301C   '.                 2012254
183400     03  MNT1842 PIC X(11)   VALUE '1332408P Y '.                 0817665
183500     03  MNT1843 PIC X(11)   VALUE '1333201C   '.                 2012254
183600     03  MNT1844 PIC X(11)   VALUE '1333308P Y '.                 0817665
183700     03  MNT1845 PIC X(11)   VALUE '1334101C   '.                 2012254
183800     03  MNT1846 PIC X(11)   VALUE '1334208P Y '.                 0817665
183900     03  MNT1847 PIC X(11)   VALUE '1335001C   '.                 2012254
184000     03  MNT1848 PIC X(11)   VALUE '1335108P Y '.                 0817665
184100     03  MNT1849 PIC X(11)   VALUE '1335901C   '.                 2012254
184200     03  MNT1850 PIC X(11)   VALUE '1336008P Y '.                 0817665
184300     03  MNT1851 PIC X(11)   VALUE '0022001C  I'.
184400     03  MNT1852 PIC X(11)   VALUE '0023801C   '.
184500     03  MNT1853 PIC X(11)   VALUE '0086602CS  '.
184600     03  MNT1854 PIC X(11)   VALUE '0097605P  I'.
184700     03  MNT1855 PIC X(11)   VALUE '0098105P  I'.
184800     03  MNT1856 PIC X(11)   VALUE '0103008P  N'.                 2012254
184900     03  MNT1857 PIC X(11)   VALUE '0103808P  N'.                 2012254
185000     03  MNT1858 PIC X(11)   VALUE '0107108P  N'.                 2012254
185100     03  MNT1859 PIC X(11)   VALUE '0107908P  N'.                 2012254
185200     03  MNT1860 PIC X(11)   VALUE '0111108P  N'.                 2012254
185300     03  MNT1861 PIC X(11)   VALUE '0111908P  N'.                 2012254
185400     03  MNT1862 PIC X(11)   VALUE '0113508P YC'.                 0817665
185500     03  MNT1863 PIC X(11)   VALUE '0114308P YC'.                 0817665
185600     03  MNT1864 PIC X(11)   VALUE '0122802CS C'.
185700     03  MNT1865 PIC X(11)   VALUE '0207801C   '.                 0427139
185800     03  MNT1866 PIC X(11)   VALUE '0207908P   '.                 0427139
185900     03  MNT1867 PIC X(11)   VALUE '0208708DS  '.                 0427139
186000     03  MNT1868 PIC X(11)   VALUE '0298101C  N'.
186100     03  MNT1869 PIC X(11)   VALUE '0299802CS  '.
186200     03  MNT1870 PIC X(11)   VALUE '0338702CS  '.
186300     03  MNT1871 PIC X(11)   VALUE '0389702CS  '.
186400     03  MNT1872 PIC X(11)   VALUE '           '.                 2012254
186500     03  MNT1873 PIC X(11)   VALUE '0883308P  N'.                 0335614
186600     03  MNT1874 PIC X(11)   VALUE '0697508P  N'.                 2012254
186700     03  MNT1875 PIC X(11)   VALUE '0698308P  N'.                 2012254
186800     03  MNT1876 PIC X(11)   VALUE '0707608P  N'.                 2012254
186900     03  MNT1877 PIC X(11)   VALUE '0708408P  N'.                 2012254
187000     03  MNT1878 PIC X(11)   VALUE '0711608P YC'.                 0817665
187100     03  MNT1879 PIC X(11)   VALUE '0712408P YC'.                 0817665
187200     03  MNT1880 PIC X(11)   VALUE '0723001C   '.                 9916070
187300     03  MNT1881 PIC X(11)   VALUE '0723101CS C'.                 9916070
187400     03  MNT1882 PIC X(11)   VALUE '0723202CS C'.                 9916070
187500     03  MNT1883 PIC X(11)   VALUE '0723402CS C'.                 9916070
187600     03  MNT1884 PIC X(11)   VALUE '0723602CS C'.                 9916070
187700     03  MNT1885 PIC X(11)   VALUE '0723801C  N'.                 9916070
187800     03  MNT1886 PIC X(11)   VALUE '0723906DS  '.                 9916070
187900     03  MNT1887 PIC X(11)   VALUE '0210502P   '.
188000     03  MNT1888 PIC X(11)   VALUE '0210720C   '.
188100     03  MNT1889 PIC X(11)   VALUE '0824408P  I'.
188200     03  MNT1890 PIC X(11)   VALUE '0825208P  I'.
188300     03  MNT1891 PIC X(11)   VALUE '0833808P  I'.
188400     03  MNT1892 PIC X(11)   VALUE '0834608P  I'.
188500     03  MNT1893 PIC X(11)   VALUE '0835402P  I'.
188600     03  MNT1894 PIC X(11)   VALUE '0842508P  N'.                 2012254
188700     03  MNT1895 PIC X(11)   VALUE '0843308P  N'.                 2012254
188800     03  MNT1896 PIC X(11)   VALUE '0844908P  N'.                 2012254
188900     03  MNT1897 PIC X(11)   VALUE '0845708P  N'.                 2012254
189000     03  MNT1898 PIC X(11)   VALUE '0856505P  I'.
189100     03  MNT1899 PIC X(11)   VALUE '0857005P  I'.
189200     03  MNT1900 PIC X(11)   VALUE '0026401C   '.                 0266887
189300     03  MNT1901 PIC X(11)   VALUE '0529108P YC'.                 0817665
189400     03  MNT1902 PIC X(11)   VALUE '0529908P YC'.                 0817665
189500     03  MNT1903 PIC X(11)   VALUE '0206601C   '.
189600     03  MNT1904 PIC X(11)   VALUE '0206702C   '.
189700     03  MNT1905 PIC X(11)   VALUE '0206901C  N'.
189800     03  MNT1906 PIC X(11)   VALUE '0207003C  N'.
189900     03  MNT1907 PIC X(11)   VALUE '0207301C  N'.
190000     03  MNT1908 PIC X(11)   VALUE '0122301CS C'.
190100     03  MNT1909 PIC X(11)   VALUE '0122402CS C'.
190200     03  MNT1910 PIC X(11)   VALUE '0122602CS C'.
190300     03  MNT1911 PIC X(11)   VALUE '0123001C  N'.
190400     03  MNT1912 PIC X(11)   VALUE '0123106DS  '.
190500     03  MNT1913 PIC X(11)   VALUE '0880801CS C'.
190600     03  MNT1914 PIC X(11)   VALUE '0880902CS C'.
190700     03  MNT1915 PIC X(11)   VALUE '0881102CS C'.
190800     03  MNT1916 PIC X(11)   VALUE '0881501C  N'.
190900     03  MNT1917 PIC X(11)   VALUE '0881606DS  '.
191000     03  MNT1918 PIC X(11)   VALUE '0882508P  I'.
191100     03  MNT1919 PIC X(11)   VALUE '0881302CS C'.
191200     03  MNT1920 PIC X(11)   VALUE '0882401P   '.                 0817704
191300     03  MNT1921 PIC X(11)   VALUE '1336808P  N'.                 2012254
191400     03  MNT1922 PIC X(11)   VALUE '1337608P  N'.                 2012254
191500     03  MNT1923 PIC X(11)   VALUE '1338408P  N'.                 2012254
191600     03  MNT1924 PIC X(11)   VALUE '1339208P  N'.                 2012254
191700     03  MNT1925 PIC X(11)   VALUE '1342408P  N'.                 2012254
191800     03  MNT1926 PIC X(11)   VALUE '1343208P  N'.                 2012254
191900     03  MNT1927 PIC X(11)   VALUE '1344008P YC'.                 0817665
192000     03  MNT1928 PIC X(11)   VALUE '1344808P YC'.                 0817665
192100     03  MNT1929 PIC X(11)   VALUE '1348008P  N'.                 2012254
192200     03  MNT1930 PIC X(11)   VALUE '1348808P  N'.                 2012254
192300     03  MNT1931 PIC X(11)   VALUE '1349608P  N'.                 2012254
192400     03  MNT1932 PIC X(11)   VALUE '1350408P  N'.                 2012254
192500     03  MNT1933 PIC X(11)   VALUE '1353608P YC'.                 0817665
192600     03  MNT1934 PIC X(11)   VALUE '1354408P  N'.                 2012254
192700     03  MNT1935 PIC X(11)   VALUE '1355208P YC'.                 0817665
192800     03  MNT1936 PIC X(11)   VALUE '1356008P YC'.                 0817665
192900     03  MNT1937 PIC X(11)   VALUE '0894802CS  '.                 0447287
193000     03  MNT1938 PIC X(11)   VALUE '0119808P  N'.
193100     03  MNT1939 PIC X(11)   VALUE '0120608P YC'.                 0817665
193200     03  MNT1940 PIC X(11)   VALUE '0724708P  N'.                 9916070
193300     03  MNT1941 PIC X(11)   VALUE '0725508P YC'.                 0817665
193400     03  MNT1942 PIC X(11)   VALUE '0846601C   '.
193500     03  MNT1943 PIC X(11)   VALUE '0846708P Y '.                 0817665
193600     03  MNT1944 PIC X(11)   VALUE '0847508P Y '.                 0817665
193700     03  MNT1945 PIC X(11)   VALUE '0673601C   '.                 9916070
193800     03  MNT1946 PIC X(11)   VALUE '0673701C   '.                 9916070
193900     03  MNT1947 PIC X(11)   VALUE '0726308P Y '.                 0817665
194000     03  MNT1948 PIC X(11)   VALUE '0727108P Y '.                 0817665
194100     03  MNT1949 PIC X(11)   VALUE '0727908P Y '.                 0817665
194200     03  MNT1950 PIC X(11)   VALUE '0728708P Y '.                 0817665
194202     03  MNT1951 PIC X(11)   VALUE '0026101C   '.                 9916072
194204     03  MNT1952 PIC X(11)   VALUE '0732401C   '.                 9916070
194206     03  MNT1953 PIC X(11)   VALUE '0729609P Y '.                 0817665
194208     03  MNT1954 PIC X(11)   VALUE '0730509P Y '.                 0817665
194210     03  MNT1955 PIC X(11)   VALUE '0731608P Y '.                 0817665
194212     03  MNT1956 PIC X(11)   VALUE '0731402P Y '.                 0817665
194214     03  MNT1957 PIC X(11)   VALUE '0169609P Y '.                 0817665
194216     03  MNT1958 PIC X(11)   VALUE '0212701C   '.                 9916073
194218     03  MNT1959 PIC X(11)   VALUE '0212802P Y '.                 0817665
194220     03  MNT1960 PIC X(11)   VALUE '0213002P Y '.                 0817665
194222     03  MNT1961 PIC X(11)   VALUE '0213208P Y '.                 0817665
194224     03  MNT1962 PIC X(11)   VALUE '0214008P Y '.                 0817665
194226     03  MNT1963 PIC X(11)   VALUE '0083008P  N'.                 9915855
194228     03  MNT1964 PIC X(11)   VALUE '0026202C   '.                 9916157
194230     03  MNT1965 PIC X(11)   VALUE '0238801C   '.                 2016374
194232     03  MNT1966 PIC X(11)   VALUE '0239304P Y '.                 0817665
194234     03  MNT1967 PIC X(11)   VALUE '0240504P Y '.                 0817665
194236     03  MNT1968 PIC X(11)   VALUE '0240908P Y '.                 0817665
194238     03  MNT1969 PIC X(11)   VALUE '0241701C   '.                 2016374
194240     03  MNT1970 PIC X(11)   VALUE '0241801P   '.                 2016374
194242     03  MNT1971 PIC X(11)   VALUE '0241904P Y '.                 0817665
194244     03  MNT1972 PIC X(11)   VALUE '0242308P Y '.                 0817665
194246     03  MNT1973 PIC X(11)   VALUE '0243104P Y '.                 0817665
194248     03  MNT1974 PIC X(11)   VALUE '0243508P Y '.                 0817665
194250     03  MNT1975 PIC X(11)   VALUE '0244304P Y '.                 0817665
194252     03  MNT1976 PIC X(11)   VALUE '0244708P Y '.                 0817665
194254     03  MNT1977 PIC X(11)   VALUE '0239708P Y '.                 0817665
194256     03  MNT1978 PIC X(11)   VALUE '0238904P Y '.                 0817665
194257     03  MNT1979 PIC X(11)   VALUE '0062101C   '.                 2015816
194258     03  MNT1980 PIC X(11)   VALUE '0406801C   '.                 2016412
194259     03  MNT1981 PIC X(11)   VALUE '0406906DS  '.                 2016412
194260     03  MNT1982 PIC X(11)   VALUE '           '.                 2012254
194261     03  MNT1983 PIC X(11)   VALUE '0002401CS  '.                 0837826
194262     03  MNT1984 PIC X(11)   VALUE '0005501C   '.                 2012254
194263     03  MNT1985 PIC X(11)   VALUE '0667808P  N'.                 2012254
194264     03  MNT1986 PIC X(11)   VALUE '0713208P  N'.                 2012254
194265     03  MNT1987 PIC X(11)   VALUE '0086802P   '.                 2012254
194266     03  MNT1988 PIC X(11)   VALUE '0087002P   '.                 2012254
194267     03  MNT1989 PIC X(11)   VALUE '0087202P   '.                 2012254
194268     03  MNT1990 PIC X(11)   VALUE '0983801C  N'.                 2012254
194269     03  MNT1991 PIC X(11)   VALUE '0983901C  N'.                 2012254
194270     03  MNT1992 PIC X(11)   VALUE '0984001C  N'.                 2012254
194271     03  MNT1993 PIC X(11)   VALUE '1101401C  N'.                 2012254
194272     03  MNT1994 PIC X(11)   VALUE '1101508C  N'.                 2012254
194273     03  MNT1995 PIC X(11)   VALUE '1102305P  N'.                 2012254
194274     03  MNT1996 PIC X(11)   VALUE '1106808P  N'.                 2012254
194275     03  MNT1997 PIC X(11)   VALUE '1113201C  N'.                 2012254
194276     03  MNT1998 PIC X(11)   VALUE '1113308C  N'.                 2012254
194277     03  MNT1999 PIC X(11)   VALUE '1114105P  N'.                 2012254
194278     03  MNT2000 PIC X(11)   VALUE '1118608P  N'.                 2012254
194279     03  MNT2001 PIC X(11)   VALUE '1125001C  N'.                 2012254
194280     03  MNT2002 PIC X(11)   VALUE '1125108C  N'.                 2012254
194281     03  MNT2003 PIC X(11)   VALUE '1125905P  N'.                 2012254
194282     03  MNT2004 PIC X(11)   VALUE '1130408P  N'.                 2012254
194283     03  MNT2005 PIC X(11)   VALUE '0214801CS  '.                 2016639
194284     03  MNT2006 PIC X(11)   VALUE '0214901C   '.                 2016639
194285     03  MNT2007 PIC X(11)   VALUE '0215001C   '.                 2016639
194286     03  MNT2008 PIC X(11)   VALUE '0215204C   '.                 2016639
194287     03  MNT2009 PIC X(11)   VALUE '0215608NS  '.                 2016639
194288     03  MNT2010 PIC X(11)   VALUE '0216408NS  '.                 2016639
194289     03  MNT2011 PIC X(11)   VALUE '0217208P  C'.                 2016639
194290     03  MNT2012 PIC X(11)   VALUE '0218008P Y '.                 0817665
194291     03  MNT2013 PIC X(11)   VALUE '0219609P Y '.                 0817665
194292     03  MNT2014 PIC X(11)   VALUE '0220502P Y '.                 0817665
194293     03  MNT2015 PIC X(11)   VALUE '0220709P Y '.                 0817665
194294     03  MNT2016 PIC X(11)   VALUE '0221602P Y '.                 0817665
194295     03  MNT2017 PIC X(11)   VALUE '0221809P Y '.                 0817665
194296     03  MNT2018 PIC X(11)   VALUE '0222702P Y '.                 0817665
194297     03  MNT2019 PIC X(11)   VALUE '0215101C   '.                 2016639
194298     03  MNT2020 PIC X(11)   VALUE '0222915C   '.                 2016639
194299     03  MNT2021 PIC X(11)   VALUE '0030103C   '.                 0727682
194300     03  MNT2022 PIC X(11)   VALUE '0030402C   '.                 0727682
194301     03  MNT2023 PIC X(11)   VALUE '0030601C   '.                 0727682
194302     03  MNT2024 PIC X(11)   VALUE '0030701C   '.                 0727682
194303     03  MNT2025 PIC X(11)   VALUE '0030801C   '.                 0727682
194304     03  MNT2026 PIC X(11)   VALUE '0030902C   '.                 0727682
194305     03  MNT2027 PIC X(11)   VALUE '0143608P YC'.                 0927850
194306     03  MNT2028 PIC X(11)   VALUE '0235808NS  '.                 0930013
194307     03  MNT2029 PIC X(11)   VALUE '0884108NS  '.                 0930013
194308     03  MNT2030 PIC X(11)   VALUE '0884908NS  '.                 0930013
194309     03  MNT2031 PIC X(11)   VALUE '0235008NS  '.                 0930013
194310     03  MNT2032 PIC X(11)   VALUE '0005601C   '.                 1020089
194311     03  MNT2033 PIC X(11)   VALUE '           '.                 0316967
194312     03  MNT2034 PIC X(11)   VALUE '           '.                 0316967
194313     03  MNT2035 PIC X(11)   VALUE '0233408P Y '.                 0930023
194314     03  MNT2036 PIC X(11)   VALUE '0234208P Y '.                 0930023
194315     03  MNT2037 PIC X(11)   VALUE '           '.                 0316967
194316     03  MNT2038 PIC X(11)   VALUE '           '.                 0316967
194317     03  MNT2039 PIC X(11)   VALUE '0668602P  C'.                 0316967
194318     03  MNT2040 PIC X(11)   VALUE '0729501C  N'.                 0316967
194320     03  MNT2041 PIC X(11)   VALUE '0226812C  N'.                 1010059
194321     03  MNT2042 PIC X(11)   VALUE '0026501C   '.                 0417066
194322     03  MNT2043 PIC X(11)   VALUE '0026602P   '.                 0417066
194323     03  MNT2044 PIC X(11)   VALUE '0026808DS  '.                 0417066
194324     03  MNT2045 PIC X(11)   VALUE '           '.                 0337109
194325     03  MNT2046 PIC X(11)   VALUE '           '.                 0337109
194326     03  MNT2047 PIC X(11)   VALUE '           '.                 0337109
194327     03  MNT2048 PIC X(11)   VALUE '0027601C   '.                 0417066
194328     03  MNT2049 PIC X(11)   VALUE '0134308P Y '.                 0817665
194329     03  MNT2050 PIC X(11)   VALUE '0135102P Y '.                 0817665
194330     03  MNT2051 PIC X(11)   VALUE '0135301C   '.                 0417110
194331     03  MNT2052 PIC X(11)   VALUE '0004105CS  '.                 0427044
194332     03  MNT2053 PIC X(11)   VALUE '0004601C   '.                 0827769
194333     03  MNT2054 PIC X(11)   VALUE '           '.                 0437111
194334     03  MNT2055 PIC X(11)   VALUE '0530708P   '.                 1020057
194335     03  MNT2056 PIC X(11)   VALUE '0531508P   '.                 1020057
194336     03  MNT2057 PIC X(11)   VALUE '0532301C   '.                 1020057
194337     03  MNT2058 PIC X(11)   VALUE '0532408DS C'.                 1020057
194338     03  MNT2059 PIC X(11)   VALUE '0533201C  N'.                 1020057
194339     03  MNT2060 PIC X(11)   VALUE '           '.                 0437111
194340     03  MNT2061 PIC X(11)   VALUE '           '.                 0437111
194341     03  MNT2062 PIC X(11)   VALUE '           '.                 0437111
194342     03  MNT2063 PIC X(11)   VALUE '           '.                 0437111
194343     03  MNT2064 PIC X(11)   VALUE '           '.                 0437111
194344     03  MNT2065 PIC X(11)   VALUE '           '.                 0437111
194345     03  MNT2066 PIC X(11)   VALUE '           '.                 0437111
194346     03  MNT2067 PIC X(11)   VALUE '           '.                 0437111
194347     03  MNT2068 PIC X(11)   VALUE '           '.                 0437111
194348     03  MNT2069 PIC X(11)   VALUE '           '.                 0437111
194349     03  MNT2070 PIC X(11)   VALUE '           '.                 0437111
194350     03  MNT2071 PIC X(11)   VALUE '           '.                 0437111
194351     03  MNT2072 PIC X(11)   VALUE '           '.                 0437111
194352     03  MNT2073 PIC X(11)   VALUE '           '.                 0437111
194353     03  MNT2074 PIC X(11)   VALUE '           '.                 0437111
194354     03  MNT2075 PIC X(11)   VALUE '           '.                 0437111
194355     03  MNT2076 PIC X(11)   VALUE '           '.                 0437111
194356     03  MNT2077 PIC X(11)   VALUE '           '.                 0437111
194357     03  MNT2078 PIC X(11)   VALUE '           '.                 0437111
194358     03  MNT2079 PIC X(11)   VALUE '           '.                 0437111
194359     03  MNT2080 PIC X(11)   VALUE '           '.                 0437111
194360     03  MNT2081 PIC X(11)   VALUE '           '.                 0437111
194361     03  MNT2082 PIC X(11)   VALUE '           '.                 0437111
194362     03  MNT2083 PIC X(11)   VALUE '           '.                 0437111
194363     03  MNT2084 PIC X(11)   VALUE '           '.                 0437111
194364     03  MNT2085 PIC X(11)   VALUE '           '.                 0437111
194365     03  MNT2086 PIC X(11)   VALUE '           '.                 0437111
194366     03  MNT2087 PIC X(11)   VALUE '           '.                 0437111
194367     03  MNT2088 PIC X(11)   VALUE '           '.                 0437111
194368     03  MNT2089 PIC X(11)   VALUE '           '.                 0437111
194369     03  MNT2090 PIC X(11)   VALUE '           '.                 0437111
194370     03  MNT2091 PIC X(11)   VALUE '           '.                 0437111
194371     03  MNT2092 PIC X(11)   VALUE '           '.                 0437111
194372     03  MNT2093 PIC X(11)   VALUE '           '.                 0437111
194373     03  MNT2094 PIC X(11)   VALUE '           '.                 0437111
194374     03  MNT2095 PIC X(11)   VALUE '           '.                 0437111
194375     03  MNT2096 PIC X(11)   VALUE '           '.                 0437111
194376     03  MNT2097 PIC X(11)   VALUE '           '.                 0437111
194377     03  MNT2098 PIC X(11)   VALUE '           '.                 0437111
194378     03  MNT2099 PIC X(11)   VALUE '           '.                 0437111
194379     03  MNT2100 PIC X(11)   VALUE '           '.                 0437111
194380     03  MNT2101 PIC X(11)   VALUE '           '.                 0437111
194381     03  MNT2102 PIC X(11)   VALUE '           '.                 0437111
194382     03  MNT2103 PIC X(11)   VALUE '           '.                 0437111
194383     03  MNT2104 PIC X(11)   VALUE '           '.                 0437111
194384     03  MNT2105 PIC X(11)   VALUE '           '.                 0437111
194385     03  MNT2106 PIC X(11)   VALUE '           '.                 0437111
194386     03  MNT2107 PIC X(11)   VALUE '           '.                 0437111
194387     03  MNT2108 PIC X(11)   VALUE '           '.                 0437111
194388     03  MNT2109 PIC X(11)   VALUE '           '.                 0437111
194389     03  MNT2110 PIC X(11)   VALUE '           '.                 0437111
194390     03  MNT2111 PIC X(11)   VALUE '           '.                 0437111
194391     03  MNT2112 PIC X(11)   VALUE '           '.                 0437111
194392     03  MNT2113 PIC X(11)   VALUE '           '.                 0437111
194393     03  MNT2114 PIC X(11)   VALUE '           '.                 0437111
194394     03  MNT2115 PIC X(11)   VALUE '           '.                 0437111
194395     03  MNT2116 PIC X(11)   VALUE '           '.                 0437111
194396     03  MNT2117 PIC X(11)   VALUE '           '.                 0437111
194397     03  MNT2118 PIC X(11)   VALUE '           '.                 0437111
194398     03  MNT2119 PIC X(11)   VALUE '           '.                 0437111
194399     03  MNT2120 PIC X(11)   VALUE '0230208P Y '.                 0817665
194400     03  MNT2121 PIC X(11)   VALUE '0231008P Y '.                 0817665
194401     03  MNT2122 PIC X(11)   VALUE '0231808P Y '.                 0817665
194402     03  MNT2123 PIC X(11)   VALUE '0232608P Y '.                 0817665
194403     03  MNT2124 PIC X(11)   VALUE '0078602P Y '.                 0817665
194404     03  MNT2125 PIC X(11)   VALUE '0078802P Y '.                 0817665
194405     03  MNT2126 PIC X(11)   VALUE '0079002P Y '.                 0817665
194406     03  MNT2127 PIC X(11)   VALUE '0079202P Y '.                 0817665
194407     03  MNT2128 PIC X(11)   VALUE '0079402P Y '.                 0817665
194408     03  MNT2129 PIC X(11)   VALUE '0079602P Y '.                 0817665
194409     03  MNT2130 PIC X(11)   VALUE '0079802P Y '.                 0817665
194410     03  MNT2131 PIC X(11)   VALUE '0080002P Y '.                 0817665
194411     03  MNT2132 PIC X(11)   VALUE '0080202P Y '.                 0817665
194412     03  MNT2133 PIC X(11)   VALUE '0080402P Y '.                 0817665
194413     03  MNT2134 PIC X(11)   VALUE '0080602P Y '.                 0817665
194414     03  MNT2135 PIC X(11)   VALUE '0080802P Y '.                 0817665
194415     03  MNT2136 PIC X(11)   VALUE '0081002P Y '.                 0817665
194416     03  MNT2137 PIC X(11)   VALUE '0081202P Y '.                 0817665
194417     03  MNT2138 PIC X(11)   VALUE '0081402P Y '.                 0817665
194418     03  MNT2139 PIC X(11)   VALUE '0081602P Y '.                 0817665
194419     03  MNT2140 PIC X(11)   VALUE '0081802P Y '.                 0817665
194420     03  MNT2141 PIC X(11)   VALUE '0082002P Y '.                 0817665
194421     03  MNT2142 PIC X(11)   VALUE '0082202P Y '.                 0817665
194422     03  MNT2143 PIC X(11)   VALUE '0082402P Y '.                 0817665
194423     03  MNT2144 PIC X(11)   VALUE '0082602P Y '.                 0817665
194424     03  MNT2145 PIC X(11)   VALUE '0082802P Y '.                 0817665
194426     03  MNT2146 PIC X(11)   VALUE '0229208DS  '.                 0547276
194428     03  MNT2147 PIC X(11)   VALUE '0075802P Y '.                 0817665
194430     03  MNT2148 PIC X(11)   VALUE '0076008P Y '.                 0817665
194432     03  MNT2149 PIC X(11)   VALUE '0076801C   '.                 0527322
194434     03  MNT2150 PIC X(11)   VALUE '0076908NS N'.                 0527322
194451     03  MNT2151 PIC X(11)   VALUE '1375102CS  '.                 0617360
194452     03  MNT2152 PIC X(11)   VALUE '1375312C   '.                 0617360
194453     03  MNT2153 PIC X(11)   VALUE '1376503CS  '.                 0617360
194454     03  MNT2154 PIC X(11)   VALUE '1376812C  N'.                 0617360
194455     03  MNT2155 PIC X(11)   VALUE '1378008D   '.                 0617360
194456     03  MNT2156 PIC X(11)   VALUE '          N'.                 0617360
194457     03  MNT2157 PIC X(11)   VALUE '          N'.                 0617360
194458     03  MNT2158 PIC X(11)   VALUE '          N'.                 0617360
194459     03  MNT2159 PIC X(11)   VALUE '          N'.                 0617360
194460     03  MNT2160 PIC X(11)   VALUE '          N'.                 0617360
194461     03  MNT2161 PIC X(11)   VALUE '          N'.                 0617360
194462     03  MNT2162 PIC X(11)   VALUE '1378808D  N'.                 0617360
194463     03  MNT2163 PIC X(11)   VALUE '          N'.                 0617360
194464     03  MNT2164 PIC X(11)   VALUE '          N'.                 0617360
194465     03  MNT2165 PIC X(11)   VALUE '          N'.                 0617360
194466     03  MNT2166 PIC X(11)   VALUE '          N'.                 0617360
194467     03  MNT2167 PIC X(11)   VALUE '          N'.                 0617360
194468     03  MNT2168 PIC X(11)   VALUE '          N'.                 0617360
194469     03  MNT2169 PIC X(11)   VALUE '1379612C  C'.                 0817719
194470     03  MNT2170 PIC X(11)   VALUE '1379701C   '.                 0617360
194471     03  MNT2171 PIC X(11)   VALUE '1379809C  C'.                 0817719
194472     03  MNT2172 PIC X(11)   VALUE '       C  N'.                 0617360
194473     03  MNT2173 PIC X(11)   VALUE '       C  N'.                 0617360
194474     03  MNT2174 PIC X(11)   VALUE '1380701C   '.                 0617360
194475     03  MNT2175 PIC X(11)   VALUE '1380808NS  '.                 0617360
194476     03  MNT2176 PIC X(11)   VALUE '          N'.                 0617360
194477     03  MNT2177 PIC X(11)   VALUE '          N'.                 0617360
194478     03  MNT2178 PIC X(11)   VALUE '          N'.                 0617360
194479     03  MNT2179 PIC X(11)   VALUE '1381608P Y '.                 0817665
194480     03  MNT2180 PIC X(11)   VALUE '1382408P Y '.                 0817665
194481     03  MNT2181 PIC X(11)   VALUE '1383205P Y '.                 0817665
194482     03  MNT2182 PIC X(11)   VALUE '1383703P  N'.                 0617360
194483     03  MNT2183 PIC X(11)   VALUE '1383703P  N'.                 0617360
194484     03  MNT2184 PIC X(11)   VALUE '1384201C  N'.                 0617360
194485     03  MNT2185 PIC X(11)   VALUE '1384308P  N'.                 0617360
194486     03  MNT2186 PIC X(11)   VALUE '1385102P  N'.                 0617360
194487     03  MNT2187 PIC X(11)   VALUE '1385301C  N'.                 0617360
194488     03  MNT2188 PIC X(11)   VALUE '1386403P  N'.                 0617360
194489     03  MNT2189 PIC X(11)   VALUE '1386403P  N'.                 0617360
194490     03  MNT2190 PIC X(11)   VALUE '1386901C  N'.                 0617360
194491     03  MNT2191 PIC X(11)   VALUE '1387008P  N'.                 0617360
194492     03  MNT2192 PIC X(11)   VALUE '1387802P  N'.                 0617360
194493     03  MNT2193 PIC X(11)   VALUE '1388001C  N'.                 0617360
194494     03  MNT2194 PIC X(11)   VALUE '1389103C   '.                 0617360
194495     03  MNT2195 PIC X(11)   VALUE '1389408P Y '.                 0817665
194496     03  MNT2196 PIC X(11)   VALUE '1390208P Y '.                 0817665
194497     03  MNT2197 PIC X(11)   VALUE '1391008P Y '.                 0817665
194498     03  MNT2198 PIC X(11)   VALUE '1391808P Y '.                 0817665
194499     03  MNT2199 PIC X(11)   VALUE '1392608D  N'.                 0617360
194500     03  MNT2200 PIC X(11)   VALUE '          N'.                 0617360
194501     03  MNT2201 PIC X(11)   VALUE '          N'.                 0617360
194502     03  MNT2202 PIC X(11)   VALUE '          N'.                 0617360
194503     03  MNT2203 PIC X(11)   VALUE '          N'.                 0617360
194504     03  MNT2204 PIC X(11)   VALUE '1393402C  N'.                 0617360
194505     03  MNT2205 PIC X(11)   VALUE '1393601C  N'.                 0617360
194506     03  MNT2206 PIC X(11)   VALUE '1393701C  N'.                 0617360
194507     03  MNT2207 PIC X(11)   VALUE '1393808P  N'.                 0617360
194508     03  MNT2208 PIC X(11)   VALUE '1394632C  N'.                 0617360
194509     03  MNT2209 PIC X(11)   VALUE '1397802C   '.                 0617360
194510     03  MNT2210 PIC X(11)   VALUE '1397802C   '.                 0617360
194511     03  MNT2211 PIC X(11)   VALUE '1398001C   '.                 0617360
194512     03  MNT2212 PIC X(11)   VALUE '1398108P Y '.                 0817665
194513     03  MNT2213 PIC X(11)   VALUE '1398901C   '.                 0617360
194514     03  MNT2214 PIC X(11)   VALUE '1399201C   '.                 0617360
194515     03  MNT2215 PIC X(11)   VALUE '1399301C  N'.                 0617360
194516     03  MNT2216 PIC X(11)   VALUE '1399401C   '.                 0617360
194517     03  MNT2217 PIC X(11)   VALUE '1399501C  N'.                 0617360
194518     03  MNT2218 PIC X(11)   VALUE '1399601C   '.                 0617360
194519     03  MNT2219 PIC X(11)   VALUE '1399702C   '.                 0617360
194520     03  MNT2220 PIC X(11)   VALUE '1399801C   '.                 0617360
194521     03  MNT2221 PIC X(11)   VALUE '1399905P Y '.                 0817665
194522     03  MNT2222 PIC X(11)   VALUE '1400608P  N'.                 0617360
194523     03  MNT2223 PIC X(11)   VALUE '1401412C  C'.                 0817719
194524     03  MNT2224 PIC X(11)   VALUE '1402602C  N'.                 0617360
194525     03  MNT2225 PIC X(11)   VALUE '1402808P  N'.                 0617360
194526     03  MNT2226 PIC X(11)   VALUE '1403601C  N'.                 0617360
194527     03  MNT2227 PIC X(11)   VALUE '1403701C  N'.                 0617360
194528     03  MNT2228 PIC X(11)   VALUE '1403701C  N'.                 0617360
194529     03  MNT2229 PIC X(11)   VALUE '1403802C  N'.                 0617360
194530     03  MNT2230 PIC X(11)   VALUE '1404002C  N'.                 0617360
194531     03  MNT2231 PIC X(11)   VALUE '1404202C  N'.                 0617360
194532     03  MNT2232 PIC X(11)   VALUE '1404408D  N'.                 0617360
194533     03  MNT2233 PIC X(11)   VALUE '1404401C  N'.                 0617360
194534     03  MNT2234 PIC X(11)   VALUE '1404501C  N'.                 0617360
194535     03  MNT2235 PIC X(11)   VALUE '1404602C  N'.                 0617360
194536     03  MNT2236 PIC X(11)   VALUE '1404802C  N'.                 0617360
194537     03  MNT2237 PIC X(11)   VALUE '1405002C  N'.                 0617360
194538     03  MNT2238 PIC X(11)   VALUE '1404606C  N'.                 0617360
194539     03  MNT2239 PIC X(11)   VALUE '1405201C  N'.                 0617360
194540     03  MNT2240 PIC X(11)   VALUE '1405301C  N'.                 0617360
194541     03  MNT2241 PIC X(11)   VALUE '1405403P  N'.                 0617360
194542     03  MNT2242 PIC X(11)   VALUE '1405703P  N'.                 0617360
194543     03  MNT2243 PIC X(11)   VALUE '1406008D  N'.                 0617360
194544     03  MNT2244 PIC X(11)   VALUE '1406001C  N'.                 0617360
194545     03  MNT2245 PIC X(11)   VALUE '1406101C  N'.                 0617360
194546     03  MNT2246 PIC X(11)   VALUE '1406202C  N'.                 0617360
194547     03  MNT2247 PIC X(11)   VALUE '1406402C  N'.                 0617360
194548     03  MNT2248 PIC X(11)   VALUE '1406602C  N'.                 0617360
194549     03  MNT2249 PIC X(11)   VALUE '1406206C  N'.                 0617360
194550     03  MNT2250 PIC X(11)   VALUE '1406801C  N'.                 0617360
194551     03  MNT2251 PIC X(11)   VALUE '1406901C  N'.                 0617360
194552     03  MNT2252 PIC X(11)   VALUE '1407001C  N'.                 0617360
194553     03  MNT2253 PIC X(11)   VALUE '1407108P Y '.                 0817665
194554     03  MNT2254 PIC X(11)   VALUE '1407908P Y '.                 0817665
194555     03  MNT2255 PIC X(11)   VALUE '1408708P Y '.                 0817665
194556     03  MNT2256 PIC X(11)   VALUE '1409508P Y '.                 0817665
194557     03  MNT2257 PIC X(11)   VALUE '1410308P Y '.                 0817665
194558     03  MNT2258 PIC X(11)   VALUE '1411108P Y '.                 0817665
194559     03  MNT2259 PIC X(11)   VALUE '1411908P Y '.                 0817665
194560     03  MNT2260 PIC X(11)   VALUE '1412708P Y '.                 0817665
194561     03  MNT2261 PIC X(11)   VALUE '1413508P Y '.                 0817665
194562     03  MNT2262 PIC X(11)   VALUE '1414308P Y '.                 0817665
194563     03  MNT2263 PIC X(11)   VALUE '1415108P Y '.                 0817665
194564     03  MNT2264 PIC X(11)   VALUE '1415908P Y '.                 0817665
194565     03  MNT2265 PIC X(11)   VALUE '1416708P Y '.                 0817665
194566     03  MNT2266 PIC X(11)   VALUE '1417508P Y '.                 0817665
194567     03  MNT2267 PIC X(11)   VALUE '1418308P Y '.                 0817665
194568     03  MNT2268 PIC X(11)   VALUE '1419108P Y '.                 0817665
194569     03  MNT2269 PIC X(11)   VALUE '1419908P Y '.                 0817665
194570     03  MNT2270 PIC X(11)   VALUE '1420708P Y '.                 0817665
194571     03  MNT2271 PIC X(11)   VALUE '1421508NS  '.                 0617360
194572     03  MNT2272 PIC X(11)   VALUE '           '.                 0617360
194573     03  MNT2273 PIC X(11)   VALUE '           '.                 0617360
194574     03  MNT2274 PIC X(11)   VALUE '           '.                 0617360
194575     03  MNT2275 PIC X(11)   VALUE '           '.                 0617360
194576     03  MNT2276 PIC X(11)   VALUE '1422308D   '.                 0617360
194577     03  MNT2277 PIC X(11)   VALUE '           '.                 0617360
194578     03  MNT2278 PIC X(11)   VALUE '           '.                 0617360
194579     03  MNT2279 PIC X(11)   VALUE '           '.                 0617360
194580     03  MNT2280 PIC X(11)   VALUE '           '.                 0617360
194581     03  MNT2281 PIC X(11)   VALUE '1423301C  N'.                 0617360
194582     03  MNT2282 PIC X(11)   VALUE '1423408D  N'.                 0617360
194583     03  MNT2283 PIC X(11)   VALUE '1423606C  N'.                 0617360
194584     03  MNT2284 PIC X(11)   VALUE '1423602C  N'.                 0617360
194585     03  MNT2285 PIC X(11)   VALUE '1423802C  N'.                 0617360
194586     03  MNT2286 PIC X(11)   VALUE '1424002C  N'.                 0617360
194587     03  MNT2287 PIC X(11)   VALUE '1424208D  N'.                 0617360
194588     03  MNT2288 PIC X(11)   VALUE '1424402C  N'.                 0617360
194589     03  MNT2289 PIC X(11)   VALUE '1424602C  N'.                 0617360
194590     03  MNT2290 PIC X(11)   VALUE '1424802C  N'.                 0617360
194591     03  MNT2291 PIC X(11)   VALUE '1424406C  N'.                 0617360
194592     03  MNT2292 PIC X(11)   VALUE '1425008P  N'.                 0617360
194593     03  MNT2293 PIC X(11)   VALUE '1425808P  N'.                 0617360
194594     03  MNT2294 PIC X(11)   VALUE '1426608P  N'.                 0617360
194595     03  MNT2295 PIC X(11)   VALUE '1427408P  N'.                 0617360
194596     03  MNT2296 PIC X(11)   VALUE '1428208P  N'.                 0617360
194597     03  MNT2297 PIC X(11)   VALUE '1429008P  N'.                 0617360
194598     03  MNT2298 PIC X(11)   VALUE '1429801C  N'.                 0617360
194599     03  MNT2299 PIC X(11)   VALUE '1429901C  N'.                 0617360
194600     03  MNT2300 PIC X(11)   VALUE '1430002P  N'.                 0617360
194601     03  MNT2301 PIC X(11)   VALUE '1430201C   '.                 0617360
194602     03  MNT2302 PIC X(11)   VALUE '1430301C  N'.                 0617360
194603     03  MNT2303 PIC X(11)   VALUE '1430403P   '.                 0617360
194604     03  MNT2304 PIC X(11)   VALUE '1430403P   '.                 0617360
194605     03  MNT2305 PIC X(11)   VALUE '1434015C  N'.                 0617360
194606     03  MNT2306 PIC X(11)   VALUE '1435603C  N'.                 0617360
194607     03  MNT2307 PIC X(11)   VALUE '1436015C  N'.                 0617360
194608     03  MNT2308 PIC X(11)   VALUE '           '.                 0617360
194609     03  MNT2309 PIC X(11)   VALUE '           '.                 0617360
194610     03  MNT2310 PIC X(11)   VALUE '           '.                 0617360
194611     03  MNT2311 PIC X(11)   VALUE '           '.                 0617360
194612     03  MNT2312 PIC X(11)   VALUE '           '.                 0617360
194613     03  MNT2313 PIC X(11)   VALUE '           '.                 0617360
194614     03  MNT2314 PIC X(11)   VALUE '           '.                 0617360
194615     03  MNT2315 PIC X(11)   VALUE '           '.                 0617360
194616     03  MNT2316 PIC X(11)   VALUE '0298201C  N'.                 0617360
194617     03  MNT2317 PIC X(11)   VALUE '0121402CS N'.                 0617360
194618     03  MNT2318 PIC X(11)   VALUE '1381006C   '.                 0617360
194619     03  MNT2319 PIC X(11)   VALUE '1399001C   '.                 0617360
194620     03  MNT2320 PIC X(11)   VALUE '1432305P Y '.                 0817665
194621     03  MNT2321 PIC X(11)   VALUE '1432805P Y '.                 0817665
194622     03  MNT2322 PIC X(11)   VALUE '0196808P YC'.                 0817665
194623     03  MNT2323 PIC X(11)   VALUE '0197608P YC'.                 0817665
194624     03  MNT2324 PIC X(11)   VALUE '1433305P YC'.                 0817665
194625     03  MNT2325 PIC X(11)   VALUE '1388308D   '.                 0617360
194786     03  MNT2326 PIC X(11)   VALUE '           '.                 0547276
194788     03  MNT2327 PIC X(11)   VALUE '           '.                 0547276
194790     03  MNT2328 PIC X(11)   VALUE '           '.                 0547276
194792     03  MNT2329 PIC X(11)   VALUE '           '.                 0547276
194794     03  MNT2330 PIC X(11)   VALUE '1400401C   '.                 0827778
194796     03  MNT2331 PIC X(11)   VALUE '1400501C   '.                 0827778
194798     03  MNT2332 PIC X(11)   VALUE '0078501C   '.                 1010086
194800     03  MNT2333 PIC X(11)   VALUE '           '.                 0547276
194802     03  MNT2334 PIC X(11)   VALUE '           '.                 0547276
194804     03  MNT2335 PIC X(11)   VALUE '           '.                 0547276
194806     03  MNT2336 PIC X(11)   VALUE '           '.                 0547276
194808     03  MNT2337 PIC X(11)   VALUE '           '.                 0547276
194810     03  MNT2338 PIC X(11)   VALUE '           '.                 0547276
194812     03  MNT2339 PIC X(11)   VALUE '           '.                 0547276
194814     03  MNT2340 PIC X(11)   VALUE '           '.                 0547276
194816     03  MNT2341 PIC X(11)   VALUE '           '.                 0547276
194818     03  MNT2342 PIC X(11)   VALUE '           '.                 0547276
194820     03  MNT2343 PIC X(11)   VALUE '           '.                 0547276
194822     03  MNT2344 PIC X(11)   VALUE '           '.                 0547276
194824     03  MNT2345 PIC X(11)   VALUE '           '.                 0547276
194826     03  MNT2346 PIC X(11)   VALUE '           '.                 0547276
194828     03  MNT2347 PIC X(11)   VALUE '0198409P  C'.                 0727675
194830     03  MNT2348 PIC X(11)   VALUE '0199302P  C'.                 0727675
194832     03  MNT2349 PIC X(11)   VALUE '0199509P  C'.                 0727675
194834     03  MNT2350 PIC X(11)   VALUE '0200402P  C'.                 0727675
194836     03  MNT2351 PIC X(11)   VALUE '0230002P Y '.                 0817665
194838     03  MNT2352 PIC X(11)   VALUE '0051802P Y '.                 0817665
194840     03  MNT2353 PIC X(11)   VALUE '0393301CS  '.                 0637636
194842     03  MNT2354 PIC X(11)   VALUE '0035802P   '.                 0927050
194844     03  MNT2355 PIC X(11)   VALUE '0028001C  N'.                 0927817
194846     03  MNT2356 PIC X(11)   VALUE '           '.                 1020116
194847     03  MNT2357 PIC X(11)   VALUE '0200601C  C'.                 1020116
194848     03  MNT2358 PIC X(11)   VALUE '0200708D  N'.                 1020116
194849     03  MNT2359 PIC X(11)   VALUE '0201502C  C'.                 1020116
194850     03  MNT2360 PIC X(11)   VALUE '0201702P YC'.                 1020116
194851     03  MNT2361 PIC X(11)   VALUE '0201902P YC'.                 1020116
194852     03  MNT2362 PIC X(11)   VALUE '           '.                 1020116
194853     03  MNT2363 PIC X(11)   VALUE '0202102P YC'.                 1020116
194860     03  MNT5001 PIC X(11)   VALUE '1588820CS  '.                 IMIB01A
194861     03  MNT5002 PIC X(11)   VALUE '1590804CS  '.                 IMIB01A
194862     03  MNT5003 PIC X(11)   VALUE '1591204CS  '.                 IMIB01A
194863     03  MNT5004 PIC X(11)   VALUE '1591603C   '.                 IMIB01A
194864     03  MNT5005 PIC X(11)   VALUE '1591904CS  '.                 IMIB01A
194865     03  MNT5006 PIC X(11)   VALUE '1592302CS  '.                 IMIB01A
194866     03  MNT5007 PIC X(11)   VALUE '1592501CS  '.                 IMIB01A
194867     03  MNT5008 PIC X(11)   VALUE '1592625CS  '.                 IMIB76
194868     03  MNT5009 PIC X(11)   VALUE '1595110CS  '.                 &I2806
194869     03  MNT5010 PIC X(11)   VALUE '1596101CS  '.                 &I2806
194870     03  MNT5011 PIC X(11)   VALUE '1596225CS  '.                 &I2806
194888 01  FILLER REDEFINES DDA-FILE-MAINT-TABLE.                       0547276
194890*    03  DMT-DATA OCCURS  2363 TIMES.                             1020116
194892     03  DMT-DATA OCCURS  2374 TIMES.                             IMIB01A
194900         05  DMT-TRAN-TRAILER.                                    0547276
194902             07  DMT-START       PIC 9(5).                        0547276
194904             07  DMT-LENGTH      PIC 99.                          0547276
194906             07  DMT-TYPE        PIC X.                           0547276
194908             07  DMT-CHK-OLD     PIC X.                           0547276
194910             07  DMT-ADD-SUB     PIC X.                           0817665
195112             07  DMT-ALLOW       PIC X.                           0547276
195150*                                                                 9915845
195200 01  MAINTENANCE-TABLE-COUNT.
195300     03  MANT-TABLE-ENTRIES      PIC S9(5) COMP-3 VALUE +2363.    1020116
195400     03  MANT-TABLE-ENTRIESX     PIC XXXX         VALUE '2363'.   1020116
195500     03  MANT-TABLE-INTL-ENTRIES PIC S9(5) COMP-3 VALUE +2363.    1020116
195600     03  MANT-TABLE-INTL-ENTRIESX    PIC XXXX     VALUE '2363'.   1020116
195700*    03  MANT-TABLE-USER-ENTRIES PIC S9(5) COMP-3 VALUE +2363.    1020116
195702     03  MANT-TABLE-USER-ENTRIES PIC S9(5) COMP-3 VALUE +2374.    IMIB01A
195800*    03  MANT-TABLE-USER-ENTRIESX    PIC XXXX     VALUE '2363'.   1020116
195802     03  MANT-TABLE-USER-ENTRIESX    PIC XXXX     VALUE '2374'.   IMIB01A
195900*                                                                 9915845
196000*----------------------------------------------------------------*9915845
196100*                                                                *9915845
196200*    THE ABOVE TABLE ENTRY FIELDS DEFINE THE BASE, INTERNATIONAL *9915845
196300*    AND USER DEFINED FIELDS.                                    *9915845
196400*                                                                *9915845
196500*    MANT-TABLE-ENTRIES(X)      = NUMBER OF BASE ENTRIES         *9915845
196600*    MANT-TABLE-INTL-ENTRIES(X) = SUM OF INTERNATIONAL AND BASE  *9915845
196700*    MANT-TABLE-USER-ENTRIES(X) = SUM OF USER, INTERNATIONAL,    *9915845
196800*                                 AND BASE                       *9915845
196900*                                                                *9915845
197000*    IF THE USER ADDS ENTRIES TO THE MAINTENANCE TABLE           *9915845
197100*    (FIELD NUMBERS OVER 5000 ADDED TO THE END OF THE TABLE):    *9915845
197200*      1.  ADD THE VALUE OF "MANT-TABLE-ENTRIES" TO THE USER     *9915845
197300*          ENTRIES.                                              *9915845
197400*      2.  ENTER THIS SUM IN "MANT-TABLE-USER-ENTRIES" AND       *9915845
197500*          "MANT-TABLE-USER-ENTRIESX".                           *9915845
197600*      3.  REPLACE THE NUMBER OF TIMES THAT "DMT-DATA" OCCURS    *9915845
197700*          WITH THE VALUE IN "MANT-TABLE-USER-ENTRIES".          *9915845
197800*                                                                *9915845
197900*    FIELD NUMBERS 4001 - 5000 ARE RESERVED FOR INTERNATIONAL    *9915845
198000*                                                                *9915845
198100*----------------------------------------------------------------*9915845
198200*                                                                 9915845
