*     * FO5238*12/05/11 JCTE PROYECTO UPGRADE SYSTEMAT
000100 01  ELEMENT-ID-TABLE.
000200     03  MNT0001 PIC X(07) VALUE   'IMA0009'.
000300     03  MNT0002 PIC X(07) VALUE   'IMA0010'.
000400     03  MNT0003 PIC X(07) VALUE   'IMA0011'.
000500     03  MNT0004 PIC X(07) VALUE   'IMA0012'.
000600     03  MNT0005 PIC X(07) VALUE   'IMA0036'.
000700     03  MNT0006 PIC X(07) VALUE   'IMA0036'.
000800     03  MNT0007 PIC X(07) VALUE   'IMA0036'.
000900     03  MNT0008 PIC X(07) VALUE   'IMA0037'.
001000     03  MNT0009 PIC X(07) VALUE   'IMA0110'.
001100     03  MNT0010 PIC X(07) VALUE   'IMA0038'.
001200     03  MNT0011 PIC X(07) VALUE   'IMA0039'.
001300     03  MNT0012 PIC X(07) VALUE   'IMA0040'.
001400     03  MNT0013 PIC X(07) VALUE   'IMA0041'.
001500     03  MNT0014 PIC X(07) VALUE   'IMA0042'.
001600     03  MNT0015 PIC X(07) VALUE   'IMA0043'.
001700     03  MNT0016 PIC X(07) VALUE   'IMA0045'.
001800     03  MNT0017 PIC X(07) VALUE   'IMA0047'.
001900     03  MNT0018 PIC X(07) VALUE   'IMA0046'.
002000     03  MNT0019 PIC X(07) VALUE   'IMA0048'.
002100     03  MNT0020 PIC X(07) VALUE   'IMA0049'.
002200     03  MNT0021 PIC X(07) VALUE   'IMA0050'.
002300     03  MNT0022 PIC X(07) VALUE   'IMA0051'.
002400     03  MNT0023 PIC X(07) VALUE   'IMA9083'.
002500     03  MNT0024 PIC X(07) VALUE   'IMA0055'.
002600     03  MNT0025 PIC X(07) VALUE   'IMA0056'.
002700     03  MNT0026 PIC X(07) VALUE   'IMA0057'.
002800     03  MNT0027 PIC X(07) VALUE   'IMA0058'.
002900     03  MNT0028 PIC X(07) VALUE   'IMA0061'.
003000     03  MNT0029 PIC X(07) VALUE   'IMA0067'.
003100     03  MNT0030 PIC X(07) VALUE   'IMA0068'.
003200     03  MNT0031 PIC X(07) VALUE   'IMA0082'.
003300     03  MNT0032 PIC X(07) VALUE   'IMA0083'.
003400     03  MNT0033 PIC X(07) VALUE   'IMA0085'.
003500     03  MNT0034 PIC X(07) VALUE   'IMA0086'.
003600     03  MNT0035 PIC X(07) VALUE   'IMA0087'.
003700     03  MNT0036 PIC X(07) VALUE   'IMA0088'.
003800     03  MNT0037 PIC X(07) VALUE   'IMA0089'.
003900     03  MNT0038 PIC X(07) VALUE   'IMA0090'.
004000     03  MNT0039 PIC X(07) VALUE   'IMA0113'.
004100     03  MNT0040 PIC X(07) VALUE   'IMA9086'.
004200     03  MNT0041 PIC X(07) VALUE   'IMA0119'.
004300     03  MNT0042 PIC X(07) VALUE   'IMA0118'.
004400     03  MNT0043 PIC X(07) VALUE   'IMA0103'.
004500     03  MNT0044 PIC X(07) VALUE   'IMA0745'.
004600     03  MNT0045 PIC X(07) VALUE   'IMA0746'.
004700     03  MNT0046 PIC X(07) VALUE   'IMA0747'.
004800     03  MNT0047 PIC X(07) VALUE   'IMA0745'.
004900     03  MNT0048 PIC X(07) VALUE   'IMA0746'.
005000     03  MNT0049 PIC X(07) VALUE   'IMA0747'.
005100     03  MNT0050 PIC X(07) VALUE   'IMA0745'.
005200     03  MNT0051 PIC X(07) VALUE   'IMA0746'.
005300     03  MNT0052 PIC X(07) VALUE   'IMA0747'.
005400     03  MNT0053 PIC X(07) VALUE   'IMA0745'.
005500     03  MNT0054 PIC X(07) VALUE   'IMA0746'.
005600     03  MNT0055 PIC X(07) VALUE   'IMA0747'.
005700     03  MNT0056 PIC X(07) VALUE   'IMA0745'.
005800     03  MNT0057 PIC X(07) VALUE   'IMA0746'.
005900     03  MNT0058 PIC X(07) VALUE   'IMA0747'.
006000     03  MNT0059 PIC X(07) VALUE   'IMA0745'.
006100     03  MNT0060 PIC X(07) VALUE   'IMA0746'.
006200     03  MNT0061 PIC X(07) VALUE   'IMA0747'.
006300     03  MNT0062 PIC X(07) VALUE   'IMA0745'.
006400     03  MNT0063 PIC X(07) VALUE   'IMA0746'.
006500     03  MNT0064 PIC X(07) VALUE   'IMA0747'.
006600     03  MNT0065 PIC X(07) VALUE   'IMA0745'.
006700     03  MNT0066 PIC X(07) VALUE   'IMA0746'.
006800     03  MNT0067 PIC X(07) VALUE   'IMA0747'.
006900     03  MNT0068 PIC X(07) VALUE   'IMA0745'.
007000     03  MNT0069 PIC X(07) VALUE   'IMA0746'.
007100     03  MNT0070 PIC X(07) VALUE   'IMA0747'.
007200     03  MNT0071 PIC X(07) VALUE   'IMA0745'.
007300     03  MNT0072 PIC X(07) VALUE   'IMA0746'.
007400     03  MNT0073 PIC X(07) VALUE   'IMA0747'.
007500     03  MNT0074 PIC X(07) VALUE   'IMA0745'.
007600     03  MNT0075 PIC X(07) VALUE   'IMA0746'.
007700     03  MNT0076 PIC X(07) VALUE   'IMA0747'.
007800     03  MNT0077 PIC X(07) VALUE   'IMA0745'.
007900     03  MNT0078 PIC X(07) VALUE   'IMA0746'.
008000     03  MNT0079 PIC X(07) VALUE   'IMA0747'.
008100     03  MNT0080 PIC X(07) VALUE   'IMA0112'.
008200     03  MNT0081 PIC X(07) VALUE   'IMA0131'.
008300     03  MNT0082 PIC X(07) VALUE   'IMA0129'.
008400     03  MNT0083 PIC X(07) VALUE   'IMA0949'.
008500     03  MNT0084 PIC X(07) VALUE   'IMA0137'.
008600     03  MNT0085 PIC X(07) VALUE   'IMA0138'.
008700     03  MNT0086 PIC X(07) VALUE   'IMA0139'.
008800     03  MNT0087 PIC X(07) VALUE   'IMA0140'.
008900     03  MNT0088 PIC X(07) VALUE   'IMA0141'.
009000     03  MNT0089 PIC X(07) VALUE   'IMA0142'.
009100     03  MNT0090 PIC X(07) VALUE   'IMA0143'.
009200     03  MNT0091 PIC X(07) VALUE   'IMA9002'.
009300     03  MNT0092 PIC X(07) VALUE   'IMA9003'.
009400     03  MNT0093 PIC X(07) VALUE   'IMA9004'.
009500     03  MNT0094 PIC X(07) VALUE   'IMA9005'.
009600     03  MNT0095 PIC X(07) VALUE   'IMA9091'.
009700     03  MNT0096 PIC X(07) VALUE   'IMA9092'.
009800     03  MNT0097 PIC X(07) VALUE   'IMA0215'.
009900     03  MNT0098 PIC X(07) VALUE   'IMA9093'.
010000     03  MNT0099 PIC X(07) VALUE   'IMA9006'.
010100     03  MNT0100 PIC X(07) VALUE   'IMA9098'.
010200     03  MNT0101 PIC X(07) VALUE   'IMA0182'.
010300     03  MNT0102 PIC X(07) VALUE   'IMA0184'.
010400     03  MNT0103 PIC X(07) VALUE   'IMA0071'.
010500     03  MNT0104 PIC X(07) VALUE   'IMA9100'.
010600     03  MNT0105 PIC X(07) VALUE   'IMA9101'.
010700     03  MNT0106 PIC X(07) VALUE   'IMA0271'.
010800     03  MNT0107 PIC X(07) VALUE   'IMA0205'.
010900     03  MNT0108 PIC X(07) VALUE   'IMA0207'.
011000     03  MNT0109 PIC X(07) VALUE   'IMA0208'.
011100     03  MNT0110 PIC X(07) VALUE   'IMA0227'.
011200     03  MNT0111 PIC X(07) VALUE   'IMA0228'.
011300     03  MNT0112 PIC X(07) VALUE   'IMA0233'.
011400     03  MNT0113 PIC X(07) VALUE   'IMA0234'.
011500     03  MNT0114 PIC X(07) VALUE   'IMA0247'.
011600     03  MNT0115 PIC X(07) VALUE   'IMA0236'.
011700     03  MNT0116 PIC X(07) VALUE   'IMA0237'.
011800     03  MNT0117 PIC X(07) VALUE   'IMA0238'.
011900     03  MNT0118 PIC X(07) VALUE   'IMA0239'.
012000     03  MNT0119 PIC X(07) VALUE   'IMA0240'.
012100     03  MNT0120 PIC X(07) VALUE   'IMA0241'.
012200     03  MNT0121 PIC X(07) VALUE   'IMA0242'.
012300     03  MNT0122 PIC X(07) VALUE   'IMA0243'.
012400     03  MNT0123 PIC X(07) VALUE   'IMA0244'.
012500     03  MNT0124 PIC X(07) VALUE   'IMA0245'.
012600     03  MNT0125 PIC X(07) VALUE   'IMA0246'.
012700     03  MNT0126 PIC X(07) VALUE   'IMA0248'.
012800     03  MNT0127 PIC X(07) VALUE   'IMA0249'.
012900     03  MNT0128 PIC X(07) VALUE   'IMA0250'.
013000     03  MNT0129 PIC X(07) VALUE   'IMA0251'.
013100     03  MNT0130 PIC X(07) VALUE   'IMA0230'.
013200     03  MNT0131 PIC X(07) VALUE   'IMA0269'.
013300     03  MNT0132 PIC X(07) VALUE   'IMA0254'.
013400     03  MNT0133 PIC X(07) VALUE   'IMA9106'.
013500     03  MNT0134 PIC X(07) VALUE   'IMA0259'.
013600     03  MNT0135 PIC X(07) VALUE   'IMA0260'.
013700     03  MNT0136 PIC X(07) VALUE   'IMA0261'.
013800     03  MNT0137 PIC X(07) VALUE   'IMA0262'.
013900     03  MNT0138 PIC X(07) VALUE   'IMA0263'.
014000     03  MNT0139 PIC X(07) VALUE   'IMA0264'.
014100     03  MNT0140 PIC X(07) VALUE   'IMA0265'.
014200     03  MNT0141 PIC X(07) VALUE   'IMA0266'.
014300     03  MNT0142 PIC X(07) VALUE   'IMA0267'.
014400     03  MNT0143 PIC X(07) VALUE   'IMA0268'.
014500     03  MNT0144 PIC X(07) VALUE   'IMA9011'.
014600     03  MNT0145 PIC X(07) VALUE   'IMA0281'.
014700     03  MNT0146 PIC X(07) VALUE   'IMA0282'.
014800     03  MNT0147 PIC X(07) VALUE   'IMA0283'.
014900     03  MNT0148 PIC X(07) VALUE   'IMA0284'.
015000     03  MNT0149 PIC X(07) VALUE   'IMA0285'.
015100     03  MNT0150 PIC X(07) VALUE   'IMA0286'.
015200     03  MNT0151 PIC X(07) VALUE   'IMA9110'.
015300     03  MNT0152 PIC X(07) VALUE   'IMA0289'.
015400     03  MNT0153 PIC X(07) VALUE   'IMA0290'.
015500     03  MNT0154 PIC X(07) VALUE   'IMA0291'.
015600     03  MNT0155 PIC X(07) VALUE   'IMA0292'.
015700     03  MNT0156 PIC X(07) VALUE   'IMA0293'.
015800     03  MNT0157 PIC X(07) VALUE   'IMA9112'.
015900     03  MNT0158 PIC X(07) VALUE   'IMA0299'.
016000     03  MNT0159 PIC X(07) VALUE   'IMA0300'.
016100     03  MNT0160 PIC X(07) VALUE   'IMA0302'.
016200     03  MNT0161 PIC X(07) VALUE   'IMA0303'.
016300     03  MNT0162 PIC X(07) VALUE   'IMA0304'.
016400     03  MNT0163 PIC X(07) VALUE   'IMA0305'.
016500     03  MNT0164 PIC X(07) VALUE   'IMA0306'.
016600     03  MNT0165 PIC X(07) VALUE   'IMA0307'.
016700     03  MNT0166 PIC X(07) VALUE   'IMA0308'.
016800     03  MNT0167 PIC X(07) VALUE   'IMA0915'.
016900     03  MNT0168 PIC X(07) VALUE   'IMA0916'.
017000     03  MNT0169 PIC X(07) VALUE   'IMA0917'.
017100     03  MNT0170 PIC X(07) VALUE   'IMA0918'.
017200     03  MNT0171 PIC X(07) VALUE   'IMA0919'.
017300     03  MNT0172 PIC X(07) VALUE   'IMA0920'.
017400     03  MNT0173 PIC X(07) VALUE   'IMA0921'.
017500     03  MNT0174 PIC X(07) VALUE   'IMA0922'.
017600     03  MNT0175 PIC X(07) VALUE   'IMA0923'.
017700     03  MNT0176 PIC X(07) VALUE   'IMA0309'.
017800     03  MNT0177 PIC X(07) VALUE   'IMA0310'.
017900     03  MNT0178 PIC X(07) VALUE   'IMA0313'.
018000     03  MNT0179 PIC X(07) VALUE   'IMA0314'.
018100     03  MNT0180 PIC X(07) VALUE   'IMA0320'.
018200     03  MNT0181 PIC X(07) VALUE   'IMA0321'.
018300     03  MNT0182 PIC X(07) VALUE   'IMA0322'.
018400     03  MNT0183 PIC X(07) VALUE   'IMA0323'.
018500     03  MNT0184 PIC X(07) VALUE   'IMA0933'.
018600     03  MNT0185 PIC X(07) VALUE   'IMA0331'.
018700     03  MNT0186 PIC X(07) VALUE   'IMA0332'.
018800     03  MNT0187 PIC X(07) VALUE   'IMA0333'.
018900     03  MNT0188 PIC X(07) VALUE   'IMA0335'.
019000     03  MNT0189 PIC X(07) VALUE   'IMA0336'.
019100     03  MNT0190 PIC X(07) VALUE   'IMA0337'.
019200     03  MNT0191 PIC X(07) VALUE   'IMA0339'.
019300     03  MNT0192 PIC X(07) VALUE   'IMA0340'.
019400     03  MNT0193 PIC X(07) VALUE   'IMA0341'.
019500     03  MNT0194 PIC X(07) VALUE   'IMA0924'.
019600     03  MNT0195 PIC X(07) VALUE   'IMA0925'.
019700     03  MNT0196 PIC X(07) VALUE   'IMA0926'.
019800     03  MNT0197 PIC X(07) VALUE   'IMA0927'.
019900     03  MNT0198 PIC X(07) VALUE   'IMA0928'.
020000     03  MNT0199 PIC X(07) VALUE   'IMA0929'.
020100     03  MNT0200 PIC X(07) VALUE   'IMA0930'.
020200     03  MNT0201 PIC X(07) VALUE   'IMA0931'.
020300     03  MNT0202 PIC X(07) VALUE   'IMA0342'.
020400     03  MNT0203 PIC X(07) VALUE   'IMA0343'.
020500     03  MNT0204 PIC X(07) VALUE   'IMA0346'.
020600     03  MNT0205 PIC X(07) VALUE   'IMA0347'.
020700     03  MNT0206 PIC X(07) VALUE   'IMA0348'.
020800     03  MNT0207 PIC X(07) VALUE   'IMA0349'.
020900     03  MNT0208 PIC X(07) VALUE   'IMA0350'.
021000     03  MNT0209 PIC X(07) VALUE   'IMA0351'.
021100     03  MNT0210 PIC X(07) VALUE   'IMA0360'.
021200     03  MNT0211 PIC X(07) VALUE   'IMA0361'.
021300     03  MNT0212 PIC X(07) VALUE   'IMA0362'.
021400     03  MNT0213 PIC X(07) VALUE   'IMA0373'.
021500     03  MNT0214 PIC X(07) VALUE   'IMA0375'.
021600     03  MNT0215 PIC X(07) VALUE   'IMA0376'.
021700     03  MNT0216 PIC X(07) VALUE   'IMA0377'.
021800     03  MNT0217 PIC X(07) VALUE   'IMA0378'.
021900     03  MNT0218 PIC X(07) VALUE   'IMA0379'.
022000     03  MNT0219 PIC X(07) VALUE   'IMA0380'.
022100     03  MNT0220 PIC X(07) VALUE   'IMA0381'.
022200     03  MNT0221 PIC X(07) VALUE   'IMA0382'.
022300     03  MNT0222 PIC X(07) VALUE   'IMA0383'.
022400     03  MNT0223 PIC X(07) VALUE   'IMA0384'.
022500     03  MNT0224 PIC X(07) VALUE   'IMA0385'.
022600     03  MNT0225 PIC X(07) VALUE   'IMA0395'.
022700     03  MNT0226 PIC X(07) VALUE   'IMA0396'.
022800     03  MNT0227 PIC X(07) VALUE   'IMA0397'.
022900     03  MNT0228 PIC X(07) VALUE   'IMA0395'.
023000     03  MNT0229 PIC X(07) VALUE   'IMA0396'.
023100     03  MNT0230 PIC X(07) VALUE   'IMA0397'.
023200     03  MNT0231 PIC X(07) VALUE   'IMA0395'.
023300     03  MNT0232 PIC X(07) VALUE   'IMA0396'.
023400     03  MNT0233 PIC X(07) VALUE   'IMA0397'.
023500     03  MNT0234 PIC X(07) VALUE   'IMA0395'.
023600     03  MNT0235 PIC X(07) VALUE   'IMA0396'.
023700     03  MNT0236 PIC X(07) VALUE   'IMA0397'.
023800     03  MNT0237 PIC X(07) VALUE   'IMA0395'.
023900     03  MNT0238 PIC X(07) VALUE   'IMA0396'.
024000     03  MNT0239 PIC X(07) VALUE   'IMA0397'.
024100     03  MNT0240 PIC X(07) VALUE   'IMA0395'.
024200     03  MNT0241 PIC X(07) VALUE   'IMA0396'.
024300     03  MNT0242 PIC X(07) VALUE   'IMA0397'.
024400     03  MNT0243 PIC X(07) VALUE   'IMA0324'.
024500     03  MNT0244 PIC X(07) VALUE   'IMA0325'.
024600     03  MNT0245 PIC X(07) VALUE   'IMA0326'.
024700     03  MNT0246 PIC X(07) VALUE   'IMA0327'.
024800     03  MNT0247 PIC X(07) VALUE   'IMA0353'.
024900     03  MNT0248 PIC X(07) VALUE   'IMA0354'.
025000     03  MNT0249 PIC X(07) VALUE   'IMA0355'.
025100     03  MNT0250 PIC X(07) VALUE   'IMA0374'.
025200     03  MNT0251 PIC X(07) VALUE   'IMA0392'.
025300     03  MNT0252 PIC X(07) VALUE   'IMA0549'.
025400     03  MNT0253 PIC X(07) VALUE   'IMA0430'.
025500     03  MNT0254 PIC X(07) VALUE   'IMA0431'.
025600     03  MNT0255 PIC X(07) VALUE   'IMA0386'.
025700     03  MNT0256 PIC X(07) VALUE   'IMA0434'.
025800     03  MNT0257 PIC X(07) VALUE   'IMA0435'.
025900     03  MNT0258 PIC X(07) VALUE   'IMA0436'.
026000     03  MNT0259 PIC X(07) VALUE   'IMA0437'.
026100     03  MNT0260 PIC X(07) VALUE   'IMA0438'.
026200     03  MNT0261 PIC X(07) VALUE   'IMA0084'.
026300     03  MNT0262 PIC X(07) VALUE   'IMA0328'.
026400     03  MNT0263 PIC X(07) VALUE   'IMA0356'.
026500     03  MNT0264 PIC X(07) VALUE   'IMA9095'.
026600     03  MNT0265 PIC X(07) VALUE   'IMA0443'.
026700     03  MNT0266 PIC X(07) VALUE   'IMA0445'.
026800     03  MNT0267 PIC X(07) VALUE   'IMA0446'.
026900     03  MNT0268 PIC X(07) VALUE   'IMA0447'.
027000     03  MNT0269 PIC X(07) VALUE   'IMA0448'.
027100     03  MNT0270 PIC X(07) VALUE   'IMA0449'.
027200     03  MNT0271 PIC X(07) VALUE   'IMA0450'.
027300     03  MNT0272 PIC X(07) VALUE   'IMA0451'.
027400     03  MNT0273 PIC X(07) VALUE   'IMA0452'.
027500     03  MNT0274 PIC X(07) VALUE   'IMA0453'.
027600     03  MNT0275 PIC X(07) VALUE   'IMA9020'.
027700     03  MNT0276 PIC X(07) VALUE   'IMA0657'.
027800     03  MNT0277 PIC X(07) VALUE   'IMA0658'.
027900     03  MNT0278 PIC X(07) VALUE   'IMA0659'.
028000     03  MNT0279 PIC X(07) VALUE   'IMA0667'.
028100     03  MNT0280 PIC X(07) VALUE   'IMA0668'.
028200     03  MNT0281 PIC X(07) VALUE   'IMA0669'.
028300     03  MNT0282 PIC X(07) VALUE   'IMA9025'.
028400     03  MNT0283 PIC X(07) VALUE   'IMA0573'.
028500     03  MNT0284 PIC X(07) VALUE   'IMA0574'.
028600     03  MNT0285 PIC X(07) VALUE   'IMA0465'.
028700     03  MNT0286 PIC X(07) VALUE   'IMA0466'.
028800     03  MNT0287 PIC X(07) VALUE   'IMA0467'.
028900     03  MNT0288 PIC X(07) VALUE   'IMA0468'.
029000     03  MNT0289 PIC X(07) VALUE   'IMA0469'.
029100     03  MNT0290 PIC X(07) VALUE   'IMA0471'.
029200     03  MNT0291 PIC X(07) VALUE   'IMA0472'.
029300     03  MNT0292 PIC X(07) VALUE   'IMA0473'.
029400     03  MNT0293 PIC X(07) VALUE   'IMA0474'.
029500     03  MNT0294 PIC X(07) VALUE   'IMA0475'.
029600     03  MNT0295 PIC X(07) VALUE   'IMA9139'.
029700     03  MNT0296 PIC X(07) VALUE   'IMA9140'.
029800     03  MNT0297 PIC X(07) VALUE   'IMA0482'.
029900     03  MNT0298 PIC X(07) VALUE   'IMA0460'.
030000     03  MNT0299 PIC X(07) VALUE   'IMA9141'.
030100     03  MNT0300 PIC X(07) VALUE   'IMA9142'.
030200     03  MNT0301 PIC X(07) VALUE   'IMA9143'.
030300     03  MNT0302 PIC X(07) VALUE   'IMA9022'.
030400     03  MNT0303 PIC X(07) VALUE   'IMA9023'.
030500     03  MNT0304 PIC X(07) VALUE   'IMA9149'.
030600     03  MNT0305 PIC X(07) VALUE   'IMA0572'.
030700     03  MNT0306 PIC X(07) VALUE   'IMA0523'.
030800     03  MNT0307 PIC X(07) VALUE   'IMA0524'.
030900     03  MNT0308 PIC X(07) VALUE   'IMA0652'.
031000     03  MNT0309 PIC X(07) VALUE   'IMA0504'.
031100     03  MNT0310 PIC X(07) VALUE   'IMA0505'.
031200     03  MNT0311 PIC X(07) VALUE   'IMA0506'.
031300     03  MNT0312 PIC X(07) VALUE   'IMA0507'.
031400     03  MNT0313 PIC X(07) VALUE   'IMA0511'.
031500     03  MNT0314 PIC X(07) VALUE   'IMA0512'.
031600     03  MNT0315 PIC X(07) VALUE   'IMA0513'.
031700     03  MNT0316 PIC X(07) VALUE   'IMA0514'.
031800     03  MNT0317 PIC X(07) VALUE   'IMA0515'.
031900     03  MNT0318 PIC X(07) VALUE   'IMA0516'.
032000     03  MNT0319 PIC X(07) VALUE   'IMA0517'.
032100     03  MNT0320 PIC X(07) VALUE   'IMA0518'.
032200     03  MNT0321 PIC X(07) VALUE   'IMA0532'.
032300     03  MNT0322 PIC X(07) VALUE   'IMA0533'.
032400     03  MNT0323 PIC X(07) VALUE   'IMA0542'.
032500     03  MNT0324 PIC X(07) VALUE   'IMA0543'.
032600     03  MNT0325 PIC X(07) VALUE   'IMA0124'.
032700     03  MNT0326 PIC X(07) VALUE   'IMA0125'.
032800     03  MNT0327 PIC X(07) VALUE   'IMA0534'.
032900     03  MNT0328 PIC X(07) VALUE   'IMA0535'.
033000     03  MNT0329 PIC X(07) VALUE   'IMA0536'.
033100     03  MNT0330 PIC X(07) VALUE   'IMA0537'.
033200     03  MNT0331 PIC X(07) VALUE   'IMA0546'.
033300     03  MNT0332 PIC X(07) VALUE   'IMA0538'.
033400     03  MNT0333 PIC X(07) VALUE   'IMA0539'.
033500     03  MNT0334 PIC X(07) VALUE   'IMA0540'.
033600     03  MNT0335 PIC X(07) VALUE   'IMA0541'.
033700     03  MNT0336 PIC X(07) VALUE   'IMA0461'.
033800     03  MNT0337 PIC X(07) VALUE   'IMA0561'.
033900     03  MNT0338 PIC X(07) VALUE   'IMA0562'.
034000     03  MNT0339 PIC X(07) VALUE   'IMA0563'.
034100     03  MNT0340 PIC X(07) VALUE   'IMA0564'.
034200     03  MNT0341 PIC X(07) VALUE   'IMA0565'.
034300     03  MNT0342 PIC X(07) VALUE   'IMA0566'.
034400     03  MNT0343 PIC X(07) VALUE   'IMA0567'.
034500     03  MNT0344 PIC X(07) VALUE   'IMA0525'.
034600     03  MNT0345 PIC X(07) VALUE   'IMA0526'.
034700     03  MNT0346 PIC X(07) VALUE   'IMA0455'.
034800     03  MNT0347 PIC X(07) VALUE   'IMA0456'.
034900     03  MNT0348 PIC X(07) VALUE   '       '.
035000     03  MNT0349 PIC X(07) VALUE   'IMA0571'.
035100     03  MNT0350 PIC X(07) VALUE   'IMA0457'.
035200     03  MNT0351 PIC X(07) VALUE   'IMA0458'.
035300     03  MNT0352 PIC X(07) VALUE   'IMA0577'.
035400     03  MNT0353 PIC X(07) VALUE   'IMA0578'.
035500     03  MNT0354 PIC X(07) VALUE   'IMA0579'.
035600     03  MNT0355 PIC X(07) VALUE   'IMA0580'.
035700     03  MNT0356 PIC X(07) VALUE   'IMA0581'.
035800     03  MNT0357 PIC X(07) VALUE   'IMA0582'.
035900     03  MNT0358 PIC X(07) VALUE   'IMA0583'.
036000     03  MNT0359 PIC X(07) VALUE   'IMA0584'.
036100     03  MNT0360 PIC X(07) VALUE   'IMA0653'.
036200     03  MNT0361 PIC X(07) VALUE   'IMA0585'.
036300     03  MNT0362 PIC X(07) VALUE   'IMA0586'.
036400     03  MNT0363 PIC X(07) VALUE   'IMA0587'.
036500     03  MNT0364 PIC X(07) VALUE   'IMA0588'.
036600     03  MNT0365 PIC X(07) VALUE   'IMA0589'.
036700     03  MNT0366 PIC X(07) VALUE   'IMA0592'.
036800     03  MNT0367 PIC X(07) VALUE   'IMA0593'.
036900     03  MNT0368 PIC X(07) VALUE   'IMA0594'.
037000     03  MNT0369 PIC X(07) VALUE   'IMA0595'.
037100     03  MNT0370 PIC X(07) VALUE   'IMA0596'.
037200     03  MNT0371 PIC X(07) VALUE   'IMA0597'.
037300     03  MNT0372 PIC X(07) VALUE   'IMA0598'.
037400     03  MNT0373 PIC X(07) VALUE   'IMA0655'.
037500     03  MNT0374 PIC X(07) VALUE   'IMA0600'.
037600     03  MNT0375 PIC X(07) VALUE   'IMA0601'.
037700     03  MNT0376 PIC X(07) VALUE   'IMA0602'.
037800     03  MNT0377 PIC X(07) VALUE   'IMA0604'.
037900     03  MNT0378 PIC X(07) VALUE   'IMA0605'.
038000     03  MNT0379 PIC X(07) VALUE   'IMA0606'.
038100     03  MNT0380 PIC X(07) VALUE   'IMA0607'.
038200     03  MNT0381 PIC X(07) VALUE   'IMA0608'.
038300     03  MNT0382 PIC X(07) VALUE   'IMA0613'.
038400     03  MNT0383 PIC X(07) VALUE   'IMA0520'.
038500     03  MNT0384 PIC X(07) VALUE   'IMA0521'.
038600     03  MNT0385 PIC X(07) VALUE   'IMA0522'.
038700     03  MNT0386 PIC X(07) VALUE   'IMA0628'.
038800     03  MNT0387 PIC X(07) VALUE   'IMA9162'.
038900     03  MNT0388 PIC X(07) VALUE   'IMA0632'.
039000     03  MNT0389 PIC X(07) VALUE   'IMA0633'.
039100     03  MNT0390 PIC X(07) VALUE   'IMA0634'.
039200     03  MNT0391 PIC X(07) VALUE   'IMA0635'.
039300     03  MNT0392 PIC X(07) VALUE   'IMA0636'.
039400     03  MNT0393 PIC X(07) VALUE   'IMA0637'.
039500     03  MNT0394 PIC X(07) VALUE   'IMA0638'.
039600     03  MNT0395 PIC X(07) VALUE   'IMA9040'.
039700     03  MNT0396 PIC X(07) VALUE   'IMA0691'.
039800     03  MNT0397 PIC X(07) VALUE   'IMA0692'.
039900     03  MNT0398 PIC X(07) VALUE   'IMA0693'.
040000     03  MNT0399 PIC X(07) VALUE   'IMA0694'.
040100     03  MNT0400 PIC X(07) VALUE   'IMA0695'.
040200     03  MNT0401 PIC X(07) VALUE   'IMA0697'.
040300     03  MNT0402 PIC X(07) VALUE   'IMA0698'.
040400     03  MNT0403 PIC X(07) VALUE   'IMA0699'.
040500     03  MNT0404 PIC X(07) VALUE   'IMA9175'.
040600     03  MNT0405 PIC X(07) VALUE   'IMA0706'.
040700     03  MNT0406 PIC X(07) VALUE   'IMA0707'.
040800     03  MNT0407 PIC X(07) VALUE   'IMA0708'.
040900     03  MNT0408 PIC X(07) VALUE   'IMA0709'.
041000     03  MNT0409 PIC X(07) VALUE   'IMA0710'.
041100     03  MNT0410 PIC X(07) VALUE   'IMA0711'.
041200     03  MNT0411 PIC X(07) VALUE   'IMA0712'.
041300     03  MNT0412 PIC X(07) VALUE   'IMA0713'.
041400     03  MNT0413 PIC X(07) VALUE   'IMA0714'.
041500     03  MNT0414 PIC X(07) VALUE   'IMA0715'.
041600     03  MNT0415 PIC X(07) VALUE   'IMA0716'.
041700     03  MNT0416 PIC X(07) VALUE   'IMA0717'.
041800     03  MNT0417 PIC X(07) VALUE   'IMA0718'.
041900     03  MNT0418 PIC X(07) VALUE   'IMA0719'.
042000     03  MNT0419 PIC X(07) VALUE   'IMA0720'.
042100     03  MNT0420 PIC X(07) VALUE   'IMA0721'.
042200     03  MNT0421 PIC X(07) VALUE   'IMA0722'.
042300     03  MNT0422 PIC X(07) VALUE   'IMA0843'.
042400     03  MNT0423 PIC X(07) VALUE   'IMA0845'.
042500     03  MNT0424 PIC X(07) VALUE   'IMA0846'.
042600     03  MNT0425 PIC X(07) VALUE   'IMA0847'.
042700     03  MNT0426 PIC X(07) VALUE   'IMA0848'.
042800     03  MNT0427 PIC X(07) VALUE   'IMA0849'.
042900     03  MNT0428 PIC X(07) VALUE   'IMA0850'.
043000     03  MNT0429 PIC X(07) VALUE   'IMA9204'.
043100     03  MNT0430 PIC X(07) VALUE   'IMA9131'.
043200     03  MNT0431 PIC X(07) VALUE   'IMA0423'.
043300     03  MNT0432 PIC X(07) VALUE   'IMA0425'.
043400     03  MNT0433 PIC X(07) VALUE   'IMA0426'.
043500     03  MNT0434 PIC X(07) VALUE   'IMA9133'.
043600     03  MNT0435 PIC X(07) VALUE   'IMA0729'.
043700     03  MNT0436 PIC X(07) VALUE   'IMA9179'.
043800     03  MNT0437 PIC X(07) VALUE   'IMA0731'.
043900     03  MNT0438 PIC X(07) VALUE   'IMA0732'.
044000     03  MNT0439 PIC X(07) VALUE   'IMA0733'.
044100     03  MNT0440 PIC X(07) VALUE   'IMA0734'.
044200     03  MNT0441 PIC X(07) VALUE   'IMA0739'.
044300     03  MNT0442 PIC X(07) VALUE   'IMA9183'.
044400     03  MNT0443 PIC X(07) VALUE   'IMA0743'.
044500     03  MNT0444 PIC X(07) VALUE   'IMA0744'.
044600     03  MNT0445 PIC X(07) VALUE   'IMA9182'.
044700     03  MNT0446 PIC X(07) VALUE   'IMA0735'.
044800     03  MNT0447 PIC X(07) VALUE   'IMA0728'.
044900     03  MNT0448 PIC X(07) VALUE   'IMA0092'.
045000     03  MNT0449 PIC X(07) VALUE   'IMA0093'.
045100     03  MNT0450 PIC X(07) VALUE   'IMA0094'.
045200     03  MNT0451 PIC X(07) VALUE   'IMA0095'.
045300     03  MNT0452 PIC X(07) VALUE   'IMA0096'.
045400     03  MNT0453 PIC X(07) VALUE   'IMA0097'.
045500     03  MNT0454 PIC X(07) VALUE   'IMA0098'.
045600     03  MNT0455 PIC X(07) VALUE   'IMA0099'.
045700     03  MNT0456 PIC X(07) VALUE   'IMA0100'.
045800     03  MNT0457 PIC X(07) VALUE   'IMA0101'.
045900     03  MNT0458 PIC X(07) VALUE   'IMA0104'.
046000     03  MNT0459 PIC X(07) VALUE   'IMA0105'.
046100     03  MNT0460 PIC X(07) VALUE   'IMA0120'.
046200     03  MNT0461 PIC X(07) VALUE   'IMA0121'.
046300     03  MNT0462 PIC X(07) VALUE   'IMA0122'.
046400     03  MNT0463 PIC X(07) VALUE   'IMA0123'.
046500     03  MNT0464 PIC X(07) VALUE   'IMA0107'.
046600     03  MNT0465 PIC X(07) VALUE   'IMA0108'.
046700     03  MNT0466 PIC X(07) VALUE   'IMA0109'.
046800     03  MNT0467 PIC X(07) VALUE   'IMA0102'.
046900     03  MNT0468 PIC X(07) VALUE   'IMA0221'.
047000     03  MNT0469 PIC X(07) VALUE   'IMA0222'.
047100     03  MNT0470 PIC X(07) VALUE   'IMA0223'.
047200     03  MNT0471 PIC X(07) VALUE   'IMA0844'.
047300     03  MNT0472 PIC X(07) VALUE   'IMA0851'.
047400     03  MNT0473 PIC X(07) VALUE   'IMA0852'.
047500     03  MNT0474 PIC X(07) VALUE   'IMA0853'.
047600     03  MNT0475 PIC X(07) VALUE   'IMA0854'.
047700     03  MNT0476 PIC X(07) VALUE   'IMA0059'.
047800     03  MNT0477 PIC X(07) VALUE   'IMA0060'.
047900     03  MNT0478 PIC X(07) VALUE   'IMA0387'.
048000     03  MNT0479 PIC X(07) VALUE   'IMA0388'.
048100     03  MNT0480 PIC X(07) VALUE   'IMA0389'.
048200     03  MNT0481 PIC X(07) VALUE   'IMA0390'.
048300     03  MNT0482 PIC X(07) VALUE   'IMA0642'.
048400     03  MNT0483 PIC X(07) VALUE   'IMA0643'.
048500     03  MNT0484 PIC X(07) VALUE   'IMA0644'.
048600     03  MNT0485 PIC X(07) VALUE   'IMA0301'.
048700     03  MNT0486 PIC X(07) VALUE   'IMA0334'.
048800     03  MNT0487 PIC X(07) VALUE   'IMA0440'.
048900     03  MNT0488 PIC X(07) VALUE   'IMA0440'.
049000     03  MNT0489 PIC X(07) VALUE   'IMA0440'.
049100     03  MNT0490 PIC X(07) VALUE   'IMA0440'.
049200     03  MNT0491 PIC X(07) VALUE   'IMA0440'.
049300     03  MNT0492 PIC X(07) VALUE   'IMA0440'.
049400     03  MNT0493 PIC X(07) VALUE   'IMA0440'.
049500     03  MNT0494 PIC X(07) VALUE   'IMA0440'.
049600     03  MNT0495 PIC X(07) VALUE   'IMA0749'.
049700     03  MNT0496 PIC X(07) VALUE   'IMA0750'.
049800     03  MNT0497 PIC X(07) VALUE   'IMA0751'.
049900     03  MNT0498 PIC X(07) VALUE   'IMA0752'.
050000     03  MNT0499 PIC X(07) VALUE   'IMA0753'.
050100     03  MNT0500 PIC X(07) VALUE   'IMA0754'.
050200     03  MNT0501 PIC X(07) VALUE   'IMA0778'.
050300     03  MNT0502 PIC X(07) VALUE   'IMA0779'.
050400     03  MNT0503 PIC X(07) VALUE   'IMA0780'.
050500     03  MNT0504 PIC X(07) VALUE   'IMA0781'.
050600     03  MNT0505 PIC X(07) VALUE   'IMA0787'.
050700     03  MNT0506 PIC X(07) VALUE   'IMA0788'.
050800     03  MNT0507 PIC X(07) VALUE   'IMA0789'.
050900     03  MNT0508 PIC X(07) VALUE   'IMA0790'.
051000     03  MNT0509 PIC X(07) VALUE   'IMA0791'.
051100     03  MNT0510 PIC X(07) VALUE   'IMA0792'.
051200     03  MNT0511 PIC X(07) VALUE   'IMA0793'.
051300     03  MNT0512 PIC X(07) VALUE   'IMA0794'.
051400     03  MNT0513 PIC X(07) VALUE   'IMA0796'.
051500     03  MNT0514 PIC X(07) VALUE   'IMA0797'.
051600     03  MNT0515 PIC X(07) VALUE   'IMA0798'.
051700     03  MNT0516 PIC X(07) VALUE   'IMA0799'.
051800     03  MNT0517 PIC X(07) VALUE   'IMA0800'.
051900     03  MNT0518 PIC X(07) VALUE   'IMA0803'.
052000     03  MNT0519 PIC X(07) VALUE   'IMA0804'.
052100     03  MNT0520 PIC X(07) VALUE   'IMA0817'.
052200     03  MNT0521 PIC X(07) VALUE   'IMA0806'.
052300     03  MNT0522 PIC X(07) VALUE   'IMA0808'.
052400     03  MNT0523 PIC X(07) VALUE   'IMA0809'.
052500     03  MNT0524 PIC X(07) VALUE   'IMA0810'.
052600     03  MNT0525 PIC X(07) VALUE   'IMA0811'.
052700     03  MNT0526 PIC X(07) VALUE   'IMA0812'.
052800     03  MNT0527 PIC X(07) VALUE   'IMA0816'.
052900     03  MNT0528 PIC X(07) VALUE   'IMA0819'.
053000     03  MNT0529 PIC X(07) VALUE   'IMA0821'.
053100     03  MNT0530 PIC X(07) VALUE   'IMA0786'.
053200     03  MNT0531 PIC X(07) VALUE   'IMA0822'.
053300     03  MNT0532 PIC X(07) VALUE   'IMA0823'.
053400     03  MNT0533 PIC X(07) VALUE   'IMA0824'.
053500     03  MNT0534 PIC X(07) VALUE   'IMA0825'.
053600     03  MNT0535 PIC X(07) VALUE   'IMA0826'.
053700     03  MNT0536 PIC X(07) VALUE   'IMA0827'.
053800     03  MNT0537 PIC X(07) VALUE   'IMA0784'.
053900     03  MNT0538 PIC X(07) VALUE   'IMA0756'.
054000     03  MNT0539 PIC X(07) VALUE   'IMA0757'.
054100     03  MNT0540 PIC X(07) VALUE   'IMA0758'.
054200     03  MNT0541 PIC X(07) VALUE   'IMA0759'.
054300     03  MNT0542 PIC X(07) VALUE   'IMA0760'.
054400     03  MNT0543 PIC X(07) VALUE   'IMA0828'.
054500     03  MNT0544 PIC X(07) VALUE   'IMA0829'.
054600     03  MNT0545 PIC X(07) VALUE   'IMA0830'.
054700     03  MNT0546 PIC X(07) VALUE   'IMA9049'.
054800     03  MNT0547 PIC X(07) VALUE   'IMA0833'.
054900     03  MNT0548 PIC X(07) VALUE   'IMA0834'.
055000     03  MNT0549 PIC X(07) VALUE   'IMA0835'.
055100     03  MNT0550 PIC X(07) VALUE   'IMA0839'.
055200     03  MNT0551 PIC X(07) VALUE   'IMA0840'.
055300     03  MNT0552 PIC X(07) VALUE   'IMA0841'.
055400     03  MNT0553 PIC X(07) VALUE   'IMA0842'.
055500     03  MNT0554 PIC X(07) VALUE   'IMA0106'.
055600     03  MNT0555 PIC X(07) VALUE   'IMA0393'.
055700     03  MNT0556 PIC X(07) VALUE   'IMA0070'.
055800     03  MNT0557 PIC X(07) VALUE   'IMA0934'.
055900     03  MNT0558 PIC X(07) VALUE   'IMA0935'.
056000     03  MNT0559 PIC X(07) VALUE   'IMA0069'.
056100     03  MNT0560 PIC X(07) VALUE   'IMA0470'.
056200     03  MNT0561 PIC X(07) VALUE   'IMA0229'.
056300     03  MNT0562 PIC X(07) VALUE   'IMA0231'.
056400     03  MNT0563 PIC X(07) VALUE   'IMA0232'.
056500     03  MNT0564 PIC X(07) VALUE   'IMA0270'.
056600     03  MNT0565 PIC X(07) VALUE   'IMA0363'.
056700     03  MNT0566 PIC X(07) VALUE   'IMA0364'.
056800     03  MNT0567 PIC X(07) VALUE   'IMA0365'.
056900     03  MNT0568 PIC X(07) VALUE   'IMA0366'.
057000     03  MNT0569 PIC X(07) VALUE   'IMA0367'.
057100     03  MNT0570 PIC X(07) VALUE   'IMA9105'.
057200     03  MNT0571 PIC X(07) VALUE   'IMA0252'.
057300     03  MNT0572 PIC X(07) VALUE   'IMA0253'.
057400     03  MNT0573 PIC X(07) VALUE   'IMA9102'.
057500     03  MNT0574 PIC X(07) VALUE   'IMA0352'.
057600     03  MNT0575 PIC X(07) VALUE   'IMA0645'.
057700     03  MNT0576 PIC X(07) VALUE   'IMA0646'.
057800     03  MNT0577 PIC X(07) VALUE   'IMA0647'.
057900     03  MNT0578 PIC X(07) VALUE   'IMA0648'.
058000     03  MNT0579 PIC X(07) VALUE   'IMA0649'.
058100     03  MNT0580 PIC X(07) VALUE   'IMA0645'.
058200     03  MNT0581 PIC X(07) VALUE   'IMA0646'.
058300     03  MNT0582 PIC X(07) VALUE   'IMA0647'.
058400     03  MNT0583 PIC X(07) VALUE   'IMA0648'.
058500     03  MNT0584 PIC X(07) VALUE   'IMA0649'.
058600     03  MNT0585 PIC X(07) VALUE   'IMA0645'.
058700     03  MNT0586 PIC X(07) VALUE   'IMA0646'.
058800     03  MNT0587 PIC X(07) VALUE   'IMA0647'.
058900     03  MNT0588 PIC X(07) VALUE   'IMA0648'.
059000     03  MNT0589 PIC X(07) VALUE   'IMA0649'.
059100     03  MNT0590 PIC X(07) VALUE   'IMA0645'.
059200     03  MNT0591 PIC X(07) VALUE   'IMA0646'.
059300     03  MNT0592 PIC X(07) VALUE   'IMA0647'.
059400     03  MNT0593 PIC X(07) VALUE   'IMA0648'.
059500     03  MNT0594 PIC X(07) VALUE   'IMA0649'.
059600     03  MNT0595 PIC X(07) VALUE   'IMA0645'.
059700     03  MNT0596 PIC X(07) VALUE   'IMA0646'.
059800     03  MNT0597 PIC X(07) VALUE   'IMA0647'.
059900     03  MNT0598 PIC X(07) VALUE   'IMA0648'.
060000     03  MNT0599 PIC X(07) VALUE   'IMA0649'.
060100     03  MNT0600 PIC X(07) VALUE   'IMA0645'.
060200     03  MNT0601 PIC X(07) VALUE   'IMA0646'.
060300     03  MNT0602 PIC X(07) VALUE   'IMA0647'.
060400     03  MNT0603 PIC X(07) VALUE   'IMA0648'.
060500     03  MNT0604 PIC X(07) VALUE   'IMA0649'.
060600     03  MNT0605 PIC X(07) VALUE   'IMA0645'.
060700     03  MNT0606 PIC X(07) VALUE   'IMA0646'.
060800     03  MNT0607 PIC X(07) VALUE   'IMA0647'.
060900     03  MNT0608 PIC X(07) VALUE   'IMA0648'.
061000     03  MNT0609 PIC X(07) VALUE   'IMA0649'.
061100     03  MNT0610 PIC X(07) VALUE   'IMA0645'.
061200     03  MNT0611 PIC X(07) VALUE   'IMA0646'.
061300     03  MNT0612 PIC X(07) VALUE   'IMA0647'.
061400     03  MNT0613 PIC X(07) VALUE   'IMA0648'.
061500     03  MNT0614 PIC X(07) VALUE   'IMA0649'.
061600     03  MNT0615 PIC X(07) VALUE   'IMA0645'.
061700     03  MNT0616 PIC X(07) VALUE   'IMA0646'.
061800     03  MNT0617 PIC X(07) VALUE   'IMA0647'.
061900     03  MNT0618 PIC X(07) VALUE   'IMA0648'.
062000     03  MNT0619 PIC X(07) VALUE   'IMA0649'.
062100     03  MNT0620 PIC X(07) VALUE   'IMA0645'.
062200     03  MNT0621 PIC X(07) VALUE   'IMA0646'.
062300     03  MNT0622 PIC X(07) VALUE   'IMA0647'.
062400     03  MNT0623 PIC X(07) VALUE   'IMA0648'.
062500     03  MNT0624 PIC X(07) VALUE   'IMA0649'.
062600     03  MNT0625 PIC X(07) VALUE   'IMA0645'.
062700     03  MNT0626 PIC X(07) VALUE   'IMA0646'.
062800     03  MNT0627 PIC X(07) VALUE   'IMA0647'.
062900     03  MNT0628 PIC X(07) VALUE   'IMA0648'.
063000     03  MNT0629 PIC X(07) VALUE   'IMA0649'.
063100     03  MNT0630 PIC X(07) VALUE   'IMA0645'.
063200     03  MNT0631 PIC X(07) VALUE   'IMA0646'.
063300     03  MNT0632 PIC X(07) VALUE   'IMA0647'.
063400     03  MNT0633 PIC X(07) VALUE   'IMA0648'.
063500     03  MNT0634 PIC X(07) VALUE   'IMA0649'.
063600     03  MNT0635 PIC X(07) VALUE   'IMA0609'.
063700     03  MNT0636 PIC X(07) VALUE   'IMA0610'.
063800     03  MNT0637 PIC X(07) VALUE   'IMA0611'.
063900     03  MNT0638 PIC X(07) VALUE   'IMA0612'.
064000     03  MNT0639 PIC X(07) VALUE   'IMA1038'.
064100     03  MNT0640 PIC X(07) VALUE   '       '.
064200     03  MNT0641 PIC X(07) VALUE   '       '.
064300     03  MNT0642 PIC X(07) VALUE   '       '.
064400     03  MNT0643 PIC X(07) VALUE   'IMA0018'.
064500     03  MNT0644 PIC X(07) VALUE   'IMA0019'.
064600     03  MNT0645 PIC X(07) VALUE   'IMA0020'.
064700     03  MNT0646 PIC X(07) VALUE   'IMA0021'.
064800     03  MNT0647 PIC X(07) VALUE   'IMA0022'.
064900     03  MNT0648 PIC X(07) VALUE   'IMA0023'.
065000     03  MNT0649 PIC X(07) VALUE   'IMA0024'.
065100     03  MNT0650 PIC X(07) VALUE   'IMA0025'.
065200     03  MNT0651 PIC X(07) VALUE   'IMA0026'.
065300     03  MNT0652 PIC X(07) VALUE   'IMA0317'.
065400     03  MNT0653 PIC X(07) VALUE   'IMA0318'.
065500     03  MNT0654 PIC X(07) VALUE   'IMA9008'.
065600     03  MNT0655 PIC X(07) VALUE   'IMA0144'.
065700     03  MNT0656 PIC X(07) VALUE   'IMA0145'.
065800     03  MNT0657 PIC X(07) VALUE   '       '.
065900     03  MNT0658 PIC X(07) VALUE   '       '.
066000     03  MNT0659 PIC X(07) VALUE   'IMA0203'.
066100     03  MNT0660 PIC X(07) VALUE   'IMA0202'.
066200     03  MNT0661 PIC X(07) VALUE   'IMA0204'.
066300     03  MNT0662 PIC X(07) VALUE   'IMA0210'.
066400     03  MNT0663 PIC X(07) VALUE   'IMA0211'.
066500     03  MNT0664 PIC X(07) VALUE   'IMA0213'.
066600     03  MNT0665 PIC X(07) VALUE   'IMA0214'.
066700     03  MNT0666 PIC X(07) VALUE   'IMA0338'.
066800     03  MNT0667 PIC X(07) VALUE   'IMA0220'.
066900     03  MNT0668 PIC X(07) VALUE   'IMA0656'.
067000     03  MNT0669 PIC X(07) VALUE   'IMA0654'.
067100     03  MNT0670 PIC X(07) VALUE   'IMA0755'.
067200     03  MNT0671 PIC X(07) VALUE   'IMA0782'.
067300     03  MNT0672 PIC X(07) VALUE   'IMA0783'.
067400     03  MNT0673 PIC X(07) VALUE   'IMA0795'.
067500     03  MNT0674 PIC X(07) VALUE   'IMA0805'.
067600     03  MNT0675 PIC X(07) VALUE   'IMA0807'.
067700     03  MNT0676 PIC X(07) VALUE   'IMA0814'.
067800     03  MNT0677 PIC X(07) VALUE   'IMA0815'.
067900     03  MNT0678 PIC X(07) VALUE   'IMA0818'.
068000     03  MNT0679 PIC X(07) VALUE   'IMA0820'.
068100     03  MNT0680 PIC X(07) VALUE   'IMA0768'.
068200     03  MNT0681 PIC X(07) VALUE   'IMA9044'.
068300     03  MNT0682 PIC X(07) VALUE   'IMA0769'.
068400     03  MNT0683 PIC X(07) VALUE   'IMA0770'.
068500     03  MNT0684 PIC X(07) VALUE   'IMA0771'.
068600     03  MNT0685 PIC X(07) VALUE   'IMA0775'.
068700     03  MNT0686 PIC X(07) VALUE   'IMA0776'.
068800     03  MNT0687 PIC X(07) VALUE   'IMA0777'.
068900     03  MNT0688 PIC X(07) VALUE   'IMA0785'.
069000     03  MNT0689 PIC X(07) VALUE   'IMA0201'.
069100     03  MNT0690 PIC X(07) VALUE   'IMA0315'.
069200     03  MNT0691 PIC X(07) VALUE   'IMA0316'.
069300     03  MNT0692 PIC X(07) VALUE   'IMA0016'.
069400     03  MNT0693 PIC X(07) VALUE   'IMA0186'.
069500     03  MNT0694 PIC X(07) VALUE   'IMA0187'.
069600     03  MNT0695 PIC X(07) VALUE   'IMA0188'.
069700     03  MNT0696 PIC X(07) VALUE   'IMA0218'.
069800     03  MNT0697 PIC X(07) VALUE   'IMA0017'.
069900     03  MNT0698 PIC X(07) VALUE   'IMA9081'.
070000     03  MNT0699 PIC X(07) VALUE   'IMA0027'.
070100     03  MNT0700 PIC X(07) VALUE   'IMA0028'.
070200     03  MNT0701 PIC X(07) VALUE   'IMA0029'.
070300     03  MNT0702 PIC X(07) VALUE   'IMA9081'.
070400     03  MNT0703 PIC X(07) VALUE   'IMA0030'.
070500     03  MNT0704 PIC X(07) VALUE   'IMA0031'.
070600     03  MNT0705 PIC X(07) VALUE   'IMA0032'.
070700     03  MNT0706 PIC X(07) VALUE   'IMA9081'.
070800     03  MNT0707 PIC X(07) VALUE   'IMA0033'.
070900     03  MNT0708 PIC X(07) VALUE   'IMA0034'.
071000     03  MNT0709 PIC X(07) VALUE   'IMA0035'.
071100     03  MNT0710 PIC X(07) VALUE   'IMA0044'.
071200     03  MNT0711 PIC X(07) VALUE   'IMA0062'.
071300     03  MNT0712 PIC X(07) VALUE   'IMA0063'.
071400     03  MNT0713 PIC X(07) VALUE   'IMA0064'.
071500     03  MNT0714 PIC X(07) VALUE   'IMA0065'.
071600     03  MNT0715 PIC X(07) VALUE   'IMA0066'.
071700     03  MNT0716 PIC X(07) VALUE   'IMA0072'.
071800     03  MNT0717 PIC X(07) VALUE   'IMA0073'.
071900     03  MNT0718 PIC X(07) VALUE   'IMA0074'.
072000     03  MNT0719 PIC X(07) VALUE   'IMA0075'.
072100     03  MNT0720 PIC X(07) VALUE   'IMA0126'.
072200     03  MNT0721 PIC X(07) VALUE   'IMA0748'.
072300     03  MNT0722 PIC X(07) VALUE   'IMA0748'.
072400     03  MNT0723 PIC X(07) VALUE   'IMA0748'.
072500     03  MNT0724 PIC X(07) VALUE   'IMA0748'.
072600     03  MNT0725 PIC X(07) VALUE   'IMA0748'.
072700     03  MNT0726 PIC X(07) VALUE   'IMA0748'.
072800     03  MNT0727 PIC X(07) VALUE   'IMA0748'.
072900     03  MNT0728 PIC X(07) VALUE   'IMA0748'.
073000     03  MNT0729 PIC X(07) VALUE   'IMA0748'.
073100     03  MNT0730 PIC X(07) VALUE   'IMA0748'.
073200     03  MNT0731 PIC X(07) VALUE   'IMA0748'.
073300     03  MNT0732 PIC X(07) VALUE   'IMA0748'.
073400     03  MNT0733 PIC X(07) VALUE   'IMA0856'.
073500     03  MNT0734 PIC X(07) VALUE   'IMA0857'.
073600     03  MNT0735 PIC X(07) VALUE   'IMA0858'.
073700     03  MNT0736 PIC X(07) VALUE   'IMA0859'.
073800     03  MNT0737 PIC X(07) VALUE   'IMA0860'.
073900     03  MNT0738 PIC X(07) VALUE   'IMA0861'.
074000     03  MNT0739 PIC X(07) VALUE   'IMA0862'.
074100     03  MNT0740 PIC X(07) VALUE   'IMA0863'.
074200     03  MNT0741 PIC X(07) VALUE   'IMA0864'.
074300     03  MNT0742 PIC X(07) VALUE   'IMA0865'.
074400     03  MNT0743 PIC X(07) VALUE   'IMA0866'.
074500     03  MNT0744 PIC X(07) VALUE   'IMA0867'.
074600     03  MNT0745 PIC X(07) VALUE   'IMA0874'.
074700     03  MNT0746 PIC X(07) VALUE   'IMA0868'.
074800     03  MNT0747 PIC X(07) VALUE   'IMA0869'.
074900     03  MNT0748 PIC X(07) VALUE   'IMA0870'.
075000     03  MNT0749 PIC X(07) VALUE   'IMA0871'.
075100     03  MNT0750 PIC X(07) VALUE   'IMA0876'.
075200     03  MNT0751 PIC X(07) VALUE   'IMA9202'.
075300     03  MNT0752 PIC X(07) VALUE   'IMA0872'.
075400     03  MNT0753 PIC X(07) VALUE   'IMA0873'.
075500     03  MNT0754 PIC X(07) VALUE   'IMA0881'.
075600     03  MNT0755 PIC X(07) VALUE   'IMA0883'.
075700     03  MNT0756 PIC X(07) VALUE   'IMA0130'.
075800     03  MNT0757 PIC X(07) VALUE   'IMA0132'.
075900     03  MNT0758 PIC X(07) VALUE   'IMA0133'.
076000     03  MNT0759 PIC X(07) VALUE   'IMA0134'.
076100     03  MNT0760 PIC X(07) VALUE   'IMA0136'.
076200     03  MNT0761 PIC X(07) VALUE   'IMA0958'.
076300     03  MNT0762 PIC X(07) VALUE   'IMA0960'.
076400     03  MNT0763 PIC X(07) VALUE   'IMA0962'.
076500     03  MNT0764 PIC X(07) VALUE   'IMA9007'.
076600     03  MNT0765 PIC X(07) VALUE   'IMA0900'.
076700     03  MNT0766 PIC X(07) VALUE   'IMA0901'.
076800     03  MNT0767 PIC X(07) VALUE   'IMA0902'.
076900     03  MNT0768 PIC X(07) VALUE   'IMA0903'.
077000     03  MNT0769 PIC X(07) VALUE   'IMA9209'.
077100     03  MNT0770 PIC X(07) VALUE   'IMA0906'.
077200     03  MNT0771 PIC X(07) VALUE   'IMA0907'.
077300     03  MNT0772 PIC X(07) VALUE   'IMA0908'.
077400     03  MNT0773 PIC X(07) VALUE   'IMA0909'.
077500     03  MNT0774 PIC X(07) VALUE   'IMA0910'.
077600     03  MNT0775 PIC X(07) VALUE   'IMA0206'.
077700     03  MNT0776 PIC X(07) VALUE   'IMA0209'.
077800     03  MNT0777 PIC X(07) VALUE   'IMA0212'.
077900     03  MNT0778 PIC X(07) VALUE   'IMA0216'.
078000     03  MNT0779 PIC X(07) VALUE   'IMA0217'.
078100     03  MNT0780 PIC X(07) VALUE   'IMA0219'.
078200     03  MNT0781 PIC X(07) VALUE   'IMA0444'.
078300     03  MNT0782 PIC X(07) VALUE   'IMA0454'.
078400     03  MNT0783 PIC X(07) VALUE   'IMA0660'.
078500     03  MNT0784 PIC X(07) VALUE   '       '.
078600     03  MNT0785 PIC X(07) VALUE   '       '.
078700     03  MNT0786 PIC X(07) VALUE   'IMA0670'.
078800     03  MNT0787 PIC X(07) VALUE   '       '.
078900     03  MNT0788 PIC X(07) VALUE   '       '.
079000     03  MNT0789 PIC X(07) VALUE   'IMA0547'.
079100     03  MNT0790 PIC X(07) VALUE   'IMA0548'.
079200     03  MNT0791 PIC X(07) VALUE   'IMA0550'.
079300     03  MNT0792 PIC X(07) VALUE   'IMA0551'.
079400     03  MNT0793 PIC X(07) VALUE   '       '.
079500     03  MNT0794 PIC X(07) VALUE   '       '.
079600     03  MNT0795 PIC X(07) VALUE   '       '.
079700     03  MNT0796 PIC X(07) VALUE   '       '.
079800     03  MNT0797 PIC X(07) VALUE   'IMA0527'.
079900     03  MNT0798 PIC X(07) VALUE   'IMA0528'.
080000     03  MNT0799 PIC X(07) VALUE   'IMA0529'.
080100     03  MNT0800 PIC X(07) VALUE   'IMA0530'.
080200     03  MNT0801 PIC X(07) VALUE   'IMA0531'.
080300     03  MNT0802 PIC X(07) VALUE   'IMA0311'.
080400     03  MNT0803 PIC X(07) VALUE   'IMA0312'.
080500     03  MNT0804 PIC X(07) VALUE   'IMA0912'.
080600     03  MNT0805 PIC X(07) VALUE   'IMA0912'.
080700     03  MNT0806 PIC X(07) VALUE   'IMA0912'.
080800     03  MNT0807 PIC X(07) VALUE   'IMA0912'.
080900     03  MNT0808 PIC X(07) VALUE   'IMA0912'.
081000     03  MNT0809 PIC X(07) VALUE   'IMA0912'.
081100     03  MNT0810 PIC X(07) VALUE   'IMA0912'.
081200     03  MNT0811 PIC X(07) VALUE   'IMA0912'.
081300     03  MNT0812 PIC X(07) VALUE   'IMA0912'.
081400     03  MNT0813 PIC X(07) VALUE   'IMA0912'.
081500     03  MNT0814 PIC X(07) VALUE   'IMA0912'.
081600     03  MNT0815 PIC X(07) VALUE   'IMA0912'.
081700     03  MNT0816 PIC X(07) VALUE   'IMA0912'.
081800     03  MNT0817 PIC X(07) VALUE   'IMA0912'.
081900     03  MNT0818 PIC X(07) VALUE   'IMA0912'.
082000     03  MNT0819 PIC X(07) VALUE   'IMA0912'.
082100     03  MNT0820 PIC X(07) VALUE   'IMA0912'.
082200     03  MNT0821 PIC X(07) VALUE   'IMA0912'.
082300     03  MNT0822 PIC X(07) VALUE   'IMA0912'.
082400     03  MNT0823 PIC X(07) VALUE   'IMA0912'.
082500     03  MNT0824 PIC X(07) VALUE   'IMA0912'.
082600     03  MNT0825 PIC X(07) VALUE   'IMA0912'.
082700     03  MNT0826 PIC X(07) VALUE   'IMA0912'.
082800     03  MNT0827 PIC X(07) VALUE   'IMA0912'.
082900     03  MNT0828 PIC X(07) VALUE   'IMA0912'.
083000     03  MNT0829 PIC X(07) VALUE   'IMA0914'.
083100     03  MNT0830 PIC X(07) VALUE   'IMA0914'.
083200     03  MNT0831 PIC X(07) VALUE   'IMA0914'.
083300     03  MNT0832 PIC X(07) VALUE   'IMA0914'.
083400     03  MNT0833 PIC X(07) VALUE   'IMA0914'.
083500     03  MNT0834 PIC X(07) VALUE   'IMA0914'.
083600     03  MNT0835 PIC X(07) VALUE   'IMA0914'.
083700     03  MNT0836 PIC X(07) VALUE   'IMA0914'.
083800     03  MNT0837 PIC X(07) VALUE   'IMA0914'.
083900     03  MNT0838 PIC X(07) VALUE   'IMA0914'.
084000     03  MNT0839 PIC X(07) VALUE   'IMA0914'.
084100     03  MNT0840 PIC X(07) VALUE   'IMA0914'.
084200     03  MNT0841 PIC X(07) VALUE   'IMA0914'.
084300     03  MNT0842 PIC X(07) VALUE   'IMA0914'.
084400     03  MNT0843 PIC X(07) VALUE   'IMA0914'.
084500     03  MNT0844 PIC X(07) VALUE   'IMA0914'.
084600     03  MNT0845 PIC X(07) VALUE   'IMA0914'.
084700     03  MNT0846 PIC X(07) VALUE   'IMA0914'.
084800     03  MNT0847 PIC X(07) VALUE   'IMA0914'.
084900     03  MNT0848 PIC X(07) VALUE   'IMA0914'.
085000     03  MNT0849 PIC X(07) VALUE   'IMA0914'.
085100     03  MNT0850 PIC X(07) VALUE   'IMA0914'.
085200     03  MNT0851 PIC X(07) VALUE   'IMA0914'.
085300     03  MNT0852 PIC X(07) VALUE   'IMA0914'.
085400     03  MNT0853 PIC X(07) VALUE   'IMA0914'.
085500     03  MNT0854 PIC X(07) VALUE   'IMA0319'.
085600     03  MNT0855 PIC X(07) VALUE   '       '.
085700     03  MNT0856 PIC X(07) VALUE   '       '.
085800     03  MNT0857 PIC X(07) VALUE   '       '.
085900     03  MNT0858 PIC X(07) VALUE   '       '.
086000     03  MNT0859 PIC X(07) VALUE   '       '.
086100     03  MNT0860 PIC X(07) VALUE   '       '.
086200     03  MNT0861 PIC X(07) VALUE   '       '.
086300     03  MNT0862 PIC X(07) VALUE   '       '.
086400     03  MNT0863 PIC X(07) VALUE   '       '.
086500     03  MNT0864 PIC X(07) VALUE   '       '.
086600     03  MNT0865 PIC X(07) VALUE   '       '.
086700     03  MNT0866 PIC X(07) VALUE   '       '.
086800     03  MNT0867 PIC X(07) VALUE   'IMA0344'.
086900     03  MNT0868 PIC X(07) VALUE   'IMA0345'.
087000     03  MNT0869 PIC X(07) VALUE   'IMA0014'.
087100     03  MNT0870 PIC X(07) VALUE   'IMA0015'.
087200     03  MNT0871 PIC X(07) VALUE   '       '.
087300     03  MNT0872 PIC X(07) VALUE   '       '.
087400     03  MNT0873 PIC X(07) VALUE   '       '.
087500     03  MNT0874 PIC X(07) VALUE   'IMA0013'.
087600     03  MNT0875 PIC X(07) VALUE   'IMA0091'.
087700     03  MNT0876 PIC X(07) VALUE   'IMA0395'.
087800     03  MNT0877 PIC X(07) VALUE   'IMA0396'.
087900     03  MNT0878 PIC X(07) VALUE   'IMA9125'.
088000     03  MNT0879 PIC X(07) VALUE   'IMA0404'.
088100     03  MNT0880 PIC X(07) VALUE   'IMA0406'.
088200     03  MNT0881 PIC X(07) VALUE   'IMA0407'.
088300     03  MNT0882 PIC X(07) VALUE   'IMA9127'.
088400     03  MNT0883 PIC X(07) VALUE   'IMA0411'.
088500     03  MNT0884 PIC X(07) VALUE   'IMA0412'.
088600     03  MNT0885 PIC X(07) VALUE   'IMA0459'.
088700     03  MNT0886 PIC X(07) VALUE   'IMA0618'.
088800     03  MNT0887 PIC X(07) VALUE   'IMA0623'.
088900     03  MNT0888 PIC X(07) VALUE   'IMA0624'.
089000     03  MNT0889 PIC X(07) VALUE   'IMA0575'.
089100     03  MNT0890 PIC X(07) VALUE   'IMA0576'.
089200     03  MNT0891 PIC X(07) VALUE   'IMA9024'.
089300     03  MNT0892 PIC X(07) VALUE   'IMA0508'.
089400     03  MNT0893 PIC X(07) VALUE   'IMA0509'.
089500     03  MNT0894 PIC X(07) VALUE   'IMA0510'.
089600     03  MNT0895 PIC X(07) VALUE   'IMA0603'.
089700     03  MNT0896 PIC X(07) VALUE   'IMA0625'.
089800     03  MNT0897 PIC X(07) VALUE   'IMA0639'.
089900     03  MNT0898 PIC X(07) VALUE   'IMA0640'.
090000     03  MNT0899 PIC X(07) VALUE   'IMA0641'.
090100     03  MNT0900 PIC X(07) VALUE   'IMA0519'.
090200     03  MNT0901 PIC X(07) VALUE   'IMA0832'.
090300     03  MNT0902 PIC X(07) VALUE   'IMA0836'.
090400     03  MNT0903 PIC X(07) VALUE   'IMA0837'.
090500     03  MNT0904 PIC X(07) VALUE   'IMA0838'.
090600     03  MNT0905 PIC X(07) VALUE   'IMA0405'.
090700     03  MNT0906 PIC X(07) VALUE   'IMA0424'.
090800     03  MNT0907 PIC X(07) VALUE   'IMA0723'.
090900     03  MNT0908 PIC X(07) VALUE   'IMA0724'.
091000     03  MNT0909 PIC X(07) VALUE   'IMA0725'.
091100     03  MNT0910 PIC X(07) VALUE   'IMA0725'.
091200     03  MNT0911 PIC X(07) VALUE   'IMA0725'.
091300     03  MNT0912 PIC X(07) VALUE   'IMA0725'.
091400     03  MNT0913 PIC X(07) VALUE   'IMA0725'.
091500     03  MNT0914 PIC X(07) VALUE   'IMA0725'.
091600     03  MNT0915 PIC X(07) VALUE   'IMA0725'.
091700     03  MNT0916 PIC X(07) VALUE   'IMA0725'.
091800     03  MNT0917 PIC X(07) VALUE   'IMA0725'.
091900     03  MNT0918 PIC X(07) VALUE   'IMA0725'.
092000     03  MNT0919 PIC X(07) VALUE   'IMA0725'.
092100     03  MNT0920 PIC X(07) VALUE   'IMA0725'.
092200     03  MNT0921 PIC X(07) VALUE   'IMA0725'.
092300     03  MNT0922 PIC X(07) VALUE   'IMA0726'.
092400     03  MNT0923 PIC X(07) VALUE   'IMA0726'.
092500     03  MNT0924 PIC X(07) VALUE   'IMA0726'.
092600     03  MNT0925 PIC X(07) VALUE   'IMA0726'.
092700     03  MNT0926 PIC X(07) VALUE   'IMA0726'.
092800     03  MNT0927 PIC X(07) VALUE   'IMA0726'.
092900     03  MNT0928 PIC X(07) VALUE   'IMA0726'.
093000     03  MNT0929 PIC X(07) VALUE   'IMA0726'.
093100     03  MNT0930 PIC X(07) VALUE   'IMA0726'.
093200     03  MNT0931 PIC X(07) VALUE   'IMA0726'.
093300     03  MNT0932 PIC X(07) VALUE   'IMA0726'.
093400     03  MNT0933 PIC X(07) VALUE   'IMA0726'.
093500     03  MNT0934 PIC X(07) VALUE   'IMA0726'.
093600     03  MNT0935 PIC X(07) VALUE   'IMA0127'.
093700     03  MNT0936 PIC X(07) VALUE   'IMA0626'.
093800     03  MNT0937 PIC X(07) VALUE   'IMA0590'.
093900     03  MNT0938 PIC X(07) VALUE   'IMA0591'.
094000     03  MNT0939 PIC X(07) VALUE   'IMA0767'.
094100     03  MNT0940 PIC X(07) VALUE   'IMA0888'.
094200     03  MNT0941 PIC X(07) VALUE   'IMA0889'.
094300     03  MNT0942 PIC X(07) VALUE   'IMA0890'.
094400     03  MNT0943 PIC X(07) VALUE   'IMA0891'.
094500     03  MNT0944 PIC X(07) VALUE   'IMA0892'.
094600     03  MNT0945 PIC X(07) VALUE   'IMA0893'.
094700     03  MNT0946 PIC X(07) VALUE   'IMA0894'.
094800     03  MNT0947 PIC X(07) VALUE   'IMA0895'.
094900     03  MNT0948 PIC X(07) VALUE   'IMA0911'.
095000     03  MNT0949 PIC X(07) VALUE   'IMA0932'.
095100     03  MNT0950 PIC X(07) VALUE   'IMA0948'.
095200     03  MNT0951 PIC X(07) VALUE   'IMA9207'.
095300     03  MNT0952 PIC X(07) VALUE   'IMA9043'.
095400     03  MNT0953 PIC X(07) VALUE   'IMA9195'.
095500     03  MNT0954 PIC X(07) VALUE   'IMA0076'.
095600     03  MNT0955 PIC X(07) VALUE   'IMA0128'.
095700     03  MNT0956 PIC X(07) VALUE   'IMA0329'.
095800     03  MNT0957 PIC X(07) VALUE   'IMA0330'.
095900     03  MNT0958 PIC X(07) VALUE   'IMA9128'.
096000     03  MNT0959 PIC X(07) VALUE   'IMA9134'.
096100     03  MNT0960 PIC X(07) VALUE   'IMA0727'.
096200     03  MNT0961 PIC X(07) VALUE   'IMA0272'.
096300     03  MNT0962 PIC X(07) VALUE   'IMA0273'.
096400     03  MNT0963 PIC X(07) VALUE   'IMA0274'.
096500     03  MNT0964 PIC X(07) VALUE   'IMA0855'.
096600     03  MNT0965 PIC X(07) VALUE   'IMA0077'.
096700     03  MNT0966 PIC X(07) VALUE   'IMA0080'.
096800     03  MNT0967 PIC X(07) VALUE   'IMA0081'.
096900     03  MNT0968 PIC X(07) VALUE   'IMA0277'.
097000     03  MNT0969 PIC X(07) VALUE   'IMA0357'.
097100     03  MNT0970 PIC X(07) VALUE   'IMA0358'.
097200     03  MNT0971 PIC X(07) VALUE   'IMA0627'.
097300     03  MNT0972 PIC X(07) VALUE   'IMA0275'.
097400     03  MNT0973 PIC X(07) VALUE   'IMA0439'.
097500     03  MNT0974 PIC X(07) VALUE   'IMA0359'.
097600     03  MNT0975 PIC X(07) VALUE   'IMA0078'.
097700     03  MNT0976 PIC X(07) VALUE   'IMA0813'.
097800     03  MNT0977 PIC X(07) VALUE   'IMA0677'.
097900     03  MNT0978 PIC X(07) VALUE   'IMA0678'.
098000     03  MNT0979 PIC X(07) VALUE   'IMA0679'.
098100     03  MNT0980 PIC X(07) VALUE   'IMA0680'.
098200     03  MNT0981 PIC X(07) VALUE   'IMA0681'.
098300     03  MNT0982 PIC X(07) VALUE   'IMA9171'.
098400     03  MNT0983 PIC X(07) VALUE   'IMA9172'.
098500     03  MNT0984 PIC X(07) VALUE   'IMA0688'.
098600     03  MNT0985 PIC X(07) VALUE   'IMA0689'.
098700     03  MNT0986 PIC X(07) VALUE   'IMA0690'.
098800     03  MNT0987 PIC X(07) VALUE   'IMA0599'.
098900     03  MNT0988 PIC X(07) VALUE   'IMA0146'.
099000     03  MNT0989 PIC X(07) VALUE   'IMA0224'.
099100     03  MNT0990 PIC X(07) VALUE   'IMA0225'.
099200     03  MNT0991 PIC X(07) VALUE   'IMA0226'.
099300     03  MNT0992 PIC X(07) VALUE   'IMA0801'.
099400     03  MNT0993 PIC X(07) VALUE   'IMA0802'.
099500     03  MNT0994 PIC X(07) VALUE   'IMA0696'.
099600     03  MNT0995 PIC X(07) VALUE   'IMA0079'.
099700     03  MNT0996 PIC X(07) VALUE   'IMA0544'.
099800     03  MNT0997 PIC X(07) VALUE   'IMA0545'.
099900     03  MNT0998 PIC X(07) VALUE   'IMA0959'.
100000     03  MNT0999 PIC X(07) VALUE   'IMA0961'.
100100     03  MNT1000 PIC X(07) VALUE   'IMA0950'.
100200     03  MNT1001 PIC X(07) VALUE   'IMA0951'.
100300     03  MNT1002 PIC X(07) VALUE   'IMA0952'.
100400     03  MNT1003 PIC X(07) VALUE   'IMA0953'.
100500     03  MNT1004 PIC X(07) VALUE   'IMA0956'.
100600     03  MNT1005 PIC X(07) VALUE   'IMA0957'.
100700     03  MNT1006 PIC X(07) VALUE   'IMA0954'.
100800     03  MNT1007 PIC X(07) VALUE   'IMA0955'.
100900     03  MNT1008 PIC X(07) VALUE   'IMA0963'.
101000     03  MNT1009 PIC X(07) VALUE   'IMA0963'.
101100     03  MNT1010 PIC X(07) VALUE   'IMA0963'.
101200     03  MNT1011 PIC X(07) VALUE   'IMA0963'.
101300     03  MNT1012 PIC X(07) VALUE   'IMA0963'.
101400     03  MNT1013 PIC X(07) VALUE   'IMA0963'.
101500     03  MNT1014 PIC X(07) VALUE   'IMA0963'.
101600     03  MNT1015 PIC X(07) VALUE   'IMA0964'.
101700     03  MNT1016 PIC X(07) VALUE   'IMA0964'.
101800     03  MNT1017 PIC X(07) VALUE   'IMA0964'.
101900     03  MNT1018 PIC X(07) VALUE   'IMA0964'.
102000     03  MNT1019 PIC X(07) VALUE   'IMA0964'.
102100     03  MNT1020 PIC X(07) VALUE   'IMA0964'.
102200     03  MNT1021 PIC X(07) VALUE   'IMA0964'.
102300     03  MNT1022 PIC X(07) VALUE   'IMA0965'.
102400     03  MNT1023 PIC X(07) VALUE   'IMA0965'.
102500     03  MNT1024 PIC X(07) VALUE   'IMA0965'.
102600     03  MNT1025 PIC X(07) VALUE   'IMA0965'.
102700     03  MNT1026 PIC X(07) VALUE   'IMA0965'.
102800     03  MNT1027 PIC X(07) VALUE   'IMA0965'.
102900     03  MNT1028 PIC X(07) VALUE   'IMA0965'.
103000     03  MNT1029 PIC X(07) VALUE   'IMA0966'.
103100     03  MNT1030 PIC X(07) VALUE   'IMA0966'.
103200     03  MNT1031 PIC X(07) VALUE   'IMA0966'.
103300     03  MNT1032 PIC X(07) VALUE   'IMA0966'.
103400     03  MNT1033 PIC X(07) VALUE   'IMA0966'.
103500     03  MNT1034 PIC X(07) VALUE   'IMA0966'.
103600     03  MNT1035 PIC X(07) VALUE   'IMA0966'.
103700     03  MNT1036 PIC X(07) VALUE   'IMA1010'.
103800     03  MNT1037 PIC X(07) VALUE   'IMA1002'.
103900     03  MNT1038 PIC X(07) VALUE   'IMA0967'.
104000     03  MNT1039 PIC X(07) VALUE   'IMA0968'.
104100     03  MNT1040 PIC X(07) VALUE   'IMA0969'.
104200     03  MNT1041 PIC X(07) VALUE   'IMA0970'.
104300     03  MNT1042 PIC X(07) VALUE   'IMA0971'.
104400     03  MNT1043 PIC X(07) VALUE   'IMA0999'.
104500     03  MNT1044 PIC X(07) VALUE   'IMA1000'.
104600     03  MNT1045 PIC X(07) VALUE   'IMA0973'.
104700     03  MNT1046 PIC X(07) VALUE   'IMA0974'.
104800     03  MNT1047 PIC X(07) VALUE   'IMA0975'.
104900     03  MNT1048 PIC X(07) VALUE   'IMA0976'.
105000     03  MNT1049 PIC X(07) VALUE   'IMA0977'.
105100     03  MNT1050 PIC X(07) VALUE   'IMA0978'.
105200     03  MNT1051 PIC X(07) VALUE   'IMA0979'.
105300     03  MNT1052 PIC X(07) VALUE   'IMA0980'.
105400     03  MNT1053 PIC X(07) VALUE   'IMA0981'.
105500     03  MNT1054 PIC X(07) VALUE   'IMA0983'.
105600     03  MNT1055 PIC X(07) VALUE   'IMA0984'.
105700     03  MNT1056 PIC X(07) VALUE   'IMA0986'.
105800     03  MNT1057 PIC X(07) VALUE   'IMA0987'.
105900     03  MNT1058 PIC X(07) VALUE   'IMA9071'.
106000     03  MNT1059 PIC X(07) VALUE   'IMA9072'.
106100     03  MNT1060 PIC X(07) VALUE   'IMA0994'.
106200     03  MNT1061 PIC X(07) VALUE   'IMA0995'.
106300     03  MNT1062 PIC X(07) VALUE   'IMA0994'.
106400     03  MNT1063 PIC X(07) VALUE   'IMA0995'.
106500     03  MNT1064 PIC X(07) VALUE   'IMA0994'.
106600     03  MNT1065 PIC X(07) VALUE   'IMA0995'.
106700     03  MNT1066 PIC X(07) VALUE   'IMA0994'.
106800     03  MNT1067 PIC X(07) VALUE   'IMA0995'.
106900     03  MNT1068 PIC X(07) VALUE   'IMA0994'.
107000     03  MNT1069 PIC X(07) VALUE   'IMA0995'.
107100     03  MNT1070 PIC X(07) VALUE   'IMA0994'.
107200     03  MNT1071 PIC X(07) VALUE   'IMA0995'.
107300     03  MNT1072 PIC X(07) VALUE   'IMA1007'.
107400     03  MNT1073 PIC X(07) VALUE   'IMA1008'.
107500     03  MNT1074 PIC X(07) VALUE   'IMA1003'.
107600     03  MNT1075 PIC X(07) VALUE   'IMA0998'.
107700     03  MNT1076 PIC X(07) VALUE   'IMA0972'.
107800     03  MNT1077 PIC X(07) VALUE   'IMA1009'.
107900     03  MNT1078 PIC X(07) VALUE   'IMA0183'.
108000     03  MNT1079 PIC X(07) VALUE   'IMA0185'.
108100     03  MNT1080 PIC X(07) VALUE   'IMA1001'.
108200     03  MNT1081 PIC X(07) VALUE   'IMA1006'.
108300     03  MNT1082 PIC X(07) VALUE   'IMA1011'.
108400     03  MNT1083 PIC X(07) VALUE   'IMA9217'.
108500     03  MNT1084 PIC X(07) VALUE   'IMA1015'.
108600     03  MNT1085 PIC X(07) VALUE   'IMA1085'.
108700     03  MNT1086 PIC X(07) VALUE   'IMA1086'.
108800     03  MNT1087 PIC X(07) VALUE   'IMA1018'.
108900     03  MNT1088 PIC X(07) VALUE   'IMA1019'.
109000     03  MNT1089 PIC X(07) VALUE   'IMA1020'.
109100     03  MNT1090 PIC X(07) VALUE   'IMA1021'.
109200     03  MNT1091 PIC X(07) VALUE   'IMA1023'.
109300     03  MNT1092 PIC X(07) VALUE   'IMA1024'.
109400     03  MNT1093 PIC X(07) VALUE   '       '.
109500     03  MNT1094 PIC X(07) VALUE   '       '.
109600     03  MNT1095 PIC X(07) VALUE   'IMA1027'.
109700     03  MNT1096 PIC X(07) VALUE   'IMA1028'.
109800     03  MNT1097 PIC X(07) VALUE   'IMA1029'.
109900     03  MNT1098 PIC X(07) VALUE   'IMA1030'.
110000     03  MNT1099 PIC X(07) VALUE   'IMA1031'.
110100     03  MNT1100 PIC X(07) VALUE   'IMA9222'.
110200     03  MNT1101 PIC X(07) VALUE   'IMA1032'.
110300     03  MNT1102 PIC X(07) VALUE   'IMA1034'.
110400     03  MNT1103 PIC X(07) VALUE   'IMA1035'.
110500     03  MNT1104 PIC X(07) VALUE   'IMA1036'.
110600     03  MNT1105 PIC X(07) VALUE   'IMA1040'.
110700     03  MNT1106 PIC X(07) VALUE   'IMA1041'.
110800     03  MNT1107 PIC X(07) VALUE   'IMA9220'.
110900     03  MNT1108 PIC X(07) VALUE   'IMA1047'.
111000     03  MNT1109 PIC X(07) VALUE   'IMA1048'.
111100     03  MNT1110 PIC X(07) VALUE   'IMA1110'.
111200     03  MNT1111 PIC X(07) VALUE   '       '.
111300     03  MNT1112 PIC X(07) VALUE   'IMA1051'.
111400     03  MNT1113 PIC X(07) VALUE   'IMA1052'.
111500     03  MNT1114 PIC X(07) VALUE   '       '.
111600     03  MNT1115 PIC X(07) VALUE   '       '.
111700     03  MNT1116 PIC X(07) VALUE   '       '.
111800     03  MNT1117 PIC X(07) VALUE   'IMA1117'.
111900     03  MNT1118 PIC X(07) VALUE   'IMA1118'.
112000     03  MNT1119 PIC X(07) VALUE   'IMA1119'.
112100     03  MNT1120 PIC X(07) VALUE   'IMA1120'.
112200     03  MNT1121 PIC X(07) VALUE   'IMA1121'.
112300     03  MNT1122 PIC X(07) VALUE   'IMA1122'.
112400     03  MNT1123 PIC X(07) VALUE   'IMA1123'.
112500     03  MNT1124 PIC X(07) VALUE   'IMA1124'.
112600     03  MNT1125 PIC X(07) VALUE   'IMA1125'.
112700     03  MNT1126 PIC X(07) VALUE   'IMA1126'.
112800     03  MNT1127 PIC X(07) VALUE   'IMA1127'.
112900     03  MNT1128 PIC X(07) VALUE   'IMA1128'.
113000     03  MNT1129 PIC X(07) VALUE   'IMA1129'.
113100     03  MNT1130 PIC X(07) VALUE   'IMA1130'.
113200     03  MNT1131 PIC X(07) VALUE   'IMA1131'.
113300     03  MNT1132 PIC X(07) VALUE   'IMA1132'.
113400     03  MNT1133 PIC X(07) VALUE   'IMA1133'.
113500     03  MNT1134 PIC X(07) VALUE   'IMA1134'.
113600     03  MNT1135 PIC X(07) VALUE   'IMA1135'.
113700     03  MNT1136 PIC X(07) VALUE   'IMA1136'.
113800     03  MNT1137 PIC X(07) VALUE   'IMA1137'.
113900     03  MNT1138 PIC X(07) VALUE   'IMA1138'.
114000     03  MNT1139 PIC X(07) VALUE   'IMA1139'.
114100     03  MNT1140 PIC X(07) VALUE   'IMA1140'.
114200     03  MNT1141 PIC X(07) VALUE   'IMA1141'.
114300     03  MNT1142 PIC X(07) VALUE   'IMA1142'.
114400     03  MNT1143 PIC X(07) VALUE   'IMA1143'.
114500     03  MNT1144 PIC X(07) VALUE   'IMA1144'.
114600     03  MNT1145 PIC X(07) VALUE   'IMA1145'.
114700     03  MNT1146 PIC X(07) VALUE   'IMA1146'.
114800     03  MNT1147 PIC X(07) VALUE   'IMA1147'.
114900     03  MNT1148 PIC X(07) VALUE   'IMA1148'.
115000     03  MNT1149 PIC X(07) VALUE   'IMA1149'.
115100     03  MNT1150 PIC X(07) VALUE   'IMA1150'.
115200     03  MNT1151 PIC X(07) VALUE   'IMA1151'.
115300     03  MNT1152 PIC X(07) VALUE   'IMA1152'.
115400     03  MNT1153 PIC X(07) VALUE   'IMA1153'.
115500     03  MNT1154 PIC X(07) VALUE   'IMA1154'.
115600     03  MNT1155 PIC X(07) VALUE   'IMA1155'.
115700     03  MNT1156 PIC X(07) VALUE   'IMA1156'.
115800     03  MNT1157 PIC X(07) VALUE   'IMA1157'.
115900     03  MNT1158 PIC X(07) VALUE   'IMA1158'.
116000     03  MNT1159 PIC X(07) VALUE   'IMA1159'.
116100     03  MNT1160 PIC X(07) VALUE   'IMA1160'.
116200     03  MNT1161 PIC X(07) VALUE   'IMA1161'.
116300     03  MNT1162 PIC X(07) VALUE   'IMA1162'.
116400     03  MNT1163 PIC X(07) VALUE   'IMA1163'.
116500     03  MNT1164 PIC X(07) VALUE   'IMA1164'.
116600     03  MNT1165 PIC X(07) VALUE   'IMA1165'.
116700     03  MNT1166 PIC X(07) VALUE   'IMA1166'.
116800     03  MNT1167 PIC X(07) VALUE   'IMA1167'.
116900     03  MNT1168 PIC X(07) VALUE   'IMA1168'.
117000     03  MNT1169 PIC X(07) VALUE   'IMA1169'.
117100     03  MNT1170 PIC X(07) VALUE   'IMA1170'.
117200     03  MNT1171 PIC X(07) VALUE   'IMA1171'.
117300     03  MNT1172 PIC X(07) VALUE   'IMA1172'.
117400     03  MNT1173 PIC X(07) VALUE   'IMA1173'.
117500     03  MNT1174 PIC X(07) VALUE   'IMA1174'.
117600     03  MNT1175 PIC X(07) VALUE   'IMA1175'.
117700     03  MNT1176 PIC X(07) VALUE   'IMA1176'.
117800     03  MNT1177 PIC X(07) VALUE   'IMA1177'.
117900     03  MNT1178 PIC X(07) VALUE   'IMA1178'.
118000     03  MNT1179 PIC X(07) VALUE   'IMA1179'.
118100     03  MNT1180 PIC X(07) VALUE   'IMA1180'.
118200     03  MNT1181 PIC X(07) VALUE   'IMA1181'.
118300     03  MNT1182 PIC X(07) VALUE   'IMA1182'.
118400     03  MNT1183 PIC X(07) VALUE   'IMA1183'.
118500     03  MNT1184 PIC X(07) VALUE   'IMA1184'.
118600     03  MNT1185 PIC X(07) VALUE   'IMA1185'.
118700     03  MNT1186 PIC X(07) VALUE   'IMA1186'.
118800     03  MNT1187 PIC X(07) VALUE   'IMA1187'.
118900     03  MNT1188 PIC X(07) VALUE   'IMA1188'.
119000     03  MNT1189 PIC X(07) VALUE   'IMA9272'.
119100     03  MNT1190 PIC X(07) VALUE   'IMA1194'.
119200     03  MNT1191 PIC X(07) VALUE   'IMA1195'.
119300     03  MNT1192 PIC X(07) VALUE   'IMA9272'.
119400     03  MNT1193 PIC X(07) VALUE   'IMA1194'.
119500     03  MNT1194 PIC X(07) VALUE   'IMA1195'.
119600     03  MNT1195 PIC X(07) VALUE   'IMA9272'.
119700     03  MNT1196 PIC X(07) VALUE   'IMA1194'.
119800     03  MNT1197 PIC X(07) VALUE   'IMA1195'.
119900     03  MNT1198 PIC X(07) VALUE   'IMA9272'.
120000     03  MNT1199 PIC X(07) VALUE   'IMA1194'.
120100     03  MNT1200 PIC X(07) VALUE   'IMA1195'.
120200     03  MNT1201 PIC X(07) VALUE   'IMA9272'.
120300     03  MNT1202 PIC X(07) VALUE   'IMA1194'.
120400     03  MNT1203 PIC X(07) VALUE   'IMA1195'.
120500     03  MNT1204 PIC X(07) VALUE   'IMA9272'.
120600     03  MNT1205 PIC X(07) VALUE   'IMA1194'.
120700     03  MNT1206 PIC X(07) VALUE   'IMA1195'.
120800     03  MNT1207 PIC X(07) VALUE   'IMA9272'.
120900     03  MNT1208 PIC X(07) VALUE   'IMA1194'.
121000     03  MNT1209 PIC X(07) VALUE   'IMA1195'.
121100     03  MNT1210 PIC X(07) VALUE   'IMA1210'.
121200     03  MNT1211 PIC X(07) VALUE   'IMA1211'.
121300     03  MNT1212 PIC X(07) VALUE   'IMA1212'.
121400     03  MNT1213 PIC X(07) VALUE   'IMA1213'.
121500     03  MNT1214 PIC X(07) VALUE   'IMA1214'.
121600     03  MNT1215 PIC X(07) VALUE   'IMA1215'.
121700     03  MNT1216 PIC X(07) VALUE   'IMA1216'.
121800     03  MNT1217 PIC X(07) VALUE   'IMA1217'.
121900     03  MNT1218 PIC X(07) VALUE   'IMA1218'.
122000     03  MNT1219 PIC X(07) VALUE   'IMA1219'.
122100     03  MNT1220 PIC X(07) VALUE   'IMA1220'.
122200     03  MNT1221 PIC X(07) VALUE   'IMA1221'.
122300     03  MNT1222 PIC X(07) VALUE   'IMA1222'.
122400     03  MNT1223 PIC X(07) VALUE   'IMA1223'.
122500     03  MNT1224 PIC X(07) VALUE   'IMA1224'.
122600     03  MNT1225 PIC X(07) VALUE   'IMA1225'.
122700     03  MNT1226 PIC X(07) VALUE   'IMA1226'.
122800     03  MNT1227 PIC X(07) VALUE   'IMA1227'.
122900     03  MNT1228 PIC X(07) VALUE   'IMA1228'.
123000     03  MNT1229 PIC X(07) VALUE   'IMA1229'.
123100     03  MNT1230 PIC X(07) VALUE   'IMA1230'.
123200     03  MNT1231 PIC X(07) VALUE   'IMA1231'.
123300     03  MNT1232 PIC X(07) VALUE   'IMA1232'.
123400     03  MNT1233 PIC X(07) VALUE   'IMA1233'.
123500     03  MNT1234 PIC X(07) VALUE   'IMA1234'.
123600     03  MNT1235 PIC X(07) VALUE   'IMA1235'.
123700     03  MNT1236 PIC X(07) VALUE   'IMA1236'.
123800     03  MNT1237 PIC X(07) VALUE   'IMA1237'.
123900     03  MNT1238 PIC X(07) VALUE   'IMA1238'.
124000     03  MNT1239 PIC X(07) VALUE   'IMA1239'.
124100     03  MNT1240 PIC X(07) VALUE   'IMA1240'.
124200     03  MNT1241 PIC X(07) VALUE   'IMA1241'.
124300     03  MNT1242 PIC X(07) VALUE   'IMA1242'.
124400     03  MNT1243 PIC X(07) VALUE   'IMA1243'.
124500     03  MNT1244 PIC X(07) VALUE   'IMA1244'.
124600     03  MNT1245 PIC X(07) VALUE   'IMA1245'.
124700     03  MNT1246 PIC X(07) VALUE   'IMA1246'.
124800     03  MNT1247 PIC X(07) VALUE   'IMA1247'.
124900     03  MNT1248 PIC X(07) VALUE   'IMA1248'.
125000     03  MNT1249 PIC X(07) VALUE   'IMA1249'.
125100     03  MNT1250 PIC X(07) VALUE   'IMA1250'.
125200     03  MNT1251 PIC X(07) VALUE   'IMA1251'.
125300     03  MNT1252 PIC X(07) VALUE   'IMA1252'.
125400     03  MNT1253 PIC X(07) VALUE   'IMA1253'.
125500     03  MNT1254 PIC X(07) VALUE   'IMA1254'.
125600     03  MNT1255 PIC X(07) VALUE   'IMA1255'.
125700     03  MNT1256 PIC X(07) VALUE   'IMA1256'.
125800     03  MNT1257 PIC X(07) VALUE   'IMA1257'.
125900     03  MNT1258 PIC X(07) VALUE   'IMA1258'.
126000     03  MNT1259 PIC X(07) VALUE   'IMA1259'.
126100     03  MNT1260 PIC X(07) VALUE   'IMA1260'.
126200     03  MNT1261 PIC X(07) VALUE   'IMA1261'.
126300     03  MNT1262 PIC X(07) VALUE   'IMA1262'.
126400     03  MNT1263 PIC X(07) VALUE   'IMA1263'.
126500     03  MNT1264 PIC X(07) VALUE   'IMA1264'.
126600     03  MNT1265 PIC X(07) VALUE   'IMA1265'.
126700     03  MNT1266 PIC X(07) VALUE   'IMA1266'.
126800     03  MNT1267 PIC X(07) VALUE   'IMA1267'.
126900     03  MNT1268 PIC X(07) VALUE   'IMA1268'.
127000     03  MNT1269 PIC X(07) VALUE   'IMA1269'.
127100     03  MNT1270 PIC X(07) VALUE   'IMA1270'.
127200     03  MNT1271 PIC X(07) VALUE   'IMA1271'.
127300     03  MNT1272 PIC X(07) VALUE   'IMA1272'.
127400     03  MNT1273 PIC X(07) VALUE   'IMA1273'.
127500     03  MNT1274 PIC X(07) VALUE   'IMA1274'.
127600     03  MNT1275 PIC X(07) VALUE   'IMA1275'.
127700     03  MNT1276 PIC X(07) VALUE   'IMA1276'.
127800     03  MNT1277 PIC X(07) VALUE   'IMA1277'.
127900     03  MNT1278 PIC X(07) VALUE   'IMA1278'.
128000     03  MNT1279 PIC X(07) VALUE   'IMA1279'.
128100     03  MNT1280 PIC X(07) VALUE   'IMA1280'.
128200     03  MNT1281 PIC X(07) VALUE   'IMA1281'.
128300     03  MNT1282 PIC X(07) VALUE   'IMA1282'.
128400     03  MNT1283 PIC X(07) VALUE   'IMA1283'.
128500     03  MNT1284 PIC X(07) VALUE   'IMA1284'.
128600     03  MNT1285 PIC X(07) VALUE   'IMA1285'.
128700     03  MNT1286 PIC X(07) VALUE   'IMA1286'.
128800     03  MNT1287 PIC X(07) VALUE   'IMA1287'.
128900     03  MNT1288 PIC X(07) VALUE   'IMA1288'.
129000     03  MNT1289 PIC X(07) VALUE   'IMA1289'.
129100     03  MNT1290 PIC X(07) VALUE   'IMA1290'.
129200     03  MNT1291 PIC X(07) VALUE   'IMA1291'.
129300     03  MNT1292 PIC X(07) VALUE   'IMA1292'.
129400     03  MNT1293 PIC X(07) VALUE   'IMA1293'.
129500     03  MNT1294 PIC X(07) VALUE   'IMA1294'.
129600     03  MNT1295 PIC X(07) VALUE   'IMA1295'.
129700     03  MNT1296 PIC X(07) VALUE   'IMA1296'.
129800     03  MNT1297 PIC X(07) VALUE   'IMA1297'.
129900     03  MNT1298 PIC X(07) VALUE   'IMA1298'.
130000     03  MNT1299 PIC X(07) VALUE   'IMA1299'.
130100     03  MNT1300 PIC X(07) VALUE   'IMA1300'.
130200     03  MNT1301 PIC X(07) VALUE   'IMA1301'.
130300     03  MNT1302 PIC X(07) VALUE   'IMA1302'.
130400     03  MNT1303 PIC X(07) VALUE   'IMA1303'.
130500     03  MNT1304 PIC X(07) VALUE   'IMA1304'.
130600     03  MNT1305 PIC X(07) VALUE   'IMA1305'.
130700     03  MNT1306 PIC X(07) VALUE   'IMA1306'.
130800     03  MNT1307 PIC X(07) VALUE   'IMA1307'.
130900     03  MNT1308 PIC X(07) VALUE   'IMA1308'.
131000     03  MNT1309 PIC X(07) VALUE   'IMA1309'.
131100     03  MNT1310 PIC X(07) VALUE   'IMA1310'.
131200     03  MNT1311 PIC X(07) VALUE   'IMA1311'.
131300     03  MNT1312 PIC X(07) VALUE   'IMA1312'.
131400     03  MNT1313 PIC X(07) VALUE   'IMA1313'.
131500     03  MNT1314 PIC X(07) VALUE   'IMA1314'.
131600     03  MNT1315 PIC X(07) VALUE   'IMA1315'.
131700     03  MNT1316 PIC X(07) VALUE   'IMA1316'.
131800     03  MNT1317 PIC X(07) VALUE   'IMA1317'.
131900     03  MNT1318 PIC X(07) VALUE   'IMA1318'.
132000     03  MNT1319 PIC X(07) VALUE   '       '.
132100     03  MNT1320 PIC X(07) VALUE   '       '.
132200     03  MNT1321 PIC X(07) VALUE   'IMA1321'.
132300     03  MNT1322 PIC X(07) VALUE   'IMA1322'.
132400     03  MNT1323 PIC X(07) VALUE   'IMA1323'.
132500     03  MNT1324 PIC X(07) VALUE   'IMA1324'.
132600     03  MNT1325 PIC X(07) VALUE   'IMA1325'.
132700     03  MNT1326 PIC X(07) VALUE   'IMA1326'.
132800     03  MNT1327 PIC X(07) VALUE   'IMA1327'.
132900     03  MNT1328 PIC X(07) VALUE   'IMA1328'.
133000     03  MNT1329 PIC X(07) VALUE   'IMA1329'.
133100     03  MNT1330 PIC X(07) VALUE   '       '.
133200     03  MNT1331 PIC X(07) VALUE   '       '.
133300     03  MNT1332 PIC X(07) VALUE   '       '.
133400     03  MNT1333 PIC X(07) VALUE   '       '.
133500     03  MNT1334 PIC X(07) VALUE   '       '.
133600     03  MNT1335 PIC X(07) VALUE   '       '.
133700     03  MNT1336 PIC X(07) VALUE   '       '.
133800     03  MNT1337 PIC X(07) VALUE   '       '.
133900     03  MNT1338 PIC X(07) VALUE   '       '.
134000     03  MNT1339 PIC X(07) VALUE   '       '.
134100     03  MNT1340 PIC X(07) VALUE   '       '.
134200     03  MNT1341 PIC X(07) VALUE   '       '.
134300     03  MNT1342 PIC X(07) VALUE   '       '.
134400     03  MNT1343 PIC X(07) VALUE   '       '.
134500     03  MNT1344 PIC X(07) VALUE   '       '.
134600     03  MNT1345 PIC X(07) VALUE   'IMA1345'.
134700     03  MNT1346 PIC X(07) VALUE   'IMA1345'.
134800     03  MNT1347 PIC X(07) VALUE   'IMA1345'.
134900     03  MNT1348 PIC X(07) VALUE   'IMA1345'.
135000     03  MNT1349 PIC X(07) VALUE   'IMA1345'.
135100     03  MNT1350 PIC X(07) VALUE   'IMA1350'.
135200     03  MNT1351 PIC X(07) VALUE   'IMA1351'.
135300     03  MNT1352 PIC X(07) VALUE   'IMA1352'.
135400     03  MNT1353 PIC X(07) VALUE   'IMA1353'.
135500     03  MNT1354 PIC X(07) VALUE   'IMA1354'.
135600     03  MNT1355 PIC X(07) VALUE   'IMA1355'.
135700     03  MNT1356 PIC X(07) VALUE   'IMA1356'.
135800     03  MNT1357 PIC X(07) VALUE   'IMA1357'.
135900     03  MNT1358 PIC X(07) VALUE   'IMA1358'.
136000     03  MNT1359 PIC X(07) VALUE   'IMA1359'.
136100     03  MNT1360 PIC X(07) VALUE   'IMA1360'.
136200     03  MNT1361 PIC X(07) VALUE   'IMA1361'.
136300     03  MNT1362 PIC X(07) VALUE   'IMA1362'.
136400     03  MNT1363 PIC X(07) VALUE   'IMA1363'.
136500     03  MNT1364 PIC X(07) VALUE   'IMA1364'.
136600     03  MNT1365 PIC X(07) VALUE   'IMA1365'.
136700     03  MNT1366 PIC X(07) VALUE   'IMA1366'.
136800     03  MNT1367 PIC X(07) VALUE   'IMA1367'.
136900     03  MNT1368 PIC X(07) VALUE   'IMA1368'.
137000     03  MNT1369 PIC X(07) VALUE   'IMA1369'.
137100     03  MNT1370 PIC X(07) VALUE   'IMA1370'.
137200     03  MNT1371 PIC X(07) VALUE   'IMA1371'.
137300     03  MNT1372 PIC X(07) VALUE   'IMA1372'.
137400     03  MNT1373 PIC X(07) VALUE   'IMA1373'.
137500     03  MNT1374 PIC X(07) VALUE   'IMA1374'.
137600     03  MNT1375 PIC X(07) VALUE   'IMA1375'.
137700     03  MNT1376 PIC X(07) VALUE   'IMA1376'.
137800     03  MNT1377 PIC X(07) VALUE   'IMA1377'.
137900     03  MNT1378 PIC X(07) VALUE   'IMA1378'.
138000     03  MNT1379 PIC X(07) VALUE   'IMA1379'.
138100     03  MNT1380 PIC X(07) VALUE   'IMA1380'.
138200     03  MNT1381 PIC X(07) VALUE   'IMA1381'.
138300     03  MNT1382 PIC X(07) VALUE   'IMA1382'.
138400     03  MNT1383 PIC X(07) VALUE   'IMA1383'.
138500     03  MNT1384 PIC X(07) VALUE   'IMA1384'.
138600     03  MNT1385 PIC X(07) VALUE   'IMA1385'.
138700     03  MNT1386 PIC X(07) VALUE   'IMA1386'.
138800     03  MNT1387 PIC X(07) VALUE   'IMA1387'.
138900     03  MNT1388 PIC X(07) VALUE   'IMA1388'.
139000     03  MNT1389 PIC X(07) VALUE   'IMA1389'.
139100     03  MNT1390 PIC X(07) VALUE   '       '.
139200     03  MNT1391 PIC X(07) VALUE   'IMA1391'.
139300     03  MNT1392 PIC X(07) VALUE   'IMA1392'.
139400     03  MNT1393 PIC X(07) VALUE   'IMA1393'.
139500     03  MNT1394 PIC X(07) VALUE   'IMA1394'.
139600     03  MNT1395 PIC X(07) VALUE   'IMA1395'.
139700     03  MNT1396 PIC X(07) VALUE   'IMA1396'.
139800     03  MNT1397 PIC X(07) VALUE   'IMA1397'.
139900     03  MNT1398 PIC X(07) VALUE   'IMA1398'.
140000     03  MNT1399 PIC X(07) VALUE   'IMA1399'.
140100     03  MNT1400 PIC X(07) VALUE   'IMA1400'.
140200     03  MNT1401 PIC X(07) VALUE   'IMA1401'.
140300     03  MNT1402 PIC X(07) VALUE   'IMA1402'.
140400     03  MNT1403 PIC X(07) VALUE   'IMA1403'.
140500     03  MNT1404 PIC X(07) VALUE   'IMA1404'.
140600     03  MNT1405 PIC X(07) VALUE   'IMA1405'.
140700     03  MNT1406 PIC X(07) VALUE   'IMA1406'.
140800     03  MNT1407 PIC X(07) VALUE   'IMA1407'.
140900     03  MNT1408 PIC X(07) VALUE   'IMA1407'.
141000     03  MNT1409 PIC X(07) VALUE   'IMA1407'.
141100     03  MNT1410 PIC X(07) VALUE   'IMA1407'.
141200     03  MNT1411 PIC X(07) VALUE   'IMA1407'.
141300     03  MNT1412 PIC X(07) VALUE   'IMA1412'.
141400     03  MNT1413 PIC X(07) VALUE   'IMA1413'.
141500     03  MNT1414 PIC X(07) VALUE   'IMA1414'.
141600     03  MNT1415 PIC X(07) VALUE   'IMA1415'.
141700     03  MNT1416 PIC X(07) VALUE   'IMA1416'.
141800     03  MNT1417 PIC X(07) VALUE   'IMA1417'.
141900     03  MNT1418 PIC X(07) VALUE   'IMA1418'.
142000     03  MNT1419 PIC X(07) VALUE   'IMA1419'.
142100     03  MNT1420 PIC X(07) VALUE   'IMA1420'.
142200     03  MNT1421 PIC X(07) VALUE   'IMA1421'.
142300     03  MNT1422 PIC X(07) VALUE   'IMA1422'.
142400     03  MNT1423 PIC X(07) VALUE   'IMA1423'.
142500     03  MNT1424 PIC X(07) VALUE   'IMA1424'.
142600     03  MNT1425 PIC X(07) VALUE   'IMA1425'.
142700     03  MNT1426 PIC X(07) VALUE   'IMA1426'.
142800     03  MNT1427 PIC X(07) VALUE   'IMA1427'.
142900     03  MNT1428 PIC X(07) VALUE   'IMA1428'.
143000     03  MNT1429 PIC X(07) VALUE   'IMA1429'.
143100     03  MNT1430 PIC X(07) VALUE   'IMA1430'.
143200     03  MNT1431 PIC X(07) VALUE   'IMA1431'.
143300     03  MNT1432 PIC X(07) VALUE   'IMA1432'.
143400     03  MNT1433 PIC X(07) VALUE   'IMA1433'.
143500     03  MNT1434 PIC X(07) VALUE   'IMA1434'.
143600     03  MNT1435 PIC X(07) VALUE   'IMA1435'.
143700     03  MNT1436 PIC X(07) VALUE   'IMA1436'.
143800     03  MNT1437 PIC X(07) VALUE   'IMA1437'.
143900     03  MNT1438 PIC X(07) VALUE   'IMA1438'.
144000     03  MNT1439 PIC X(07) VALUE   'IMA1439'.
144100     03  MNT1440 PIC X(07) VALUE   'IMA1440'.
144200     03  MNT1441 PIC X(07) VALUE   'IMA1441'.
144300     03  MNT1442 PIC X(07) VALUE   'IMA1442'.
144400     03  MNT1443 PIC X(07) VALUE   'IMA1443'.
144500     03  MNT1444 PIC X(07) VALUE   'IMA1444'.
144600     03  MNT1445 PIC X(07) VALUE   'IMA1445'.
144700     03  MNT1446 PIC X(07) VALUE   'IMA1446'.
144800     03  MNT1447 PIC X(07) VALUE   'IMA1447'.
144900     03  MNT1448 PIC X(07) VALUE   'IMA1448'.
145000     03  MNT1449 PIC X(07) VALUE   'IMA1449'.
145100     03  MNT1450 PIC X(07) VALUE   'IMA1450'.
145200     03  MNT1451 PIC X(07) VALUE   'IMA1451'.
145300     03  MNT1452 PIC X(07) VALUE   'IMA1452'.
145400     03  MNT1453 PIC X(07) VALUE   'IMA1453'.
145500     03  MNT1454 PIC X(07) VALUE   'IMA1454'.
145600     03  MNT1455 PIC X(07) VALUE   'IMA1455'.
145700     03  MNT1456 PIC X(07) VALUE   'IMA1456'.
145800     03  MNT1457 PIC X(07) VALUE   'IMA1456'.
145900     03  MNT1458 PIC X(07) VALUE   'IMA1456'.
146000     03  MNT1459 PIC X(07) VALUE   'IMA1456'.
146100     03  MNT1460 PIC X(07) VALUE   'IMA1456'.
146200     03  MNT1461 PIC X(07) VALUE   'IMA1456'.
146300     03  MNT1462 PIC X(07) VALUE   'IMA1456'.
146400     03  MNT1463 PIC X(07) VALUE   'IMA1456'.
146500     03  MNT1464 PIC X(07) VALUE   'IMA1456'.
146600     03  MNT1465 PIC X(07) VALUE   'IMA1456'.
146700     03  MNT1466 PIC X(07) VALUE   'IMA1456'.
146800     03  MNT1467 PIC X(07) VALUE   'IMA1456'.
146900     03  MNT1468 PIC X(07) VALUE   'IMA1468'.
147000     03  MNT1469 PIC X(07) VALUE   'IMA1469'.
147100     03  MNT1470 PIC X(07) VALUE   'IMA1470'.
147200     03  MNT1471 PIC X(07) VALUE   '       '.
147300     03  MNT1472 PIC X(07) VALUE   'IMA1472'.
147400     03  MNT1473 PIC X(07) VALUE   'IMA1473'.
147500     03  MNT1474 PIC X(07) VALUE   'IMA1474'.
147600     03  MNT1475 PIC X(07) VALUE   'IMA1475'.
147700     03  MNT1476 PIC X(07) VALUE   'IMA1476'.
147800     03  MNT1477 PIC X(07) VALUE   'IMA1477'.
147900     03  MNT1478 PIC X(07) VALUE   'IMA1478'.
148000     03  MNT1479 PIC X(07) VALUE   '       '.
148100     03  MNT1480 PIC X(07) VALUE   '       '.
148200     03  MNT1481 PIC X(07) VALUE   '       '.
148300     03  MNT1482 PIC X(07) VALUE   '       '.
148400     03  MNT1483 PIC X(07) VALUE   '       '.
148500     03  MNT1484 PIC X(07) VALUE   '       '.
148600     03  MNT1485 PIC X(07) VALUE   '       '.
148700     03  MNT1486 PIC X(07) VALUE   '       '.
148800     03  MNT1487 PIC X(07) VALUE   '       '.
148900     03  MNT1488 PIC X(07) VALUE   '       '.
149000     03  MNT1489 PIC X(07) VALUE   '       '.
149100     03  MNT1490 PIC X(07) VALUE   '       '.
149200     03  MNT1491 PIC X(07) VALUE   '       '.
149300     03  MNT1492 PIC X(07) VALUE   '       '.
149400     03  MNT1493 PIC X(07) VALUE   '       '.
149500     03  MNT1494 PIC X(07) VALUE   'IMA0395'.
149600     03  MNT1495 PIC X(07) VALUE   'IMA0396'.
149700     03  MNT1496 PIC X(07) VALUE   'IMA0397'.
149800     03  MNT1497 PIC X(07) VALUE   'IMA1497'.
149900     03  MNT1498 PIC X(07) VALUE   'IMA1498'.
150000     03  MNT1499 PIC X(07) VALUE   'IMA1499'.
150100     03  MNT1500 PIC X(07) VALUE   'IMA1500'.
150200     03  MNT1501 PIC X(07) VALUE   'IMA0912'.
150300     03  MNT1502 PIC X(07) VALUE   'IMA0914'.
150400     03  MNT1503 PIC X(07) VALUE   'IMA0912'.
150500     03  MNT1504 PIC X(07) VALUE   'IMA0914'.
150600     03  MNT1505 PIC X(07) VALUE   'IMA0912'.
150700     03  MNT1506 PIC X(07) VALUE   'IMA0914'.
150800     03  MNT1507 PIC X(07) VALUE   'IMA0912'.
150900     03  MNT1508 PIC X(07) VALUE   'IMA0914'.
151000     03  MNT1509 PIC X(07) VALUE   'IMA0912'.
151100     03  MNT1510 PIC X(07) VALUE   'IMA0914'.
151200     03  MNT1511 PIC X(07) VALUE   'IMA0912'.
151300     03  MNT1512 PIC X(07) VALUE   'IMA0914'.
151400     03  MNT1513 PIC X(07) VALUE   'IMA0912'.
151500     03  MNT1514 PIC X(07) VALUE   'IMA0914'.
151600     03  MNT1515 PIC X(07) VALUE   'IMA0912'.
151700     03  MNT1516 PIC X(07) VALUE   'IMA0914'.
151800     03  MNT1517 PIC X(07) VALUE   'IMA0912'.
151900     03  MNT1518 PIC X(07) VALUE   'IMA0914'.
152000     03  MNT1519 PIC X(07) VALUE   'IMA0912'.
152100     03  MNT1520 PIC X(07) VALUE   'IMA0914'.
152200     03  MNT1521 PIC X(07) VALUE   'IMA0912'.
152300     03  MNT1522 PIC X(07) VALUE   'IMA0914'.
152400     03  MNT1523 PIC X(07) VALUE   'IMA0912'.
152500     03  MNT1524 PIC X(07) VALUE   'IMA0914'.
152600     03  MNT1525 PIC X(07) VALUE   'IMA0912'.
152700     03  MNT1526 PIC X(07) VALUE   'IMA0914'.
152800     03  MNT1527 PIC X(07) VALUE   'IMA0912'.
152900     03  MNT1528 PIC X(07) VALUE   'IMA0914'.
153000     03  MNT1529 PIC X(07) VALUE   'IMA0912'.
153100     03  MNT1530 PIC X(07) VALUE   'IMA0914'.
153200     03  MNT1531 PIC X(07) VALUE   'IMA0912'.
153300     03  MNT1532 PIC X(07) VALUE   'IMA0914'.
153400     03  MNT1533 PIC X(07) VALUE   'IMA0912'.
153500     03  MNT1534 PIC X(07) VALUE   'IMA0914'.
153600     03  MNT1535 PIC X(07) VALUE   'IMA0912'.
153700     03  MNT1536 PIC X(07) VALUE   'IMA0914'.
153800     03  MNT1537 PIC X(07) VALUE   'IMA0912'.
153900     03  MNT1538 PIC X(07) VALUE   'IMA0914'.
154000     03  MNT1539 PIC X(07) VALUE   'IMA0912'.
154100     03  MNT1540 PIC X(07) VALUE   'IMA0914'.
154200     03  MNT1541 PIC X(07) VALUE   'IMA0912'.
154300     03  MNT1542 PIC X(07) VALUE   'IMA0914'.
154400     03  MNT1543 PIC X(07) VALUE   'IMA0912'.
154500     03  MNT1544 PIC X(07) VALUE   'IMA0914'.
154600     03  MNT1545 PIC X(07) VALUE   'IMA0912'.
154700     03  MNT1546 PIC X(07) VALUE   'IMA0914'.
154800     03  MNT1547 PIC X(07) VALUE   'IMA0912'.
154900     03  MNT1548 PIC X(07) VALUE   'IMA0914'.
155000     03  MNT1549 PIC X(07) VALUE   'IMA0912'.
155100     03  MNT1550 PIC X(07) VALUE   'IMA0914'.
155200     03  MNT1551 PIC X(07) VALUE   'IMA0912'.
155300     03  MNT1552 PIC X(07) VALUE   'IMA0914'.
155400     03  MNT1553 PIC X(07) VALUE   'IMA0912'.
155500     03  MNT1554 PIC X(07) VALUE   'IMA0914'.
155600     03  MNT1555 PIC X(07) VALUE   'IMA0912'.
155700     03  MNT1556 PIC X(07) VALUE   'IMA0914'.
155800     03  MNT1557 PIC X(07) VALUE   'IMA0912'.
155900     03  MNT1558 PIC X(07) VALUE   'IMA0914'.
156000     03  MNT1559 PIC X(07) VALUE   'IMA0912'.
156100     03  MNT1560 PIC X(07) VALUE   'IMA0914'.
156200     03  MNT1561 PIC X(07) VALUE   'IMA0912'.
156300     03  MNT1562 PIC X(07) VALUE   'IMA0914'.
156400     03  MNT1563 PIC X(07) VALUE   'IMA0912'.
156500     03  MNT1564 PIC X(07) VALUE   'IMA0914'.
156600     03  MNT1565 PIC X(07) VALUE   'IMA0912'.
156700     03  MNT1566 PIC X(07) VALUE   'IMA0914'.
156800     03  MNT1567 PIC X(07) VALUE   'IMA0912'.
156900     03  MNT1568 PIC X(07) VALUE   'IMA0914'.
157000     03  MNT1569 PIC X(07) VALUE   'IMA0912'.
157100     03  MNT1570 PIC X(07) VALUE   'IMA0914'.
157200     03  MNT1571 PIC X(07) VALUE   'IMA0912'.
157300     03  MNT1572 PIC X(07) VALUE   'IMA0914'.
157400     03  MNT1573 PIC X(07) VALUE   'IMA0912'.
157500     03  MNT1574 PIC X(07) VALUE   'IMA0914'.
157600     03  MNT1575 PIC X(07) VALUE   'IMA0912'.
157700     03  MNT1576 PIC X(07) VALUE   'IMA0914'.
157800     03  MNT1577 PIC X(07) VALUE   'IMA0912'.
157900     03  MNT1578 PIC X(07) VALUE   'IMA0914'.
158000     03  MNT1579 PIC X(07) VALUE   'IMA0912'.
158100     03  MNT1580 PIC X(07) VALUE   'IMA0914'.
158200     03  MNT1581 PIC X(07) VALUE   'IMA0912'.
158300     03  MNT1582 PIC X(07) VALUE   'IMA0914'.
158400     03  MNT1583 PIC X(07) VALUE   'IMA0912'.
158500     03  MNT1584 PIC X(07) VALUE   'IMA0914'.
158600     03  MNT1585 PIC X(07) VALUE   'IMA0912'.
158700     03  MNT1586 PIC X(07) VALUE   'IMA0914'.
158800     03  MNT1587 PIC X(07) VALUE   'IMA0912'.
158900     03  MNT1588 PIC X(07) VALUE   'IMA0914'.
159000     03  MNT1589 PIC X(07) VALUE   'IMA0912'.
159100     03  MNT1590 PIC X(07) VALUE   'IMA0914'.
159200     03  MNT1591 PIC X(07) VALUE   'IMA0912'.
159300     03  MNT1592 PIC X(07) VALUE   'IMA0914'.
159400     03  MNT1593 PIC X(07) VALUE   'IMA0912'.
159500     03  MNT1594 PIC X(07) VALUE   'IMA0914'.
159600     03  MNT1595 PIC X(07) VALUE   'IMA0912'.
159700     03  MNT1596 PIC X(07) VALUE   'IMA0914'.
159800     03  MNT1597 PIC X(07) VALUE   'IMA0912'.
159900     03  MNT1598 PIC X(07) VALUE   'IMA0914'.
160000     03  MNT1599 PIC X(07) VALUE   'IMA0912'.
160100     03  MNT1600 PIC X(07) VALUE   'IMA0914'.
160200     03  MNT1601 PIC X(07) VALUE   'IMA0912'.
160300     03  MNT1602 PIC X(07) VALUE   'IMA0914'.
160400     03  MNT1603 PIC X(07) VALUE   'IMA0912'.
160500     03  MNT1604 PIC X(07) VALUE   'IMA0914'.
160600     03  MNT1605 PIC X(07) VALUE   'IMA0912'.
160700     03  MNT1606 PIC X(07) VALUE   'IMA0914'.
160800     03  MNT1607 PIC X(07) VALUE   'IMA0912'.
160900     03  MNT1608 PIC X(07) VALUE   'IMA0914'.
161000     03  MNT1609 PIC X(07) VALUE   'IMA0912'.
161100     03  MNT1610 PIC X(07) VALUE   'IMA0914'.
161200     03  MNT1611 PIC X(07) VALUE   'IMA0912'.
161300     03  MNT1612 PIC X(07) VALUE   'IMA0914'.
161400     03  MNT1613 PIC X(07) VALUE   'IMA0912'.
161500     03  MNT1614 PIC X(07) VALUE   'IMA0914'.
161600     03  MNT1615 PIC X(07) VALUE   'IMA0912'.
161700     03  MNT1616 PIC X(07) VALUE   'IMA0914'.
161800     03  MNT1617 PIC X(07) VALUE   'IMA0912'.
161900     03  MNT1618 PIC X(07) VALUE   'IMA0914'.
162000     03  MNT1619 PIC X(07) VALUE   'IMA0912'.
162100     03  MNT1620 PIC X(07) VALUE   'IMA0914'.
162200     03  MNT1621 PIC X(07) VALUE   'IMA0912'.
162300     03  MNT1622 PIC X(07) VALUE   'IMA0914'.
162400     03  MNT1623 PIC X(07) VALUE   'IMA0912'.
162500     03  MNT1624 PIC X(07) VALUE   'IMA0914'.
162600     03  MNT1625 PIC X(07) VALUE   'IMA0912'.
162700     03  MNT1626 PIC X(07) VALUE   'IMA0914'.
162800     03  MNT1627 PIC X(07) VALUE   'IMA0912'.
162900     03  MNT1628 PIC X(07) VALUE   'IMA0914'.
163000     03  MNT1629 PIC X(07) VALUE   'IMA0912'.
163100     03  MNT1630 PIC X(07) VALUE   'IMA0914'.
163200     03  MNT1631 PIC X(07) VALUE   'IMA0912'.
163300     03  MNT1632 PIC X(07) VALUE   'IMA0914'.
163400     03  MNT1633 PIC X(07) VALUE   'IMA0912'.
163500     03  MNT1634 PIC X(07) VALUE   'IMA0914'.
163600     03  MNT1635 PIC X(07) VALUE   'IMA0912'.
163700     03  MNT1636 PIC X(07) VALUE   'IMA0914'.
163800     03  MNT1637 PIC X(07) VALUE   'IMA0912'.
163900     03  MNT1638 PIC X(07) VALUE   'IMA0914'.
164000     03  MNT1639 PIC X(07) VALUE   'IMA0912'.
164100     03  MNT1640 PIC X(07) VALUE   'IMA0914'.
164200     03  MNT1641 PIC X(07) VALUE   'IMA0912'.
164300     03  MNT1642 PIC X(07) VALUE   'IMA0914'.
164400     03  MNT1643 PIC X(07) VALUE   'IMA0912'.
164500     03  MNT1644 PIC X(07) VALUE   'IMA0914'.
164600     03  MNT1645 PIC X(07) VALUE   'IMA0912'.
164700     03  MNT1646 PIC X(07) VALUE   'IMA0914'.
164800     03  MNT1647 PIC X(07) VALUE   'IMA0912'.
164900     03  MNT1648 PIC X(07) VALUE   'IMA0914'.
165000     03  MNT1649 PIC X(07) VALUE   'IMA0912'.
165100     03  MNT1650 PIC X(07) VALUE   'IMA0914'.
165200     03  MNT1651 PIC X(07) VALUE   'IMA0912'.
165300     03  MNT1652 PIC X(07) VALUE   'IMA0914'.
165400     03  MNT1653 PIC X(07) VALUE   'IMA0912'.
165500     03  MNT1654 PIC X(07) VALUE   'IMA0914'.
165600     03  MNT1655 PIC X(07) VALUE   'IMA0912'.
165700     03  MNT1656 PIC X(07) VALUE   'IMA0914'.
165800     03  MNT1657 PIC X(07) VALUE   'IMA0912'.
165900     03  MNT1658 PIC X(07) VALUE   'IMA0914'.
166000     03  MNT1659 PIC X(07) VALUE   'IMA0912'.
166100     03  MNT1660 PIC X(07) VALUE   'IMA0914'.
166200     03  MNT1661 PIC X(07) VALUE   'IMA0912'.
166300     03  MNT1662 PIC X(07) VALUE   'IMA0914'.
166400     03  MNT1663 PIC X(07) VALUE   'IMA0912'.
166500     03  MNT1664 PIC X(07) VALUE   'IMA0914'.
166600     03  MNT1665 PIC X(07) VALUE   'IMA0912'.
166700     03  MNT1666 PIC X(07) VALUE   'IMA0914'.
166800     03  MNT1667 PIC X(07) VALUE   'IMA0912'.
166900     03  MNT1668 PIC X(07) VALUE   'IMA0914'.
167000     03  MNT1669 PIC X(07) VALUE   'IMA0912'.
167100     03  MNT1670 PIC X(07) VALUE   'IMA0914'.
167200     03  MNT1671 PIC X(07) VALUE   'IMA0912'.
167300     03  MNT1672 PIC X(07) VALUE   'IMA0914'.
167400     03  MNT1673 PIC X(07) VALUE   'IMA0912'.
167500     03  MNT1674 PIC X(07) VALUE   'IMA0914'.
167600     03  MNT1675 PIC X(07) VALUE   'IMA0912'.
167700     03  MNT1676 PIC X(07) VALUE   'IMA0914'.
167800     03  MNT1677 PIC X(07) VALUE   'IMA0912'.
167900     03  MNT1678 PIC X(07) VALUE   'IMA0914'.
168000     03  MNT1679 PIC X(07) VALUE   'IMA0912'.
168100     03  MNT1680 PIC X(07) VALUE   'IMA0914'.
168200     03  MNT1681 PIC X(07) VALUE   'IMA0912'.
168300     03  MNT1682 PIC X(07) VALUE   'IMA0914'.
168400     03  MNT1683 PIC X(07) VALUE   'IMA0912'.
168500     03  MNT1684 PIC X(07) VALUE   'IMA0914'.
168600     03  MNT1685 PIC X(07) VALUE   'IMA0912'.
168700     03  MNT1686 PIC X(07) VALUE   'IMA0914'.
168800     03  MNT1687 PIC X(07) VALUE   'IMA0912'.
168900     03  MNT1688 PIC X(07) VALUE   'IMA0914'.
169000     03  MNT1689 PIC X(07) VALUE   'IMA0912'.
169100     03  MNT1690 PIC X(07) VALUE   'IMA0914'.
169200     03  MNT1691 PIC X(07) VALUE   'IMA0912'.
169300     03  MNT1692 PIC X(07) VALUE   'IMA0914'.
169400     03  MNT1693 PIC X(07) VALUE   'IMA0912'.
169500     03  MNT1694 PIC X(07) VALUE   'IMA0914'.
169600     03  MNT1695 PIC X(07) VALUE   'IMA0912'.
169700     03  MNT1696 PIC X(07) VALUE   'IMA0914'.
169800     03  MNT1697 PIC X(07) VALUE   'IMA0912'.
169900     03  MNT1698 PIC X(07) VALUE   'IMA0914'.
170000     03  MNT1699 PIC X(07) VALUE   'IMA0912'.
170100     03  MNT1700 PIC X(07) VALUE   'IMA0914'.
170200     03  MNT1701 PIC X(07) VALUE   'IMA0912'.
170300     03  MNT1702 PIC X(07) VALUE   'IMA0914'.
170400     03  MNT1703 PIC X(07) VALUE   'IMA0912'.
170500     03  MNT1704 PIC X(07) VALUE   'IMA0914'.
170600     03  MNT1705 PIC X(07) VALUE   'IMA0912'.
170700     03  MNT1706 PIC X(07) VALUE   'IMA0914'.
170800     03  MNT1707 PIC X(07) VALUE   'IMA0912'.
170900     03  MNT1708 PIC X(07) VALUE   'IMA0914'.
171000     03  MNT1709 PIC X(07) VALUE   'IMA0912'.
171100     03  MNT1710 PIC X(07) VALUE   'IMA0914'.
171200     03  MNT1711 PIC X(07) VALUE   'IMA0912'.
171300     03  MNT1712 PIC X(07) VALUE   'IMA0914'.
171400     03  MNT1713 PIC X(07) VALUE   'IMA0912'.
171500     03  MNT1714 PIC X(07) VALUE   'IMA0914'.
171600     03  MNT1715 PIC X(07) VALUE   'IMA0912'.
171700     03  MNT1716 PIC X(07) VALUE   'IMA0914'.
171800     03  MNT1717 PIC X(07) VALUE   'IMA0912'.
171900     03  MNT1718 PIC X(07) VALUE   'IMA0914'.
172000     03  MNT1719 PIC X(07) VALUE   'IMA0912'.
172100     03  MNT1720 PIC X(07) VALUE   'IMA0914'.
172200     03  MNT1721 PIC X(07) VALUE   'IMA0912'.
172300     03  MNT1722 PIC X(07) VALUE   'IMA0914'.
172400     03  MNT1723 PIC X(07) VALUE   'IMA0912'.
172500     03  MNT1724 PIC X(07) VALUE   'IMA0914'.
172600     03  MNT1725 PIC X(07) VALUE   'IMA0912'.
172700     03  MNT1726 PIC X(07) VALUE   'IMA0914'.
172800     03  MNT1727 PIC X(07) VALUE   'IMA0912'.
172900     03  MNT1728 PIC X(07) VALUE   'IMA0914'.
173000     03  MNT1729 PIC X(07) VALUE   'IMA0912'.
173100     03  MNT1730 PIC X(07) VALUE   'IMA0914'.
173200     03  MNT1731 PIC X(07) VALUE   'IMA0912'.
173300     03  MNT1732 PIC X(07) VALUE   'IMA0914'.
173400     03  MNT1733 PIC X(07) VALUE   'IMA0912'.
173500     03  MNT1734 PIC X(07) VALUE   'IMA0914'.
173600     03  MNT1735 PIC X(07) VALUE   'IMA0912'.
173700     03  MNT1736 PIC X(07) VALUE   'IMA0914'.
173800     03  MNT1737 PIC X(07) VALUE   'IMA0912'.
173900     03  MNT1738 PIC X(07) VALUE   'IMA0914'.
174000     03  MNT1739 PIC X(07) VALUE   'IMA0912'.
174100     03  MNT1740 PIC X(07) VALUE   'IMA0914'.
174200     03  MNT1741 PIC X(07) VALUE   'IMA0912'.
174300     03  MNT1742 PIC X(07) VALUE   'IMA0914'.
174400     03  MNT1743 PIC X(07) VALUE   'IMA0912'.
174500     03  MNT1744 PIC X(07) VALUE   'IMA0914'.
174600     03  MNT1745 PIC X(07) VALUE   'IMA0912'.
174700     03  MNT1746 PIC X(07) VALUE   'IMA0914'.
174800     03  MNT1747 PIC X(07) VALUE   'IMA0912'.
174900     03  MNT1748 PIC X(07) VALUE   'IMA0914'.
175000     03  MNT1749 PIC X(07) VALUE   'IMA0912'.
175100     03  MNT1750 PIC X(07) VALUE   'IMA0914'.
175200     03  MNT1751 PIC X(07) VALUE   'IMA0912'.
175300     03  MNT1752 PIC X(07) VALUE   'IMA0914'.
175400     03  MNT1753 PIC X(07) VALUE   'IMA0912'.
175500     03  MNT1754 PIC X(07) VALUE   'IMA0914'.
175600     03  MNT1755 PIC X(07) VALUE   'IMA0912'.
175700     03  MNT1756 PIC X(07) VALUE   'IMA0914'.
175800     03  MNT1757 PIC X(07) VALUE   'IMA0912'.
175900     03  MNT1758 PIC X(07) VALUE   'IMA0914'.
176000     03  MNT1759 PIC X(07) VALUE   'IMA0912'.
176100     03  MNT1760 PIC X(07) VALUE   'IMA0914'.
176200     03  MNT1761 PIC X(07) VALUE   'IMA0912'.
176300     03  MNT1762 PIC X(07) VALUE   'IMA0914'.
176400     03  MNT1763 PIC X(07) VALUE   'IMA0912'.
176500     03  MNT1764 PIC X(07) VALUE   'IMA0914'.
176600     03  MNT1765 PIC X(07) VALUE   'IMA0912'.
176700     03  MNT1766 PIC X(07) VALUE   'IMA0914'.
176800     03  MNT1767 PIC X(07) VALUE   'IMA0912'.
176900     03  MNT1768 PIC X(07) VALUE   'IMA0914'.
177000     03  MNT1769 PIC X(07) VALUE   'IMA0912'.
177100     03  MNT1770 PIC X(07) VALUE   'IMA0914'.
177200     03  MNT1771 PIC X(07) VALUE   'IMA0912'.
177300     03  MNT1772 PIC X(07) VALUE   'IMA0914'.
177400     03  MNT1773 PIC X(07) VALUE   'IMA0912'.
177500     03  MNT1774 PIC X(07) VALUE   'IMA0914'.
177600     03  MNT1775 PIC X(07) VALUE   'IMA0912'.
177700     03  MNT1776 PIC X(07) VALUE   'IMA0914'.
177800     03  MNT1777 PIC X(07) VALUE   'IMA0912'.
177900     03  MNT1778 PIC X(07) VALUE   'IMA0914'.
178000     03  MNT1779 PIC X(07) VALUE   'IMA0912'.
178100     03  MNT1780 PIC X(07) VALUE   'IMA0914'.
178200     03  MNT1781 PIC X(07) VALUE   'IMA0912'.
178300     03  MNT1782 PIC X(07) VALUE   'IMA0914'.
178400     03  MNT1783 PIC X(07) VALUE   'IMA0912'.
178500     03  MNT1784 PIC X(07) VALUE   'IMA0914'.
178600     03  MNT1785 PIC X(07) VALUE   'IMA0912'.
178700     03  MNT1786 PIC X(07) VALUE   'IMA0914'.
178800     03  MNT1787 PIC X(07) VALUE   'IMA0912'.
178900     03  MNT1788 PIC X(07) VALUE   'IMA0914'.
179000     03  MNT1789 PIC X(07) VALUE   'IMA0912'.
179100     03  MNT1790 PIC X(07) VALUE   'IMA0914'.
179200     03  MNT1791 PIC X(07) VALUE   'IMA0912'.
179300     03  MNT1792 PIC X(07) VALUE   'IMA0914'.
179400     03  MNT1793 PIC X(07) VALUE   'IMA0912'.
179500     03  MNT1794 PIC X(07) VALUE   'IMA0914'.
179600     03  MNT1795 PIC X(07) VALUE   'IMA0912'.
179700     03  MNT1796 PIC X(07) VALUE   'IMA0914'.
179800     03  MNT1797 PIC X(07) VALUE   'IMA0912'.
179900     03  MNT1798 PIC X(07) VALUE   'IMA0914'.
180000     03  MNT1799 PIC X(07) VALUE   'IMA0912'.
180100     03  MNT1800 PIC X(07) VALUE   'IMA0914'.
180200     03  MNT1801 PIC X(07) VALUE   'IMA0912'.
180300     03  MNT1802 PIC X(07) VALUE   'IMA0914'.
180400     03  MNT1803 PIC X(07) VALUE   'IMA0912'.
180500     03  MNT1804 PIC X(07) VALUE   'IMA0914'.
180600     03  MNT1805 PIC X(07) VALUE   'IMA0912'.
180700     03  MNT1806 PIC X(07) VALUE   'IMA0914'.
180800     03  MNT1807 PIC X(07) VALUE   'IMA0912'.
180900     03  MNT1808 PIC X(07) VALUE   'IMA0914'.
181000     03  MNT1809 PIC X(07) VALUE   'IMA0912'.
181100     03  MNT1810 PIC X(07) VALUE   'IMA0914'.
181200     03  MNT1811 PIC X(07) VALUE   'IMA0912'.
181300     03  MNT1812 PIC X(07) VALUE   'IMA0914'.
181400     03  MNT1813 PIC X(07) VALUE   'IMA0912'.
181500     03  MNT1814 PIC X(07) VALUE   'IMA0914'.
181600     03  MNT1815 PIC X(07) VALUE   'IMA0912'.
181700     03  MNT1816 PIC X(07) VALUE   'IMA0914'.
181800     03  MNT1817 PIC X(07) VALUE   'IMA0912'.
181900     03  MNT1818 PIC X(07) VALUE   'IMA0914'.
182000     03  MNT1819 PIC X(07) VALUE   'IMA0912'.
182100     03  MNT1820 PIC X(07) VALUE   'IMA0914'.
182200     03  MNT1821 PIC X(07) VALUE   'IMA0912'.
182300     03  MNT1822 PIC X(07) VALUE   'IMA0914'.
182400     03  MNT1823 PIC X(07) VALUE   'IMA0912'.
182500     03  MNT1824 PIC X(07) VALUE   'IMA0914'.
182600     03  MNT1825 PIC X(07) VALUE   'IMA0912'.
182700     03  MNT1826 PIC X(07) VALUE   'IMA0914'.
182800     03  MNT1827 PIC X(07) VALUE   'IMA0912'.
182900     03  MNT1828 PIC X(07) VALUE   'IMA0914'.
183000     03  MNT1829 PIC X(07) VALUE   'IMA0912'.
183100     03  MNT1830 PIC X(07) VALUE   'IMA0914'.
183200     03  MNT1831 PIC X(07) VALUE   'IMA0912'.
183300     03  MNT1832 PIC X(07) VALUE   'IMA0914'.
183400     03  MNT1833 PIC X(07) VALUE   'IMA0912'.
183500     03  MNT1834 PIC X(07) VALUE   'IMA0914'.
183600     03  MNT1835 PIC X(07) VALUE   'IMA0912'.
183700     03  MNT1836 PIC X(07) VALUE   'IMA0914'.
183800     03  MNT1837 PIC X(07) VALUE   'IMA0912'.
183900     03  MNT1838 PIC X(07) VALUE   'IMA0914'.
184000     03  MNT1839 PIC X(07) VALUE   'IMA0912'.
184100     03  MNT1840 PIC X(07) VALUE   'IMA0914'.
184200     03  MNT1841 PIC X(07) VALUE   'IMA0912'.
184300     03  MNT1842 PIC X(07) VALUE   'IMA0914'.
184400     03  MNT1843 PIC X(07) VALUE   'IMA0912'.
184500     03  MNT1844 PIC X(07) VALUE   'IMA0914'.
184600     03  MNT1845 PIC X(07) VALUE   'IMA0912'.
184700     03  MNT1846 PIC X(07) VALUE   'IMA0914'.
184800     03  MNT1847 PIC X(07) VALUE   'IMA0912'.
184900     03  MNT1848 PIC X(07) VALUE   'IMA0914'.
185000     03  MNT1849 PIC X(07) VALUE   'IMA0912'.
185100     03  MNT1850 PIC X(07) VALUE   'IMA0914'.
185200     03  MNT1851 PIC X(07) VALUE   'IMA1851'.
185300     03  MNT1852 PIC X(07) VALUE   'IMA1852'.
185400     03  MNT1853 PIC X(07) VALUE   'IMA1853'.
185500     03  MNT1854 PIC X(07) VALUE   'IMA1854'.
185600     03  MNT1855 PIC X(07) VALUE   'IMA1855'.
185700     03  MNT1856 PIC X(07) VALUE   'IMA1856'.
185800     03  MNT1857 PIC X(07) VALUE   'IMA1857'.
185900     03  MNT1858 PIC X(07) VALUE   'IMA1858'.
186000     03  MNT1859 PIC X(07) VALUE   'IMA1859'.
186100     03  MNT1860 PIC X(07) VALUE   'IMA1860'.
186200     03  MNT1861 PIC X(07) VALUE   'IMA1861'.
186300     03  MNT1862 PIC X(07) VALUE   'IMA1862'.
186400     03  MNT1863 PIC X(07) VALUE   'IMA1863'.
186500     03  MNT1864 PIC X(07) VALUE   'IMA1864'.
186600     03  MNT1865 PIC X(07) VALUE   'IMA1865'.
186700     03  MNT1866 PIC X(07) VALUE   'IMA1866'.
186800     03  MNT1867 PIC X(07) VALUE   'IMA1867'.
186900     03  MNT1868 PIC X(07) VALUE   'IMA1868'.
187000     03  MNT1869 PIC X(07) VALUE   'IMA1869'.
187100     03  MNT1870 PIC X(07) VALUE   'IMA1870'.
187200     03  MNT1871 PIC X(07) VALUE   'IMA1871'.
187300     03  MNT1872 PIC X(07) VALUE   'IMA1872'.
187400     03  MNT1873 PIC X(07) VALUE   'IMA1873'.
187500     03  MNT1874 PIC X(07) VALUE   'IMA1874'.
187600     03  MNT1875 PIC X(07) VALUE   'IMA1875'.
187700     03  MNT1876 PIC X(07) VALUE   'IMA1876'.
187800     03  MNT1877 PIC X(07) VALUE   'IMA1877'.
187900     03  MNT1878 PIC X(07) VALUE   'IMA1878'.
188000     03  MNT1879 PIC X(07) VALUE   'IMA1879'.
188100     03  MNT1880 PIC X(07) VALUE   'IMA1880'.
188200     03  MNT1881 PIC X(07) VALUE   'IMA1881'.
188300     03  MNT1882 PIC X(07) VALUE   'IMA1882'.
188400     03  MNT1883 PIC X(07) VALUE   'IMA1883'.
188500     03  MNT1884 PIC X(07) VALUE   'IMA1884'.
188600     03  MNT1885 PIC X(07) VALUE   'IMA1885'.
188700     03  MNT1886 PIC X(07) VALUE   'IMA1886'.
188800     03  MNT1887 PIC X(07) VALUE   'IMA1887'.
188900     03  MNT1888 PIC X(07) VALUE   'IMA1888'.
189000     03  MNT1889 PIC X(07) VALUE   'IMA1889'.
189100     03  MNT1890 PIC X(07) VALUE   'IMA1890'.
189200     03  MNT1891 PIC X(07) VALUE   'IMA1891'.
189300     03  MNT1892 PIC X(07) VALUE   'IMA1892'.
189400     03  MNT1893 PIC X(07) VALUE   'IMA1893'.
189500     03  MNT1894 PIC X(07) VALUE   'IMA1894'.
189600     03  MNT1895 PIC X(07) VALUE   'IMA1895'.
189700     03  MNT1896 PIC X(07) VALUE   'IMA1896'.
189800     03  MNT1897 PIC X(07) VALUE   'IMA1897'.
189900     03  MNT1898 PIC X(07) VALUE   'IMA1898'.
190000     03  MNT1899 PIC X(07) VALUE   'IMA1899'.
190100     03  MNT1900 PIC X(07) VALUE   'IMA1900'.
190200     03  MNT1901 PIC X(07) VALUE   'IMA1901'.
190300     03  MNT1902 PIC X(07) VALUE   'IMA1902'.
190400     03  MNT1903 PIC X(07) VALUE   'IMA1903'.
190500     03  MNT1904 PIC X(07) VALUE   'IMA1904'.
190600     03  MNT1905 PIC X(07) VALUE   'IMA1905'.
190700     03  MNT1906 PIC X(07) VALUE   'IMA1906'.
190800     03  MNT1907 PIC X(07) VALUE   'IMA1907'.
190900     03  MNT1908 PIC X(07) VALUE   'IMA1908'.
191000     03  MNT1909 PIC X(07) VALUE   'IMA1909'.
191100     03  MNT1910 PIC X(07) VALUE   'IMA1910'.
191200     03  MNT1911 PIC X(07) VALUE   'IMA1911'.
191300     03  MNT1912 PIC X(07) VALUE   'IMA1912'.
191400     03  MNT1913 PIC X(07) VALUE   'IMA1913'.
191500     03  MNT1914 PIC X(07) VALUE   'IMA1914'.
191600     03  MNT1915 PIC X(07) VALUE   'IMA1915'.
191700     03  MNT1916 PIC X(07) VALUE   'IMA1916'.
191800     03  MNT1917 PIC X(07) VALUE   'IMA1917'.
191900     03  MNT1918 PIC X(07) VALUE   'IMA1918'.
192000     03  MNT1919 PIC X(07) VALUE   'IMA1919'.
192100     03  MNT1920 PIC X(07) VALUE   'IMA1920'.
192200     03  MNT1921 PIC X(07) VALUE   'IMA1921'.
192300     03  MNT1922 PIC X(07) VALUE   'IMA1922'.
192400     03  MNT1923 PIC X(07) VALUE   'IMA1923'.
192500     03  MNT1924 PIC X(07) VALUE   'IMA1924'.
192600     03  MNT1925 PIC X(07) VALUE   'IMA1925'.
192700     03  MNT1926 PIC X(07) VALUE   'IMA1926'.
192800     03  MNT1927 PIC X(07) VALUE   'IMA1927'.
192900     03  MNT1928 PIC X(07) VALUE   'IMA1928'.
193000     03  MNT1929 PIC X(07) VALUE   'IMA1929'.
193100     03  MNT1930 PIC X(07) VALUE   'IMA1930'.
193200     03  MNT1931 PIC X(07) VALUE   'IMA1931'.
193300     03  MNT1932 PIC X(07) VALUE   'IMA1932'.
193400     03  MNT1933 PIC X(07) VALUE   'IMA1933'.
193500     03  MNT1934 PIC X(07) VALUE   'IMA1934'.
193600     03  MNT1935 PIC X(07) VALUE   'IMA1935'.
193700     03  MNT1936 PIC X(07) VALUE   'IMA1936'.
193800     03  MNT1937 PIC X(07) VALUE   'IMA1937'.
193900     03  MNT1938 PIC X(07) VALUE   'IMA1938'.
194000     03  MNT1939 PIC X(07) VALUE   'IMA1939'.
194100     03  MNT1940 PIC X(07) VALUE   'IMA1940'.
194200     03  MNT1941 PIC X(07) VALUE   'IMA1941'.
194300     03  MNT1942 PIC X(07) VALUE   'IMA1942'.
194400     03  MNT1943 PIC X(07) VALUE   'IMA1943'.
194500     03  MNT1944 PIC X(07) VALUE   'IMA1944'.
194600     03  MNT1945 PIC X(07) VALUE   'IMA1945'.
194700     03  MNT1946 PIC X(07) VALUE   'IMA1946'.
194800     03  MNT1947 PIC X(07) VALUE   'IMA1947'.
194900     03  MNT1948 PIC X(07) VALUE   'IMA1948'.
195000     03  MNT1949 PIC X(07) VALUE   'IMA1949'.
195100     03  MNT1950 PIC X(07) VALUE   'IMA1950'.
195200     03  MNT1951 PIC X(07) VALUE   'IMA1951'.
195300     03  MNT1952 PIC X(07) VALUE   'IMA1952'.
195400     03  MNT1953 PIC X(07) VALUE   'IMA1953'.
195500     03  MNT1954 PIC X(07) VALUE   'IMA1954'.
195600     03  MNT1955 PIC X(07) VALUE   'IMA1955'.
195700     03  MNT1956 PIC X(07) VALUE   'IMA1956'.
195800     03  MNT1957 PIC X(07) VALUE   'IMA1957'.
195900     03  MNT1958 PIC X(07) VALUE   'IMA1958'.
196000     03  MNT1959 PIC X(07) VALUE   'IMA1959'.
196100     03  MNT1960 PIC X(07) VALUE   'IMA1960'.
196200     03  MNT1961 PIC X(07) VALUE   'IMA1961'.
196300     03  MNT1962 PIC X(07) VALUE   'IMA1962'.
196400     03  MNT1963 PIC X(07) VALUE   'IMA1963'.
196500     03  MNT1964 PIC X(07) VALUE   'IMA1964'.
196600     03  MNT1965 PIC X(07) VALUE   'IMA1965'.
196700     03  MNT1966 PIC X(07) VALUE   'IMA1966'.
196800     03  MNT1967 PIC X(07) VALUE   'IMA1967'.
196900     03  MNT1968 PIC X(07) VALUE   'IMA1968'.
197000     03  MNT1969 PIC X(07) VALUE   'IMA1969'.
197100     03  MNT1970 PIC X(07) VALUE   'IMA1970'.
197200     03  MNT1971 PIC X(07) VALUE   'IMA1971'.
197300     03  MNT1972 PIC X(07) VALUE   'IMA1972'.
197400     03  MNT1973 PIC X(07) VALUE   'IMA1973'.
197500     03  MNT1974 PIC X(07) VALUE   'IMA1974'.
197600     03  MNT1975 PIC X(07) VALUE   'IMA1975'.
197700     03  MNT1976 PIC X(07) VALUE   'IMA1976'.
197800     03  MNT1977 PIC X(07) VALUE   'IMA1977'.
197900     03  MNT1978 PIC X(07) VALUE   'IMA1978'.
198000     03  MNT1979 PIC X(07) VALUE   'IMA1979'.
198100     03  MNT1980 PIC X(07) VALUE   'IMA1980'.
198200     03  MNT1981 PIC X(07) VALUE   'IMA9401'.
198300     03  MNT1982 PIC X(07) VALUE   '       '.
198400     03  MNT1983 PIC X(07) VALUE   '       '.
198500     03  MNT1984 PIC X(07) VALUE   'IMA1984'.
198600     03  MNT1985 PIC X(07) VALUE   'IMA1985'.
198700     03  MNT1986 PIC X(07) VALUE   'IMA1986'.
198800     03  MNT1987 PIC X(07) VALUE   'IMA1987'.
198900     03  MNT1988 PIC X(07) VALUE   'IMA1988'.
199000     03  MNT1989 PIC X(07) VALUE   'IMA1989'.
199100     03  MNT1990 PIC X(07) VALUE   'IMA1990'.
199200     03  MNT1991 PIC X(07) VALUE   'IMA1991'.
199300     03  MNT1992 PIC X(07) VALUE   'IMA1992'.
199400     03  MNT1993 PIC X(07) VALUE   'IMA1993'.
199500     03  MNT1994 PIC X(07) VALUE   'IMA1994'.
199600     03  MNT1995 PIC X(07) VALUE   'IMA1995'.
199700     03  MNT1996 PIC X(07) VALUE   'IMA1996'.
199800     03  MNT1997 PIC X(07) VALUE   'IMA1997'.
199900     03  MNT1998 PIC X(07) VALUE   'IMA1998'.
200000     03  MNT1999 PIC X(07) VALUE   'IMA1999'.
200100     03  MNT2000 PIC X(07) VALUE   'IMA2000'.
200200     03  MNT2001 PIC X(07) VALUE   'IMA2001'.
200300     03  MNT2002 PIC X(07) VALUE   'IMA2002'.
200400     03  MNT2003 PIC X(07) VALUE   'IMA2003'.
200500     03  MNT2004 PIC X(07) VALUE   'IMA2004'.
200600     03  MNT2005 PIC X(07) VALUE   'IMA2005'.
200700     03  MNT2006 PIC X(07) VALUE   'IMA2006'.
200800     03  MNT2007 PIC X(07) VALUE   'IMA2007'.
200900     03  MNT2008 PIC X(07) VALUE   'IMA2008'.
201000     03  MNT2009 PIC X(07) VALUE   'IMA2009'.
201100     03  MNT2010 PIC X(07) VALUE   'IMA2010'.
201200     03  MNT2011 PIC X(07) VALUE   'IMA2011'.
201300     03  MNT2012 PIC X(07) VALUE   'IMA2012'.
201400     03  MNT2013 PIC X(07) VALUE   'IMA2013'.
201500     03  MNT2014 PIC X(07) VALUE   'IMA2014'.
201600     03  MNT2015 PIC X(07) VALUE   'IMA2015'.
201700     03  MNT2016 PIC X(07) VALUE   'IMA2016'.
201800     03  MNT2017 PIC X(07) VALUE   'IMA2017'.
201900     03  MNT2018 PIC X(07) VALUE   'IMA2018'.
202000     03  MNT2019 PIC X(07) VALUE   'IMA2019'.
202100     03  MNT2020 PIC X(07) VALUE   'IMA2020'.
202200     03  MNT2021 PIC X(07) VALUE   'IMA2021'.
202300     03  MNT2022 PIC X(07) VALUE   'IMA2022'.
202400     03  MNT2023 PIC X(07) VALUE   'IMA2023'.
202500     03  MNT2024 PIC X(07) VALUE   'IMA2024'.
202600     03  MNT2025 PIC X(07) VALUE   'IMA2025'.
202700     03  MNT2026 PIC X(07) VALUE   'IMA2026'.
202800     03  MNT2027 PIC X(07) VALUE   '       '.
202900     03  MNT2028 PIC X(07) VALUE   '       '.
203000     03  MNT2029 PIC X(07) VALUE   '       '.
203100     03  MNT2030 PIC X(07) VALUE   '       '.
203200     03  MNT2031 PIC X(07) VALUE   '       '.
203300     03  MNT2032 PIC X(07) VALUE   '       '.
203400     03  MNT2033 PIC X(07) VALUE   '       '.
203500     03  MNT2034 PIC X(07) VALUE   '       '.
203600     03  MNT2035 PIC X(07) VALUE   '       '.
203700     03  MNT2036 PIC X(07) VALUE   '       '.
203800     03  MNT2037 PIC X(07) VALUE   '       '.
203900     03  MNT2038 PIC X(07) VALUE   '       '.
204000     03  MNT2039 PIC X(07) VALUE   'IMA2039'.
204100     03  MNT2040 PIC X(07) VALUE   'IMA2040'.
204200     03  MNT2041 PIC X(07) VALUE   'IMA2041'.
204300     03  MNT2042 PIC X(07) VALUE   'IMA2042'.
204400     03  MNT2043 PIC X(07) VALUE   'IMA2043'.
204500     03  MNT2044 PIC X(07) VALUE   'IMA9237'.
204600     03  MNT2045 PIC X(07) VALUE   '       '.
204700     03  MNT2046 PIC X(07) VALUE   '       '.
204800     03  MNT2047 PIC X(07) VALUE   '       '.
204900     03  MNT2048 PIC X(07) VALUE   'IMA2048'.
205000     03  MNT2049 PIC X(07) VALUE   'IMA2049'.
205100     03  MNT2050 PIC X(07) VALUE   'IMA2050'.
205200     03  MNT2051 PIC X(07) VALUE   'IMA2051'.
205300     03  MNT2052 PIC X(07) VALUE   'IMA2052'.
205400     03  MNT2053 PIC X(07) VALUE   '       '.
205500     03  MNT2054 PIC X(07) VALUE   '       '.
205600     03  MNT2055 PIC X(07) VALUE   '       '.
205700     03  MNT2056 PIC X(07) VALUE   '       '.
205800     03  MNT2057 PIC X(07) VALUE   '       '.
205900     03  MNT2058 PIC X(07) VALUE   '       '.
206000     03  MNT2059 PIC X(07) VALUE   '       '.
206100     03  MNT2060 PIC X(07) VALUE   '       '.
206200     03  MNT2061 PIC X(07) VALUE   '       '.
206300     03  MNT2062 PIC X(07) VALUE   '       '.
206400     03  MNT2063 PIC X(07) VALUE   '       '.
206500     03  MNT2064 PIC X(07) VALUE   '       '.
206600     03  MNT2065 PIC X(07) VALUE   '       '.
206700     03  MNT2066 PIC X(07) VALUE   '       '.
206800     03  MNT2067 PIC X(07) VALUE   '       '.
206900     03  MNT2068 PIC X(07) VALUE   '       '.
207000     03  MNT2069 PIC X(07) VALUE   '       '.
207100     03  MNT2070 PIC X(07) VALUE   '       '.
207200     03  MNT2071 PIC X(07) VALUE   '       '.
207300     03  MNT2072 PIC X(07) VALUE   '       '.
207400     03  MNT2073 PIC X(07) VALUE   '       '.
207500     03  MNT2074 PIC X(07) VALUE   '       '.
207600     03  MNT2075 PIC X(07) VALUE   '       '.
207700     03  MNT2076 PIC X(07) VALUE   '       '.
207800     03  MNT2077 PIC X(07) VALUE   '       '.
207900     03  MNT2078 PIC X(07) VALUE   '       '.
208000     03  MNT2079 PIC X(07) VALUE   '       '.
208100     03  MNT2080 PIC X(07) VALUE   '       '.
208200     03  MNT2081 PIC X(07) VALUE   '       '.
208300     03  MNT2082 PIC X(07) VALUE   '       '.
208400     03  MNT2083 PIC X(07) VALUE   '       '.
208500     03  MNT2084 PIC X(07) VALUE   '       '.
208600     03  MNT2085 PIC X(07) VALUE   '       '.
208700     03  MNT2086 PIC X(07) VALUE   '       '.
208800     03  MNT2087 PIC X(07) VALUE   '       '.
208900     03  MNT2088 PIC X(07) VALUE   '       '.
209000     03  MNT2089 PIC X(07) VALUE   '       '.
209100     03  MNT2090 PIC X(07) VALUE   '       '.
209200     03  MNT2091 PIC X(07) VALUE   '       '.
209300     03  MNT2092 PIC X(07) VALUE   '       '.
209400     03  MNT2093 PIC X(07) VALUE   '       '.
209500     03  MNT2094 PIC X(07) VALUE   '       '.
209600     03  MNT2095 PIC X(07) VALUE   '       '.
209700     03  MNT2096 PIC X(07) VALUE   '       '.
209800     03  MNT2097 PIC X(07) VALUE   '       '.
209900     03  MNT2098 PIC X(07) VALUE   '       '.
210000     03  MNT2099 PIC X(07) VALUE   '       '.
210100     03  MNT2100 PIC X(07) VALUE   '       '.
210200     03  MNT2101 PIC X(07) VALUE   '       '.
210300     03  MNT2102 PIC X(07) VALUE   '       '.
210400     03  MNT2103 PIC X(07) VALUE   '       '.
210500     03  MNT2104 PIC X(07) VALUE   '       '.
210600     03  MNT2105 PIC X(07) VALUE   '       '.
210700     03  MNT2106 PIC X(07) VALUE   '       '.
210800     03  MNT2107 PIC X(07) VALUE   '       '.
210900     03  MNT2108 PIC X(07) VALUE   '       '.
211000     03  MNT2109 PIC X(07) VALUE   '       '.
211100     03  MNT2110 PIC X(07) VALUE   '       '.
211200     03  MNT2111 PIC X(07) VALUE   '       '.
211300     03  MNT2112 PIC X(07) VALUE   '       '.
211400     03  MNT2113 PIC X(07) VALUE   '       '.
211500     03  MNT2114 PIC X(07) VALUE   '       '.
211600     03  MNT2115 PIC X(07) VALUE   '       '.
211700     03  MNT2116 PIC X(07) VALUE   '       '.
211800     03  MNT2117 PIC X(07) VALUE   '       '.
211900     03  MNT2118 PIC X(07) VALUE   '       '.
212000     03  MNT2119 PIC X(07) VALUE   '       '.
212100     03  MNT2120 PIC X(07) VALUE   'IMA2120'.
212200     03  MNT2121 PIC X(07) VALUE   'IMA2121'.
212300     03  MNT2122 PIC X(07) VALUE   'IMA2122'.
212400     03  MNT2123 PIC X(07) VALUE   'IMA2123'.
212500     03  MNT2124 PIC X(07) VALUE   'IMA2124'.
212600     03  MNT2125 PIC X(07) VALUE   'IMA2125'.
212700     03  MNT2126 PIC X(07) VALUE   'IMA2126'.
212800     03  MNT2127 PIC X(07) VALUE   'IMA2127'.
212900     03  MNT2128 PIC X(07) VALUE   'IMA2128'.
213000     03  MNT2129 PIC X(07) VALUE   'IMA2129'.
213100     03  MNT2130 PIC X(07) VALUE   'IMA2130'.
213200     03  MNT2131 PIC X(07) VALUE   'IMA2131'.
213300     03  MNT2132 PIC X(07) VALUE   'IMA2132'.
213400     03  MNT2133 PIC X(07) VALUE   'IMA2133'.
213500     03  MNT2134 PIC X(07) VALUE   'IMA2134'.
213600     03  MNT2135 PIC X(07) VALUE   'IMA2135'.
213700     03  MNT2136 PIC X(07) VALUE   'IMA2136'.
213800     03  MNT2137 PIC X(07) VALUE   'IMA2137'.
213900     03  MNT2138 PIC X(07) VALUE   'IMA2138'.
214000     03  MNT2139 PIC X(07) VALUE   'IMA2139'.
214100     03  MNT2140 PIC X(07) VALUE   'IMA2140'.
214200     03  MNT2141 PIC X(07) VALUE   'IMA2141'.
214300     03  MNT2142 PIC X(07) VALUE   'IMA2142'.
214400     03  MNT2143 PIC X(07) VALUE   'IMA2143'.
214500     03  MNT2144 PIC X(07) VALUE   'IMA2144'.
214600     03  MNT2145 PIC X(07) VALUE   'IMA2145'.
214700     03  MNT2146 PIC X(07) VALUE   'IMA2146'.
214800     03  MNT2147 PIC X(07) VALUE   'IMA2147'.
214900     03  MNT2148 PIC X(07) VALUE   'IMA2148'.
215000     03  MNT2149 PIC X(07) VALUE   'IMA2149'.
215100     03  MNT2150 PIC X(07) VALUE   'IMA2150'.
215200     03  MNT2151 PIC X(07) VALUE   'IMA2151'.
215300     03  MNT2152 PIC X(07) VALUE   'IMA2152'.
215400     03  MNT2153 PIC X(07) VALUE   'IMA2153'.
215500     03  MNT2154 PIC X(07) VALUE   'IMA2154'.
215600     03  MNT2155 PIC X(07) VALUE   'IMA9279'.
215700     03  MNT2156 PIC X(07) VALUE   '       '.
215800     03  MNT2157 PIC X(07) VALUE   '       '.
215900     03  MNT2158 PIC X(07) VALUE   '       '.
216000     03  MNT2159 PIC X(07) VALUE   '       '.
216100     03  MNT2160 PIC X(07) VALUE   '       '.
216200     03  MNT2161 PIC X(07) VALUE   '       '.
216300     03  MNT2162 PIC X(07) VALUE   'IMA9281'.
216400     03  MNT2163 PIC X(07) VALUE   '       '.
216500     03  MNT2164 PIC X(07) VALUE   '       '.
216600     03  MNT2165 PIC X(07) VALUE   '       '.
216700     03  MNT2166 PIC X(07) VALUE   '       '.
216800     03  MNT2167 PIC X(07) VALUE   '       '.
216900     03  MNT2168 PIC X(07) VALUE   '       '.
217000     03  MNT2169 PIC X(07) VALUE   'IMA9283'.
217100     03  MNT2170 PIC X(07) VALUE   'IMA2170'.
217200     03  MNT2171 PIC X(07) VALUE   'IMA9284'.
217300     03  MNT2172 PIC X(07) VALUE   '       '.
217400     03  MNT2173 PIC X(07) VALUE   '       '.
217500     03  MNT2174 PIC X(07) VALUE   'IMA2176'.
217600     03  MNT2175 PIC X(07) VALUE   'IMA9285'.
217700     03  MNT2176 PIC X(07) VALUE   '       '.
217800     03  MNT2177 PIC X(07) VALUE   '       '.
217900     03  MNT2178 PIC X(07) VALUE   '       '.
218000     03  MNT2179 PIC X(07) VALUE   'IMA2179'.
218100     03  MNT2180 PIC X(07) VALUE   'IMA2180'.
218200     03  MNT2181 PIC X(07) VALUE   'IMA2181'.
218300     03  MNT2182 PIC X(07) VALUE   'IMA2182'.
218400     03  MNT2183 PIC X(07) VALUE   'IMA2183'.
218500     03  MNT2184 PIC X(07) VALUE   'IMA2184'.
218600     03  MNT2185 PIC X(07) VALUE   'IMA2185'.
218700     03  MNT2186 PIC X(07) VALUE   'IMA2186'.
218800     03  MNT2187 PIC X(07) VALUE   'IMA2187'.
218900     03  MNT2188 PIC X(07) VALUE   'IMA2188'.
219000     03  MNT2189 PIC X(07) VALUE   'IMA2189'.
219100     03  MNT2190 PIC X(07) VALUE   'IMA2190'.
219200     03  MNT2191 PIC X(07) VALUE   'IMA2191'.
219300     03  MNT2192 PIC X(07) VALUE   'IMA2192'.
219400     03  MNT2193 PIC X(07) VALUE   'IMA2193'.
219500     03  MNT2194 PIC X(07) VALUE   'IMA2194'.
219600     03  MNT2195 PIC X(07) VALUE   'IMA2195'.
219700     03  MNT2196 PIC X(07) VALUE   'IMA2196'.
219800     03  MNT2197 PIC X(07) VALUE   'IMA2197'.
219900     03  MNT2198 PIC X(07) VALUE   'IMA2198'.
220000     03  MNT2199 PIC X(07) VALUE   'IMA9290'.
220100     03  MNT2200 PIC X(07) VALUE   '       '.
220200     03  MNT2201 PIC X(07) VALUE   '       '.
220300     03  MNT2202 PIC X(07) VALUE   '       '.
220400     03  MNT2203 PIC X(07) VALUE   '       '.
220500     03  MNT2204 PIC X(07) VALUE   'IMA2204'.
220600     03  MNT2205 PIC X(07) VALUE   'IMA2205'.
220700     03  MNT2206 PIC X(07) VALUE   'IMA2206'.
220800     03  MNT2207 PIC X(07) VALUE   'IMA2207'.
220900     03  MNT2208 PIC X(07) VALUE   'IMA2208'.
221000     03  MNT2209 PIC X(07) VALUE   'IMA2209'.
221100     03  MNT2210 PIC X(07) VALUE   'IMA2210'.
221200     03  MNT2211 PIC X(07) VALUE   'IMA2211'.
221300     03  MNT2212 PIC X(07) VALUE   'IMA2212'.
221400     03  MNT2213 PIC X(07) VALUE   'IMA2213'.
221500     03  MNT2214 PIC X(07) VALUE   'IMA2214'.
221600     03  MNT2215 PIC X(07) VALUE   'IMA2215'.
221700     03  MNT2216 PIC X(07) VALUE   'IMA2216'.
221800     03  MNT2217 PIC X(07) VALUE   'IMA2217'.
221900     03  MNT2218 PIC X(07) VALUE   'IMA2218'.
222000     03  MNT2219 PIC X(07) VALUE   'IMA2219'.
222100     03  MNT2220 PIC X(07) VALUE   'IMA2220'.
222200     03  MNT2221 PIC X(07) VALUE   'IMA2221'.
222300     03  MNT2222 PIC X(07) VALUE   'IMA2222'.
222400     03  MNT2223 PIC X(07) VALUE   'IMA2223'.
222500     03  MNT2224 PIC X(07) VALUE   'IMA2224'.
222600     03  MNT2225 PIC X(07) VALUE   'IMA2225'.
222700     03  MNT2226 PIC X(07) VALUE   'IMA2226'.
222800     03  MNT2227 PIC X(07) VALUE   'IMA2227'.
222900     03  MNT2228 PIC X(07) VALUE   'IMA2228'.
223000     03  MNT2229 PIC X(07) VALUE   'IMA2229'.
223100     03  MNT2230 PIC X(07) VALUE   'IMA2230'.
223200     03  MNT2231 PIC X(07) VALUE   'IMA2231'.
223300     03  MNT2232 PIC X(07) VALUE   'IMA9294'.
223400     03  MNT2233 PIC X(07) VALUE   'IMA2233'.
223500     03  MNT2234 PIC X(07) VALUE   'IMA2234'.
223600     03  MNT2235 PIC X(07) VALUE   'IMA2235'.
223700     03  MNT2236 PIC X(07) VALUE   'IMA2236'.
223800     03  MNT2237 PIC X(07) VALUE   'IMA2237'.
223900     03  MNT2238 PIC X(07) VALUE   'IMA2238'.
224000     03  MNT2239 PIC X(07) VALUE   'IMA2239'.
224100     03  MNT2240 PIC X(07) VALUE   'IMA2240'.
224200     03  MNT2241 PIC X(07) VALUE   'IMA2241'.
224300     03  MNT2242 PIC X(07) VALUE   'IMA2242'.
224400     03  MNT2243 PIC X(07) VALUE   'IMA9296'.
224500     03  MNT2244 PIC X(07) VALUE   'IMA2244'.
224600     03  MNT2245 PIC X(07) VALUE   'IMA2245'.
224700     03  MNT2246 PIC X(07) VALUE   'IMA2246'.
224800     03  MNT2247 PIC X(07) VALUE   'IMA2247'.
224900     03  MNT2248 PIC X(07) VALUE   'IMA2248'.
225000     03  MNT2249 PIC X(07) VALUE   'IMA2249'.
225100     03  MNT2250 PIC X(07) VALUE   'IMA2250'.
225200     03  MNT2251 PIC X(07) VALUE   'IMA2251'.
225300     03  MNT2252 PIC X(07) VALUE   'IMA2252'.
225400     03  MNT2253 PIC X(07) VALUE   'IMA2253'.
225500     03  MNT2254 PIC X(07) VALUE   'IMA2254'.
225600     03  MNT2255 PIC X(07) VALUE   'IMA2255'.
225700     03  MNT2256 PIC X(07) VALUE   'IMA2256'.
225800     03  MNT2257 PIC X(07) VALUE   'IMA2257'.
225900     03  MNT2258 PIC X(07) VALUE   'IMA2258'.
226000     03  MNT2259 PIC X(07) VALUE   'IMA2259'.
226100     03  MNT2260 PIC X(07) VALUE   'IMA2260'.
226200     03  MNT2261 PIC X(07) VALUE   'IMA2261'.
226300     03  MNT2262 PIC X(07) VALUE   'IMA2262'.
226400     03  MNT2263 PIC X(07) VALUE   'IMA2263'.
226500     03  MNT2264 PIC X(07) VALUE   'IMA2264'.
226600     03  MNT2265 PIC X(07) VALUE   'IMA2265'.
226700     03  MNT2266 PIC X(07) VALUE   'IMA2266'.
226800     03  MNT2267 PIC X(07) VALUE   'IMA2267'.
226900     03  MNT2268 PIC X(07) VALUE   'IMA2268'.
227000     03  MNT2269 PIC X(07) VALUE   'IMA2269'.
227100     03  MNT2270 PIC X(07) VALUE   'IMA2270'.
227200     03  MNT2271 PIC X(07) VALUE   'IMA9299'.
227300     03  MNT2272 PIC X(07) VALUE   '       '.
227400     03  MNT2273 PIC X(07) VALUE   '       '.
227500     03  MNT2274 PIC X(07) VALUE   '       '.
227600     03  MNT2275 PIC X(07) VALUE   '       '.
227700     03  MNT2276 PIC X(07) VALUE   'IMA9418'.
227800     03  MNT2277 PIC X(07) VALUE   '       '.
227900     03  MNT2278 PIC X(07) VALUE   '       '.
228000     03  MNT2279 PIC X(07) VALUE   '       '.
228100     03  MNT2280 PIC X(07) VALUE   '       '.
228200     03  MNT2281 PIC X(07) VALUE   'IMA2281'.
228300     03  MNT2282 PIC X(07) VALUE   'IMA9302'.
228400     03  MNT2283 PIC X(07) VALUE   'IMA2283'.
228500     03  MNT2284 PIC X(07) VALUE   'IMA2284'.
228600     03  MNT2285 PIC X(07) VALUE   'IMA2285'.
228700     03  MNT2286 PIC X(07) VALUE   'IMA2286'.
228800     03  MNT2287 PIC X(07) VALUE   'IMA9303'.
228900     03  MNT2288 PIC X(07) VALUE   'IMA2288'.
229000     03  MNT2289 PIC X(07) VALUE   'IMA2289'.
229100     03  MNT2290 PIC X(07) VALUE   'IMA2290'.
229200     03  MNT2291 PIC X(07) VALUE   'IMA2291'.
229300     03  MNT2292 PIC X(07) VALUE   'IMA2292'.
229400     03  MNT2293 PIC X(07) VALUE   'IMA2293'.
229500     03  MNT2294 PIC X(07) VALUE   'IMA2294'.
229600     03  MNT2295 PIC X(07) VALUE   'IMA2295'.
229700     03  MNT2296 PIC X(07) VALUE   'IMA2296'.
229800     03  MNT2297 PIC X(07) VALUE   'IMA2297'.
229900     03  MNT2298 PIC X(07) VALUE   'IMA2298'.
230000     03  MNT2299 PIC X(07) VALUE   'IMA2299'.
230100     03  MNT2300 PIC X(07) VALUE   'IMA2300'.
230200     03  MNT2301 PIC X(07) VALUE   'IMA2301'.
230300     03  MNT2302 PIC X(07) VALUE   'IMA2302'.
230400     03  MNT2303 PIC X(07) VALUE   'IMA2303'.
230500     03  MNT2304 PIC X(07) VALUE   'IMA2304'.
230600     03  MNT2305 PIC X(07) VALUE   'IMA2305'.
230700     03  MNT2306 PIC X(07) VALUE   'IMA2306'.
230800     03  MNT2307 PIC X(07) VALUE   'IMA2307'.
230900     03  MNT2308 PIC X(07) VALUE   '       '.
231000     03  MNT2309 PIC X(07) VALUE   '       '.
231100     03  MNT2310 PIC X(07) VALUE   '       '.
231200     03  MNT2311 PIC X(07) VALUE   '       '.
231300     03  MNT2312 PIC X(07) VALUE   '       '.
231400     03  MNT2313 PIC X(07) VALUE   '       '.
231500     03  MNT2314 PIC X(07) VALUE   '       '.
231600     03  MNT2315 PIC X(07) VALUE   '       '.
231700     03  MNT2316 PIC X(07) VALUE   'IMA2316'.
231800     03  MNT2317 PIC X(07) VALUE   'IMA2317'.
231900     03  MNT2318 PIC X(07) VALUE   'IMA2318'.
232000     03  MNT2319 PIC X(07) VALUE   'IMA2319'.
232100     03  MNT2320 PIC X(07) VALUE   'IMA2320'.
232200     03  MNT2321 PIC X(07) VALUE   'IMA2321'.
232300     03  MNT2322 PIC X(07) VALUE   'IMA2322'.
232400     03  MNT2323 PIC X(07) VALUE   'IMA2323'.
232500     03  MNT2324 PIC X(07) VALUE   'IMA2324'.
232600     03  MNT2325 PIC X(07) VALUE   'IMA9429'.
232700     03  MNT2326 PIC X(07) VALUE   '       '.
232800     03  MNT2327 PIC X(07) VALUE   '       '.
232900     03  MNT2328 PIC X(07) VALUE   '       '.
233000     03  MNT2329 PIC X(07) VALUE   '       '.
233100     03  MNT2330 PIC X(07) VALUE   '       '.
233200     03  MNT2331 PIC X(07) VALUE   '       '.
233300     03  MNT2332 PIC X(07) VALUE   '       '.
233400     03  MNT2333 PIC X(07) VALUE   '       '.
233500     03  MNT2334 PIC X(07) VALUE   '       '.
233600     03  MNT2335 PIC X(07) VALUE   '       '.
233700     03  MNT2336 PIC X(07) VALUE   '       '.
233800     03  MNT2337 PIC X(07) VALUE   '       '.
233900     03  MNT2338 PIC X(07) VALUE   '       '.
234000     03  MNT2339 PIC X(07) VALUE   '       '.
234100     03  MNT2340 PIC X(07) VALUE   '       '.
234200     03  MNT2341 PIC X(07) VALUE   '       '.
234300     03  MNT2342 PIC X(07) VALUE   '       '.
234400     03  MNT2343 PIC X(07) VALUE   '       '.
234500     03  MNT2344 PIC X(07) VALUE   '       '.
234600     03  MNT2345 PIC X(07) VALUE   '       '.
234700     03  MNT2346 PIC X(07) VALUE   '       '.
234800     03  MNT2347 PIC X(07) VALUE   'IMA2347'.
234900     03  MNT2348 PIC X(07) VALUE   'IMA2348'.
235000     03  MNT2349 PIC X(07) VALUE   'IMA2349'.
235100     03  MNT2350 PIC X(07) VALUE   'IMA2350'.
235200     03  MNT2351 PIC X(07) VALUE   'IMA2351'.
235300     03  MNT2352 PIC X(07) VALUE   'IMA2352'.
235400     03  MNT2353 PIC X(07) VALUE   'IMA2353'.
235500 01  FILLER REDEFINES ELEMENT-ID-TABLE.
235600     03  TSMNT-TRAN-TRAILER OCCURS 2353 TIMES.
235700         05  TSMNT-ELE-ID        PIC X(7).
235800