         MACRO                                                          00000100
&LABEL   SIRETRN &RC=0                                                  00000200
&LABEL   L     13,4(0,13)                                               00000300
         RETURN (14,12),RC=&RC                                          00000400
         MEND                                                           00000500