             DS    0H                 ENSURE ALIGNMENT
CZFY110S  EQU  *      .             START OF MAP DEFINITION
         DS    12C .             TIOA PREFIX
        SPACE
Y110C01L DS    CL2 .  INPUT DATA FIELD LEN
Y110C01F DS    0C .   DATA FIELD FLAG
Y110C01A DS    C .    DATA FIELD ATTRIBUTE
Y110C01I DS    0CL20 .  INPUT DATA FIELD
Y110C01O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V01L DS    CL2 .  INPUT DATA FIELD LEN
Y110V01F DS    0C .   DATA FIELD FLAG
Y110V01A DS    C .    DATA FIELD ATTRIBUTE
Y110V01I DS    0CL8 .  INPUT DATA FIELD
Y110V01O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C02L DS    CL2 .  INPUT DATA FIELD LEN
Y110C02F DS    0C .   DATA FIELD FLAG
Y110C02A DS    C .    DATA FIELD ATTRIBUTE
Y110C02I DS    0CL20 .  INPUT DATA FIELD
Y110C02O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V02L DS    CL2 .  INPUT DATA FIELD LEN
Y110V02F DS    0C .   DATA FIELD FLAG
Y110V02A DS    C .    DATA FIELD ATTRIBUTE
Y110V02I DS    0CL8 .  INPUT DATA FIELD
Y110V02O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C03L DS    CL2 .  INPUT DATA FIELD LEN
Y110C03F DS    0C .   DATA FIELD FLAG
Y110C03A DS    C .    DATA FIELD ATTRIBUTE
Y110C03I DS    0CL20 .  INPUT DATA FIELD
Y110C03O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V03L DS    CL2 .  INPUT DATA FIELD LEN
Y110V03F DS    0C .   DATA FIELD FLAG
Y110V03A DS    C .    DATA FIELD ATTRIBUTE
Y110V03I DS    0CL8 .  INPUT DATA FIELD
Y110V03O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C04L DS    CL2 .  INPUT DATA FIELD LEN
Y110C04F DS    0C .   DATA FIELD FLAG
Y110C04A DS    C .    DATA FIELD ATTRIBUTE
Y110C04I DS    0CL20 .  INPUT DATA FIELD
Y110C04O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V04L DS    CL2 .  INPUT DATA FIELD LEN
Y110V04F DS    0C .   DATA FIELD FLAG
Y110V04A DS    C .    DATA FIELD ATTRIBUTE
Y110V04I DS    0CL8 .  INPUT DATA FIELD
Y110V04O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C05L DS    CL2 .  INPUT DATA FIELD LEN
Y110C05F DS    0C .   DATA FIELD FLAG
Y110C05A DS    C .    DATA FIELD ATTRIBUTE
Y110C05I DS    0CL20 .  INPUT DATA FIELD
Y110C05O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V05L DS    CL2 .  INPUT DATA FIELD LEN
Y110V05F DS    0C .   DATA FIELD FLAG
Y110V05A DS    C .    DATA FIELD ATTRIBUTE
Y110V05I DS    0CL8 .  INPUT DATA FIELD
Y110V05O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C06L DS    CL2 .  INPUT DATA FIELD LEN
Y110C06F DS    0C .   DATA FIELD FLAG
Y110C06A DS    C .    DATA FIELD ATTRIBUTE
Y110C06I DS    0CL20 .  INPUT DATA FIELD
Y110C06O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V06L DS    CL2 .  INPUT DATA FIELD LEN
Y110V06F DS    0C .   DATA FIELD FLAG
Y110V06A DS    C .    DATA FIELD ATTRIBUTE
Y110V06I DS    0CL8 .  INPUT DATA FIELD
Y110V06O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C07L DS    CL2 .  INPUT DATA FIELD LEN
Y110C07F DS    0C .   DATA FIELD FLAG
Y110C07A DS    C .    DATA FIELD ATTRIBUTE
Y110C07I DS    0CL20 .  INPUT DATA FIELD
Y110C07O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V07L DS    CL2 .  INPUT DATA FIELD LEN
Y110V07F DS    0C .   DATA FIELD FLAG
Y110V07A DS    C .    DATA FIELD ATTRIBUTE
Y110V07I DS    0CL8 .  INPUT DATA FIELD
Y110V07O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C08L DS    CL2 .  INPUT DATA FIELD LEN
Y110C08F DS    0C .   DATA FIELD FLAG
Y110C08A DS    C .    DATA FIELD ATTRIBUTE
Y110C08I DS    0CL20 .  INPUT DATA FIELD
Y110C08O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V08L DS    CL2 .  INPUT DATA FIELD LEN
Y110V08F DS    0C .   DATA FIELD FLAG
Y110V08A DS    C .    DATA FIELD ATTRIBUTE
Y110V08I DS    0CL8 .  INPUT DATA FIELD
Y110V08O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C09L DS    CL2 .  INPUT DATA FIELD LEN
Y110C09F DS    0C .   DATA FIELD FLAG
Y110C09A DS    C .    DATA FIELD ATTRIBUTE
Y110C09I DS    0CL20 .  INPUT DATA FIELD
Y110C09O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V09L DS    CL2 .  INPUT DATA FIELD LEN
Y110V09F DS    0C .   DATA FIELD FLAG
Y110V09A DS    C .    DATA FIELD ATTRIBUTE
Y110V09I DS    0CL8 .  INPUT DATA FIELD
Y110V09O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C10L DS    CL2 .  INPUT DATA FIELD LEN
Y110C10F DS    0C .   DATA FIELD FLAG
Y110C10A DS    C .    DATA FIELD ATTRIBUTE
Y110C10I DS    0CL20 .  INPUT DATA FIELD
Y110C10O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V10L DS    CL2 .  INPUT DATA FIELD LEN
Y110V10F DS    0C .   DATA FIELD FLAG
Y110V10A DS    C .    DATA FIELD ATTRIBUTE
Y110V10I DS    0CL8 .  INPUT DATA FIELD
Y110V10O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C11L DS    CL2 .  INPUT DATA FIELD LEN
Y110C11F DS    0C .   DATA FIELD FLAG
Y110C11A DS    C .    DATA FIELD ATTRIBUTE
Y110C11I DS    0CL20 .  INPUT DATA FIELD
Y110C11O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V11L DS    CL2 .  INPUT DATA FIELD LEN
Y110V11F DS    0C .   DATA FIELD FLAG
Y110V11A DS    C .    DATA FIELD ATTRIBUTE
Y110V11I DS    0CL8 .  INPUT DATA FIELD
Y110V11O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C12L DS    CL2 .  INPUT DATA FIELD LEN
Y110C12F DS    0C .   DATA FIELD FLAG
Y110C12A DS    C .    DATA FIELD ATTRIBUTE
Y110C12I DS    0CL20 .  INPUT DATA FIELD
Y110C12O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V12L DS    CL2 .  INPUT DATA FIELD LEN
Y110V12F DS    0C .   DATA FIELD FLAG
Y110V12A DS    C .    DATA FIELD ATTRIBUTE
Y110V12I DS    0CL8 .  INPUT DATA FIELD
Y110V12O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C13L DS    CL2 .  INPUT DATA FIELD LEN
Y110C13F DS    0C .   DATA FIELD FLAG
Y110C13A DS    C .    DATA FIELD ATTRIBUTE
Y110C13I DS    0CL20 .  INPUT DATA FIELD
Y110C13O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V13L DS    CL2 .  INPUT DATA FIELD LEN
Y110V13F DS    0C .   DATA FIELD FLAG
Y110V13A DS    C .    DATA FIELD ATTRIBUTE
Y110V13I DS    0CL8 .  INPUT DATA FIELD
Y110V13O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C14L DS    CL2 .  INPUT DATA FIELD LEN
Y110C14F DS    0C .   DATA FIELD FLAG
Y110C14A DS    C .    DATA FIELD ATTRIBUTE
Y110C14I DS    0CL20 .  INPUT DATA FIELD
Y110C14O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V14L DS    CL2 .  INPUT DATA FIELD LEN
Y110V14F DS    0C .   DATA FIELD FLAG
Y110V14A DS    C .    DATA FIELD ATTRIBUTE
Y110V14I DS    0CL8 .  INPUT DATA FIELD
Y110V14O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C15L DS    CL2 .  INPUT DATA FIELD LEN
Y110C15F DS    0C .   DATA FIELD FLAG
Y110C15A DS    C .    DATA FIELD ATTRIBUTE
Y110C15I DS    0CL20 .  INPUT DATA FIELD
Y110C15O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V15L DS    CL2 .  INPUT DATA FIELD LEN
Y110V15F DS    0C .   DATA FIELD FLAG
Y110V15A DS    C .    DATA FIELD ATTRIBUTE
Y110V15I DS    0CL8 .  INPUT DATA FIELD
Y110V15O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C16L DS    CL2 .  INPUT DATA FIELD LEN
Y110C16F DS    0C .   DATA FIELD FLAG
Y110C16A DS    C .    DATA FIELD ATTRIBUTE
Y110C16I DS    0CL20 .  INPUT DATA FIELD
Y110C16O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V16L DS    CL2 .  INPUT DATA FIELD LEN
Y110V16F DS    0C .   DATA FIELD FLAG
Y110V16A DS    C .    DATA FIELD ATTRIBUTE
Y110V16I DS    0CL8 .  INPUT DATA FIELD
Y110V16O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C17L DS    CL2 .  INPUT DATA FIELD LEN
Y110C17F DS    0C .   DATA FIELD FLAG
Y110C17A DS    C .    DATA FIELD ATTRIBUTE
Y110C17I DS    0CL20 .  INPUT DATA FIELD
Y110C17O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V17L DS    CL2 .  INPUT DATA FIELD LEN
Y110V17F DS    0C .   DATA FIELD FLAG
Y110V17A DS    C .    DATA FIELD ATTRIBUTE
Y110V17I DS    0CL8 .  INPUT DATA FIELD
Y110V17O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C18L DS    CL2 .  INPUT DATA FIELD LEN
Y110C18F DS    0C .   DATA FIELD FLAG
Y110C18A DS    C .    DATA FIELD ATTRIBUTE
Y110C18I DS    0CL20 .  INPUT DATA FIELD
Y110C18O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V18L DS    CL2 .  INPUT DATA FIELD LEN
Y110V18F DS    0C .   DATA FIELD FLAG
Y110V18A DS    C .    DATA FIELD ATTRIBUTE
Y110V18I DS    0CL8 .  INPUT DATA FIELD
Y110V18O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C19L DS    CL2 .  INPUT DATA FIELD LEN
Y110C19F DS    0C .   DATA FIELD FLAG
Y110C19A DS    C .    DATA FIELD ATTRIBUTE
Y110C19I DS    0CL20 .  INPUT DATA FIELD
Y110C19O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V19L DS    CL2 .  INPUT DATA FIELD LEN
Y110V19F DS    0C .   DATA FIELD FLAG
Y110V19A DS    C .    DATA FIELD ATTRIBUTE
Y110V19I DS    0CL8 .  INPUT DATA FIELD
Y110V19O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C20L DS    CL2 .  INPUT DATA FIELD LEN
Y110C20F DS    0C .   DATA FIELD FLAG
Y110C20A DS    C .    DATA FIELD ATTRIBUTE
Y110C20I DS    0CL20 .  INPUT DATA FIELD
Y110C20O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V20L DS    CL2 .  INPUT DATA FIELD LEN
Y110V20F DS    0C .   DATA FIELD FLAG
Y110V20A DS    C .    DATA FIELD ATTRIBUTE
Y110V20I DS    0CL8 .  INPUT DATA FIELD
Y110V20O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C21L DS    CL2 .  INPUT DATA FIELD LEN
Y110C21F DS    0C .   DATA FIELD FLAG
Y110C21A DS    C .    DATA FIELD ATTRIBUTE
Y110C21I DS    0CL20 .  INPUT DATA FIELD
Y110C21O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V21L DS    CL2 .  INPUT DATA FIELD LEN
Y110V21F DS    0C .   DATA FIELD FLAG
Y110V21A DS    C .    DATA FIELD ATTRIBUTE
Y110V21I DS    0CL8 .  INPUT DATA FIELD
Y110V21O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C22L DS    CL2 .  INPUT DATA FIELD LEN
Y110C22F DS    0C .   DATA FIELD FLAG
Y110C22A DS    C .    DATA FIELD ATTRIBUTE
Y110C22I DS    0CL20 .  INPUT DATA FIELD
Y110C22O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V22L DS    CL2 .  INPUT DATA FIELD LEN
Y110V22F DS    0C .   DATA FIELD FLAG
Y110V22A DS    C .    DATA FIELD ATTRIBUTE
Y110V22I DS    0CL8 .  INPUT DATA FIELD
Y110V22O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C23L DS    CL2 .  INPUT DATA FIELD LEN
Y110C23F DS    0C .   DATA FIELD FLAG
Y110C23A DS    C .    DATA FIELD ATTRIBUTE
Y110C23I DS    0CL20 .  INPUT DATA FIELD
Y110C23O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V23L DS    CL2 .  INPUT DATA FIELD LEN
Y110V23F DS    0C .   DATA FIELD FLAG
Y110V23A DS    C .    DATA FIELD ATTRIBUTE
Y110V23I DS    0CL8 .  INPUT DATA FIELD
Y110V23O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C24L DS    CL2 .  INPUT DATA FIELD LEN
Y110C24F DS    0C .   DATA FIELD FLAG
Y110C24A DS    C .    DATA FIELD ATTRIBUTE
Y110C24I DS    0CL20 .  INPUT DATA FIELD
Y110C24O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V24L DS    CL2 .  INPUT DATA FIELD LEN
Y110V24F DS    0C .   DATA FIELD FLAG
Y110V24A DS    C .    DATA FIELD ATTRIBUTE
Y110V24I DS    0CL8 .  INPUT DATA FIELD
Y110V24O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C25L DS    CL2 .  INPUT DATA FIELD LEN
Y110C25F DS    0C .   DATA FIELD FLAG
Y110C25A DS    C .    DATA FIELD ATTRIBUTE
Y110C25I DS    0CL20 .  INPUT DATA FIELD
Y110C25O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V25L DS    CL2 .  INPUT DATA FIELD LEN
Y110V25F DS    0C .   DATA FIELD FLAG
Y110V25A DS    C .    DATA FIELD ATTRIBUTE
Y110V25I DS    0CL8 .  INPUT DATA FIELD
Y110V25O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C26L DS    CL2 .  INPUT DATA FIELD LEN
Y110C26F DS    0C .   DATA FIELD FLAG
Y110C26A DS    C .    DATA FIELD ATTRIBUTE
Y110C26I DS    0CL20 .  INPUT DATA FIELD
Y110C26O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V26L DS    CL2 .  INPUT DATA FIELD LEN
Y110V26F DS    0C .   DATA FIELD FLAG
Y110V26A DS    C .    DATA FIELD ATTRIBUTE
Y110V26I DS    0CL8 .  INPUT DATA FIELD
Y110V26O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C27L DS    CL2 .  INPUT DATA FIELD LEN
Y110C27F DS    0C .   DATA FIELD FLAG
Y110C27A DS    C .    DATA FIELD ATTRIBUTE
Y110C27I DS    0CL20 .  INPUT DATA FIELD
Y110C27O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V27L DS    CL2 .  INPUT DATA FIELD LEN
Y110V27F DS    0C .   DATA FIELD FLAG
Y110V27A DS    C .    DATA FIELD ATTRIBUTE
Y110V27I DS    0CL8 .  INPUT DATA FIELD
Y110V27O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110C28L DS    CL2 .  INPUT DATA FIELD LEN
Y110C28F DS    0C .   DATA FIELD FLAG
Y110C28A DS    C .    DATA FIELD ATTRIBUTE
Y110C28I DS    0CL20 .  INPUT DATA FIELD
Y110C28O DS    CL20 .   OUTPUT DATA FIELD
        SPACE
Y110V28L DS    CL2 .  INPUT DATA FIELD LEN
Y110V28F DS    0C .   DATA FIELD FLAG
Y110V28A DS    C .    DATA FIELD ATTRIBUTE
Y110V28I DS    0CL8 .  INPUT DATA FIELD
Y110V28O DS    CL8 .   OUTPUT DATA FIELD
        SPACE
Y110FUNL DS    CL2 .  INPUT DATA FIELD LEN
Y110FUNF DS    0C .   DATA FIELD FLAG
Y110FUNA DS    C .    DATA FIELD ATTRIBUTE
Y110FUNI DS    0CL1 .  INPUT DATA FIELD
Y110FUNO DS    CL1 .   OUTPUT DATA FIELD
        SPACE
Y110MSGL DS    CL2 .  INPUT DATA FIELD LEN
Y110MSGF DS    0C .   DATA FIELD FLAG
Y110MSGA DS    C .    DATA FIELD ATTRIBUTE
Y110MSGI DS    0CL78 .  INPUT DATA FIELD
Y110MSGO DS    CL78 .   OUTPUT DATA FIELD
        SPACE
CZFY110E  EQU   *     .               END OF MAP DEFINITION
           ORG  CZFY110S  .               ADDRESS START OF MAP
* CALCULATE MAPLENGTH, ASSIGNING A VALUE OF ONE WHERE LENGTH=ZERO
CZFY110L  EQU  CZFY110E-CZFY110S
CZFY110I  DS  0CL(CZFY110L+1-(CZFY110L/CZFY110L))
CZFY110O  DS  0CL(CZFY110L+1-(CZFY110L/CZFY110L))
           ORG
         ORG   CZFY110I  .               MAP ORIGIN
* * * END OF MAP DEFINITION * * *
         SPACE 3
             DS    0H                 ENSURE ALIGNMENT
CZFY120S  EQU  *      .             START OF MAP DEFINITION
         DS    12C .             TIOA PREFIX
        SPACE
Y120INFL DS    CL2 .  INPUT DATA FIELD LEN
Y120INFF DS    0C .   DATA FIELD FLAG
Y120INFA DS    C .    DATA FIELD ATTRIBUTE
Y120INFI DS    0CL30 .  INPUT DATA FIELD
Y120INFO DS    CL30 .   OUTPUT DATA FIELD
        SPACE
Y120FUNL DS    CL2 .  INPUT DATA FIELD LEN
Y120FUNF DS    0C .   DATA FIELD FLAG
Y120FUNA DS    C .    DATA FIELD ATTRIBUTE
Y120FUNI DS    0CL4 .  INPUT DATA FIELD
Y120FUNO DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y120MSGL DS    CL2 .  INPUT DATA FIELD LEN
Y120MSGF DS    0C .   DATA FIELD FLAG
Y120MSGA DS    C .    DATA FIELD ATTRIBUTE
Y120MSGI DS    0CL78 .  INPUT DATA FIELD
Y120MSGO DS    CL78 .   OUTPUT DATA FIELD
        SPACE
CZFY120E  EQU   *     .               END OF MAP DEFINITION
           ORG  CZFY120S  .               ADDRESS START OF MAP
* CALCULATE MAPLENGTH, ASSIGNING A VALUE OF ONE WHERE LENGTH=ZERO
CZFY120L  EQU  CZFY120E-CZFY120S
CZFY120I  DS  0CL(CZFY120L+1-(CZFY120L/CZFY120L))
CZFY120O  DS  0CL(CZFY120L+1-(CZFY120L/CZFY120L))
           ORG
         ORG   CZFY120I  .               MAP ORIGIN
* * * END OF MAP DEFINITION * * *
         SPACE 3
             DS    0H                 ENSURE ALIGNMENT
CZFY122S  EQU  *      .             START OF MAP DEFINITION
         DS    12C .             TIOA PREFIX
        SPACE
Y122DKRL DS    CL2 .  INPUT DATA FIELD LEN
Y122DKRF DS    0C .   DATA FIELD FLAG
Y122DKRA DS    C .    DATA FIELD ATTRIBUTE
Y122DKRI DS    0CL30 .  INPUT DATA FIELD
Y122DKRO DS    CL30 .   OUTPUT DATA FIELD
        SPACE
Y122TELL DS    CL2 .  INPUT DATA FIELD LEN
Y122TELF DS    0C .   DATA FIELD FLAG
Y122TELA DS    C .    DATA FIELD ATTRIBUTE
Y122TELI DS    0CL4 .  INPUT DATA FIELD
Y122TELO DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y122TRXL DS    CL2 .  INPUT DATA FIELD LEN
Y122TRXF DS    0C .   DATA FIELD FLAG
Y122TRXA DS    C .    DATA FIELD ATTRIBUTE
Y122TRXI DS    0CL4 .  INPUT DATA FIELD
Y122TRXO DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y122TIML DS    CL2 .  INPUT DATA FIELD LEN
Y122TIMF DS    0C .   DATA FIELD FLAG
Y122TIMA DS    C .    DATA FIELD ATTRIBUTE
Y122TIMI DS    0CL6 .  INPUT DATA FIELD
Y122TIMO DS    CL6 .   OUTPUT DATA FIELD
        SPACE
Y122SERL DS    CL2 .  INPUT DATA FIELD LEN
Y122SERF DS    0C .   DATA FIELD FLAG
Y122SERA DS    C .    DATA FIELD ATTRIBUTE
Y122SERI DS    0CL7 .  INPUT DATA FIELD
Y122SERO DS    CL7 .   OUTPUT DATA FIELD
        SPACE
Y122ACTL DS    CL2 .  INPUT DATA FIELD LEN
Y122ACTF DS    0C .   DATA FIELD FLAG
Y122ACTA DS    C .    DATA FIELD ATTRIBUTE
Y122ACTI DS    0CL30 .  INPUT DATA FIELD
Y122ACTO DS    CL30 .   OUTPUT DATA FIELD
        SPACE
Y122FL1L DS    CL2 .  INPUT DATA FIELD LEN
Y122FL1F DS    0C .   DATA FIELD FLAG
Y122FL1A DS    C .    DATA FIELD ATTRIBUTE
Y122FL1I DS    0CL15 .  INPUT DATA FIELD
Y122FL1O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122FL2L DS    CL2 .  INPUT DATA FIELD LEN
Y122FL2F DS    0C .   DATA FIELD FLAG
Y122FL2A DS    C .    DATA FIELD ATTRIBUTE
Y122FL2I DS    0CL15 .  INPUT DATA FIELD
Y122FL2O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122FL3L DS    CL2 .  INPUT DATA FIELD LEN
Y122FL3F DS    0C .   DATA FIELD FLAG
Y122FL3A DS    C .    DATA FIELD ATTRIBUTE
Y122FL3I DS    0CL15 .  INPUT DATA FIELD
Y122FL3O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122FL4L DS    CL2 .  INPUT DATA FIELD LEN
Y122FL4F DS    0C .   DATA FIELD FLAG
Y122FL4A DS    C .    DATA FIELD ATTRIBUTE
Y122FL4I DS    0CL15 .  INPUT DATA FIELD
Y122FL4O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C01L DS    CL2 .  INPUT DATA FIELD LEN
Y122C01F DS    0C .   DATA FIELD FLAG
Y122C01A DS    C .    DATA FIELD ATTRIBUTE
Y122C01I DS    0CL3 .  INPUT DATA FIELD
Y122C01O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N01L DS    CL2 .  INPUT DATA FIELD LEN
Y122N01F DS    0C .   DATA FIELD FLAG
Y122N01A DS    C .    DATA FIELD ATTRIBUTE
Y122N01I DS    0CL5 .  INPUT DATA FIELD
Y122N01O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A01L DS    CL2 .  INPUT DATA FIELD LEN
Y122A01F DS    0C .   DATA FIELD FLAG
Y122A01A DS    C .    DATA FIELD ATTRIBUTE
Y122A01I DS    0CL15 .  INPUT DATA FIELD
Y122A01O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C02L DS    CL2 .  INPUT DATA FIELD LEN
Y122C02F DS    0C .   DATA FIELD FLAG
Y122C02A DS    C .    DATA FIELD ATTRIBUTE
Y122C02I DS    0CL3 .  INPUT DATA FIELD
Y122C02O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N02L DS    CL2 .  INPUT DATA FIELD LEN
Y122N02F DS    0C .   DATA FIELD FLAG
Y122N02A DS    C .    DATA FIELD ATTRIBUTE
Y122N02I DS    0CL5 .  INPUT DATA FIELD
Y122N02O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A02L DS    CL2 .  INPUT DATA FIELD LEN
Y122A02F DS    0C .   DATA FIELD FLAG
Y122A02A DS    C .    DATA FIELD ATTRIBUTE
Y122A02I DS    0CL15 .  INPUT DATA FIELD
Y122A02O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C03L DS    CL2 .  INPUT DATA FIELD LEN
Y122C03F DS    0C .   DATA FIELD FLAG
Y122C03A DS    C .    DATA FIELD ATTRIBUTE
Y122C03I DS    0CL3 .  INPUT DATA FIELD
Y122C03O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N03L DS    CL2 .  INPUT DATA FIELD LEN
Y122N03F DS    0C .   DATA FIELD FLAG
Y122N03A DS    C .    DATA FIELD ATTRIBUTE
Y122N03I DS    0CL5 .  INPUT DATA FIELD
Y122N03O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A03L DS    CL2 .  INPUT DATA FIELD LEN
Y122A03F DS    0C .   DATA FIELD FLAG
Y122A03A DS    C .    DATA FIELD ATTRIBUTE
Y122A03I DS    0CL15 .  INPUT DATA FIELD
Y122A03O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C04L DS    CL2 .  INPUT DATA FIELD LEN
Y122C04F DS    0C .   DATA FIELD FLAG
Y122C04A DS    C .    DATA FIELD ATTRIBUTE
Y122C04I DS    0CL3 .  INPUT DATA FIELD
Y122C04O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N04L DS    CL2 .  INPUT DATA FIELD LEN
Y122N04F DS    0C .   DATA FIELD FLAG
Y122N04A DS    C .    DATA FIELD ATTRIBUTE
Y122N04I DS    0CL5 .  INPUT DATA FIELD
Y122N04O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A04L DS    CL2 .  INPUT DATA FIELD LEN
Y122A04F DS    0C .   DATA FIELD FLAG
Y122A04A DS    C .    DATA FIELD ATTRIBUTE
Y122A04I DS    0CL15 .  INPUT DATA FIELD
Y122A04O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C05L DS    CL2 .  INPUT DATA FIELD LEN
Y122C05F DS    0C .   DATA FIELD FLAG
Y122C05A DS    C .    DATA FIELD ATTRIBUTE
Y122C05I DS    0CL3 .  INPUT DATA FIELD
Y122C05O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N05L DS    CL2 .  INPUT DATA FIELD LEN
Y122N05F DS    0C .   DATA FIELD FLAG
Y122N05A DS    C .    DATA FIELD ATTRIBUTE
Y122N05I DS    0CL5 .  INPUT DATA FIELD
Y122N05O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A05L DS    CL2 .  INPUT DATA FIELD LEN
Y122A05F DS    0C .   DATA FIELD FLAG
Y122A05A DS    C .    DATA FIELD ATTRIBUTE
Y122A05I DS    0CL15 .  INPUT DATA FIELD
Y122A05O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C06L DS    CL2 .  INPUT DATA FIELD LEN
Y122C06F DS    0C .   DATA FIELD FLAG
Y122C06A DS    C .    DATA FIELD ATTRIBUTE
Y122C06I DS    0CL3 .  INPUT DATA FIELD
Y122C06O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N06L DS    CL2 .  INPUT DATA FIELD LEN
Y122N06F DS    0C .   DATA FIELD FLAG
Y122N06A DS    C .    DATA FIELD ATTRIBUTE
Y122N06I DS    0CL5 .  INPUT DATA FIELD
Y122N06O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A06L DS    CL2 .  INPUT DATA FIELD LEN
Y122A06F DS    0C .   DATA FIELD FLAG
Y122A06A DS    C .    DATA FIELD ATTRIBUTE
Y122A06I DS    0CL15 .  INPUT DATA FIELD
Y122A06O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C07L DS    CL2 .  INPUT DATA FIELD LEN
Y122C07F DS    0C .   DATA FIELD FLAG
Y122C07A DS    C .    DATA FIELD ATTRIBUTE
Y122C07I DS    0CL3 .  INPUT DATA FIELD
Y122C07O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N07L DS    CL2 .  INPUT DATA FIELD LEN
Y122N07F DS    0C .   DATA FIELD FLAG
Y122N07A DS    C .    DATA FIELD ATTRIBUTE
Y122N07I DS    0CL5 .  INPUT DATA FIELD
Y122N07O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A07L DS    CL2 .  INPUT DATA FIELD LEN
Y122A07F DS    0C .   DATA FIELD FLAG
Y122A07A DS    C .    DATA FIELD ATTRIBUTE
Y122A07I DS    0CL15 .  INPUT DATA FIELD
Y122A07O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C08L DS    CL2 .  INPUT DATA FIELD LEN
Y122C08F DS    0C .   DATA FIELD FLAG
Y122C08A DS    C .    DATA FIELD ATTRIBUTE
Y122C08I DS    0CL3 .  INPUT DATA FIELD
Y122C08O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N08L DS    CL2 .  INPUT DATA FIELD LEN
Y122N08F DS    0C .   DATA FIELD FLAG
Y122N08A DS    C .    DATA FIELD ATTRIBUTE
Y122N08I DS    0CL5 .  INPUT DATA FIELD
Y122N08O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A08L DS    CL2 .  INPUT DATA FIELD LEN
Y122A08F DS    0C .   DATA FIELD FLAG
Y122A08A DS    C .    DATA FIELD ATTRIBUTE
Y122A08I DS    0CL15 .  INPUT DATA FIELD
Y122A08O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C09L DS    CL2 .  INPUT DATA FIELD LEN
Y122C09F DS    0C .   DATA FIELD FLAG
Y122C09A DS    C .    DATA FIELD ATTRIBUTE
Y122C09I DS    0CL3 .  INPUT DATA FIELD
Y122C09O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N09L DS    CL2 .  INPUT DATA FIELD LEN
Y122N09F DS    0C .   DATA FIELD FLAG
Y122N09A DS    C .    DATA FIELD ATTRIBUTE
Y122N09I DS    0CL5 .  INPUT DATA FIELD
Y122N09O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A09L DS    CL2 .  INPUT DATA FIELD LEN
Y122A09F DS    0C .   DATA FIELD FLAG
Y122A09A DS    C .    DATA FIELD ATTRIBUTE
Y122A09I DS    0CL15 .  INPUT DATA FIELD
Y122A09O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C10L DS    CL2 .  INPUT DATA FIELD LEN
Y122C10F DS    0C .   DATA FIELD FLAG
Y122C10A DS    C .    DATA FIELD ATTRIBUTE
Y122C10I DS    0CL3 .  INPUT DATA FIELD
Y122C10O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N10L DS    CL2 .  INPUT DATA FIELD LEN
Y122N10F DS    0C .   DATA FIELD FLAG
Y122N10A DS    C .    DATA FIELD ATTRIBUTE
Y122N10I DS    0CL5 .  INPUT DATA FIELD
Y122N10O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A10L DS    CL2 .  INPUT DATA FIELD LEN
Y122A10F DS    0C .   DATA FIELD FLAG
Y122A10A DS    C .    DATA FIELD ATTRIBUTE
Y122A10I DS    0CL15 .  INPUT DATA FIELD
Y122A10O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C11L DS    CL2 .  INPUT DATA FIELD LEN
Y122C11F DS    0C .   DATA FIELD FLAG
Y122C11A DS    C .    DATA FIELD ATTRIBUTE
Y122C11I DS    0CL3 .  INPUT DATA FIELD
Y122C11O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N11L DS    CL2 .  INPUT DATA FIELD LEN
Y122N11F DS    0C .   DATA FIELD FLAG
Y122N11A DS    C .    DATA FIELD ATTRIBUTE
Y122N11I DS    0CL5 .  INPUT DATA FIELD
Y122N11O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A11L DS    CL2 .  INPUT DATA FIELD LEN
Y122A11F DS    0C .   DATA FIELD FLAG
Y122A11A DS    C .    DATA FIELD ATTRIBUTE
Y122A11I DS    0CL15 .  INPUT DATA FIELD
Y122A11O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C12L DS    CL2 .  INPUT DATA FIELD LEN
Y122C12F DS    0C .   DATA FIELD FLAG
Y122C12A DS    C .    DATA FIELD ATTRIBUTE
Y122C12I DS    0CL3 .  INPUT DATA FIELD
Y122C12O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N12L DS    CL2 .  INPUT DATA FIELD LEN
Y122N12F DS    0C .   DATA FIELD FLAG
Y122N12A DS    C .    DATA FIELD ATTRIBUTE
Y122N12I DS    0CL5 .  INPUT DATA FIELD
Y122N12O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A12L DS    CL2 .  INPUT DATA FIELD LEN
Y122A12F DS    0C .   DATA FIELD FLAG
Y122A12A DS    C .    DATA FIELD ATTRIBUTE
Y122A12I DS    0CL15 .  INPUT DATA FIELD
Y122A12O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C13L DS    CL2 .  INPUT DATA FIELD LEN
Y122C13F DS    0C .   DATA FIELD FLAG
Y122C13A DS    C .    DATA FIELD ATTRIBUTE
Y122C13I DS    0CL3 .  INPUT DATA FIELD
Y122C13O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N13L DS    CL2 .  INPUT DATA FIELD LEN
Y122N13F DS    0C .   DATA FIELD FLAG
Y122N13A DS    C .    DATA FIELD ATTRIBUTE
Y122N13I DS    0CL5 .  INPUT DATA FIELD
Y122N13O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A13L DS    CL2 .  INPUT DATA FIELD LEN
Y122A13F DS    0C .   DATA FIELD FLAG
Y122A13A DS    C .    DATA FIELD ATTRIBUTE
Y122A13I DS    0CL15 .  INPUT DATA FIELD
Y122A13O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C14L DS    CL2 .  INPUT DATA FIELD LEN
Y122C14F DS    0C .   DATA FIELD FLAG
Y122C14A DS    C .    DATA FIELD ATTRIBUTE
Y122C14I DS    0CL3 .  INPUT DATA FIELD
Y122C14O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N14L DS    CL2 .  INPUT DATA FIELD LEN
Y122N14F DS    0C .   DATA FIELD FLAG
Y122N14A DS    C .    DATA FIELD ATTRIBUTE
Y122N14I DS    0CL5 .  INPUT DATA FIELD
Y122N14O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A14L DS    CL2 .  INPUT DATA FIELD LEN
Y122A14F DS    0C .   DATA FIELD FLAG
Y122A14A DS    C .    DATA FIELD ATTRIBUTE
Y122A14I DS    0CL15 .  INPUT DATA FIELD
Y122A14O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C15L DS    CL2 .  INPUT DATA FIELD LEN
Y122C15F DS    0C .   DATA FIELD FLAG
Y122C15A DS    C .    DATA FIELD ATTRIBUTE
Y122C15I DS    0CL3 .  INPUT DATA FIELD
Y122C15O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N15L DS    CL2 .  INPUT DATA FIELD LEN
Y122N15F DS    0C .   DATA FIELD FLAG
Y122N15A DS    C .    DATA FIELD ATTRIBUTE
Y122N15I DS    0CL5 .  INPUT DATA FIELD
Y122N15O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A15L DS    CL2 .  INPUT DATA FIELD LEN
Y122A15F DS    0C .   DATA FIELD FLAG
Y122A15A DS    C .    DATA FIELD ATTRIBUTE
Y122A15I DS    0CL15 .  INPUT DATA FIELD
Y122A15O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C16L DS    CL2 .  INPUT DATA FIELD LEN
Y122C16F DS    0C .   DATA FIELD FLAG
Y122C16A DS    C .    DATA FIELD ATTRIBUTE
Y122C16I DS    0CL3 .  INPUT DATA FIELD
Y122C16O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N16L DS    CL2 .  INPUT DATA FIELD LEN
Y122N16F DS    0C .   DATA FIELD FLAG
Y122N16A DS    C .    DATA FIELD ATTRIBUTE
Y122N16I DS    0CL5 .  INPUT DATA FIELD
Y122N16O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A16L DS    CL2 .  INPUT DATA FIELD LEN
Y122A16F DS    0C .   DATA FIELD FLAG
Y122A16A DS    C .    DATA FIELD ATTRIBUTE
Y122A16I DS    0CL15 .  INPUT DATA FIELD
Y122A16O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C17L DS    CL2 .  INPUT DATA FIELD LEN
Y122C17F DS    0C .   DATA FIELD FLAG
Y122C17A DS    C .    DATA FIELD ATTRIBUTE
Y122C17I DS    0CL3 .  INPUT DATA FIELD
Y122C17O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N17L DS    CL2 .  INPUT DATA FIELD LEN
Y122N17F DS    0C .   DATA FIELD FLAG
Y122N17A DS    C .    DATA FIELD ATTRIBUTE
Y122N17I DS    0CL5 .  INPUT DATA FIELD
Y122N17O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A17L DS    CL2 .  INPUT DATA FIELD LEN
Y122A17F DS    0C .   DATA FIELD FLAG
Y122A17A DS    C .    DATA FIELD ATTRIBUTE
Y122A17I DS    0CL15 .  INPUT DATA FIELD
Y122A17O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C18L DS    CL2 .  INPUT DATA FIELD LEN
Y122C18F DS    0C .   DATA FIELD FLAG
Y122C18A DS    C .    DATA FIELD ATTRIBUTE
Y122C18I DS    0CL3 .  INPUT DATA FIELD
Y122C18O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N18L DS    CL2 .  INPUT DATA FIELD LEN
Y122N18F DS    0C .   DATA FIELD FLAG
Y122N18A DS    C .    DATA FIELD ATTRIBUTE
Y122N18I DS    0CL5 .  INPUT DATA FIELD
Y122N18O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A18L DS    CL2 .  INPUT DATA FIELD LEN
Y122A18F DS    0C .   DATA FIELD FLAG
Y122A18A DS    C .    DATA FIELD ATTRIBUTE
Y122A18I DS    0CL15 .  INPUT DATA FIELD
Y122A18O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C19L DS    CL2 .  INPUT DATA FIELD LEN
Y122C19F DS    0C .   DATA FIELD FLAG
Y122C19A DS    C .    DATA FIELD ATTRIBUTE
Y122C19I DS    0CL3 .  INPUT DATA FIELD
Y122C19O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N19L DS    CL2 .  INPUT DATA FIELD LEN
Y122N19F DS    0C .   DATA FIELD FLAG
Y122N19A DS    C .    DATA FIELD ATTRIBUTE
Y122N19I DS    0CL5 .  INPUT DATA FIELD
Y122N19O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A19L DS    CL2 .  INPUT DATA FIELD LEN
Y122A19F DS    0C .   DATA FIELD FLAG
Y122A19A DS    C .    DATA FIELD ATTRIBUTE
Y122A19I DS    0CL15 .  INPUT DATA FIELD
Y122A19O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C20L DS    CL2 .  INPUT DATA FIELD LEN
Y122C20F DS    0C .   DATA FIELD FLAG
Y122C20A DS    C .    DATA FIELD ATTRIBUTE
Y122C20I DS    0CL3 .  INPUT DATA FIELD
Y122C20O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N20L DS    CL2 .  INPUT DATA FIELD LEN
Y122N20F DS    0C .   DATA FIELD FLAG
Y122N20A DS    C .    DATA FIELD ATTRIBUTE
Y122N20I DS    0CL5 .  INPUT DATA FIELD
Y122N20O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A20L DS    CL2 .  INPUT DATA FIELD LEN
Y122A20F DS    0C .   DATA FIELD FLAG
Y122A20A DS    C .    DATA FIELD ATTRIBUTE
Y122A20I DS    0CL15 .  INPUT DATA FIELD
Y122A20O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122C21L DS    CL2 .  INPUT DATA FIELD LEN
Y122C21F DS    0C .   DATA FIELD FLAG
Y122C21A DS    C .    DATA FIELD ATTRIBUTE
Y122C21I DS    0CL3 .  INPUT DATA FIELD
Y122C21O DS    CL3 .   OUTPUT DATA FIELD
        SPACE
Y122N21L DS    CL2 .  INPUT DATA FIELD LEN
Y122N21F DS    0C .   DATA FIELD FLAG
Y122N21A DS    C .    DATA FIELD ATTRIBUTE
Y122N21I DS    0CL5 .  INPUT DATA FIELD
Y122N21O DS    CL5 .   OUTPUT DATA FIELD
        SPACE
Y122A21L DS    CL2 .  INPUT DATA FIELD LEN
Y122A21F DS    0C .   DATA FIELD FLAG
Y122A21A DS    C .    DATA FIELD ATTRIBUTE
Y122A21I DS    0CL15 .  INPUT DATA FIELD
Y122A21O DS    CL15 .   OUTPUT DATA FIELD
        SPACE
Y122FUNL DS    CL2 .  INPUT DATA FIELD LEN
Y122FUNF DS    0C .   DATA FIELD FLAG
Y122FUNA DS    C .    DATA FIELD ATTRIBUTE
Y122FUNI DS    0CL1 .  INPUT DATA FIELD
Y122FUNO DS    CL1 .   OUTPUT DATA FIELD
        SPACE
Y122MSGL DS    CL2 .  INPUT DATA FIELD LEN
Y122MSGF DS    0C .   DATA FIELD FLAG
Y122MSGA DS    C .    DATA FIELD ATTRIBUTE
Y122MSGI DS    0CL78 .  INPUT DATA FIELD
Y122MSGO DS    CL78 .   OUTPUT DATA FIELD
        SPACE
CZFY122E  EQU   *     .               END OF MAP DEFINITION
           ORG  CZFY122S  .               ADDRESS START OF MAP
* CALCULATE MAPLENGTH, ASSIGNING A VALUE OF ONE WHERE LENGTH=ZERO
CZFY122L  EQU  CZFY122E-CZFY122S
CZFY122I  DS  0CL(CZFY122L+1-(CZFY122L/CZFY122L))
CZFY122O  DS  0CL(CZFY122L+1-(CZFY122L/CZFY122L))
           ORG
         ORG   CZFY122I  .               MAP ORIGIN
* * * END OF MAP DEFINITION * * *
         SPACE 3
             DS    0H                 ENSURE ALIGNMENT
CZFY140S  EQU  *      .             START OF MAP DEFINITION
         DS    12C .             TIOA PREFIX
        SPACE
Y140PAGL DS    CL2 .  INPUT DATA FIELD LEN
Y140PAGF DS    0C .   DATA FIELD FLAG
Y140PAGA DS    C .    DATA FIELD ATTRIBUTE
Y140PAGI DS    0CL2 .  INPUT DATA FIELD
Y140PAGO DS    CL2 .   OUTPUT DATA FIELD
        SPACE
Y140T01L DS    CL2 .  INPUT DATA FIELD LEN
Y140T01F DS    0C .   DATA FIELD FLAG
Y140T01A DS    C .    DATA FIELD ATTRIBUTE
Y140T01I DS    0CL4 .  INPUT DATA FIELD
Y140T01O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B01L DS    CL2 .  INPUT DATA FIELD LEN
Y140B01F DS    0C .   DATA FIELD FLAG
Y140B01A DS    C .    DATA FIELD ATTRIBUTE
Y140B01I DS    0CL4 .  INPUT DATA FIELD
Y140B01O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T02L DS    CL2 .  INPUT DATA FIELD LEN
Y140T02F DS    0C .   DATA FIELD FLAG
Y140T02A DS    C .    DATA FIELD ATTRIBUTE
Y140T02I DS    0CL4 .  INPUT DATA FIELD
Y140T02O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B02L DS    CL2 .  INPUT DATA FIELD LEN
Y140B02F DS    0C .   DATA FIELD FLAG
Y140B02A DS    C .    DATA FIELD ATTRIBUTE
Y140B02I DS    0CL4 .  INPUT DATA FIELD
Y140B02O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T03L DS    CL2 .  INPUT DATA FIELD LEN
Y140T03F DS    0C .   DATA FIELD FLAG
Y140T03A DS    C .    DATA FIELD ATTRIBUTE
Y140T03I DS    0CL4 .  INPUT DATA FIELD
Y140T03O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B03L DS    CL2 .  INPUT DATA FIELD LEN
Y140B03F DS    0C .   DATA FIELD FLAG
Y140B03A DS    C .    DATA FIELD ATTRIBUTE
Y140B03I DS    0CL4 .  INPUT DATA FIELD
Y140B03O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T04L DS    CL2 .  INPUT DATA FIELD LEN
Y140T04F DS    0C .   DATA FIELD FLAG
Y140T04A DS    C .    DATA FIELD ATTRIBUTE
Y140T04I DS    0CL4 .  INPUT DATA FIELD
Y140T04O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B04L DS    CL2 .  INPUT DATA FIELD LEN
Y140B04F DS    0C .   DATA FIELD FLAG
Y140B04A DS    C .    DATA FIELD ATTRIBUTE
Y140B04I DS    0CL4 .  INPUT DATA FIELD
Y140B04O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T05L DS    CL2 .  INPUT DATA FIELD LEN
Y140T05F DS    0C .   DATA FIELD FLAG
Y140T05A DS    C .    DATA FIELD ATTRIBUTE
Y140T05I DS    0CL4 .  INPUT DATA FIELD
Y140T05O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B05L DS    CL2 .  INPUT DATA FIELD LEN
Y140B05F DS    0C .   DATA FIELD FLAG
Y140B05A DS    C .    DATA FIELD ATTRIBUTE
Y140B05I DS    0CL4 .  INPUT DATA FIELD
Y140B05O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T06L DS    CL2 .  INPUT DATA FIELD LEN
Y140T06F DS    0C .   DATA FIELD FLAG
Y140T06A DS    C .    DATA FIELD ATTRIBUTE
Y140T06I DS    0CL4 .  INPUT DATA FIELD
Y140T06O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B06L DS    CL2 .  INPUT DATA FIELD LEN
Y140B06F DS    0C .   DATA FIELD FLAG
Y140B06A DS    C .    DATA FIELD ATTRIBUTE
Y140B06I DS    0CL4 .  INPUT DATA FIELD
Y140B06O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T07L DS    CL2 .  INPUT DATA FIELD LEN
Y140T07F DS    0C .   DATA FIELD FLAG
Y140T07A DS    C .    DATA FIELD ATTRIBUTE
Y140T07I DS    0CL4 .  INPUT DATA FIELD
Y140T07O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B07L DS    CL2 .  INPUT DATA FIELD LEN
Y140B07F DS    0C .   DATA FIELD FLAG
Y140B07A DS    C .    DATA FIELD ATTRIBUTE
Y140B07I DS    0CL4 .  INPUT DATA FIELD
Y140B07O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T08L DS    CL2 .  INPUT DATA FIELD LEN
Y140T08F DS    0C .   DATA FIELD FLAG
Y140T08A DS    C .    DATA FIELD ATTRIBUTE
Y140T08I DS    0CL4 .  INPUT DATA FIELD
Y140T08O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B08L DS    CL2 .  INPUT DATA FIELD LEN
Y140B08F DS    0C .   DATA FIELD FLAG
Y140B08A DS    C .    DATA FIELD ATTRIBUTE
Y140B08I DS    0CL4 .  INPUT DATA FIELD
Y140B08O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T09L DS    CL2 .  INPUT DATA FIELD LEN
Y140T09F DS    0C .   DATA FIELD FLAG
Y140T09A DS    C .    DATA FIELD ATTRIBUTE
Y140T09I DS    0CL4 .  INPUT DATA FIELD
Y140T09O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B09L DS    CL2 .  INPUT DATA FIELD LEN
Y140B09F DS    0C .   DATA FIELD FLAG
Y140B09A DS    C .    DATA FIELD ATTRIBUTE
Y140B09I DS    0CL4 .  INPUT DATA FIELD
Y140B09O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T10L DS    CL2 .  INPUT DATA FIELD LEN
Y140T10F DS    0C .   DATA FIELD FLAG
Y140T10A DS    C .    DATA FIELD ATTRIBUTE
Y140T10I DS    0CL4 .  INPUT DATA FIELD
Y140T10O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B10L DS    CL2 .  INPUT DATA FIELD LEN
Y140B10F DS    0C .   DATA FIELD FLAG
Y140B10A DS    C .    DATA FIELD ATTRIBUTE
Y140B10I DS    0CL4 .  INPUT DATA FIELD
Y140B10O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T11L DS    CL2 .  INPUT DATA FIELD LEN
Y140T11F DS    0C .   DATA FIELD FLAG
Y140T11A DS    C .    DATA FIELD ATTRIBUTE
Y140T11I DS    0CL4 .  INPUT DATA FIELD
Y140T11O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B11L DS    CL2 .  INPUT DATA FIELD LEN
Y140B11F DS    0C .   DATA FIELD FLAG
Y140B11A DS    C .    DATA FIELD ATTRIBUTE
Y140B11I DS    0CL4 .  INPUT DATA FIELD
Y140B11O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T12L DS    CL2 .  INPUT DATA FIELD LEN
Y140T12F DS    0C .   DATA FIELD FLAG
Y140T12A DS    C .    DATA FIELD ATTRIBUTE
Y140T12I DS    0CL4 .  INPUT DATA FIELD
Y140T12O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B12L DS    CL2 .  INPUT DATA FIELD LEN
Y140B12F DS    0C .   DATA FIELD FLAG
Y140B12A DS    C .    DATA FIELD ATTRIBUTE
Y140B12I DS    0CL4 .  INPUT DATA FIELD
Y140B12O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T13L DS    CL2 .  INPUT DATA FIELD LEN
Y140T13F DS    0C .   DATA FIELD FLAG
Y140T13A DS    C .    DATA FIELD ATTRIBUTE
Y140T13I DS    0CL4 .  INPUT DATA FIELD
Y140T13O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B13L DS    CL2 .  INPUT DATA FIELD LEN
Y140B13F DS    0C .   DATA FIELD FLAG
Y140B13A DS    C .    DATA FIELD ATTRIBUTE
Y140B13I DS    0CL4 .  INPUT DATA FIELD
Y140B13O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T14L DS    CL2 .  INPUT DATA FIELD LEN
Y140T14F DS    0C .   DATA FIELD FLAG
Y140T14A DS    C .    DATA FIELD ATTRIBUTE
Y140T14I DS    0CL4 .  INPUT DATA FIELD
Y140T14O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B14L DS    CL2 .  INPUT DATA FIELD LEN
Y140B14F DS    0C .   DATA FIELD FLAG
Y140B14A DS    C .    DATA FIELD ATTRIBUTE
Y140B14I DS    0CL4 .  INPUT DATA FIELD
Y140B14O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T15L DS    CL2 .  INPUT DATA FIELD LEN
Y140T15F DS    0C .   DATA FIELD FLAG
Y140T15A DS    C .    DATA FIELD ATTRIBUTE
Y140T15I DS    0CL4 .  INPUT DATA FIELD
Y140T15O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B15L DS    CL2 .  INPUT DATA FIELD LEN
Y140B15F DS    0C .   DATA FIELD FLAG
Y140B15A DS    C .    DATA FIELD ATTRIBUTE
Y140B15I DS    0CL4 .  INPUT DATA FIELD
Y140B15O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T16L DS    CL2 .  INPUT DATA FIELD LEN
Y140T16F DS    0C .   DATA FIELD FLAG
Y140T16A DS    C .    DATA FIELD ATTRIBUTE
Y140T16I DS    0CL4 .  INPUT DATA FIELD
Y140T16O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B16L DS    CL2 .  INPUT DATA FIELD LEN
Y140B16F DS    0C .   DATA FIELD FLAG
Y140B16A DS    C .    DATA FIELD ATTRIBUTE
Y140B16I DS    0CL4 .  INPUT DATA FIELD
Y140B16O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T17L DS    CL2 .  INPUT DATA FIELD LEN
Y140T17F DS    0C .   DATA FIELD FLAG
Y140T17A DS    C .    DATA FIELD ATTRIBUTE
Y140T17I DS    0CL4 .  INPUT DATA FIELD
Y140T17O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B17L DS    CL2 .  INPUT DATA FIELD LEN
Y140B17F DS    0C .   DATA FIELD FLAG
Y140B17A DS    C .    DATA FIELD ATTRIBUTE
Y140B17I DS    0CL4 .  INPUT DATA FIELD
Y140B17O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T18L DS    CL2 .  INPUT DATA FIELD LEN
Y140T18F DS    0C .   DATA FIELD FLAG
Y140T18A DS    C .    DATA FIELD ATTRIBUTE
Y140T18I DS    0CL4 .  INPUT DATA FIELD
Y140T18O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B18L DS    CL2 .  INPUT DATA FIELD LEN
Y140B18F DS    0C .   DATA FIELD FLAG
Y140B18A DS    C .    DATA FIELD ATTRIBUTE
Y140B18I DS    0CL4 .  INPUT DATA FIELD
Y140B18O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T19L DS    CL2 .  INPUT DATA FIELD LEN
Y140T19F DS    0C .   DATA FIELD FLAG
Y140T19A DS    C .    DATA FIELD ATTRIBUTE
Y140T19I DS    0CL4 .  INPUT DATA FIELD
Y140T19O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B19L DS    CL2 .  INPUT DATA FIELD LEN
Y140B19F DS    0C .   DATA FIELD FLAG
Y140B19A DS    C .    DATA FIELD ATTRIBUTE
Y140B19I DS    0CL4 .  INPUT DATA FIELD
Y140B19O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T20L DS    CL2 .  INPUT DATA FIELD LEN
Y140T20F DS    0C .   DATA FIELD FLAG
Y140T20A DS    C .    DATA FIELD ATTRIBUTE
Y140T20I DS    0CL4 .  INPUT DATA FIELD
Y140T20O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B20L DS    CL2 .  INPUT DATA FIELD LEN
Y140B20F DS    0C .   DATA FIELD FLAG
Y140B20A DS    C .    DATA FIELD ATTRIBUTE
Y140B20I DS    0CL4 .  INPUT DATA FIELD
Y140B20O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T21L DS    CL2 .  INPUT DATA FIELD LEN
Y140T21F DS    0C .   DATA FIELD FLAG
Y140T21A DS    C .    DATA FIELD ATTRIBUTE
Y140T21I DS    0CL4 .  INPUT DATA FIELD
Y140T21O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B21L DS    CL2 .  INPUT DATA FIELD LEN
Y140B21F DS    0C .   DATA FIELD FLAG
Y140B21A DS    C .    DATA FIELD ATTRIBUTE
Y140B21I DS    0CL4 .  INPUT DATA FIELD
Y140B21O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T22L DS    CL2 .  INPUT DATA FIELD LEN
Y140T22F DS    0C .   DATA FIELD FLAG
Y140T22A DS    C .    DATA FIELD ATTRIBUTE
Y140T22I DS    0CL4 .  INPUT DATA FIELD
Y140T22O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B22L DS    CL2 .  INPUT DATA FIELD LEN
Y140B22F DS    0C .   DATA FIELD FLAG
Y140B22A DS    C .    DATA FIELD ATTRIBUTE
Y140B22I DS    0CL4 .  INPUT DATA FIELD
Y140B22O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T23L DS    CL2 .  INPUT DATA FIELD LEN
Y140T23F DS    0C .   DATA FIELD FLAG
Y140T23A DS    C .    DATA FIELD ATTRIBUTE
Y140T23I DS    0CL4 .  INPUT DATA FIELD
Y140T23O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B23L DS    CL2 .  INPUT DATA FIELD LEN
Y140B23F DS    0C .   DATA FIELD FLAG
Y140B23A DS    C .    DATA FIELD ATTRIBUTE
Y140B23I DS    0CL4 .  INPUT DATA FIELD
Y140B23O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T24L DS    CL2 .  INPUT DATA FIELD LEN
Y140T24F DS    0C .   DATA FIELD FLAG
Y140T24A DS    C .    DATA FIELD ATTRIBUTE
Y140T24I DS    0CL4 .  INPUT DATA FIELD
Y140T24O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B24L DS    CL2 .  INPUT DATA FIELD LEN
Y140B24F DS    0C .   DATA FIELD FLAG
Y140B24A DS    C .    DATA FIELD ATTRIBUTE
Y140B24I DS    0CL4 .  INPUT DATA FIELD
Y140B24O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T25L DS    CL2 .  INPUT DATA FIELD LEN
Y140T25F DS    0C .   DATA FIELD FLAG
Y140T25A DS    C .    DATA FIELD ATTRIBUTE
Y140T25I DS    0CL4 .  INPUT DATA FIELD
Y140T25O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B25L DS    CL2 .  INPUT DATA FIELD LEN
Y140B25F DS    0C .   DATA FIELD FLAG
Y140B25A DS    C .    DATA FIELD ATTRIBUTE
Y140B25I DS    0CL4 .  INPUT DATA FIELD
Y140B25O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T26L DS    CL2 .  INPUT DATA FIELD LEN
Y140T26F DS    0C .   DATA FIELD FLAG
Y140T26A DS    C .    DATA FIELD ATTRIBUTE
Y140T26I DS    0CL4 .  INPUT DATA FIELD
Y140T26O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B26L DS    CL2 .  INPUT DATA FIELD LEN
Y140B26F DS    0C .   DATA FIELD FLAG
Y140B26A DS    C .    DATA FIELD ATTRIBUTE
Y140B26I DS    0CL4 .  INPUT DATA FIELD
Y140B26O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T27L DS    CL2 .  INPUT DATA FIELD LEN
Y140T27F DS    0C .   DATA FIELD FLAG
Y140T27A DS    C .    DATA FIELD ATTRIBUTE
Y140T27I DS    0CL4 .  INPUT DATA FIELD
Y140T27O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B27L DS    CL2 .  INPUT DATA FIELD LEN
Y140B27F DS    0C .   DATA FIELD FLAG
Y140B27A DS    C .    DATA FIELD ATTRIBUTE
Y140B27I DS    0CL4 .  INPUT DATA FIELD
Y140B27O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T28L DS    CL2 .  INPUT DATA FIELD LEN
Y140T28F DS    0C .   DATA FIELD FLAG
Y140T28A DS    C .    DATA FIELD ATTRIBUTE
Y140T28I DS    0CL4 .  INPUT DATA FIELD
Y140T28O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B28L DS    CL2 .  INPUT DATA FIELD LEN
Y140B28F DS    0C .   DATA FIELD FLAG
Y140B28A DS    C .    DATA FIELD ATTRIBUTE
Y140B28I DS    0CL4 .  INPUT DATA FIELD
Y140B28O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T29L DS    CL2 .  INPUT DATA FIELD LEN
Y140T29F DS    0C .   DATA FIELD FLAG
Y140T29A DS    C .    DATA FIELD ATTRIBUTE
Y140T29I DS    0CL4 .  INPUT DATA FIELD
Y140T29O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B29L DS    CL2 .  INPUT DATA FIELD LEN
Y140B29F DS    0C .   DATA FIELD FLAG
Y140B29A DS    C .    DATA FIELD ATTRIBUTE
Y140B29I DS    0CL4 .  INPUT DATA FIELD
Y140B29O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140T30L DS    CL2 .  INPUT DATA FIELD LEN
Y140T30F DS    0C .   DATA FIELD FLAG
Y140T30A DS    C .    DATA FIELD ATTRIBUTE
Y140T30I DS    0CL4 .  INPUT DATA FIELD
Y140T30O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140B30L DS    CL2 .  INPUT DATA FIELD LEN
Y140B30F DS    0C .   DATA FIELD FLAG
Y140B30A DS    C .    DATA FIELD ATTRIBUTE
Y140B30I DS    0CL4 .  INPUT DATA FIELD
Y140B30O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y140FUNL DS    CL2 .  INPUT DATA FIELD LEN
Y140FUNF DS    0C .   DATA FIELD FLAG
Y140FUNA DS    C .    DATA FIELD ATTRIBUTE
Y140FUNI DS    0CL1 .  INPUT DATA FIELD
Y140FUNO DS    CL1 .   OUTPUT DATA FIELD
        SPACE
Y140MSGL DS    CL2 .  INPUT DATA FIELD LEN
Y140MSGF DS    0C .   DATA FIELD FLAG
Y140MSGA DS    C .    DATA FIELD ATTRIBUTE
Y140MSGI DS    0CL78 .  INPUT DATA FIELD
Y140MSGO DS    CL78 .   OUTPUT DATA FIELD
        SPACE
CZFY140E  EQU   *     .               END OF MAP DEFINITION
           ORG  CZFY140S  .               ADDRESS START OF MAP
* CALCULATE MAPLENGTH, ASSIGNING A VALUE OF ONE WHERE LENGTH=ZERO
CZFY140L  EQU  CZFY140E-CZFY140S
CZFY140I  DS  0CL(CZFY140L+1-(CZFY140L/CZFY140L))
CZFY140O  DS  0CL(CZFY140L+1-(CZFY140L/CZFY140L))
           ORG
         ORG   CZFY140I  .               MAP ORIGIN
* * * END OF MAP DEFINITION * * *
         SPACE 3
             DS    0H                 ENSURE ALIGNMENT
CZFY142S  EQU  *      .             START OF MAP DEFINITION
         DS    12C .             TIOA PREFIX
        SPACE
Y142INFL DS    CL2 .  INPUT DATA FIELD LEN
Y142INFF DS    0C .   DATA FIELD FLAG
Y142INFA DS    C .    DATA FIELD ATTRIBUTE
Y142INFI DS    0CL30 .  INPUT DATA FIELD
Y142INFO DS    CL30 .   OUTPUT DATA FIELD
        SPACE
Y142FUNL DS    CL2 .  INPUT DATA FIELD LEN
Y142FUNF DS    0C .   DATA FIELD FLAG
Y142FUNA DS    C .    DATA FIELD ATTRIBUTE
Y142FUNI DS    0CL1 .  INPUT DATA FIELD
Y142FUNO DS    CL1 .   OUTPUT DATA FIELD
        SPACE
Y142MSGL DS    CL2 .  INPUT DATA FIELD LEN
Y142MSGF DS    0C .   DATA FIELD FLAG
Y142MSGA DS    C .    DATA FIELD ATTRIBUTE
Y142MSGI DS    0CL78 .  INPUT DATA FIELD
Y142MSGO DS    CL78 .   OUTPUT DATA FIELD
        SPACE
CZFY142E  EQU   *     .               END OF MAP DEFINITION
           ORG  CZFY142S  .               ADDRESS START OF MAP
* CALCULATE MAPLENGTH, ASSIGNING A VALUE OF ONE WHERE LENGTH=ZERO
CZFY142L  EQU  CZFY142E-CZFY142S
CZFY142I  DS  0CL(CZFY142L+1-(CZFY142L/CZFY142L))
CZFY142O  DS  0CL(CZFY142L+1-(CZFY142L/CZFY142L))
           ORG
         ORG   CZFY142I  .               MAP ORIGIN
* * * END OF MAP DEFINITION * * *
         SPACE 3
             DS    0H                 ENSURE ALIGNMENT
CZFY150S  EQU  *      .             START OF MAP DEFINITION
         DS    12C .             TIOA PREFIX
        SPACE
Y150PAGL DS    CL2 .  INPUT DATA FIELD LEN
Y150PAGF DS    0C .   DATA FIELD FLAG
Y150PAGA DS    C .    DATA FIELD ATTRIBUTE
Y150PAGI DS    0CL2 .  INPUT DATA FIELD
Y150PAGO DS    CL2 .   OUTPUT DATA FIELD
        SPACE
Y150T01L DS    CL2 .  INPUT DATA FIELD LEN
Y150T01F DS    0C .   DATA FIELD FLAG
Y150T01A DS    C .    DATA FIELD ATTRIBUTE
Y150T01I DS    0CL4 .  INPUT DATA FIELD
Y150T01O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B01L DS    CL2 .  INPUT DATA FIELD LEN
Y150B01F DS    0C .   DATA FIELD FLAG
Y150B01A DS    C .    DATA FIELD ATTRIBUTE
Y150B01I DS    0CL4 .  INPUT DATA FIELD
Y150B01O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T02L DS    CL2 .  INPUT DATA FIELD LEN
Y150T02F DS    0C .   DATA FIELD FLAG
Y150T02A DS    C .    DATA FIELD ATTRIBUTE
Y150T02I DS    0CL4 .  INPUT DATA FIELD
Y150T02O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B02L DS    CL2 .  INPUT DATA FIELD LEN
Y150B02F DS    0C .   DATA FIELD FLAG
Y150B02A DS    C .    DATA FIELD ATTRIBUTE
Y150B02I DS    0CL4 .  INPUT DATA FIELD
Y150B02O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T03L DS    CL2 .  INPUT DATA FIELD LEN
Y150T03F DS    0C .   DATA FIELD FLAG
Y150T03A DS    C .    DATA FIELD ATTRIBUTE
Y150T03I DS    0CL4 .  INPUT DATA FIELD
Y150T03O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B03L DS    CL2 .  INPUT DATA FIELD LEN
Y150B03F DS    0C .   DATA FIELD FLAG
Y150B03A DS    C .    DATA FIELD ATTRIBUTE
Y150B03I DS    0CL4 .  INPUT DATA FIELD
Y150B03O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T04L DS    CL2 .  INPUT DATA FIELD LEN
Y150T04F DS    0C .   DATA FIELD FLAG
Y150T04A DS    C .    DATA FIELD ATTRIBUTE
Y150T04I DS    0CL4 .  INPUT DATA FIELD
Y150T04O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B04L DS    CL2 .  INPUT DATA FIELD LEN
Y150B04F DS    0C .   DATA FIELD FLAG
Y150B04A DS    C .    DATA FIELD ATTRIBUTE
Y150B04I DS    0CL4 .  INPUT DATA FIELD
Y150B04O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T05L DS    CL2 .  INPUT DATA FIELD LEN
Y150T05F DS    0C .   DATA FIELD FLAG
Y150T05A DS    C .    DATA FIELD ATTRIBUTE
Y150T05I DS    0CL4 .  INPUT DATA FIELD
Y150T05O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B05L DS    CL2 .  INPUT DATA FIELD LEN
Y150B05F DS    0C .   DATA FIELD FLAG
Y150B05A DS    C .    DATA FIELD ATTRIBUTE
Y150B05I DS    0CL4 .  INPUT DATA FIELD
Y150B05O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T06L DS    CL2 .  INPUT DATA FIELD LEN
Y150T06F DS    0C .   DATA FIELD FLAG
Y150T06A DS    C .    DATA FIELD ATTRIBUTE
Y150T06I DS    0CL4 .  INPUT DATA FIELD
Y150T06O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B06L DS    CL2 .  INPUT DATA FIELD LEN
Y150B06F DS    0C .   DATA FIELD FLAG
Y150B06A DS    C .    DATA FIELD ATTRIBUTE
Y150B06I DS    0CL4 .  INPUT DATA FIELD
Y150B06O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T07L DS    CL2 .  INPUT DATA FIELD LEN
Y150T07F DS    0C .   DATA FIELD FLAG
Y150T07A DS    C .    DATA FIELD ATTRIBUTE
Y150T07I DS    0CL4 .  INPUT DATA FIELD
Y150T07O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B07L DS    CL2 .  INPUT DATA FIELD LEN
Y150B07F DS    0C .   DATA FIELD FLAG
Y150B07A DS    C .    DATA FIELD ATTRIBUTE
Y150B07I DS    0CL4 .  INPUT DATA FIELD
Y150B07O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T08L DS    CL2 .  INPUT DATA FIELD LEN
Y150T08F DS    0C .   DATA FIELD FLAG
Y150T08A DS    C .    DATA FIELD ATTRIBUTE
Y150T08I DS    0CL4 .  INPUT DATA FIELD
Y150T08O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B08L DS    CL2 .  INPUT DATA FIELD LEN
Y150B08F DS    0C .   DATA FIELD FLAG
Y150B08A DS    C .    DATA FIELD ATTRIBUTE
Y150B08I DS    0CL4 .  INPUT DATA FIELD
Y150B08O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T09L DS    CL2 .  INPUT DATA FIELD LEN
Y150T09F DS    0C .   DATA FIELD FLAG
Y150T09A DS    C .    DATA FIELD ATTRIBUTE
Y150T09I DS    0CL4 .  INPUT DATA FIELD
Y150T09O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B09L DS    CL2 .  INPUT DATA FIELD LEN
Y150B09F DS    0C .   DATA FIELD FLAG
Y150B09A DS    C .    DATA FIELD ATTRIBUTE
Y150B09I DS    0CL4 .  INPUT DATA FIELD
Y150B09O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T10L DS    CL2 .  INPUT DATA FIELD LEN
Y150T10F DS    0C .   DATA FIELD FLAG
Y150T10A DS    C .    DATA FIELD ATTRIBUTE
Y150T10I DS    0CL4 .  INPUT DATA FIELD
Y150T10O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B10L DS    CL2 .  INPUT DATA FIELD LEN
Y150B10F DS    0C .   DATA FIELD FLAG
Y150B10A DS    C .    DATA FIELD ATTRIBUTE
Y150B10I DS    0CL4 .  INPUT DATA FIELD
Y150B10O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T11L DS    CL2 .  INPUT DATA FIELD LEN
Y150T11F DS    0C .   DATA FIELD FLAG
Y150T11A DS    C .    DATA FIELD ATTRIBUTE
Y150T11I DS    0CL4 .  INPUT DATA FIELD
Y150T11O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B11L DS    CL2 .  INPUT DATA FIELD LEN
Y150B11F DS    0C .   DATA FIELD FLAG
Y150B11A DS    C .    DATA FIELD ATTRIBUTE
Y150B11I DS    0CL4 .  INPUT DATA FIELD
Y150B11O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T12L DS    CL2 .  INPUT DATA FIELD LEN
Y150T12F DS    0C .   DATA FIELD FLAG
Y150T12A DS    C .    DATA FIELD ATTRIBUTE
Y150T12I DS    0CL4 .  INPUT DATA FIELD
Y150T12O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B12L DS    CL2 .  INPUT DATA FIELD LEN
Y150B12F DS    0C .   DATA FIELD FLAG
Y150B12A DS    C .    DATA FIELD ATTRIBUTE
Y150B12I DS    0CL4 .  INPUT DATA FIELD
Y150B12O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T13L DS    CL2 .  INPUT DATA FIELD LEN
Y150T13F DS    0C .   DATA FIELD FLAG
Y150T13A DS    C .    DATA FIELD ATTRIBUTE
Y150T13I DS    0CL4 .  INPUT DATA FIELD
Y150T13O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B13L DS    CL2 .  INPUT DATA FIELD LEN
Y150B13F DS    0C .   DATA FIELD FLAG
Y150B13A DS    C .    DATA FIELD ATTRIBUTE
Y150B13I DS    0CL4 .  INPUT DATA FIELD
Y150B13O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T14L DS    CL2 .  INPUT DATA FIELD LEN
Y150T14F DS    0C .   DATA FIELD FLAG
Y150T14A DS    C .    DATA FIELD ATTRIBUTE
Y150T14I DS    0CL4 .  INPUT DATA FIELD
Y150T14O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B14L DS    CL2 .  INPUT DATA FIELD LEN
Y150B14F DS    0C .   DATA FIELD FLAG
Y150B14A DS    C .    DATA FIELD ATTRIBUTE
Y150B14I DS    0CL4 .  INPUT DATA FIELD
Y150B14O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T15L DS    CL2 .  INPUT DATA FIELD LEN
Y150T15F DS    0C .   DATA FIELD FLAG
Y150T15A DS    C .    DATA FIELD ATTRIBUTE
Y150T15I DS    0CL4 .  INPUT DATA FIELD
Y150T15O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B15L DS    CL2 .  INPUT DATA FIELD LEN
Y150B15F DS    0C .   DATA FIELD FLAG
Y150B15A DS    C .    DATA FIELD ATTRIBUTE
Y150B15I DS    0CL4 .  INPUT DATA FIELD
Y150B15O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T16L DS    CL2 .  INPUT DATA FIELD LEN
Y150T16F DS    0C .   DATA FIELD FLAG
Y150T16A DS    C .    DATA FIELD ATTRIBUTE
Y150T16I DS    0CL4 .  INPUT DATA FIELD
Y150T16O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B16L DS    CL2 .  INPUT DATA FIELD LEN
Y150B16F DS    0C .   DATA FIELD FLAG
Y150B16A DS    C .    DATA FIELD ATTRIBUTE
Y150B16I DS    0CL4 .  INPUT DATA FIELD
Y150B16O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T17L DS    CL2 .  INPUT DATA FIELD LEN
Y150T17F DS    0C .   DATA FIELD FLAG
Y150T17A DS    C .    DATA FIELD ATTRIBUTE
Y150T17I DS    0CL4 .  INPUT DATA FIELD
Y150T17O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B17L DS    CL2 .  INPUT DATA FIELD LEN
Y150B17F DS    0C .   DATA FIELD FLAG
Y150B17A DS    C .    DATA FIELD ATTRIBUTE
Y150B17I DS    0CL4 .  INPUT DATA FIELD
Y150B17O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T18L DS    CL2 .  INPUT DATA FIELD LEN
Y150T18F DS    0C .   DATA FIELD FLAG
Y150T18A DS    C .    DATA FIELD ATTRIBUTE
Y150T18I DS    0CL4 .  INPUT DATA FIELD
Y150T18O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B18L DS    CL2 .  INPUT DATA FIELD LEN
Y150B18F DS    0C .   DATA FIELD FLAG
Y150B18A DS    C .    DATA FIELD ATTRIBUTE
Y150B18I DS    0CL4 .  INPUT DATA FIELD
Y150B18O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T19L DS    CL2 .  INPUT DATA FIELD LEN
Y150T19F DS    0C .   DATA FIELD FLAG
Y150T19A DS    C .    DATA FIELD ATTRIBUTE
Y150T19I DS    0CL4 .  INPUT DATA FIELD
Y150T19O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B19L DS    CL2 .  INPUT DATA FIELD LEN
Y150B19F DS    0C .   DATA FIELD FLAG
Y150B19A DS    C .    DATA FIELD ATTRIBUTE
Y150B19I DS    0CL4 .  INPUT DATA FIELD
Y150B19O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T20L DS    CL2 .  INPUT DATA FIELD LEN
Y150T20F DS    0C .   DATA FIELD FLAG
Y150T20A DS    C .    DATA FIELD ATTRIBUTE
Y150T20I DS    0CL4 .  INPUT DATA FIELD
Y150T20O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B20L DS    CL2 .  INPUT DATA FIELD LEN
Y150B20F DS    0C .   DATA FIELD FLAG
Y150B20A DS    C .    DATA FIELD ATTRIBUTE
Y150B20I DS    0CL4 .  INPUT DATA FIELD
Y150B20O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T21L DS    CL2 .  INPUT DATA FIELD LEN
Y150T21F DS    0C .   DATA FIELD FLAG
Y150T21A DS    C .    DATA FIELD ATTRIBUTE
Y150T21I DS    0CL4 .  INPUT DATA FIELD
Y150T21O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B21L DS    CL2 .  INPUT DATA FIELD LEN
Y150B21F DS    0C .   DATA FIELD FLAG
Y150B21A DS    C .    DATA FIELD ATTRIBUTE
Y150B21I DS    0CL4 .  INPUT DATA FIELD
Y150B21O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T22L DS    CL2 .  INPUT DATA FIELD LEN
Y150T22F DS    0C .   DATA FIELD FLAG
Y150T22A DS    C .    DATA FIELD ATTRIBUTE
Y150T22I DS    0CL4 .  INPUT DATA FIELD
Y150T22O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B22L DS    CL2 .  INPUT DATA FIELD LEN
Y150B22F DS    0C .   DATA FIELD FLAG
Y150B22A DS    C .    DATA FIELD ATTRIBUTE
Y150B22I DS    0CL4 .  INPUT DATA FIELD
Y150B22O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T23L DS    CL2 .  INPUT DATA FIELD LEN
Y150T23F DS    0C .   DATA FIELD FLAG
Y150T23A DS    C .    DATA FIELD ATTRIBUTE
Y150T23I DS    0CL4 .  INPUT DATA FIELD
Y150T23O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B23L DS    CL2 .  INPUT DATA FIELD LEN
Y150B23F DS    0C .   DATA FIELD FLAG
Y150B23A DS    C .    DATA FIELD ATTRIBUTE
Y150B23I DS    0CL4 .  INPUT DATA FIELD
Y150B23O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T24L DS    CL2 .  INPUT DATA FIELD LEN
Y150T24F DS    0C .   DATA FIELD FLAG
Y150T24A DS    C .    DATA FIELD ATTRIBUTE
Y150T24I DS    0CL4 .  INPUT DATA FIELD
Y150T24O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B24L DS    CL2 .  INPUT DATA FIELD LEN
Y150B24F DS    0C .   DATA FIELD FLAG
Y150B24A DS    C .    DATA FIELD ATTRIBUTE
Y150B24I DS    0CL4 .  INPUT DATA FIELD
Y150B24O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T25L DS    CL2 .  INPUT DATA FIELD LEN
Y150T25F DS    0C .   DATA FIELD FLAG
Y150T25A DS    C .    DATA FIELD ATTRIBUTE
Y150T25I DS    0CL4 .  INPUT DATA FIELD
Y150T25O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B25L DS    CL2 .  INPUT DATA FIELD LEN
Y150B25F DS    0C .   DATA FIELD FLAG
Y150B25A DS    C .    DATA FIELD ATTRIBUTE
Y150B25I DS    0CL4 .  INPUT DATA FIELD
Y150B25O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T26L DS    CL2 .  INPUT DATA FIELD LEN
Y150T26F DS    0C .   DATA FIELD FLAG
Y150T26A DS    C .    DATA FIELD ATTRIBUTE
Y150T26I DS    0CL4 .  INPUT DATA FIELD
Y150T26O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B26L DS    CL2 .  INPUT DATA FIELD LEN
Y150B26F DS    0C .   DATA FIELD FLAG
Y150B26A DS    C .    DATA FIELD ATTRIBUTE
Y150B26I DS    0CL4 .  INPUT DATA FIELD
Y150B26O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T27L DS    CL2 .  INPUT DATA FIELD LEN
Y150T27F DS    0C .   DATA FIELD FLAG
Y150T27A DS    C .    DATA FIELD ATTRIBUTE
Y150T27I DS    0CL4 .  INPUT DATA FIELD
Y150T27O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B27L DS    CL2 .  INPUT DATA FIELD LEN
Y150B27F DS    0C .   DATA FIELD FLAG
Y150B27A DS    C .    DATA FIELD ATTRIBUTE
Y150B27I DS    0CL4 .  INPUT DATA FIELD
Y150B27O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T28L DS    CL2 .  INPUT DATA FIELD LEN
Y150T28F DS    0C .   DATA FIELD FLAG
Y150T28A DS    C .    DATA FIELD ATTRIBUTE
Y150T28I DS    0CL4 .  INPUT DATA FIELD
Y150T28O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B28L DS    CL2 .  INPUT DATA FIELD LEN
Y150B28F DS    0C .   DATA FIELD FLAG
Y150B28A DS    C .    DATA FIELD ATTRIBUTE
Y150B28I DS    0CL4 .  INPUT DATA FIELD
Y150B28O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T29L DS    CL2 .  INPUT DATA FIELD LEN
Y150T29F DS    0C .   DATA FIELD FLAG
Y150T29A DS    C .    DATA FIELD ATTRIBUTE
Y150T29I DS    0CL4 .  INPUT DATA FIELD
Y150T29O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B29L DS    CL2 .  INPUT DATA FIELD LEN
Y150B29F DS    0C .   DATA FIELD FLAG
Y150B29A DS    C .    DATA FIELD ATTRIBUTE
Y150B29I DS    0CL4 .  INPUT DATA FIELD
Y150B29O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150T30L DS    CL2 .  INPUT DATA FIELD LEN
Y150T30F DS    0C .   DATA FIELD FLAG
Y150T30A DS    C .    DATA FIELD ATTRIBUTE
Y150T30I DS    0CL4 .  INPUT DATA FIELD
Y150T30O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150B30L DS    CL2 .  INPUT DATA FIELD LEN
Y150B30F DS    0C .   DATA FIELD FLAG
Y150B30A DS    C .    DATA FIELD ATTRIBUTE
Y150B30I DS    0CL4 .  INPUT DATA FIELD
Y150B30O DS    CL4 .   OUTPUT DATA FIELD
        SPACE
Y150FUNL DS    CL2 .  INPUT DATA FIELD LEN
Y150FUNF DS    0C .   DATA FIELD FLAG
Y150FUNA DS    C .    DATA FIELD ATTRIBUTE
Y150FUNI DS    0CL1 .  INPUT DATA FIELD
Y150FUNO DS    CL1 .   OUTPUT DATA FIELD
        SPACE
Y150MSGL DS    CL2 .  INPUT DATA FIELD LEN
Y150MSGF DS    0C .   DATA FIELD FLAG
Y150MSGA DS    C .    DATA FIELD ATTRIBUTE
Y150MSGI DS    0CL78 .  INPUT DATA FIELD
Y150MSGO DS    CL78 .   OUTPUT DATA FIELD
        SPACE
CZFY150E  EQU   *     .               END OF MAP DEFINITION
           ORG  CZFY150S  .               ADDRESS START OF MAP
* CALCULATE MAPLENGTH, ASSIGNING A VALUE OF ONE WHERE LENGTH=ZERO
CZFY150L  EQU  CZFY150E-CZFY150S
CZFY150I  DS  0CL(CZFY150L+1-(CZFY150L/CZFY150L))
CZFY150O  DS  0CL(CZFY150L+1-(CZFY150L/CZFY150L))
           ORG
         ORG   CZFY150I  .               MAP ORIGIN
* * * END OF MAP DEFINITION * * *
         SPACE 3
             DS    0H                 ENSURE ALIGNMENT
CZFY152S  EQU  *      .             START OF MAP DEFINITION
         DS    12C .             TIOA PREFIX
        SPACE
Y152INFL DS    CL2 .  INPUT DATA FIELD LEN
Y152INFF DS    0C .   DATA FIELD FLAG
Y152INFA DS    C .    DATA FIELD ATTRIBUTE
Y152INFI DS    0CL30 .  INPUT DATA FIELD
Y152INFO DS    CL30 .   OUTPUT DATA FIELD
        SPACE
Y152FUNL DS    CL2 .  INPUT DATA FIELD LEN
Y152FUNF DS    0C .   DATA FIELD FLAG
Y152FUNA DS    C .    DATA FIELD ATTRIBUTE
Y152FUNI DS    0CL1 .  INPUT DATA FIELD
Y152FUNO DS    CL1 .   OUTPUT DATA FIELD
        SPACE
Y152MSGL DS    CL2 .  INPUT DATA FIELD LEN
Y152MSGF DS    0C .   DATA FIELD FLAG
Y152MSGA DS    C .    DATA FIELD ATTRIBUTE
Y152MSGI DS    0CL78 .  INPUT DATA FIELD
Y152MSGO DS    CL78 .   OUTPUT DATA FIELD
        SPACE
CZFY152E  EQU   *     .               END OF MAP DEFINITION
           ORG  CZFY152S  .               ADDRESS START OF MAP
* CALCULATE MAPLENGTH, ASSIGNING A VALUE OF ONE WHERE LENGTH=ZERO
CZFY152L  EQU  CZFY152E-CZFY152S
CZFY152I  DS  0CL(CZFY152L+1-(CZFY152L/CZFY152L))
CZFY152O  DS  0CL(CZFY152L+1-(CZFY152L/CZFY152L))
           ORG
* * * END OF MAP DEFINITION * * *
         SPACE 3
         ORG
CZFYM01T EQU *       * END OF MAP SET
* * * END OF MAP SET DEFINITION * * *
         SPACE 3