         MACRO                                                          00010000
&NAME    DOWHILE &OPS,&CNTL=                                            00020000
.* -----------------------------------------------------------------    00030000
.* 5799-BNT (C) COPYRIGHT IBM AMERICAS/FAR EAST 1983                    00040000
.* 5799-BNT (C) COPYRIGHT IBM WORLD TRADE CORP. 1983                    00050000
.* 5798-CLF COPYRIGHT IBM CORP. 1976                                    00060000
.* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                          00070000
.* REFER TO COPYRIGHT INSTRUCTIONS FROM NO. G120-2083                   00080000
.* -----------------------------------------------------------------    00090000
.*                                                                      00100000
 GBLA &$PMAFO      * AND FOLLOWED BY OR COUNTER                         00110000
 GBLA &$PMCNO      * CASE NUMBER                                        00120000
 GBLA &$PMINC      * IF NESTING LEVEL COUNT                             00130000
 GBLA &$PMPNI      * PROC NESTING INDEX                                 00140000
 GBLA &$PMPNO      * PROC NUMBER WITHIN CASE                            00150000
 GBLA &$PMPSC      * CONDITION (PREDICATE SET) COUNTER                  00160000
 GBLA &$PMNDX      * LABEL SEQUENCE COUNTER                   @JBTR     00170000
.*                                                                      00180000
 GBLB &$PMCEM      * CASE ERROR PROC PRESENT INDICATOR                  00190000
 GBLB &$PMCICS     * CICS OPTION                                        00200000
 GBLB &$PMCIND     * CASE ACTIVE (WITHIN CASE/ECASE) INDICATOR          00210000
 GBLB &$PMDCLS     * DCL ACTIVE (WITHIN DCL/EDCL PAIR)                  00220000
 GBLB &$PMES(20)   * ELSE MACRO PRESENT INDICATOR                       00230000
 GBLB &$PMOAA      * OR AND AND INDICATOR                               00240000
 GBLB &$PMOERR     * CASE SEQ ERR INDICATOR                             00250000
 GBLB &$PMPMS      * PROC MAIN ACTIVE SWITCH                            00260000
 GBLB &$PMROS      * RENT (REENTRANT) OPTION SW FROM PROC               00270000
.*                                                                      00280000
 GBLC &$PMCLBL     * CASE LABEL FOR ECASE                               00290000
 GBLC &$PMINS(20)  * IF NESTED SYSNDX VALUE                             00300000
 GBLC &$PMISN(20)  * IF SYMBOLIC NAME                                   00310000
 GBLC &$PMLKR      * PROC LINK REGISTER (PROC PERFORM EPROC)            00320000
 GBLC &$PMPMX      * CURRENT SYSNDX VALUE                               00330000
 GBLC &$PMPNM(20)  * PROC NESTED NAME                                   00340000
 GBLC &$PMPNS(20)  * PROC NESTING SYMBOL                                00350000
 GBLC &$PMPTP(20)  * PROC TYPE C=CASE L=CLOSED E=ERROR                  00360000
 GBLC &$PMWR1      * WORK REGISTER 1 NAME                               00370000
 GBLC &$PMWR2      * WORK REGISTER 2 NAME                               00380000
 GBLC &$PMWSN      * WRKAREA SYMBOLIC NAME                              00390000
.*                                                                      00400000
.* -----------------------------------------------------------------    00410000
 LCLB  &ANDOR                                                           00420000
 LCLB  &TOSW,&BYSW                                                      00430000
 LCLA  &I                                                               00440000
 LCLC  &NULL                                                            00450000
 LCLC  &CVAR,&START,&BYVAL,&TOVAL                                       00460000
 LCLC  &C,&SAFLBL                                             @JBTR     00470000
.* --------------------------------------------------------------       00480000
.*                                                                      00490000
&$PMINC     SETA  &$PMINC+1                                             00500000
.*                                                            @JBTR     00510000
&C       SETC  '&$PMNDX'                                      @JBTR     00520000
&$PMNDX  SETA  &$PMNDX+1                                      @JBTR     00530000
         AIF   (&$PMNDX GT 9).$GN100                          @JBTR     00540000
&C       SETC  '0'.'&C'                                       @JBTR     00550000
.$GN100  AIF   (&$PMNDX GT 99).$GN200                         @JBTR     00560000
&C       SETC  '0'.'&C'                                       @JBTR     00570000
.$GN200  AIF   (&$PMNDX GT 999).$GN300                        @JBTR     00580000
&C       SETC  '0'.'&C'                                       @JBTR     00590000
.$GN300  ANOP                                                 @JBTR     00600000
.*                                                            @JBTR     00610000
&$PMINS(&$PMINC) SETC '&C'                                    @JBTR     00620000
&$PMISN(&$PMINC) SETC '&NAME'                                           00630000
         AIF   ('&NAME' EQ '&NULL').NONAME                              00640000
&NAME    DS    0H                                                       00650000
.NONAME  ANOP                                                           00660000
.*                                                            @JBTR     00670000
.*             ---- LOOP CONTROL INITIALIZATION                         00680000
         AIF   (T'&CNTL EQ 'O').CNTLX  NO LOOP CNTL                     00690000
         AIF   (T'&CNTL(1) NE 'O').CNTLA1                               00700000
         MNOTE 12,'SPM0401 - CONTROL REGISTER NAME REQUIRED.'           00710000
         MEXIT                                                          00720000
.CNTLA1  ANOP                                                           00730000
&CVAR    SETC  '&CNTL(1)'  SAVE CONTROL REG NAME                        00740000
&START   SETC  '&CVAR'                                                  00750000
         AIF   (T'&CNTL(2) EQ 'O').CNTLAX                               00760000
&START   SETC  '&CNTL(2)'  SAVE STARTING VALUE                          00770000
.CNTLA2  ANOP                                                           00780000
         AIF   ('&START'(1,1) NE '(').CNTLA5                            00790000
&START   SETC  '&CNTL(2)'(2,K'&CNTL(2)-2)                               00800000
.CNTLA3  AIF   ('&CVAR' EQ '&START').CNTLA4                             00810000
         LR    &CVAR,&START   INITIALIZE CONTROL REG                    00820000
.CNTLA4  AGO   .CNTLAX                                                  00830000
.CNTLA5  ANOP                                                           00840000
         LA    &CVAR,&START   INITIALIZE CONTROL REG                    00850000
.CNTLAX  ANOP                                                           00860000
.*                                                                      00870000
         AIF   (N'&CNTL LT 3).CNTLX IF NO BY OR TO SPEC                 00880000
&BYVAL   SETC  '1'                                                      00890000
         AIF   ('&CNTL(3)' EQ 'BY' OR '&CNTL(3)' EQ 'TO').CNTLB1        00900000
.CNTLB0  MNOTE 12,'SPM0402 - CNTL=&CNTL IS INVALID.'                    00910000
         MEXIT                                                          00920000
.CNTLB1  AIF   (T'&CNTL(5) NE 'O' AND '&CNTL(5)' NE 'TO'               *00930000
               AND '&CNTL(5)' NE 'BY').CNTLB0                           00940000
         AIF   ('&CNTL(3)' NE 'BY').CNTLB2                              00950000
&BYVAL   SETC  '&CNTL(4)'                                               00960000
&BYSW    SETB  1                                                        00970000
.CNTLB2  AIF   ('&CNTL(5)' NE 'BY').CNTLB3                              00980000
&BYSW    SETB  1                                                        00990000
&BYVAL   SETC  '&CNTL(6)'                                               01000000
.CNTLB3  AIF   ('&CNTL(3)' NE 'TO').CNTLB4                              01010000
&TOSW    SETB  1                                                        01020000
&TOVAL   SETC  '&CNTL(4)'                                               01030000
.CNTLB4  AIF   ('&CNTL(5)' NE 'TO').CNTLB5                              01040000
&TOSW    SETB  1                                                        01050000
&TOVAL   SETC  '&CNTL(6)'                                               01060000
.CNTLB5  ANOP                                                           01070000
.*             ---- LOOP CONTROL INCREMENT                              01080000
         AIF   (NOT &BYSW AND NOT &TOSW).CNTLD1   NO INCR/DECR          01090000
         B     $PMI&C         SKIP UPDATING CNTL REG                    01100000
$PMD&C   DS    0H                                                       01110000
         AIF   ('&SYSPARM' NE 'TRON').NOTR01                  @JBTR     01120000
&SAFLBL  SETC  '$PMD'.'&C'                                    @JBTR     01130000
         MVC   TRDATA,=CL8'&SAFLBL'                           @JBTR     01140000
         BAL   14,SAFTRACE                                    @JBTR     01150000
.NOTR01  AIF   ('&BYVAL'(1,1) EQ '(').CNTLC2                  @JBTR     01160000
         AIF   ('&BYVAL'(1,1) EQ '-').CNTLC1                            01170000
         LA    &CVAR,&BYVAL.(&CVAR)  INCREMENT CNTL REG                 01180000
         AGO   .CNTLD                                                   01190000
.CNTLC1  ANOP                                                           01200000
         AIF   ('&BYVAL' NE '-1').CNTLC1A                               01210000
         BCTR  &CVAR,0        DECREMENT CNTL REG BY 1                   01220000
         AGO   .CNTLD                                                   01230000
.CNTLC1A  ANOP                                                          01240000
         A     &CVAR,=F'&BYVAL'    DECREMENT CNTL REG                   01250000
         AGO   .CNTLD                                                   01260000
.CNTLC2  ANOP                                                           01270000
         AR    &CVAR,&BYVAL   INCREMENT CNTL REG                        01280000
.CNTLD   ANOP                                                           01290000
.*                                                                      01300000
$PMI&C   DS    0H                                                       01310000
&SAFLBL  SETC  '$PMI'.'&C'                                    @JBTR     01320000
         AGO   .CNTLD2                                                  01330000
.CNTLD1  ANOP                                                           01340000
$PMD&C   DS    0H                                                       01350000
         AIF   ('&SYSPARM' NE 'TRON').CNTLD2                  @JBTR     01360000
&SAFLBL  SETC  '$PMD'.'&C'                                    @JBTR     01370000
         MVC   TRDATA,=CL8'&SAFLBL'                           @JBTR     01380000
         BAL   14,SAFTRACE                                    @JBTR     01390000
.CNTLD2  ANOP                                                           01400000
.*             ---- LOOP CONTROL LIMIT                                  01410000
         AIF   (NOT &TOSW).CNTLF                                        01420000
         AIF   ('&TOVAL'(1,1) EQ '(').CNTLE1                            01430000
         LA    &$PMWR1,&TOVAL                                           01440000
         CR    &CVAR,&$PMWR1   TEST FOR LIMIT                           01450000
         AGO   .CNTLE2                                                  01460000
.CNTLE1  CR    &CVAR,&TOVAL   TEST FOR LIMIT                            01470000
.CNTLE2  BH   $PME&C         END LOOP IF LIMIT REACHED                  01480000
.CNTLF   ANOP                                                           01490000
         AGO   .CNTLZ                                                   01500000
.CNTLX   ANOP                                                           01510000
$PMD&C   DS    0H                                                       01520000
         AIF   ('&SYSPARM' NE 'TRON').CNTLZ                   @JBTR     01530000
&SAFLBL  SETC  '$PMD'.'&C'                                    @JBTR     01540000
         MVC   TRDATA,=CL8'&SAFLBL'                           @JBTR     01550000
         BAL   14,SAFTRACE                                    @JBTR     01560000
.CNTLZ   ANOP                                                           01570000
.*                                                                      01580000
         AIF   (N'&SYSLIST NE 0).CNTLZ1                                 01590000
         MEXIT                                                          01600000
.CNTLZ1  ANOP                                                           01610000
.*             END OF LOOP CONTROL                                      01620000
.*             ---- CHECK FOR AND FOLLOWED BY OR ----                   01630000
&$PMOAA  SETB  0                                                        01640000
&$PMAFO     SETA  0                                                     01650000
&ANDOR   SETB 0               INITIALIZE SW                             01660000
&I       SETA  2              POINT TO SECOND PARAMETER (LOGICAL        01670000
.IFAO    ANOP  START OF SEARCH LOOP                                     01680000
         AIF   ('&SYSLIST(&I)' NE 'AND').IFA                            01690000
&ANDOR   SETB  1              SET WHEN AND IS FOUND                     01700000
         AGO   .IFB                                                     01710000
.IFA     AIF   ('&SYSLIST(&I)' NE 'OR' OR NOT &ANDOR).IFB               01720000
&$PMAFO     SETA  &$PMAFO+1         SET AND FOLOOWED BY OR INDIC        01730000
&ANDOR   SETB  0              RESET AND SW FOR MORE                     01740000
.IFB     ANOP                                                           01750000
&I       SETA  &I+2           POINT TO NEXT CONNECTOR                   01760000
         AIF   (&I LE N'&SYSLIST).IFAO  LOOP THRU CONNECTORS            01770000
.*             ----- PREDICATE SET GENRATION -----                      01780000
&I       SETA  1                                                        01790000
.IFLOOP  ANOP                                                           01800000
         AIF   (T'&SYSLIST(&I+1) EQ 'O').IFC                            01810000
         $PMMP &SYSLIST(&I),&SYSLIST(&I+1)                              01820000
&I       SETA  &I+2                                                     01830000
         AIF   (&I LE N'&SYSLIST).IFLOOP                                01840000
         MEXIT                                                          01850000
.*                                                                      01860000
.IFC     $PMMP &SYSLIST(&I),THEN                                        01870000
         MEND                                                           01880000