       01  FIABMNAI.
           02  FILLER PIC X(12).
           02  ABTRIDL    COMP  PIC  S9(4).
           02  ABTRIDF    PICTURE X.
           02  FILLER REDEFINES ABTRIDF.
             03 ABTRIDA    PICTURE X.
           02  ABTRIDI  PIC X(4).
           02  ABDATEL    COMP  PIC  S9(4).
           02  ABDATEF    PICTURE X.
           02  FILLER REDEFINES ABDATEF.
             03 ABDATEA    PICTURE X.
           02  ABDATEI  PIC X(8).
           02  ABTIMEL    COMP  PIC  S9(4).
           02  ABTIMEF    PICTURE X.
           02  FILLER REDEFINES ABTIMEF.
             03 ABTIMEA    PICTURE X.
           02  ABTIMEI  PIC X(8).
           02  ABTRN1L    COMP  PIC  S9(4).
           02  ABTRN1F    PICTURE X.
           02  FILLER REDEFINES ABTRN1F.
             03 ABTRN1A    PICTURE X.
           02  ABTRN1I  PIC X(4).
           02  ABABB1L    COMP  PIC  S9(4).
           02  ABABB1F    PICTURE X.
           02  FILLER REDEFINES ABABB1F.
             03 ABABB1A    PICTURE X.
           02  ABABB1I  PIC X(1).
           02  ABABB2L    COMP  PIC  S9(4).
           02  ABABB2F    PICTURE X.
           02  FILLER REDEFINES ABABB2F.
             03 ABABB2A    PICTURE X.
           02  ABABB2I  PIC X(1).
           02  ABABR1L    COMP  PIC  S9(4).
           02  ABABR1F    PICTURE X.
           02  FILLER REDEFINES ABABR1F.
             03 ABABR1A    PICTURE X.
           02  ABABR1I  PIC X(1).
           02  ABABR2L    COMP  PIC  S9(4).
           02  ABABR2F    PICTURE X.
           02  FILLER REDEFINES ABABR2F.
             03 ABABR2A    PICTURE X.
           02  ABABR2I  PIC X(1).
           02  ABABR3L    COMP  PIC  S9(4).
           02  ABABR3F    PICTURE X.
           02  FILLER REDEFINES ABABR3F.
             03 ABABR3A    PICTURE X.
           02  ABABR3I  PIC X(1).
           02  ABERRL    COMP  PIC  S9(4).
           02  ABERRF    PICTURE X.
           02  FILLER REDEFINES ABERRF.
             03 ABERRA    PICTURE X.
           02  ABERRI  PIC X(79).
       01  FIABMNAO REDEFINES FIABMNAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  ABTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ABTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ABTRN1O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABABB1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABABB2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABABR1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABABR2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABABR3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABERRO  PIC X(79).