       01  FIABB1BI.
           02  FILLER PIC X(12).
           02  ABFLR1BL    COMP  PIC  S9(4).
           02  ABFLR1BF    PICTURE X.
           02  FILLER REDEFINES ABFLR1BF.
             03 ABFLR1BA    PICTURE X.
           02  ABFLR1BI  PIC X(239).
           02  ABFLR2BL    COMP  PIC  S9(4).
           02  ABFLR2BF    PICTURE X.
           02  FILLER REDEFINES ABFLR2BF.
             03 ABFLR2BA    PICTURE X.
           02  ABFLR2BI  PIC X(239).
           02  ABFLR3BL    COMP  PIC  S9(4).
           02  ABFLR3BF    PICTURE X.
           02  FILLER REDEFINES ABFLR3BF.
             03 ABFLR3BA    PICTURE X.
           02  ABFLR3BI  PIC X(239).
           02  ABFLR4BL    COMP  PIC  S9(4).
           02  ABFLR4BF    PICTURE X.
           02  FILLER REDEFINES ABFLR4BF.
             03 ABFLR4BA    PICTURE X.
           02  ABFLR4BI  PIC X(239).
           02  ABFLR5BL    COMP  PIC  S9(4).
           02  ABFLR5BF    PICTURE X.
           02  FILLER REDEFINES ABFLR5BF.
             03 ABFLR5BA    PICTURE X.
           02  ABFLR5BI  PIC X(239).
           02  ABFLR6BL    COMP  PIC  S9(4).
           02  ABFLR6BF    PICTURE X.
           02  FILLER REDEFINES ABFLR6BF.
             03 ABFLR6BA    PICTURE X.
           02  ABFLR6BI  PIC X(239).
           02  ABFLR7BL    COMP  PIC  S9(4).
           02  ABFLR7BF    PICTURE X.
           02  FILLER REDEFINES ABFLR7BF.
             03 ABFLR7BA    PICTURE X.
           02  ABFLR7BI  PIC X(239).
           02  ABFLR8BL    COMP  PIC  S9(4).
           02  ABFLR8BF    PICTURE X.
           02  FILLER REDEFINES ABFLR8BF.
             03 ABFLR8BA    PICTURE X.
           02  ABFLR8BI  PIC X(220).
       01  FIABB1BO REDEFINES FIABB1BI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  ABFLR1BO  PIC X(239).
           02  FILLER PICTURE X(3).
           02  ABFLR2BO  PIC X(239).
           02  FILLER PICTURE X(3).
           02  ABFLR3BO  PIC X(239).
           02  FILLER PICTURE X(3).
           02  ABFLR4BO  PIC X(239).
           02  FILLER PICTURE X(3).
           02  ABFLR5BO  PIC X(239).
           02  FILLER PICTURE X(3).
           02  ABFLR6BO  PIC X(239).
           02  FILLER PICTURE X(3).
           02  ABFLR7BO  PIC X(239).
           02  FILLER PICTURE X(3).
           02  ABFLR8BO  PIC X(220).
       01  FIABB1CI REDEFINES FIABB1BI.
           02  FILLER PIC X(12).
           02  ABTRIDCL    COMP  PIC  S9(4).
           02  ABTRIDCF    PICTURE X.
           02  FILLER REDEFINES ABTRIDCF.
             03 ABTRIDCA    PICTURE X.
           02  ABTRIDCI  PIC X(4).
           02  ABDATECL    COMP  PIC  S9(4).
           02  ABDATECF    PICTURE X.
           02  FILLER REDEFINES ABDATECF.
             03 ABDATECA    PICTURE X.
           02  ABDATECI  PIC X(8).
           02  ABTIMECL    COMP  PIC  S9(4).
           02  ABTIMECF    PICTURE X.
           02  FILLER REDEFINES ABTIMECF.
             03 ABTIMECA    PICTURE X.
           02  ABTIMECI  PIC X(8).
           02  ABCTL1CL    COMP  PIC  S9(4).
           02  ABCTL1CF    PICTURE X.
           02  FILLER REDEFINES ABCTL1CF.
             03 ABCTL1CA    PICTURE X.
           02  ABCTL1CI  PIC X(4).
           02  ABCPYCL    COMP  PIC  S9(4).
           02  ABCPYCF    PICTURE X.
           02  FILLER REDEFINES ABCPYCF.
             03 ABCPYCA    PICTURE X.
           02  ABCPYCI  PIC X(15).
           02  ABCPY1CL    COMP  PIC  S9(4).
           02  ABCPY1CF    PICTURE X.
           02  FILLER REDEFINES ABCPY1CF.
             03 ABCPY1CA    PICTURE X.
           02  ABCPY1CI  PIC X(4).
           02  ABACTCL    COMP  PIC  S9(4).
           02  ABACTCF    PICTURE X.
           02  FILLER REDEFINES ABACTCF.
             03 ABACTCA    PICTURE X.
           02  ABACTCI  PIC X(1).
           02  ABDELCL    COMP  PIC  S9(4).
           02  ABDELCF    PICTURE X.
           02  FILLER REDEFINES ABDELCF.
             03 ABDELCA    PICTURE X.
           02  ABDELCI  PIC X(19).
           02  ABDELVCL    COMP  PIC  S9(4).
           02  ABDELVCF    PICTURE X.
           02  FILLER REDEFINES ABDELVCF.
             03 ABDELVCA    PICTURE X.
           02  ABDELVCI  PIC X(1).
           02  NOT1CL    COMP  PIC  S9(4).
           02  NOT1CF    PICTURE X.
           02  FILLER REDEFINES NOT1CF.
             03 NOT1CA    PICTURE X.
           02  NOT1CI  PIC X(41).
           02  NOT2CL    COMP  PIC  S9(4).
           02  NOT2CF    PICTURE X.
           02  FILLER REDEFINES NOT2CF.
             03 NOT2CA    PICTURE X.
           02  NOT2CI  PIC X(41).
           02  NOT3CL    COMP  PIC  S9(4).
           02  NOT3CF    PICTURE X.
           02  FILLER REDEFINES NOT3CF.
             03 NOT3CA    PICTURE X.
           02  NOT3CI  PIC X(41).
           02  NOT4CL    COMP  PIC  S9(4).
           02  NOT4CF    PICTURE X.
           02  FILLER REDEFINES NOT4CF.
             03 NOT4CA    PICTURE X.
           02  NOT4CI  PIC X(41).
           02  NOT5CL    COMP  PIC  S9(4).
           02  NOT5CF    PICTURE X.
           02  FILLER REDEFINES NOT5CF.
             03 NOT5CA    PICTURE X.
           02  NOT5CI  PIC X(41).
           02  NOT6CL    COMP  PIC  S9(4).
           02  NOT6CF    PICTURE X.
           02  FILLER REDEFINES NOT6CF.
             03 NOT6CA    PICTURE X.
           02  NOT6CI  PIC X(41).
           02  NOT7CL    COMP  PIC  S9(4).
           02  NOT7CF    PICTURE X.
           02  FILLER REDEFINES NOT7CF.
             03 NOT7CA    PICTURE X.
           02  NOT7CI  PIC X(41).
           02  NOT8CL    COMP  PIC  S9(4).
           02  NOT8CF    PICTURE X.
           02  FILLER REDEFINES NOT8CF.
             03 NOT8CA    PICTURE X.
           02  NOT8CI  PIC X(41).
           02  ABERRCL    COMP  PIC  S9(4).
           02  ABERRCF    PICTURE X.
           02  FILLER REDEFINES ABERRCF.
             03 ABERRCA    PICTURE X.
           02  ABERRCI  PIC X(79).
       01  FIABB1CO REDEFINES FIABB1CI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  ABTRIDCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABDATECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ABTIMECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ABCTL1CO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABCPYCO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  ABCPY1CO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABACTCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABDELCO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  ABDELVCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  NOT1CO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  NOT2CO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  NOT3CO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  NOT4CO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  NOT5CO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  NOT6CO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  NOT7CO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  NOT8CO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  ABERRCO  PIC X(79).
       01  FIABB1EI REDEFINES FIABB1BI.
           02  FILLER PIC X(12).
           02  ABTRIDEL    COMP  PIC  S9(4).
           02  ABTRIDEF    PICTURE X.
           02  FILLER REDEFINES ABTRIDEF.
             03 ABTRIDEA    PICTURE X.
           02  ABTRIDEI  PIC X(4).
           02  ABDATEEL    COMP  PIC  S9(4).
           02  ABDATEEF    PICTURE X.
           02  FILLER REDEFINES ABDATEEF.
             03 ABDATEEA    PICTURE X.
           02  ABDATEEI  PIC X(8).
           02  ABACTEL    COMP  PIC  S9(4).
           02  ABACTEF    PICTURE X.
           02  FILLER REDEFINES ABACTEF.
             03 ABACTEA    PICTURE X.
           02  ABACTEI  PIC X(1).
           02  ABTIMEEL    COMP  PIC  S9(4).
           02  ABTIMEEF    PICTURE X.
           02  FILLER REDEFINES ABTIMEEF.
             03 ABTIMEEA    PICTURE X.
           02  ABTIMEEI  PIC X(8).
           02  ABCTL1EL    COMP  PIC  S9(4).
           02  ABCTL1EF    PICTURE X.
           02  FILLER REDEFINES ABCTL1EF.
             03 ABCTL1EA    PICTURE X.
           02  ABCTL1EI  PIC X(4).
           02  ABNAMEEL    COMP  PIC  S9(4).
           02  ABNAMEEF    PICTURE X.
           02  FILLER REDEFINES ABNAMEEF.
             03 ABNAMEEA    PICTURE X.
           02  ABNAMEEI  PIC X(40).
           02  ABGLNOEL    COMP  PIC  S9(4).
           02  ABGLNOEF    PICTURE X.
           02  FILLER REDEFINES ABGLNOEF.
             03 ABGLNOEA    PICTURE X.
           02  ABGLNOEI  PIC X(4).
           02  ABINPEL    COMP  PIC  S9(4).
           02  ABINPEF    PICTURE X.
           02  FILLER REDEFINES ABINPEF.
             03 ABINPEA    PICTURE X.
           02  ABINPEI  PIC X(1).
           02  ABOUTPEL    COMP  PIC  S9(4).
           02  ABOUTPEF    PICTURE X.
           02  FILLER REDEFINES ABOUTPEF.
             03 ABOUTPEA    PICTURE X.
           02  ABOUTPEI  PIC X(1).
           02  APP1EL    COMP  PIC  S9(4).
           02  APP1EF    PICTURE X.
           02  FILLER REDEFINES APP1EF.
             03 APP1EA    PICTURE X.
           02  APP1EI  PIC X(2).
           02  APP1BEL    COMP  PIC  S9(4).
           02  APP1BEF    PICTURE X.
           02  FILLER REDEFINES APP1BEF.
             03 APP1BEA    PICTURE X.
           02  APP1BEI  PIC X(1).
           02  APP1LEL    COMP  PIC  S9(4).
           02  APP1LEF    PICTURE X.
           02  FILLER REDEFINES APP1LEF.
             03 APP1LEA    PICTURE X.
           02  APP1LEI  PIC X(1).
           02  APP2EL    COMP  PIC  S9(4).
           02  APP2EF    PICTURE X.
           02  FILLER REDEFINES APP2EF.
             03 APP2EA    PICTURE X.
           02  APP2EI  PIC X(2).
           02  APP2BEL    COMP  PIC  S9(4).
           02  APP2BEF    PICTURE X.
           02  FILLER REDEFINES APP2BEF.
             03 APP2BEA    PICTURE X.
           02  APP2BEI  PIC X(1).
           02  APP2LEL    COMP  PIC  S9(4).
           02  APP2LEF    PICTURE X.
           02  FILLER REDEFINES APP2LEF.
             03 APP2LEA    PICTURE X.
           02  APP2LEI  PIC X(1).
           02  APP3EL    COMP  PIC  S9(4).
           02  APP3EF    PICTURE X.
           02  FILLER REDEFINES APP3EF.
             03 APP3EA    PICTURE X.
           02  APP3EI  PIC X(2).
           02  APP3BEL    COMP  PIC  S9(4).
           02  APP3BEF    PICTURE X.
           02  FILLER REDEFINES APP3BEF.
             03 APP3BEA    PICTURE X.
           02  APP3BEI  PIC X(1).
           02  APP3LEL    COMP  PIC  S9(4).
           02  APP3LEF    PICTURE X.
           02  FILLER REDEFINES APP3LEF.
             03 APP3LEA    PICTURE X.
           02  APP3LEI  PIC X(1).
           02  APP4EL    COMP  PIC  S9(4).
           02  APP4EF    PICTURE X.
           02  FILLER REDEFINES APP4EF.
             03 APP4EA    PICTURE X.
           02  APP4EI  PIC X(2).
           02  APP4BEL    COMP  PIC  S9(4).
           02  APP4BEF    PICTURE X.
           02  FILLER REDEFINES APP4BEF.
             03 APP4BEA    PICTURE X.
           02  APP4BEI  PIC X(1).
           02  APP4LEL    COMP  PIC  S9(4).
           02  APP4LEF    PICTURE X.
           02  FILLER REDEFINES APP4LEF.
             03 APP4LEA    PICTURE X.
           02  APP4LEI  PIC X(1).
           02  APP5EL    COMP  PIC  S9(4).
           02  APP5EF    PICTURE X.
           02  FILLER REDEFINES APP5EF.
             03 APP5EA    PICTURE X.
           02  APP5EI  PIC X(2).
           02  APP5BEL    COMP  PIC  S9(4).
           02  APP5BEF    PICTURE X.
           02  FILLER REDEFINES APP5BEF.
             03 APP5BEA    PICTURE X.
           02  APP5BEI  PIC X(1).
           02  APP5LEL    COMP  PIC  S9(4).
           02  APP5LEF    PICTURE X.
           02  FILLER REDEFINES APP5LEF.
             03 APP5LEA    PICTURE X.
           02  APP5LEI  PIC X(1).
           02  APP6EL    COMP  PIC  S9(4).
           02  APP6EF    PICTURE X.
           02  FILLER REDEFINES APP6EF.
             03 APP6EA    PICTURE X.
           02  APP6EI  PIC X(2).
           02  APP6BEL    COMP  PIC  S9(4).
           02  APP6BEF    PICTURE X.
           02  FILLER REDEFINES APP6BEF.
             03 APP6BEA    PICTURE X.
           02  APP6BEI  PIC X(1).
           02  APP6LEL    COMP  PIC  S9(4).
           02  APP6LEF    PICTURE X.
           02  FILLER REDEFINES APP6LEF.
             03 APP6LEA    PICTURE X.
           02  APP6LEI  PIC X(1).
           02  APP7EL    COMP  PIC  S9(4).
           02  APP7EF    PICTURE X.
           02  FILLER REDEFINES APP7EF.
             03 APP7EA    PICTURE X.
           02  APP7EI  PIC X(2).
           02  APP7BEL    COMP  PIC  S9(4).
           02  APP7BEF    PICTURE X.
           02  FILLER REDEFINES APP7BEF.
             03 APP7BEA    PICTURE X.
           02  APP7BEI  PIC X(1).
           02  APP7LEL    COMP  PIC  S9(4).
           02  APP7LEF    PICTURE X.
           02  FILLER REDEFINES APP7LEF.
             03 APP7LEA    PICTURE X.
           02  APP7LEI  PIC X(1).
           02  APP8EL    COMP  PIC  S9(4).
           02  APP8EF    PICTURE X.
           02  FILLER REDEFINES APP8EF.
             03 APP8EA    PICTURE X.
           02  APP8EI  PIC X(2).
           02  APP8BEL    COMP  PIC  S9(4).
           02  APP8BEF    PICTURE X.
           02  FILLER REDEFINES APP8BEF.
             03 APP8BEA    PICTURE X.
           02  APP8BEI  PIC X(1).
           02  APP8LEL    COMP  PIC  S9(4).
           02  APP8LEF    PICTURE X.
           02  FILLER REDEFINES APP8LEF.
             03 APP8LEA    PICTURE X.
           02  APP8LEI  PIC X(1).
           02  APP9EL    COMP  PIC  S9(4).
           02  APP9EF    PICTURE X.
           02  FILLER REDEFINES APP9EF.
             03 APP9EA    PICTURE X.
           02  APP9EI  PIC X(2).
           02  APP9BEL    COMP  PIC  S9(4).
           02  APP9BEF    PICTURE X.
           02  FILLER REDEFINES APP9BEF.
             03 APP9BEA    PICTURE X.
           02  APP9BEI  PIC X(1).
           02  APP9LEL    COMP  PIC  S9(4).
           02  APP9LEF    PICTURE X.
           02  FILLER REDEFINES APP9LEF.
             03 APP9LEA    PICTURE X.
           02  APP9LEI  PIC X(1).
           02  APP10EL    COMP  PIC  S9(4).
           02  APP10EF    PICTURE X.
           02  FILLER REDEFINES APP10EF.
             03 APP10EA    PICTURE X.
           02  APP10EI  PIC X(2).
           02  APP10BEL    COMP  PIC  S9(4).
           02  APP10BEF    PICTURE X.
           02  FILLER REDEFINES APP10BEF.
             03 APP10BEA    PICTURE X.
           02  APP10BEI  PIC X(1).
           02  APP10LEL    COMP  PIC  S9(4).
           02  APP10LEF    PICTURE X.
           02  FILLER REDEFINES APP10LEF.
             03 APP10LEA    PICTURE X.
           02  APP10LEI  PIC X(1).
           02  APP11EL    COMP  PIC  S9(4).
           02  APP11EF    PICTURE X.
           02  FILLER REDEFINES APP11EF.
             03 APP11EA    PICTURE X.
           02  APP11EI  PIC X(2).
           02  APP11BEL    COMP  PIC  S9(4).
           02  APP11BEF    PICTURE X.
           02  FILLER REDEFINES APP11BEF.
             03 APP11BEA    PICTURE X.
           02  APP11BEI  PIC X(1).
           02  APP11LEL    COMP  PIC  S9(4).
           02  APP11LEF    PICTURE X.
           02  FILLER REDEFINES APP11LEF.
             03 APP11LEA    PICTURE X.
           02  APP11LEI  PIC X(1).
           02  APP12EL    COMP  PIC  S9(4).
           02  APP12EF    PICTURE X.
           02  FILLER REDEFINES APP12EF.
             03 APP12EA    PICTURE X.
           02  APP12EI  PIC X(2).
           02  APP12BEL    COMP  PIC  S9(4).
           02  APP12BEF    PICTURE X.
           02  FILLER REDEFINES APP12BEF.
             03 APP12BEA    PICTURE X.
           02  APP12BEI  PIC X(1).
           02  APP12LEL    COMP  PIC  S9(4).
           02  APP12LEF    PICTURE X.
           02  FILLER REDEFINES APP12LEF.
             03 APP12LEA    PICTURE X.
           02  APP12LEI  PIC X(1).
           02  APP13EL    COMP  PIC  S9(4).
           02  APP13EF    PICTURE X.
           02  FILLER REDEFINES APP13EF.
             03 APP13EA    PICTURE X.
           02  APP13EI  PIC X(2).
           02  APP13BEL    COMP  PIC  S9(4).
           02  APP13BEF    PICTURE X.
           02  FILLER REDEFINES APP13BEF.
             03 APP13BEA    PICTURE X.
           02  APP13BEI  PIC X(1).
           02  APP13LEL    COMP  PIC  S9(4).
           02  APP13LEF    PICTURE X.
           02  FILLER REDEFINES APP13LEF.
             03 APP13LEA    PICTURE X.
           02  APP13LEI  PIC X(1).
           02  APP14EL    COMP  PIC  S9(4).
           02  APP14EF    PICTURE X.
           02  FILLER REDEFINES APP14EF.
             03 APP14EA    PICTURE X.
           02  APP14EI  PIC X(2).
           02  APP14BEL    COMP  PIC  S9(4).
           02  APP14BEF    PICTURE X.
           02  FILLER REDEFINES APP14BEF.
             03 APP14BEA    PICTURE X.
           02  APP14BEI  PIC X(1).
           02  APP14LEL    COMP  PIC  S9(4).
           02  APP14LEF    PICTURE X.
           02  FILLER REDEFINES APP14LEF.
             03 APP14LEA    PICTURE X.
           02  APP14LEI  PIC X(1).
           02  APP15EL    COMP  PIC  S9(4).
           02  APP15EF    PICTURE X.
           02  FILLER REDEFINES APP15EF.
             03 APP15EA    PICTURE X.
           02  APP15EI  PIC X(2).
           02  APP15BEL    COMP  PIC  S9(4).
           02  APP15BEF    PICTURE X.
           02  FILLER REDEFINES APP15BEF.
             03 APP15BEA    PICTURE X.
           02  APP15BEI  PIC X(1).
           02  APP15LEL    COMP  PIC  S9(4).
           02  APP15LEF    PICTURE X.
           02  FILLER REDEFINES APP15LEF.
             03 APP15LEA    PICTURE X.
           02  APP15LEI  PIC X(1).
           02  APP16EL    COMP  PIC  S9(4).
           02  APP16EF    PICTURE X.
           02  FILLER REDEFINES APP16EF.
             03 APP16EA    PICTURE X.
           02  APP16EI  PIC X(2).
           02  APP16BEL    COMP  PIC  S9(4).
           02  APP16BEF    PICTURE X.
           02  FILLER REDEFINES APP16BEF.
             03 APP16BEA    PICTURE X.
           02  APP16BEI  PIC X(1).
           02  APP16LEL    COMP  PIC  S9(4).
           02  APP16LEF    PICTURE X.
           02  FILLER REDEFINES APP16LEF.
             03 APP16LEA    PICTURE X.
           02  APP16LEI  PIC X(1).
           02  APP17EL    COMP  PIC  S9(4).
           02  APP17EF    PICTURE X.
           02  FILLER REDEFINES APP17EF.
             03 APP17EA    PICTURE X.
           02  APP17EI  PIC X(2).
           02  APP17BEL    COMP  PIC  S9(4).
           02  APP17BEF    PICTURE X.
           02  FILLER REDEFINES APP17BEF.
             03 APP17BEA    PICTURE X.
           02  APP17BEI  PIC X(1).
           02  APP17LEL    COMP  PIC  S9(4).
           02  APP17LEF    PICTURE X.
           02  FILLER REDEFINES APP17LEF.
             03 APP17LEA    PICTURE X.
           02  APP17LEI  PIC X(1).
           02  APP18EL    COMP  PIC  S9(4).
           02  APP18EF    PICTURE X.
           02  FILLER REDEFINES APP18EF.
             03 APP18EA    PICTURE X.
           02  APP18EI  PIC X(2).
           02  APP18BEL    COMP  PIC  S9(4).
           02  APP18BEF    PICTURE X.
           02  FILLER REDEFINES APP18BEF.
             03 APP18BEA    PICTURE X.
           02  APP18BEI  PIC X(1).
           02  APP18LEL    COMP  PIC  S9(4).
           02  APP18LEF    PICTURE X.
           02  FILLER REDEFINES APP18LEF.
             03 APP18LEA    PICTURE X.
           02  APP18LEI  PIC X(1).
           02  APP19EL    COMP  PIC  S9(4).
           02  APP19EF    PICTURE X.
           02  FILLER REDEFINES APP19EF.
             03 APP19EA    PICTURE X.
           02  APP19EI  PIC X(2).
           02  APP19BEL    COMP  PIC  S9(4).
           02  APP19BEF    PICTURE X.
           02  FILLER REDEFINES APP19BEF.
             03 APP19BEA    PICTURE X.
           02  APP19BEI  PIC X(1).
           02  APP19LEL    COMP  PIC  S9(4).
           02  APP19LEF    PICTURE X.
           02  FILLER REDEFINES APP19LEF.
             03 APP19LEA    PICTURE X.
           02  APP19LEI  PIC X(1).
           02  APP20EL    COMP  PIC  S9(4).
           02  APP20EF    PICTURE X.
           02  FILLER REDEFINES APP20EF.
             03 APP20EA    PICTURE X.
           02  APP20EI  PIC X(2).
           02  APP20BEL    COMP  PIC  S9(4).
           02  APP20BEF    PICTURE X.
           02  FILLER REDEFINES APP20BEF.
             03 APP20BEA    PICTURE X.
           02  APP20BEI  PIC X(1).
           02  APP20LEL    COMP  PIC  S9(4).
           02  APP20LEF    PICTURE X.
           02  FILLER REDEFINES APP20LEF.
             03 APP20LEA    PICTURE X.
           02  APP20LEI  PIC X(1).
           02  APP21EL    COMP  PIC  S9(4).
           02  APP21EF    PICTURE X.
           02  FILLER REDEFINES APP21EF.
             03 APP21EA    PICTURE X.
           02  APP21EI  PIC X(2).
           02  APP21BEL    COMP  PIC  S9(4).
           02  APP21BEF    PICTURE X.
           02  FILLER REDEFINES APP21BEF.
             03 APP21BEA    PICTURE X.
           02  APP21BEI  PIC X(1).
           02  APP21LEL    COMP  PIC  S9(4).
           02  APP21LEF    PICTURE X.
           02  FILLER REDEFINES APP21LEF.
             03 APP21LEA    PICTURE X.
           02  APP21LEI  PIC X(1).
           02  APP22EL    COMP  PIC  S9(4).
           02  APP22EF    PICTURE X.
           02  FILLER REDEFINES APP22EF.
             03 APP22EA    PICTURE X.
           02  APP22EI  PIC X(2).
           02  APP22BEL    COMP  PIC  S9(4).
           02  APP22BEF    PICTURE X.
           02  FILLER REDEFINES APP22BEF.
             03 APP22BEA    PICTURE X.
           02  APP22BEI  PIC X(1).
           02  APP22LEL    COMP  PIC  S9(4).
           02  APP22LEF    PICTURE X.
           02  FILLER REDEFINES APP22LEF.
             03 APP22LEA    PICTURE X.
           02  APP22LEI  PIC X(1).
           02  APP23EL    COMP  PIC  S9(4).
           02  APP23EF    PICTURE X.
           02  FILLER REDEFINES APP23EF.
             03 APP23EA    PICTURE X.
           02  APP23EI  PIC X(2).
           02  APP23BEL    COMP  PIC  S9(4).
           02  APP23BEF    PICTURE X.
           02  FILLER REDEFINES APP23BEF.
             03 APP23BEA    PICTURE X.
           02  APP23BEI  PIC X(1).
           02  APP23LEL    COMP  PIC  S9(4).
           02  APP23LEF    PICTURE X.
           02  FILLER REDEFINES APP23LEF.
             03 APP23LEA    PICTURE X.
           02  APP23LEI  PIC X(1).
           02  APP24EL    COMP  PIC  S9(4).
           02  APP24EF    PICTURE X.
           02  FILLER REDEFINES APP24EF.
             03 APP24EA    PICTURE X.
           02  APP24EI  PIC X(2).
           02  APP24BEL    COMP  PIC  S9(4).
           02  APP24BEF    PICTURE X.
           02  FILLER REDEFINES APP24BEF.
             03 APP24BEA    PICTURE X.
           02  APP24BEI  PIC X(1).
           02  APP24LEL    COMP  PIC  S9(4).
           02  APP24LEF    PICTURE X.
           02  FILLER REDEFINES APP24LEF.
             03 APP24LEA    PICTURE X.
           02  APP24LEI  PIC X(1).
           02  APP25EL    COMP  PIC  S9(4).
           02  APP25EF    PICTURE X.
           02  FILLER REDEFINES APP25EF.
             03 APP25EA    PICTURE X.
           02  APP25EI  PIC X(2).
           02  APP25BEL    COMP  PIC  S9(4).
           02  APP25BEF    PICTURE X.
           02  FILLER REDEFINES APP25BEF.
             03 APP25BEA    PICTURE X.
           02  APP25BEI  PIC X(1).
           02  APP25LEL    COMP  PIC  S9(4).
           02  APP25LEF    PICTURE X.
           02  FILLER REDEFINES APP25LEF.
             03 APP25LEA    PICTURE X.
           02  APP25LEI  PIC X(1).
           02  APP26EL    COMP  PIC  S9(4).
           02  APP26EF    PICTURE X.
           02  FILLER REDEFINES APP26EF.
             03 APP26EA    PICTURE X.
           02  APP26EI  PIC X(2).
           02  APP26BEL    COMP  PIC  S9(4).
           02  APP26BEF    PICTURE X.
           02  FILLER REDEFINES APP26BEF.
             03 APP26BEA    PICTURE X.
           02  APP26BEI  PIC X(1).
           02  APP26LEL    COMP  PIC  S9(4).
           02  APP26LEF    PICTURE X.
           02  FILLER REDEFINES APP26LEF.
             03 APP26LEA    PICTURE X.
           02  APP26LEI  PIC X(1).
           02  APP27EL    COMP  PIC  S9(4).
           02  APP27EF    PICTURE X.
           02  FILLER REDEFINES APP27EF.
             03 APP27EA    PICTURE X.
           02  APP27EI  PIC X(2).
           02  APP27BEL    COMP  PIC  S9(4).
           02  APP27BEF    PICTURE X.
           02  FILLER REDEFINES APP27BEF.
             03 APP27BEA    PICTURE X.
           02  APP27BEI  PIC X(1).
           02  APP27LEL    COMP  PIC  S9(4).
           02  APP27LEF    PICTURE X.
           02  FILLER REDEFINES APP27LEF.
             03 APP27LEA    PICTURE X.
           02  APP27LEI  PIC X(1).
           02  APP28EL    COMP  PIC  S9(4).
           02  APP28EF    PICTURE X.
           02  FILLER REDEFINES APP28EF.
             03 APP28EA    PICTURE X.
           02  APP28EI  PIC X(2).
           02  APP28BEL    COMP  PIC  S9(4).
           02  APP28BEF    PICTURE X.
           02  FILLER REDEFINES APP28BEF.
             03 APP28BEA    PICTURE X.
           02  APP28BEI  PIC X(1).
           02  APP28LEL    COMP  PIC  S9(4).
           02  APP28LEF    PICTURE X.
           02  FILLER REDEFINES APP28LEF.
             03 APP28LEA    PICTURE X.
           02  APP28LEI  PIC X(1).
           02  APP29EL    COMP  PIC  S9(4).
           02  APP29EF    PICTURE X.
           02  FILLER REDEFINES APP29EF.
             03 APP29EA    PICTURE X.
           02  APP29EI  PIC X(2).
           02  APP29BEL    COMP  PIC  S9(4).
           02  APP29BEF    PICTURE X.
           02  FILLER REDEFINES APP29BEF.
             03 APP29BEA    PICTURE X.
           02  APP29BEI  PIC X(1).
           02  APP29LEL    COMP  PIC  S9(4).
           02  APP29LEF    PICTURE X.
           02  FILLER REDEFINES APP29LEF.
             03 APP29LEA    PICTURE X.
           02  APP29LEI  PIC X(1).
           02  APP30EL    COMP  PIC  S9(4).
           02  APP30EF    PICTURE X.
           02  FILLER REDEFINES APP30EF.
             03 APP30EA    PICTURE X.
           02  APP30EI  PIC X(2).
           02  APP30BEL    COMP  PIC  S9(4).
           02  APP30BEF    PICTURE X.
           02  FILLER REDEFINES APP30BEF.
             03 APP30BEA    PICTURE X.
           02  APP30BEI  PIC X(1).
           02  APP30LEL    COMP  PIC  S9(4).
           02  APP30LEF    PICTURE X.
           02  FILLER REDEFINES APP30LEF.
             03 APP30LEA    PICTURE X.
           02  APP30LEI  PIC X(1).
           02  ABPFEL    COMP  PIC  S9(4).
           02  ABPFEF    PICTURE X.
           02  FILLER REDEFINES ABPFEF.
             03 ABPFEA    PICTURE X.
           02  ABPFEI  PIC X(79).
           02  ABERREL    COMP  PIC  S9(4).
           02  ABERREF    PICTURE X.
           02  FILLER REDEFINES ABERREF.
             03 ABERREA    PICTURE X.
           02  ABERREI  PIC X(79).
       01  FIABB1EO REDEFINES FIABB1EI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  ABTRIDEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABDATEEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ABACTEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABTIMEEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ABCTL1EO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABNAMEEO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  ABGLNOEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABINPEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABOUTPEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP1EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP1BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP1LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP2EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP2BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP2LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP3EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP3BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP3LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP4EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP4BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP4LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP5EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP5BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP5LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP6EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP6BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP6LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP7EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP7BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP7LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP8EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP8BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP8LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP9EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP9BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP9LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP10EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP10BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP10LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP11EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP11BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP11LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP12EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP12BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP12LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP13EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP13BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP13LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP14EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP14BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP14LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP15EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP15BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP15LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP16EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP16BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP16LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP17EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP17BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP17LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP18EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP18BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP18LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP19EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP19BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP19LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP20EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP20BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP20LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP21EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP21BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP21LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP22EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP22BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP22LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP23EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP23BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP23LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP24EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP24BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP24LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP25EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP25BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP25LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP26EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP26BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP26LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP27EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP27BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP27LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP28EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP28BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP28LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP29EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP29BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP29LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP30EO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  APP30BEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  APP30LEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABPFEO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  ABERREO  PIC X(79).
       01  FIABB1GI REDEFINES FIABB1BI.
           02  FILLER PIC X(12).
           02  ABTRIDGL    COMP  PIC  S9(4).
           02  ABTRIDGF    PICTURE X.
           02  FILLER REDEFINES ABTRIDGF.
             03 ABTRIDGA    PICTURE X.
           02  ABTRIDGI  PIC X(4).
           02  ABDATEGL    COMP  PIC  S9(4).
           02  ABDATEGF    PICTURE X.
           02  FILLER REDEFINES ABDATEGF.
             03 ABDATEGA    PICTURE X.
           02  ABDATEGI  PIC X(8).
           02  ABACTGL    COMP  PIC  S9(4).
           02  ABACTGF    PICTURE X.
           02  FILLER REDEFINES ABACTGF.
             03 ABACTGA    PICTURE X.
           02  ABACTGI  PIC X(1).
           02  ABTIMEGL    COMP  PIC  S9(4).
           02  ABTIMEGF    PICTURE X.
           02  FILLER REDEFINES ABTIMEGF.
             03 ABTIMEGA    PICTURE X.
           02  ABTIMEGI  PIC X(8).
           02  ABCTL1GL    COMP  PIC  S9(4).
           02  ABCTL1GF    PICTURE X.
           02  FILLER REDEFINES ABCTL1GF.
             03 ABCTL1GA    PICTURE X.
           02  ABCTL1GI  PIC X(4).
           02  ABHEADGL    COMP  PIC  S9(4).
           02  ABHEADGF    PICTURE X.
           02  FILLER REDEFINES ABHEADGF.
             03 ABHEADGA    PICTURE X.
           02  ABHEADGI  PIC X(27).
           02  AB12FMGL    COMP  PIC  S9(4).
           02  AB12FMGF    PICTURE X.
           02  FILLER REDEFINES AB12FMGF.
             03 AB12FMGA    PICTURE X.
           02  AB12FMGI  PIC X(1).
           02  AB12SPGL    COMP  PIC  S9(4).
           02  AB12SPGF    PICTURE X.
           02  FILLER REDEFINES AB12SPGF.
             03 AB12SPGA    PICTURE X.
           02  AB12SPGI  PIC X(1).
           02  AB12SLGL    COMP  PIC  S9(4).
           02  AB12SLGF    PICTURE X.
           02  FILLER REDEFINES AB12SLGF.
             03 AB12SLGA    PICTURE X.
           02  AB12SLGI  PIC X(19).
           02  ATH1GL    COMP  PIC  S9(4).
           02  ATH1GF    PICTURE X.
           02  FILLER REDEFINES ATH1GF.
             03 ATH1GA    PICTURE X.
           02  ATH1GI  PIC X(1).
           02  AUTH1GL    COMP  PIC  S9(4).
           02  AUTH1GF    PICTURE X.
           02  FILLER REDEFINES AUTH1GF.
             03 AUTH1GA    PICTURE X.
           02  AUTH1GI  PIC X(10).
           02  ATH2GL    COMP  PIC  S9(4).
           02  ATH2GF    PICTURE X.
           02  FILLER REDEFINES ATH2GF.
             03 ATH2GA    PICTURE X.
           02  ATH2GI  PIC X(1).
           02  AUTH2GL    COMP  PIC  S9(4).
           02  AUTH2GF    PICTURE X.
           02  FILLER REDEFINES AUTH2GF.
             03 AUTH2GA    PICTURE X.
           02  AUTH2GI  PIC X(10).
           02  AB14FMGL    COMP  PIC  S9(4).
           02  AB14FMGF    PICTURE X.
           02  FILLER REDEFINES AB14FMGF.
             03 AB14FMGA    PICTURE X.
           02  AB14FMGI  PIC X(1).
           02  AB14SPGL    COMP  PIC  S9(4).
           02  AB14SPGF    PICTURE X.
           02  FILLER REDEFINES AB14SPGF.
             03 AB14SPGA    PICTURE X.
           02  AB14SPGI  PIC X(1).
           02  AB14SLGL    COMP  PIC  S9(4).
           02  AB14SLGF    PICTURE X.
           02  FILLER REDEFINES AB14SLGF.
             03 AB14SLGA    PICTURE X.
           02  AB14SLGI  PIC X(19).
           02  ATH3GL    COMP  PIC  S9(4).
           02  ATH3GF    PICTURE X.
           02  FILLER REDEFINES ATH3GF.
             03 ATH3GA    PICTURE X.
           02  ATH3GI  PIC X(1).
           02  AUTH3GL    COMP  PIC  S9(4).
           02  AUTH3GF    PICTURE X.
           02  FILLER REDEFINES AUTH3GF.
             03 AUTH3GA    PICTURE X.
           02  AUTH3GI  PIC X(10).
           02  ATH4GL    COMP  PIC  S9(4).
           02  ATH4GF    PICTURE X.
           02  FILLER REDEFINES ATH4GF.
             03 ATH4GA    PICTURE X.
           02  ATH4GI  PIC X(1).
           02  AUTH4GL    COMP  PIC  S9(4).
           02  AUTH4GF    PICTURE X.
           02  FILLER REDEFINES AUTH4GF.
             03 AUTH4GA    PICTURE X.
           02  AUTH4GI  PIC X(10).
           02  ABL1FMGL    COMP  PIC  S9(4).
           02  ABL1FMGF    PICTURE X.
           02  FILLER REDEFINES ABL1FMGF.
             03 ABL1FMGA    PICTURE X.
           02  ABL1FMGI  PIC X(1).
           02  ABL1SPGL    COMP  PIC  S9(4).
           02  ABL1SPGF    PICTURE X.
           02  FILLER REDEFINES ABL1SPGF.
             03 ABL1SPGA    PICTURE X.
           02  ABL1SPGI  PIC X(1).
           02  ABL1SLGL    COMP  PIC  S9(4).
           02  ABL1SLGF    PICTURE X.
           02  FILLER REDEFINES ABL1SLGF.
             03 ABL1SLGA    PICTURE X.
           02  ABL1SLGI  PIC X(19).
           02  ATH5GL    COMP  PIC  S9(4).
           02  ATH5GF    PICTURE X.
           02  FILLER REDEFINES ATH5GF.
             03 ATH5GA    PICTURE X.
           02  ATH5GI  PIC X(1).
           02  AUTH5GL    COMP  PIC  S9(4).
           02  AUTH5GF    PICTURE X.
           02  FILLER REDEFINES AUTH5GF.
             03 AUTH5GA    PICTURE X.
           02  AUTH5GI  PIC X(10).
           02  ATH6GL    COMP  PIC  S9(4).
           02  ATH6GF    PICTURE X.
           02  FILLER REDEFINES ATH6GF.
             03 ATH6GA    PICTURE X.
           02  ATH6GI  PIC X(1).
           02  AUTH6GL    COMP  PIC  S9(4).
           02  AUTH6GF    PICTURE X.
           02  FILLER REDEFINES AUTH6GF.
             03 AUTH6GA    PICTURE X.
           02  AUTH6GI  PIC X(10).
           02  ABL2RLGL    COMP  PIC  S9(4).
           02  ABL2RLGF    PICTURE X.
           02  FILLER REDEFINES ABL2RLGF.
             03 ABL2RLGA    PICTURE X.
           02  ABL2RLGI  PIC X(1).
           02  ABL2FMGL    COMP  PIC  S9(4).
           02  ABL2FMGF    PICTURE X.
           02  FILLER REDEFINES ABL2FMGF.
             03 ABL2FMGA    PICTURE X.
           02  ABL2FMGI  PIC X(1).
           02  ABL2SPGL    COMP  PIC  S9(4).
           02  ABL2SPGF    PICTURE X.
           02  FILLER REDEFINES ABL2SPGF.
             03 ABL2SPGA    PICTURE X.
           02  ABL2SPGI  PIC X(1).
           02  ABL2SLGL    COMP  PIC  S9(4).
           02  ABL2SLGF    PICTURE X.
           02  FILLER REDEFINES ABL2SLGF.
             03 ABL2SLGA    PICTURE X.
           02  ABL2SLGI  PIC X(19).
           02  ATH7GL    COMP  PIC  S9(4).
           02  ATH7GF    PICTURE X.
           02  FILLER REDEFINES ATH7GF.
             03 ATH7GA    PICTURE X.
           02  ATH7GI  PIC X(1).
           02  AUTH7GL    COMP  PIC  S9(4).
           02  AUTH7GF    PICTURE X.
           02  FILLER REDEFINES AUTH7GF.
             03 AUTH7GA    PICTURE X.
           02  AUTH7GI  PIC X(10).
           02  ATH8GL    COMP  PIC  S9(4).
           02  ATH8GF    PICTURE X.
           02  FILLER REDEFINES ATH8GF.
             03 ATH8GA    PICTURE X.
           02  ATH8GI  PIC X(1).
           02  AUTH8GL    COMP  PIC  S9(4).
           02  AUTH8GF    PICTURE X.
           02  FILLER REDEFINES AUTH8GF.
             03 AUTH8GA    PICTURE X.
           02  AUTH8GI  PIC X(10).
           02  ABL3RLGL    COMP  PIC  S9(4).
           02  ABL3RLGF    PICTURE X.
           02  FILLER REDEFINES ABL3RLGF.
             03 ABL3RLGA    PICTURE X.
           02  ABL3RLGI  PIC X(1).
           02  ABL3FMGL    COMP  PIC  S9(4).
           02  ABL3FMGF    PICTURE X.
           02  FILLER REDEFINES ABL3FMGF.
             03 ABL3FMGA    PICTURE X.
           02  ABL3FMGI  PIC X(1).
           02  ABL3SPGL    COMP  PIC  S9(4).
           02  ABL3SPGF    PICTURE X.
           02  FILLER REDEFINES ABL3SPGF.
             03 ABL3SPGA    PICTURE X.
           02  ABL3SPGI  PIC X(1).
           02  ABL3SLGL    COMP  PIC  S9(4).
           02  ABL3SLGF    PICTURE X.
           02  FILLER REDEFINES ABL3SLGF.
             03 ABL3SLGA    PICTURE X.
           02  ABL3SLGI  PIC X(19).
           02  ATH9GL    COMP  PIC  S9(4).
           02  ATH9GF    PICTURE X.
           02  FILLER REDEFINES ATH9GF.
             03 ATH9GA    PICTURE X.
           02  ATH9GI  PIC X(1).
           02  AUTH9GL    COMP  PIC  S9(4).
           02  AUTH9GF    PICTURE X.
           02  FILLER REDEFINES AUTH9GF.
             03 AUTH9GA    PICTURE X.
           02  AUTH9GI  PIC X(10).
           02  ATH10GL    COMP  PIC  S9(4).
           02  ATH10GF    PICTURE X.
           02  FILLER REDEFINES ATH10GF.
             03 ATH10GA    PICTURE X.
           02  ATH10GI  PIC X(2).
           02  AUTH10GL    COMP  PIC  S9(4).
           02  AUTH10GF    PICTURE X.
           02  FILLER REDEFINES AUTH10GF.
             03 AUTH10GA    PICTURE X.
           02  AUTH10GI  PIC X(10).
           02  ABL4RLGL    COMP  PIC  S9(4).
           02  ABL4RLGF    PICTURE X.
           02  FILLER REDEFINES ABL4RLGF.
             03 ABL4RLGA    PICTURE X.
           02  ABL4RLGI  PIC X(1).
           02  ABL4FMGL    COMP  PIC  S9(4).
           02  ABL4FMGF    PICTURE X.
           02  FILLER REDEFINES ABL4FMGF.
             03 ABL4FMGA    PICTURE X.
           02  ABL4FMGI  PIC X(1).
           02  ABL4SPGL    COMP  PIC  S9(4).
           02  ABL4SPGF    PICTURE X.
           02  FILLER REDEFINES ABL4SPGF.
             03 ABL4SPGA    PICTURE X.
           02  ABL4SPGI  PIC X(1).
           02  ABL4SLGL    COMP  PIC  S9(4).
           02  ABL4SLGF    PICTURE X.
           02  FILLER REDEFINES ABL4SLGF.
             03 ABL4SLGA    PICTURE X.
           02  ABL4SLGI  PIC X(19).
           02  ATH11GL    COMP  PIC  S9(4).
           02  ATH11GF    PICTURE X.
           02  FILLER REDEFINES ATH11GF.
             03 ATH11GA    PICTURE X.
           02  ATH11GI  PIC X(2).
           02  AUTH11GL    COMP  PIC  S9(4).
           02  AUTH11GF    PICTURE X.
           02  FILLER REDEFINES AUTH11GF.
             03 AUTH11GA    PICTURE X.
           02  AUTH11GI  PIC X(10).
           02  ATH12GL    COMP  PIC  S9(4).
           02  ATH12GF    PICTURE X.
           02  FILLER REDEFINES ATH12GF.
             03 ATH12GA    PICTURE X.
           02  ATH12GI  PIC X(2).
           02  AUTH12GL    COMP  PIC  S9(4).
           02  AUTH12GF    PICTURE X.
           02  FILLER REDEFINES AUTH12GF.
             03 AUTH12GA    PICTURE X.
           02  AUTH12GI  PIC X(10).
           02  AB19FMGL    COMP  PIC  S9(4).
           02  AB19FMGF    PICTURE X.
           02  FILLER REDEFINES AB19FMGF.
             03 AB19FMGA    PICTURE X.
           02  AB19FMGI  PIC X(1).
           02  AB19SPGL    COMP  PIC  S9(4).
           02  AB19SPGF    PICTURE X.
           02  FILLER REDEFINES AB19SPGF.
             03 AB19SPGA    PICTURE X.
           02  AB19SPGI  PIC X(1).
           02  AB19SLGL    COMP  PIC  S9(4).
           02  AB19SLGF    PICTURE X.
           02  FILLER REDEFINES AB19SLGF.
             03 AB19SLGA    PICTURE X.
           02  AB19SLGI  PIC X(19).
           02  ATH13GL    COMP  PIC  S9(4).
           02  ATH13GF    PICTURE X.
           02  FILLER REDEFINES ATH13GF.
             03 ATH13GA    PICTURE X.
           02  ATH13GI  PIC X(2).
           02  AUTH13GL    COMP  PIC  S9(4).
           02  AUTH13GF    PICTURE X.
           02  FILLER REDEFINES AUTH13GF.
             03 AUTH13GA    PICTURE X.
           02  AUTH13GI  PIC X(10).
           02  ATH14GL    COMP  PIC  S9(4).
           02  ATH14GF    PICTURE X.
           02  FILLER REDEFINES ATH14GF.
             03 ATH14GA    PICTURE X.
           02  ATH14GI  PIC X(2).
           02  AUTH14GL    COMP  PIC  S9(4).
           02  AUTH14GF    PICTURE X.
           02  FILLER REDEFINES AUTH14GF.
             03 AUTH14GA    PICTURE X.
           02  AUTH14GI  PIC X(10).
           02  ATH15GL    COMP  PIC  S9(4).
           02  ATH15GF    PICTURE X.
           02  FILLER REDEFINES ATH15GF.
             03 ATH15GA    PICTURE X.
           02  ATH15GI  PIC X(2).
           02  AUTH15GL    COMP  PIC  S9(4).
           02  AUTH15GF    PICTURE X.
           02  FILLER REDEFINES AUTH15GF.
             03 AUTH15GA    PICTURE X.
           02  AUTH15GI  PIC X(10).
           02  ATH16GL    COMP  PIC  S9(4).
           02  ATH16GF    PICTURE X.
           02  FILLER REDEFINES ATH16GF.
             03 ATH16GA    PICTURE X.
           02  ATH16GI  PIC X(2).
           02  AUTH16GL    COMP  PIC  S9(4).
           02  AUTH16GF    PICTURE X.
           02  FILLER REDEFINES AUTH16GF.
             03 AUTH16GA    PICTURE X.
           02  AUTH16GI  PIC X(10).
           02  ATH17GL    COMP  PIC  S9(4).
           02  ATH17GF    PICTURE X.
           02  FILLER REDEFINES ATH17GF.
             03 ATH17GA    PICTURE X.
           02  ATH17GI  PIC X(2).
           02  AUTH17GL    COMP  PIC  S9(4).
           02  AUTH17GF    PICTURE X.
           02  FILLER REDEFINES AUTH17GF.
             03 AUTH17GA    PICTURE X.
           02  AUTH17GI  PIC X(10).
           02  ATH18GL    COMP  PIC  S9(4).
           02  ATH18GF    PICTURE X.
           02  FILLER REDEFINES ATH18GF.
             03 ATH18GA    PICTURE X.
           02  ATH18GI  PIC X(2).
           02  AUTH18GL    COMP  PIC  S9(4).
           02  AUTH18GF    PICTURE X.
           02  FILLER REDEFINES AUTH18GF.
             03 AUTH18GA    PICTURE X.
           02  AUTH18GI  PIC X(10).
           02  ATH19GL    COMP  PIC  S9(4).
           02  ATH19GF    PICTURE X.
           02  FILLER REDEFINES ATH19GF.
             03 ATH19GA    PICTURE X.
           02  ATH19GI  PIC X(2).
           02  AUTH19GL    COMP  PIC  S9(4).
           02  AUTH19GF    PICTURE X.
           02  FILLER REDEFINES AUTH19GF.
             03 AUTH19GA    PICTURE X.
           02  AUTH19GI  PIC X(10).
           02  ATH20GL    COMP  PIC  S9(4).
           02  ATH20GF    PICTURE X.
           02  FILLER REDEFINES ATH20GF.
             03 ATH20GA    PICTURE X.
           02  ATH20GI  PIC X(2).
           02  AUTH20GL    COMP  PIC  S9(4).
           02  AUTH20GF    PICTURE X.
           02  FILLER REDEFINES AUTH20GF.
             03 AUTH20GA    PICTURE X.
           02  AUTH20GI  PIC X(10).
           02  ATH21GL    COMP  PIC  S9(4).
           02  ATH21GF    PICTURE X.
           02  FILLER REDEFINES ATH21GF.
             03 ATH21GA    PICTURE X.
           02  ATH21GI  PIC X(2).
           02  AUTH21GL    COMP  PIC  S9(4).
           02  AUTH21GF    PICTURE X.
           02  FILLER REDEFINES AUTH21GF.
             03 AUTH21GA    PICTURE X.
           02  AUTH21GI  PIC X(10).
           02  ATH22GL    COMP  PIC  S9(4).
           02  ATH22GF    PICTURE X.
           02  FILLER REDEFINES ATH22GF.
             03 ATH22GA    PICTURE X.
           02  ATH22GI  PIC X(2).
           02  AUTH22GL    COMP  PIC  S9(4).
           02  AUTH22GF    PICTURE X.
           02  FILLER REDEFINES AUTH22GF.
             03 AUTH22GA    PICTURE X.
           02  AUTH22GI  PIC X(10).
           02  ATH23GL    COMP  PIC  S9(4).
           02  ATH23GF    PICTURE X.
           02  FILLER REDEFINES ATH23GF.
             03 ATH23GA    PICTURE X.
           02  ATH23GI  PIC X(2).
           02  AUTH23GL    COMP  PIC  S9(4).
           02  AUTH23GF    PICTURE X.
           02  FILLER REDEFINES AUTH23GF.
             03 AUTH23GA    PICTURE X.
           02  AUTH23GI  PIC X(10).
           02  ATH24GL    COMP  PIC  S9(4).
           02  ATH24GF    PICTURE X.
           02  FILLER REDEFINES ATH24GF.
             03 ATH24GA    PICTURE X.
           02  ATH24GI  PIC X(2).
           02  AUTH24GL    COMP  PIC  S9(4).
           02  AUTH24GF    PICTURE X.
           02  FILLER REDEFINES AUTH24GF.
             03 AUTH24GA    PICTURE X.
           02  AUTH24GI  PIC X(10).
           02  ATH25GL    COMP  PIC  S9(4).
           02  ATH25GF    PICTURE X.
           02  FILLER REDEFINES ATH25GF.
             03 ATH25GA    PICTURE X.
           02  ATH25GI  PIC X(2).
           02  AUTH25GL    COMP  PIC  S9(4).
           02  AUTH25GF    PICTURE X.
           02  FILLER REDEFINES AUTH25GF.
             03 AUTH25GA    PICTURE X.
           02  AUTH25GI  PIC X(10).
           02  ATH26GL    COMP  PIC  S9(4).
           02  ATH26GF    PICTURE X.
           02  FILLER REDEFINES ATH26GF.
             03 ATH26GA    PICTURE X.
           02  ATH26GI  PIC X(2).
           02  AUTH26GL    COMP  PIC  S9(4).
           02  AUTH26GF    PICTURE X.
           02  FILLER REDEFINES AUTH26GF.
             03 AUTH26GA    PICTURE X.
           02  AUTH26GI  PIC X(10).
           02  ATH27GL    COMP  PIC  S9(4).
           02  ATH27GF    PICTURE X.
           02  FILLER REDEFINES ATH27GF.
             03 ATH27GA    PICTURE X.
           02  ATH27GI  PIC X(2).
           02  AUTH27GL    COMP  PIC  S9(4).
           02  AUTH27GF    PICTURE X.
           02  FILLER REDEFINES AUTH27GF.
             03 AUTH27GA    PICTURE X.
           02  AUTH27GI  PIC X(10).
           02  ATH28GL    COMP  PIC  S9(4).
           02  ATH28GF    PICTURE X.
           02  FILLER REDEFINES ATH28GF.
             03 ATH28GA    PICTURE X.
           02  ATH28GI  PIC X(2).
           02  AUTH28GL    COMP  PIC  S9(4).
           02  AUTH28GF    PICTURE X.
           02  FILLER REDEFINES AUTH28GF.
             03 AUTH28GA    PICTURE X.
           02  AUTH28GI  PIC X(10).
           02  ATH29GL    COMP  PIC  S9(4).
           02  ATH29GF    PICTURE X.
           02  FILLER REDEFINES ATH29GF.
             03 ATH29GA    PICTURE X.
           02  ATH29GI  PIC X(2).
           02  AUTH29GL    COMP  PIC  S9(4).
           02  AUTH29GF    PICTURE X.
           02  FILLER REDEFINES AUTH29GF.
             03 AUTH29GA    PICTURE X.
           02  AUTH29GI  PIC X(10).
           02  ATH30GL    COMP  PIC  S9(4).
           02  ATH30GF    PICTURE X.
           02  FILLER REDEFINES ATH30GF.
             03 ATH30GA    PICTURE X.
           02  ATH30GI  PIC X(2).
           02  AUTH30GL    COMP  PIC  S9(4).
           02  AUTH30GF    PICTURE X.
           02  FILLER REDEFINES AUTH30GF.
             03 AUTH30GA    PICTURE X.
           02  AUTH30GI  PIC X(10).
           02  ABPFGL    COMP  PIC  S9(4).
           02  ABPFGF    PICTURE X.
           02  FILLER REDEFINES ABPFGF.
             03 ABPFGA    PICTURE X.
           02  ABPFGI  PIC X(79).
           02  ABERRGL    COMP  PIC  S9(4).
           02  ABERRGF    PICTURE X.
           02  FILLER REDEFINES ABERRGF.
             03 ABERRGA    PICTURE X.
           02  ABERRGI  PIC X(79).
       01  FIABB1GO REDEFINES FIABB1GI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  ABTRIDGO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABDATEGO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ABACTGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABTIMEGO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ABCTL1GO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ABHEADGO  PIC X(27).
           02  FILLER PICTURE X(3).
           02  AB12FMGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AB12SPGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AB12SLGO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  ATH1GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AUTH1GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH2GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AUTH2GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  AB14FMGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AB14SPGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AB14SLGO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  ATH3GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AUTH3GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH4GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AUTH4GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ABL1FMGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL1SPGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL1SLGO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  ATH5GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AUTH5GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH6GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AUTH6GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ABL2RLGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL2FMGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL2SPGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL2SLGO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  ATH7GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AUTH7GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH8GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AUTH8GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ABL3RLGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL3FMGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL3SPGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL3SLGO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  ATH9GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AUTH9GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH10GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH10GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ABL4RLGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL4FMGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL4SPGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ABL4SLGO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  ATH11GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH11GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH12GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH12GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  AB19FMGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AB19SPGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  AB19SLGO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  ATH13GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH13GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH14GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH14GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH15GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH15GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH16GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH16GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH17GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH17GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH18GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH18GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH19GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH19GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH20GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH20GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH21GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH21GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH22GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH22GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH23GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH23GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH24GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH24GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH25GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH25GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH26GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH26GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH27GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH27GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH28GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH28GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH29GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH29GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ATH30GO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AUTH30GO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ABPFGO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  ABERRGO  PIC X(79).