       01  FIDACDAI.
           02  FILLER PIC X(12).
           02  DATRANL    COMP  PIC  S9(4).
           02  DATRANF    PICTURE X.
           02  FILLER REDEFINES DATRANF.
             03 DATRANA    PICTURE X.
           02  DATRANI  PIC X(4).
           02  DADATEL    COMP  PIC  S9(4).
           02  DADATEF    PICTURE X.
           02  FILLER REDEFINES DADATEF.
             03 DADATEA    PICTURE X.
           02  DADATEI  PIC X(8).
           02  DATIMEL    COMP  PIC  S9(4).
           02  DATIMEF    PICTURE X.
           02  FILLER REDEFINES DATIMEF.
             03 DATIMEA    PICTURE X.
           02  DATIMEI  PIC X(8).
           02  DAACTL    COMP  PIC  S9(4).
           02  DAACTF    PICTURE X.
           02  FILLER REDEFINES DAACTF.
             03 DAACTA    PICTURE X.
           02  DAACTI  PIC X(1).
           02  DATABL    COMP  PIC  S9(4).
           02  DATABF    PICTURE X.
           02  FILLER REDEFINES DATABF.
             03 DATABA    PICTURE X.
           02  DATABI  PIC X(8).
           02  DAENTL    COMP  PIC  S9(4).
           02  DAENTF    PICTURE X.
           02  FILLER REDEFINES DAENTF.
             03 DAENTA    PICTURE X.
           02  DAENTI  PIC X(5).
           02  DAITABL    COMP  PIC  S9(4).
           02  DAITABF    PICTURE X.
           02  FILLER REDEFINES DAITABF.
             03 DAITABA    PICTURE X.
           02  DAITABI  PIC X(8).
           02  DAISEQL    COMP  PIC  S9(4).
           02  DAISEQF    PICTURE X.
           02  FILLER REDEFINES DAISEQF.
             03 DAISEQA    PICTURE X.
           02  DAISEQI  PIC X(5).
           02  DAINAML    COMP  PIC  S9(4).
           02  DAINAMF    PICTURE X.
           02  FILLER REDEFINES DAINAMF.
             03 DAINAMA    PICTURE X.
           02  DAINAMI  PIC X(30).
           02  DAITYPL    COMP  PIC  S9(4).
           02  DAITYPF    PICTURE X.
           02  FILLER REDEFINES DAITYPF.
             03 DAITYPA    PICTURE X.
           02  DAITYPI  PIC X(1).
           02  DAIQUAL    COMP  PIC  S9(4).
           02  DAIQUAF    PICTURE X.
           02  FILLER REDEFINES DAIQUAF.
             03 DAIQUAA    PICTURE X.
           02  DAIQUAI  PIC X(1).
           02  DAISGNL    COMP  PIC  S9(4).
           02  DAISGNF    PICTURE X.
           02  FILLER REDEFINES DAISGNF.
             03 DAISGNA    PICTURE X.
           02  DAISGNI  PIC X(1).
           02  DAILENL    COMP  PIC  S9(4).
           02  DAILENF    PICTURE X.
           02  FILLER REDEFINES DAILENF.
             03 DAILENA    PICTURE X.
           02  DAILENI  PIC X(5).
           02  DAIDECL    COMP  PIC  S9(4).
           02  DAIDECF    PICTURE X.
           02  FILLER REDEFINES DAIDECF.
             03 DAIDECA    PICTURE X.
           02  DAIDECI  PIC X(3).
           02  DAIOCCL    COMP  PIC  S9(4).
           02  DAIOCCF    PICTURE X.
           02  FILLER REDEFINES DAIOCCF.
             03 DAIOCCA    PICTURE X.
           02  DAIOCCI  PIC X(5).
           02  DAIPOSL    COMP  PIC  S9(4).
           02  DAIPOSF    PICTURE X.
           02  FILLER REDEFINES DAIPOSF.
             03 DAIPOSA    PICTURE X.
           02  DAIPOSI  PIC X(5).
           02  DAISHTL    COMP  PIC  S9(4).
           02  DAISHTF    PICTURE X.
           02  FILLER REDEFINES DAISHTF.
             03 DAISHTA    PICTURE X.
           02  DAISHTI  PIC X(1).
           02  DAISHRL    COMP  PIC  S9(4).
           02  DAISHRF    PICTURE X.
           02  FILLER REDEFINES DAISHRF.
             03 DAISHRA    PICTURE X.
           02  DAISHRI  PIC X(8).
           02  DAONAML    COMP  PIC  S9(4).
           02  DAONAMF    PICTURE X.
           02  FILLER REDEFINES DAONAMF.
             03 DAONAMA    PICTURE X.
           02  DAONAMI  PIC X(30).
           02  DAOTYPL    COMP  PIC  S9(4).
           02  DAOTYPF    PICTURE X.
           02  FILLER REDEFINES DAOTYPF.
             03 DAOTYPA    PICTURE X.
           02  DAOTYPI  PIC X(1).
           02  DAOQUAL    COMP  PIC  S9(4).
           02  DAOQUAF    PICTURE X.
           02  FILLER REDEFINES DAOQUAF.
             03 DAOQUAA    PICTURE X.
           02  DAOQUAI  PIC X(1).
           02  DAOSGNL    COMP  PIC  S9(4).
           02  DAOSGNF    PICTURE X.
           02  FILLER REDEFINES DAOSGNF.
             03 DAOSGNA    PICTURE X.
           02  DAOSGNI  PIC X(1).
           02  DAOLENL    COMP  PIC  S9(4).
           02  DAOLENF    PICTURE X.
           02  FILLER REDEFINES DAOLENF.
             03 DAOLENA    PICTURE X.
           02  DAOLENI  PIC X(5).
           02  DAODECL    COMP  PIC  S9(4).
           02  DAODECF    PICTURE X.
           02  FILLER REDEFINES DAODECF.
             03 DAODECA    PICTURE X.
           02  DAODECI  PIC X(3).
           02  DAOOCCL    COMP  PIC  S9(4).
           02  DAOOCCF    PICTURE X.
           02  FILLER REDEFINES DAOOCCF.
             03 DAOOCCA    PICTURE X.
           02  DAOOCCI  PIC X(5).
           02  DAOPOSL    COMP  PIC  S9(4).
           02  DAOPOSF    PICTURE X.
           02  FILLER REDEFINES DAOPOSF.
             03 DAOPOSA    PICTURE X.
           02  DAOPOSI  PIC X(5).
           02  DAOSHTL    COMP  PIC  S9(4).
           02  DAOSHTF    PICTURE X.
           02  FILLER REDEFINES DAOSHTF.
             03 DAOSHTA    PICTURE X.
           02  DAOSHTI  PIC X(1).
           02  DAOSHRL    COMP  PIC  S9(4).
           02  DAOSHRF    PICTURE X.
           02  FILLER REDEFINES DAOSHRF.
             03 DAOSHRA    PICTURE X.
           02  DAOSHRI  PIC X(8).
           02  DAOOPTL    COMP  PIC  S9(4).
           02  DAOOPTF    PICTURE X.
           02  FILLER REDEFINES DAOOPTF.
             03 DAOOPTA    PICTURE X.
           02  DAOOPTI  PIC X(1).
           02  DAOOEDL    COMP  PIC  S9(4).
           02  DAOOEDF    PICTURE X.
           02  FILLER REDEFINES DAOOEDF.
             03 DAOOEDA    PICTURE X.
           02  DAOOEDI  PIC X(2).
           02  DAUPDTL    COMP  PIC  S9(4).
           02  DAUPDTF    PICTURE X.
           02  FILLER REDEFINES DAUPDTF.
             03 DAUPDTA    PICTURE X.
           02  DAUPDTI  PIC X(8).
           02  DAUPTML    COMP  PIC  S9(4).
           02  DAUPTMF    PICTURE X.
           02  FILLER REDEFINES DAUPTMF.
             03 DAUPTMA    PICTURE X.
           02  DAUPTMI  PIC X(8).
           02  DAERRORL    COMP  PIC  S9(4).
           02  DAERRORF    PICTURE X.
           02  FILLER REDEFINES DAERRORF.
             03 DAERRORA    PICTURE X.
           02  DAERRORI  PIC X(79).
       01  FIDACDAO REDEFINES FIDACDAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DATRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DADATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DATIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAACTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DATABO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAENTO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  DAITABO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAISEQO PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAINAMO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  DAITYPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIQUAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAISGNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAILENO PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAIDECO PIC 999.
           02  FILLER PICTURE X(3).
           02  DAIOCCO PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAIPOSO PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISHTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAISHRO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAONAMO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  DAOTYPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAOQUAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAOSGNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAOLENO PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAODECO PIC 999.
           02  FILLER PICTURE X(3).
           02  DAOOCCO PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOPOSO PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSHTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAOSHRO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOOPTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAOOEDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DAUPDTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAUPTMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAERRORO  PIC X(79).