       01  FIDACHAI.
           02  FILLER PIC X(12).
           02  DATRANL    COMP  PIC  S9(4).
           02  DATRANF    PICTURE X.
           02  FILLER REDEFINES DATRANF.
             03 DATRANA    PICTURE X.
           02  DATRANI  PIC X(4).
           02  DADATEL    COMP  PIC  S9(4).
           02  DADATEF    PICTURE X.
           02  FILLER REDEFINES DADATEF.
             03 DADATEA    PICTURE X.
           02  DADATEI  PIC X(8).
           02  DATIMEL    COMP  PIC  S9(4).
           02  DATIMEF    PICTURE X.
           02  FILLER REDEFINES DATIMEF.
             03 DATIMEA    PICTURE X.
           02  DATIMEI  PIC X(8).
           02  DATABL    COMP  PIC  S9(4).
           02  DATABF    PICTURE X.
           02  FILLER REDEFINES DATABF.
             03 DATABA    PICTURE X.
           02  DATABI  PIC X(8).
           02  DAACTL    COMP  PIC  S9(4).
           02  DAACTF    PICTURE X.
           02  FILLER REDEFINES DAACTF.
             03 DAACTA    PICTURE X.
           02  DAACTI  PIC X(1).
           02  DAITABL    COMP  PIC  S9(4).
           02  DAITABF    PICTURE X.
           02  FILLER REDEFINES DAITABF.
             03 DAITABA    PICTURE X.
           02  DAITABI  PIC X(8).
           02  DAILENL    COMP  PIC  S9(4).
           02  DAILENF    PICTURE X.
           02  FILLER REDEFINES DAILENF.
             03 DAILENA    PICTURE X.
           02  DAILENI  PIC X(5).
           02  DAIRTNL    COMP  PIC  S9(4).
           02  DAIRTNF    PICTURE X.
           02  FILLER REDEFINES DAIRTNF.
             03 DAIRTNA    PICTURE X.
           02  DAIRTNI  PIC X(8).
           02  DAILIML    COMP  PIC  S9(4).
           02  DAILIMF    PICTURE X.
           02  FILLER REDEFINES DAILIMF.
             03 DAILIMA    PICTURE X.
           02  DAILIMI  PIC X(7).
           02  DAIEDTL    COMP  PIC  S9(4).
           02  DAIEDTF    PICTURE X.
           02  FILLER REDEFINES DAIEDTF.
             03 DAIEDTA    PICTURE X.
           02  DAIEDTI  PIC X(8).
           02  DAOTABL    COMP  PIC  S9(4).
           02  DAOTABF    PICTURE X.
           02  FILLER REDEFINES DAOTABF.
             03 DAOTABA    PICTURE X.
           02  DAOTABI  PIC X(8).
           02  DAOLENL    COMP  PIC  S9(4).
           02  DAOLENF    PICTURE X.
           02  FILLER REDEFINES DAOLENF.
             03 DAOLENA    PICTURE X.
           02  DAOLENI  PIC X(5).
           02  DAORTNL    COMP  PIC  S9(4).
           02  DAORTNF    PICTURE X.
           02  FILLER REDEFINES DAORTNF.
             03 DAORTNA    PICTURE X.
           02  DAORTNI  PIC X(8).
           02  DAOLIML    COMP  PIC  S9(4).
           02  DAOLIMF    PICTURE X.
           02  FILLER REDEFINES DAOLIMF.
             03 DAOLIMA    PICTURE X.
           02  DAOLIMI  PIC X(7).
           02  DAOEDTL    COMP  PIC  S9(4).
           02  DAOEDTF    PICTURE X.
           02  FILLER REDEFINES DAOEDTF.
             03 DAOEDTA    PICTURE X.
           02  DAOEDTI  PIC X(8).
           02  DACEDTL    COMP  PIC  S9(4).
           02  DACEDTF    PICTURE X.
           02  FILLER REDEFINES DACEDTF.
             03 DACEDTA    PICTURE X.
           02  DACEDTI  PIC X(8).
           02  DACRTNL    COMP  PIC  S9(4).
           02  DACRTNF    PICTURE X.
           02  FILLER REDEFINES DACRTNF.
             03 DACRTNA    PICTURE X.
           02  DACRTNI  PIC X(8).
           02  DATEMPL    COMP  PIC  S9(4).
           02  DATEMPF    PICTURE X.
           02  FILLER REDEFINES DATEMPF.
             03 DATEMPA    PICTURE X.
           02  DATEMPI  PIC X(1).
           02  DAUPDTL    COMP  PIC  S9(4).
           02  DAUPDTF    PICTURE X.
           02  FILLER REDEFINES DAUPDTF.
             03 DAUPDTA    PICTURE X.
           02  DAUPDTI  PIC X(8).
           02  DAUPTML    COMP  PIC  S9(4).
           02  DAUPTMF    PICTURE X.
           02  FILLER REDEFINES DAUPTMF.
             03 DAUPTMA    PICTURE X.
           02  DAUPTMI  PIC X(8).
           02  DAERRORL    COMP  PIC  S9(4).
           02  DAERRORF    PICTURE X.
           02  FILLER REDEFINES DAERRORF.
             03 DAERRORA    PICTURE X.
           02  DAERRORI  PIC X(79).
       01  FIDACHAO REDEFINES FIDACHAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DATRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DADATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DATIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DATABO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAACTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAITABO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAILENO PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAIRTNO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAILIMO PIC 9999999.
           02  FILLER PICTURE X(3).
           02  DAIEDTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOTABO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOLENO PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAORTNO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOLIMO PIC 9999999.
           02  FILLER PICTURE X(3).
           02  DAOEDTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DACEDTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DACRTNO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DATEMPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAUPDTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAUPTMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAERRORO  PIC X(79).