       01  FIDACMAI.
           02  FILLER PIC X(12).
           02  DATRANL    COMP  PIC  S9(4).
           02  DATRANF    PICTURE X.
           02  FILLER REDEFINES DATRANF.
             03 DATRANA    PICTURE X.
           02  DATRANI  PIC X(4).
           02  DADATEL    COMP  PIC  S9(4).
           02  DADATEF    PICTURE X.
           02  FILLER REDEFINES DADATEF.
             03 DADATEA    PICTURE X.
           02  DADATEI  PIC X(8).
           02  DATIMEL    COMP  PIC  S9(4).
           02  DATIMEF    PICTURE X.
           02  FILLER REDEFINES DATIMEF.
             03 DATIMEA    PICTURE X.
           02  DATIMEI  PIC X(8).
           02  DAITABL    COMP  PIC  S9(4).
           02  DAITABF    PICTURE X.
           02  FILLER REDEFINES DAITABF.
             03 DAITABA    PICTURE X.
           02  DAITABI  PIC X(8).
           02  DAOTABL    COMP  PIC  S9(4).
           02  DAOTABF    PICTURE X.
           02  FILLER REDEFINES DAOTABF.
             03 DAOTABA    PICTURE X.
           02  DAOTABI  PIC X(8).
           02  DAISEQ1L    COMP  PIC  S9(4).
           02  DAISEQ1F    PICTURE X.
           02  FILLER REDEFINES DAISEQ1F.
             03 DAISEQ1A    PICTURE X.
           02  DAISEQ1I  PIC X(5).
           02  DAISPL1L    COMP  PIC  S9(4).
           02  DAISPL1F    PICTURE X.
           02  FILLER REDEFINES DAISPL1F.
             03 DAISPL1A    PICTURE X.
           02  DAISPL1I  PIC X(1).
           02  DAIRTN1L    COMP  PIC  S9(4).
           02  DAIRTN1F    PICTURE X.
           02  FILLER REDEFINES DAIRTN1F.
             03 DAIRTN1A    PICTURE X.
           02  DAIRTN1I  PIC X(8).
           02  DAIMSG1L    COMP  PIC  S9(4).
           02  DAIMSG1F    PICTURE X.
           02  FILLER REDEFINES DAIMSG1F.
             03 DAIMSG1A    PICTURE X.
           02  DAIMSG1I  PIC X(7).
           02  DAOSEQ1L    COMP  PIC  S9(4).
           02  DAOSEQ1F    PICTURE X.
           02  FILLER REDEFINES DAOSEQ1F.
             03 DAOSEQ1A    PICTURE X.
           02  DAOSEQ1I  PIC X(5).
           02  DAOSPL1L    COMP  PIC  S9(4).
           02  DAOSPL1F    PICTURE X.
           02  FILLER REDEFINES DAOSPL1F.
             03 DAOSPL1A    PICTURE X.
           02  DAOSPL1I  PIC X(1).
           02  DAORTN1L    COMP  PIC  S9(4).
           02  DAORTN1F    PICTURE X.
           02  FILLER REDEFINES DAORTN1F.
             03 DAORTN1A    PICTURE X.
           02  DAORTN1I  PIC X(8).
           02  DAOMSG1L    COMP  PIC  S9(4).
           02  DAOMSG1F    PICTURE X.
           02  FILLER REDEFINES DAOMSG1F.
             03 DAOMSG1A    PICTURE X.
           02  DAOMSG1I  PIC X(7).
           02  DAISEQ2L    COMP  PIC  S9(4).
           02  DAISEQ2F    PICTURE X.
           02  FILLER REDEFINES DAISEQ2F.
             03 DAISEQ2A    PICTURE X.
           02  DAISEQ2I  PIC X(5).
           02  DAISPL2L    COMP  PIC  S9(4).
           02  DAISPL2F    PICTURE X.
           02  FILLER REDEFINES DAISPL2F.
             03 DAISPL2A    PICTURE X.
           02  DAISPL2I  PIC X(1).
           02  DAIRTN2L    COMP  PIC  S9(4).
           02  DAIRTN2F    PICTURE X.
           02  FILLER REDEFINES DAIRTN2F.
             03 DAIRTN2A    PICTURE X.
           02  DAIRTN2I  PIC X(8).
           02  DAIMSG2L    COMP  PIC  S9(4).
           02  DAIMSG2F    PICTURE X.
           02  FILLER REDEFINES DAIMSG2F.
             03 DAIMSG2A    PICTURE X.
           02  DAIMSG2I  PIC X(7).
           02  DAOSEQ2L    COMP  PIC  S9(4).
           02  DAOSEQ2F    PICTURE X.
           02  FILLER REDEFINES DAOSEQ2F.
             03 DAOSEQ2A    PICTURE X.
           02  DAOSEQ2I  PIC X(5).
           02  DAOSPL2L    COMP  PIC  S9(4).
           02  DAOSPL2F    PICTURE X.
           02  FILLER REDEFINES DAOSPL2F.
             03 DAOSPL2A    PICTURE X.
           02  DAOSPL2I  PIC X(1).
           02  DAORTN2L    COMP  PIC  S9(4).
           02  DAORTN2F    PICTURE X.
           02  FILLER REDEFINES DAORTN2F.
             03 DAORTN2A    PICTURE X.
           02  DAORTN2I  PIC X(8).
           02  DAOMSG2L    COMP  PIC  S9(4).
           02  DAOMSG2F    PICTURE X.
           02  FILLER REDEFINES DAOMSG2F.
             03 DAOMSG2A    PICTURE X.
           02  DAOMSG2I  PIC X(7).
           02  DAISEQ3L    COMP  PIC  S9(4).
           02  DAISEQ3F    PICTURE X.
           02  FILLER REDEFINES DAISEQ3F.
             03 DAISEQ3A    PICTURE X.
           02  DAISEQ3I  PIC X(5).
           02  DAISPL3L    COMP  PIC  S9(4).
           02  DAISPL3F    PICTURE X.
           02  FILLER REDEFINES DAISPL3F.
             03 DAISPL3A    PICTURE X.
           02  DAISPL3I  PIC X(1).
           02  DAIRTN3L    COMP  PIC  S9(4).
           02  DAIRTN3F    PICTURE X.
           02  FILLER REDEFINES DAIRTN3F.
             03 DAIRTN3A    PICTURE X.
           02  DAIRTN3I  PIC X(8).
           02  DAIMSG3L    COMP  PIC  S9(4).
           02  DAIMSG3F    PICTURE X.
           02  FILLER REDEFINES DAIMSG3F.
             03 DAIMSG3A    PICTURE X.
           02  DAIMSG3I  PIC X(7).
           02  DAOSEQ3L    COMP  PIC  S9(4).
           02  DAOSEQ3F    PICTURE X.
           02  FILLER REDEFINES DAOSEQ3F.
             03 DAOSEQ3A    PICTURE X.
           02  DAOSEQ3I  PIC X(5).
           02  DAOSPL3L    COMP  PIC  S9(4).
           02  DAOSPL3F    PICTURE X.
           02  FILLER REDEFINES DAOSPL3F.
             03 DAOSPL3A    PICTURE X.
           02  DAOSPL3I  PIC X(1).
           02  DAORTN3L    COMP  PIC  S9(4).
           02  DAORTN3F    PICTURE X.
           02  FILLER REDEFINES DAORTN3F.
             03 DAORTN3A    PICTURE X.
           02  DAORTN3I  PIC X(8).
           02  DAOMSG3L    COMP  PIC  S9(4).
           02  DAOMSG3F    PICTURE X.
           02  FILLER REDEFINES DAOMSG3F.
             03 DAOMSG3A    PICTURE X.
           02  DAOMSG3I  PIC X(7).
           02  DAISEQ4L    COMP  PIC  S9(4).
           02  DAISEQ4F    PICTURE X.
           02  FILLER REDEFINES DAISEQ4F.
             03 DAISEQ4A    PICTURE X.
           02  DAISEQ4I  PIC X(5).
           02  DAISPL4L    COMP  PIC  S9(4).
           02  DAISPL4F    PICTURE X.
           02  FILLER REDEFINES DAISPL4F.
             03 DAISPL4A    PICTURE X.
           02  DAISPL4I  PIC X(1).
           02  DAIRTN4L    COMP  PIC  S9(4).
           02  DAIRTN4F    PICTURE X.
           02  FILLER REDEFINES DAIRTN4F.
             03 DAIRTN4A    PICTURE X.
           02  DAIRTN4I  PIC X(8).
           02  DAIMSG4L    COMP  PIC  S9(4).
           02  DAIMSG4F    PICTURE X.
           02  FILLER REDEFINES DAIMSG4F.
             03 DAIMSG4A    PICTURE X.
           02  DAIMSG4I  PIC X(7).
           02  DAOSEQ4L    COMP  PIC  S9(4).
           02  DAOSEQ4F    PICTURE X.
           02  FILLER REDEFINES DAOSEQ4F.
             03 DAOSEQ4A    PICTURE X.
           02  DAOSEQ4I  PIC X(5).
           02  DAOSPL4L    COMP  PIC  S9(4).
           02  DAOSPL4F    PICTURE X.
           02  FILLER REDEFINES DAOSPL4F.
             03 DAOSPL4A    PICTURE X.
           02  DAOSPL4I  PIC X(1).
           02  DAORTN4L    COMP  PIC  S9(4).
           02  DAORTN4F    PICTURE X.
           02  FILLER REDEFINES DAORTN4F.
             03 DAORTN4A    PICTURE X.
           02  DAORTN4I  PIC X(8).
           02  DAOMSG4L    COMP  PIC  S9(4).
           02  DAOMSG4F    PICTURE X.
           02  FILLER REDEFINES DAOMSG4F.
             03 DAOMSG4A    PICTURE X.
           02  DAOMSG4I  PIC X(7).
           02  DAISEQ5L    COMP  PIC  S9(4).
           02  DAISEQ5F    PICTURE X.
           02  FILLER REDEFINES DAISEQ5F.
             03 DAISEQ5A    PICTURE X.
           02  DAISEQ5I  PIC X(5).
           02  DAISPL5L    COMP  PIC  S9(4).
           02  DAISPL5F    PICTURE X.
           02  FILLER REDEFINES DAISPL5F.
             03 DAISPL5A    PICTURE X.
           02  DAISPL5I  PIC X(1).
           02  DAIRTN5L    COMP  PIC  S9(4).
           02  DAIRTN5F    PICTURE X.
           02  FILLER REDEFINES DAIRTN5F.
             03 DAIRTN5A    PICTURE X.
           02  DAIRTN5I  PIC X(8).
           02  DAIMSG5L    COMP  PIC  S9(4).
           02  DAIMSG5F    PICTURE X.
           02  FILLER REDEFINES DAIMSG5F.
             03 DAIMSG5A    PICTURE X.
           02  DAIMSG5I  PIC X(7).
           02  DAOSEQ5L    COMP  PIC  S9(4).
           02  DAOSEQ5F    PICTURE X.
           02  FILLER REDEFINES DAOSEQ5F.
             03 DAOSEQ5A    PICTURE X.
           02  DAOSEQ5I  PIC X(5).
           02  DAOSPL5L    COMP  PIC  S9(4).
           02  DAOSPL5F    PICTURE X.
           02  FILLER REDEFINES DAOSPL5F.
             03 DAOSPL5A    PICTURE X.
           02  DAOSPL5I  PIC X(1).
           02  DAORTN5L    COMP  PIC  S9(4).
           02  DAORTN5F    PICTURE X.
           02  FILLER REDEFINES DAORTN5F.
             03 DAORTN5A    PICTURE X.
           02  DAORTN5I  PIC X(8).
           02  DAOMSG5L    COMP  PIC  S9(4).
           02  DAOMSG5F    PICTURE X.
           02  FILLER REDEFINES DAOMSG5F.
             03 DAOMSG5A    PICTURE X.
           02  DAOMSG5I  PIC X(7).
           02  DAISEQ6L    COMP  PIC  S9(4).
           02  DAISEQ6F    PICTURE X.
           02  FILLER REDEFINES DAISEQ6F.
             03 DAISEQ6A    PICTURE X.
           02  DAISEQ6I  PIC X(5).
           02  DAISPL6L    COMP  PIC  S9(4).
           02  DAISPL6F    PICTURE X.
           02  FILLER REDEFINES DAISPL6F.
             03 DAISPL6A    PICTURE X.
           02  DAISPL6I  PIC X(1).
           02  DAIRTN6L    COMP  PIC  S9(4).
           02  DAIRTN6F    PICTURE X.
           02  FILLER REDEFINES DAIRTN6F.
             03 DAIRTN6A    PICTURE X.
           02  DAIRTN6I  PIC X(8).
           02  DAIMSG6L    COMP  PIC  S9(4).
           02  DAIMSG6F    PICTURE X.
           02  FILLER REDEFINES DAIMSG6F.
             03 DAIMSG6A    PICTURE X.
           02  DAIMSG6I  PIC X(7).
           02  DAOSEQ6L    COMP  PIC  S9(4).
           02  DAOSEQ6F    PICTURE X.
           02  FILLER REDEFINES DAOSEQ6F.
             03 DAOSEQ6A    PICTURE X.
           02  DAOSEQ6I  PIC X(5).
           02  DAOSPL6L    COMP  PIC  S9(4).
           02  DAOSPL6F    PICTURE X.
           02  FILLER REDEFINES DAOSPL6F.
             03 DAOSPL6A    PICTURE X.
           02  DAOSPL6I  PIC X(1).
           02  DAORTN6L    COMP  PIC  S9(4).
           02  DAORTN6F    PICTURE X.
           02  FILLER REDEFINES DAORTN6F.
             03 DAORTN6A    PICTURE X.
           02  DAORTN6I  PIC X(8).
           02  DAOMSG6L    COMP  PIC  S9(4).
           02  DAOMSG6F    PICTURE X.
           02  FILLER REDEFINES DAOMSG6F.
             03 DAOMSG6A    PICTURE X.
           02  DAOMSG6I  PIC X(7).
           02  DAISEQ7L    COMP  PIC  S9(4).
           02  DAISEQ7F    PICTURE X.
           02  FILLER REDEFINES DAISEQ7F.
             03 DAISEQ7A    PICTURE X.
           02  DAISEQ7I  PIC X(5).
           02  DAISPL7L    COMP  PIC  S9(4).
           02  DAISPL7F    PICTURE X.
           02  FILLER REDEFINES DAISPL7F.
             03 DAISPL7A    PICTURE X.
           02  DAISPL7I  PIC X(1).
           02  DAIRTN7L    COMP  PIC  S9(4).
           02  DAIRTN7F    PICTURE X.
           02  FILLER REDEFINES DAIRTN7F.
             03 DAIRTN7A    PICTURE X.
           02  DAIRTN7I  PIC X(8).
           02  DAIMSG7L    COMP  PIC  S9(4).
           02  DAIMSG7F    PICTURE X.
           02  FILLER REDEFINES DAIMSG7F.
             03 DAIMSG7A    PICTURE X.
           02  DAIMSG7I  PIC X(7).
           02  DAOSEQ7L    COMP  PIC  S9(4).
           02  DAOSEQ7F    PICTURE X.
           02  FILLER REDEFINES DAOSEQ7F.
             03 DAOSEQ7A    PICTURE X.
           02  DAOSEQ7I  PIC X(5).
           02  DAOSPL7L    COMP  PIC  S9(4).
           02  DAOSPL7F    PICTURE X.
           02  FILLER REDEFINES DAOSPL7F.
             03 DAOSPL7A    PICTURE X.
           02  DAOSPL7I  PIC X(1).
           02  DAORTN7L    COMP  PIC  S9(4).
           02  DAORTN7F    PICTURE X.
           02  FILLER REDEFINES DAORTN7F.
             03 DAORTN7A    PICTURE X.
           02  DAORTN7I  PIC X(8).
           02  DAOMSG7L    COMP  PIC  S9(4).
           02  DAOMSG7F    PICTURE X.
           02  FILLER REDEFINES DAOMSG7F.
             03 DAOMSG7A    PICTURE X.
           02  DAOMSG7I  PIC X(7).
           02  DAISEQ8L    COMP  PIC  S9(4).
           02  DAISEQ8F    PICTURE X.
           02  FILLER REDEFINES DAISEQ8F.
             03 DAISEQ8A    PICTURE X.
           02  DAISEQ8I  PIC X(5).
           02  DAISPL8L    COMP  PIC  S9(4).
           02  DAISPL8F    PICTURE X.
           02  FILLER REDEFINES DAISPL8F.
             03 DAISPL8A    PICTURE X.
           02  DAISPL8I  PIC X(1).
           02  DAIRTN8L    COMP  PIC  S9(4).
           02  DAIRTN8F    PICTURE X.
           02  FILLER REDEFINES DAIRTN8F.
             03 DAIRTN8A    PICTURE X.
           02  DAIRTN8I  PIC X(8).
           02  DAIMSG8L    COMP  PIC  S9(4).
           02  DAIMSG8F    PICTURE X.
           02  FILLER REDEFINES DAIMSG8F.
             03 DAIMSG8A    PICTURE X.
           02  DAIMSG8I  PIC X(7).
           02  DAOSEQ8L    COMP  PIC  S9(4).
           02  DAOSEQ8F    PICTURE X.
           02  FILLER REDEFINES DAOSEQ8F.
             03 DAOSEQ8A    PICTURE X.
           02  DAOSEQ8I  PIC X(5).
           02  DAOSPL8L    COMP  PIC  S9(4).
           02  DAOSPL8F    PICTURE X.
           02  FILLER REDEFINES DAOSPL8F.
             03 DAOSPL8A    PICTURE X.
           02  DAOSPL8I  PIC X(1).
           02  DAORTN8L    COMP  PIC  S9(4).
           02  DAORTN8F    PICTURE X.
           02  FILLER REDEFINES DAORTN8F.
             03 DAORTN8A    PICTURE X.
           02  DAORTN8I  PIC X(8).
           02  DAOMSG8L    COMP  PIC  S9(4).
           02  DAOMSG8F    PICTURE X.
           02  FILLER REDEFINES DAOMSG8F.
             03 DAOMSG8A    PICTURE X.
           02  DAOMSG8I  PIC X(7).
           02  DAISEQ9L    COMP  PIC  S9(4).
           02  DAISEQ9F    PICTURE X.
           02  FILLER REDEFINES DAISEQ9F.
             03 DAISEQ9A    PICTURE X.
           02  DAISEQ9I  PIC X(5).
           02  DAISPL9L    COMP  PIC  S9(4).
           02  DAISPL9F    PICTURE X.
           02  FILLER REDEFINES DAISPL9F.
             03 DAISPL9A    PICTURE X.
           02  DAISPL9I  PIC X(1).
           02  DAIRTN9L    COMP  PIC  S9(4).
           02  DAIRTN9F    PICTURE X.
           02  FILLER REDEFINES DAIRTN9F.
             03 DAIRTN9A    PICTURE X.
           02  DAIRTN9I  PIC X(8).
           02  DAIMSG9L    COMP  PIC  S9(4).
           02  DAIMSG9F    PICTURE X.
           02  FILLER REDEFINES DAIMSG9F.
             03 DAIMSG9A    PICTURE X.
           02  DAIMSG9I  PIC X(7).
           02  DAOSEQ9L    COMP  PIC  S9(4).
           02  DAOSEQ9F    PICTURE X.
           02  FILLER REDEFINES DAOSEQ9F.
             03 DAOSEQ9A    PICTURE X.
           02  DAOSEQ9I  PIC X(5).
           02  DAOSPL9L    COMP  PIC  S9(4).
           02  DAOSPL9F    PICTURE X.
           02  FILLER REDEFINES DAOSPL9F.
             03 DAOSPL9A    PICTURE X.
           02  DAOSPL9I  PIC X(1).
           02  DAORTN9L    COMP  PIC  S9(4).
           02  DAORTN9F    PICTURE X.
           02  FILLER REDEFINES DAORTN9F.
             03 DAORTN9A    PICTURE X.
           02  DAORTN9I  PIC X(8).
           02  DAOMSG9L    COMP  PIC  S9(4).
           02  DAOMSG9F    PICTURE X.
           02  FILLER REDEFINES DAOMSG9F.
             03 DAOMSG9A    PICTURE X.
           02  DAOMSG9I  PIC X(7).
           02  DAISE10L    COMP  PIC  S9(4).
           02  DAISE10F    PICTURE X.
           02  FILLER REDEFINES DAISE10F.
             03 DAISE10A    PICTURE X.
           02  DAISE10I  PIC X(5).
           02  DAISP10L    COMP  PIC  S9(4).
           02  DAISP10F    PICTURE X.
           02  FILLER REDEFINES DAISP10F.
             03 DAISP10A    PICTURE X.
           02  DAISP10I  PIC X(1).
           02  DAIRT10L    COMP  PIC  S9(4).
           02  DAIRT10F    PICTURE X.
           02  FILLER REDEFINES DAIRT10F.
             03 DAIRT10A    PICTURE X.
           02  DAIRT10I  PIC X(8).
           02  DAIMS10L    COMP  PIC  S9(4).
           02  DAIMS10F    PICTURE X.
           02  FILLER REDEFINES DAIMS10F.
             03 DAIMS10A    PICTURE X.
           02  DAIMS10I  PIC X(7).
           02  DAOSQ10L    COMP  PIC  S9(4).
           02  DAOSQ10F    PICTURE X.
           02  FILLER REDEFINES DAOSQ10F.
             03 DAOSQ10A    PICTURE X.
           02  DAOSQ10I  PIC X(5).
           02  DAOSP10L    COMP  PIC  S9(4).
           02  DAOSP10F    PICTURE X.
           02  FILLER REDEFINES DAOSP10F.
             03 DAOSP10A    PICTURE X.
           02  DAOSP10I  PIC X(1).
           02  DAORT10L    COMP  PIC  S9(4).
           02  DAORT10F    PICTURE X.
           02  FILLER REDEFINES DAORT10F.
             03 DAORT10A    PICTURE X.
           02  DAORT10I  PIC X(8).
           02  DAOMS10L    COMP  PIC  S9(4).
           02  DAOMS10F    PICTURE X.
           02  FILLER REDEFINES DAOMS10F.
             03 DAOMS10A    PICTURE X.
           02  DAOMS10I  PIC X(7).
           02  DAISQ11L    COMP  PIC  S9(4).
           02  DAISQ11F    PICTURE X.
           02  FILLER REDEFINES DAISQ11F.
             03 DAISQ11A    PICTURE X.
           02  DAISQ11I  PIC X(5).
           02  DAISP11L    COMP  PIC  S9(4).
           02  DAISP11F    PICTURE X.
           02  FILLER REDEFINES DAISP11F.
             03 DAISP11A    PICTURE X.
           02  DAISP11I  PIC X(1).
           02  DAIRT11L    COMP  PIC  S9(4).
           02  DAIRT11F    PICTURE X.
           02  FILLER REDEFINES DAIRT11F.
             03 DAIRT11A    PICTURE X.
           02  DAIRT11I  PIC X(8).
           02  DAIMS11L    COMP  PIC  S9(4).
           02  DAIMS11F    PICTURE X.
           02  FILLER REDEFINES DAIMS11F.
             03 DAIMS11A    PICTURE X.
           02  DAIMS11I  PIC X(7).
           02  DAOSE11L    COMP  PIC  S9(4).
           02  DAOSE11F    PICTURE X.
           02  FILLER REDEFINES DAOSE11F.
             03 DAOSE11A    PICTURE X.
           02  DAOSE11I  PIC X(5).
           02  DAOSP11L    COMP  PIC  S9(4).
           02  DAOSP11F    PICTURE X.
           02  FILLER REDEFINES DAOSP11F.
             03 DAOSP11A    PICTURE X.
           02  DAOSP11I  PIC X(1).
           02  DAORT11L    COMP  PIC  S9(4).
           02  DAORT11F    PICTURE X.
           02  FILLER REDEFINES DAORT11F.
             03 DAORT11A    PICTURE X.
           02  DAORT11I  PIC X(8).
           02  DAOMS11L    COMP  PIC  S9(4).
           02  DAOMS11F    PICTURE X.
           02  FILLER REDEFINES DAOMS11F.
             03 DAOMS11A    PICTURE X.
           02  DAOMS11I  PIC X(7).
           02  DAISE12L    COMP  PIC  S9(4).
           02  DAISE12F    PICTURE X.
           02  FILLER REDEFINES DAISE12F.
             03 DAISE12A    PICTURE X.
           02  DAISE12I  PIC X(5).
           02  DAISP12L    COMP  PIC  S9(4).
           02  DAISP12F    PICTURE X.
           02  FILLER REDEFINES DAISP12F.
             03 DAISP12A    PICTURE X.
           02  DAISP12I  PIC X(1).
           02  DAIRT12L    COMP  PIC  S9(4).
           02  DAIRT12F    PICTURE X.
           02  FILLER REDEFINES DAIRT12F.
             03 DAIRT12A    PICTURE X.
           02  DAIRT12I  PIC X(8).
           02  DAIMS12L    COMP  PIC  S9(4).
           02  DAIMS12F    PICTURE X.
           02  FILLER REDEFINES DAIMS12F.
             03 DAIMS12A    PICTURE X.
           02  DAIMS12I  PIC X(7).
           02  DAOSE12L    COMP  PIC  S9(4).
           02  DAOSE12F    PICTURE X.
           02  FILLER REDEFINES DAOSE12F.
             03 DAOSE12A    PICTURE X.
           02  DAOSE12I  PIC X(5).
           02  DAOSP12L    COMP  PIC  S9(4).
           02  DAOSP12F    PICTURE X.
           02  FILLER REDEFINES DAOSP12F.
             03 DAOSP12A    PICTURE X.
           02  DAOSP12I  PIC X(1).
           02  DAORT12L    COMP  PIC  S9(4).
           02  DAORT12F    PICTURE X.
           02  FILLER REDEFINES DAORT12F.
             03 DAORT12A    PICTURE X.
           02  DAORT12I  PIC X(8).
           02  DAOMS12L    COMP  PIC  S9(4).
           02  DAOMS12F    PICTURE X.
           02  FILLER REDEFINES DAOMS12F.
             03 DAOMS12A    PICTURE X.
           02  DAOMS12I  PIC X(7).
           02  DAISE13L    COMP  PIC  S9(4).
           02  DAISE13F    PICTURE X.
           02  FILLER REDEFINES DAISE13F.
             03 DAISE13A    PICTURE X.
           02  DAISE13I  PIC X(5).
           02  DAISP13L    COMP  PIC  S9(4).
           02  DAISP13F    PICTURE X.
           02  FILLER REDEFINES DAISP13F.
             03 DAISP13A    PICTURE X.
           02  DAISP13I  PIC X(1).
           02  DAIRT13L    COMP  PIC  S9(4).
           02  DAIRT13F    PICTURE X.
           02  FILLER REDEFINES DAIRT13F.
             03 DAIRT13A    PICTURE X.
           02  DAIRT13I  PIC X(8).
           02  DAIMS13L    COMP  PIC  S9(4).
           02  DAIMS13F    PICTURE X.
           02  FILLER REDEFINES DAIMS13F.
             03 DAIMS13A    PICTURE X.
           02  DAIMS13I  PIC X(7).
           02  DAOSE13L    COMP  PIC  S9(4).
           02  DAOSE13F    PICTURE X.
           02  FILLER REDEFINES DAOSE13F.
             03 DAOSE13A    PICTURE X.
           02  DAOSE13I  PIC X(5).
           02  DAOSP13L    COMP  PIC  S9(4).
           02  DAOSP13F    PICTURE X.
           02  FILLER REDEFINES DAOSP13F.
             03 DAOSP13A    PICTURE X.
           02  DAOSP13I  PIC X(1).
           02  DAORT13L    COMP  PIC  S9(4).
           02  DAORT13F    PICTURE X.
           02  FILLER REDEFINES DAORT13F.
             03 DAORT13A    PICTURE X.
           02  DAORT13I  PIC X(8).
           02  DAOMS13L    COMP  PIC  S9(4).
           02  DAOMS13F    PICTURE X.
           02  FILLER REDEFINES DAOMS13F.
             03 DAOMS13A    PICTURE X.
           02  DAOMS13I  PIC X(7).
           02  DAISE14L    COMP  PIC  S9(4).
           02  DAISE14F    PICTURE X.
           02  FILLER REDEFINES DAISE14F.
             03 DAISE14A    PICTURE X.
           02  DAISE14I  PIC X(5).
           02  DAISP14L    COMP  PIC  S9(4).
           02  DAISP14F    PICTURE X.
           02  FILLER REDEFINES DAISP14F.
             03 DAISP14A    PICTURE X.
           02  DAISP14I  PIC X(1).
           02  DAIRT14L    COMP  PIC  S9(4).
           02  DAIRT14F    PICTURE X.
           02  FILLER REDEFINES DAIRT14F.
             03 DAIRT14A    PICTURE X.
           02  DAIRT14I  PIC X(8).
           02  DAIMS14L    COMP  PIC  S9(4).
           02  DAIMS14F    PICTURE X.
           02  FILLER REDEFINES DAIMS14F.
             03 DAIMS14A    PICTURE X.
           02  DAIMS14I  PIC X(7).
           02  DAOSE14L    COMP  PIC  S9(4).
           02  DAOSE14F    PICTURE X.
           02  FILLER REDEFINES DAOSE14F.
             03 DAOSE14A    PICTURE X.
           02  DAOSE14I  PIC X(5).
           02  DAOSP14L    COMP  PIC  S9(4).
           02  DAOSP14F    PICTURE X.
           02  FILLER REDEFINES DAOSP14F.
             03 DAOSP14A    PICTURE X.
           02  DAOSP14I  PIC X(1).
           02  DAORT14L    COMP  PIC  S9(4).
           02  DAORT14F    PICTURE X.
           02  FILLER REDEFINES DAORT14F.
             03 DAORT14A    PICTURE X.
           02  DAORT14I  PIC X(8).
           02  DAOMS14L    COMP  PIC  S9(4).
           02  DAOMS14F    PICTURE X.
           02  FILLER REDEFINES DAOMS14F.
             03 DAOMS14A    PICTURE X.
           02  DAOMS14I  PIC X(7).
           02  DAISE15L    COMP  PIC  S9(4).
           02  DAISE15F    PICTURE X.
           02  FILLER REDEFINES DAISE15F.
             03 DAISE15A    PICTURE X.
           02  DAISE15I  PIC X(5).
           02  DAISP15L    COMP  PIC  S9(4).
           02  DAISP15F    PICTURE X.
           02  FILLER REDEFINES DAISP15F.
             03 DAISP15A    PICTURE X.
           02  DAISP15I  PIC X(1).
           02  DAIRT15L    COMP  PIC  S9(4).
           02  DAIRT15F    PICTURE X.
           02  FILLER REDEFINES DAIRT15F.
             03 DAIRT15A    PICTURE X.
           02  DAIRT15I  PIC X(8).
           02  DAIMS15L    COMP  PIC  S9(4).
           02  DAIMS15F    PICTURE X.
           02  FILLER REDEFINES DAIMS15F.
             03 DAIMS15A    PICTURE X.
           02  DAIMS15I  PIC X(7).
           02  DAOSE15L    COMP  PIC  S9(4).
           02  DAOSE15F    PICTURE X.
           02  FILLER REDEFINES DAOSE15F.
             03 DAOSE15A    PICTURE X.
           02  DAOSE15I  PIC X(5).
           02  DAOSP15L    COMP  PIC  S9(4).
           02  DAOSP15F    PICTURE X.
           02  FILLER REDEFINES DAOSP15F.
             03 DAOSP15A    PICTURE X.
           02  DAOSP15I  PIC X(1).
           02  DAORT15L    COMP  PIC  S9(4).
           02  DAORT15F    PICTURE X.
           02  FILLER REDEFINES DAORT15F.
             03 DAORT15A    PICTURE X.
           02  DAORT15I  PIC X(8).
           02  DAOMS15L    COMP  PIC  S9(4).
           02  DAOMS15F    PICTURE X.
           02  FILLER REDEFINES DAOMS15F.
             03 DAOMS15A    PICTURE X.
           02  DAOMS15I  PIC X(7).
           02  DAERRORL    COMP  PIC  S9(4).
           02  DAERRORF    PICTURE X.
           02  FILLER REDEFINES DAERRORF.
             03 DAERRORA    PICTURE X.
           02  DAERRORI  PIC X(79).
       01  FIDACMAO REDEFINES FIDACMAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DATRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DADATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DATIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAITABO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOTABO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAISEQ1O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISPL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRTN1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMSG1O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSEQ1O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSPL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORTN1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMSG1O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISEQ2O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISPL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRTN2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMSG2O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSEQ2O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSPL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORTN2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMSG2O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISEQ3O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISPL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRTN3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMSG3O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSEQ3O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSPL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORTN3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMSG3O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISEQ4O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISPL4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRTN4O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMSG4O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSEQ4O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSPL4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORTN4O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMSG4O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISEQ5O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISPL5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRTN5O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMSG5O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSEQ5O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSPL5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORTN5O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMSG5O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISEQ6O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISPL6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRTN6O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMSG6O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSEQ6O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSPL6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORTN6O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMSG6O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISEQ7O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISPL7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRTN7O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMSG7O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSEQ7O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSPL7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORTN7O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMSG7O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISEQ8O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISPL8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRTN8O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMSG8O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSEQ8O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSPL8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORTN8O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMSG8O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISEQ9O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISPL9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRTN9O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMSG9O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSEQ9O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSPL9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORTN9O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMSG9O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISE10O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISP10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRT10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMS10O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSQ10O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSP10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORT10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMS10O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISQ11O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISP11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRT11O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMS11O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSE11O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSP11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORT11O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMS11O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISE12O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISP12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRT12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMS12O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSE12O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSP12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORT12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMS12O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISE13O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISP13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRT13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMS13O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSE13O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSP13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORT13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMS13O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISE14O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISP14O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRT14O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMS14O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSE14O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSP14O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORT14O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMS14O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAISE15O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAISP15O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAIRT15O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAIMS15O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAOSE15O PIC 99999.
           02  FILLER PICTURE X(3).
           02  DAOSP15O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DAORT15O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DAOMS15O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DAERRORO  PIC X(79).