       01  FIDI2CAI.
           02  FILLER PIC X(12).
           02  DITRANL    COMP  PIC  S9(4).
           02  DITRANF    PICTURE X.
           02  FILLER REDEFINES DITRANF.
             03 DITRANA    PICTURE X.
           02  DITRANI  PIC X(4).
           02  DIDATEL    COMP  PIC  S9(4).
           02  DIDATEF    PICTURE X.
           02  FILLER REDEFINES DIDATEF.
             03 DIDATEA    PICTURE X.
           02  DIDATEI  PIC X(8).
           02  DITIMEL    COMP  PIC  S9(4).
           02  DITIMEF    PICTURE X.
           02  FILLER REDEFINES DITIMEF.
             03 DITIMEA    PICTURE X.
           02  DITIMEI  PIC X(8).
           02  DICTL2L    COMP  PIC  S9(4).
           02  DICTL2F    PICTURE X.
           02  FILLER REDEFINES DICTL2F.
             03 DICTL2A    PICTURE X.
           02  DICTL2I  PIC X(3).
           02  DICTL3L    COMP  PIC  S9(4).
           02  DICTL3F    PICTURE X.
           02  FILLER REDEFINES DICTL3F.
             03 DICTL3A    PICTURE X.
           02  DICTL3I  PIC X(3).
           02  DIDEALL    COMP  PIC  S9(4).
           02  DIDEALF    PICTURE X.
           02  FILLER REDEFINES DIDEALF.
             03 DIDEALA    PICTURE X.
           02  DIDEALI  PIC X(7).
           02  DILINEL    COMP  PIC  S9(4).
           02  DILINEF    PICTURE X.
           02  FILLER REDEFINES DILINEF.
             03 DILINEA    PICTURE X.
           02  DILINEI  PIC X(2).
           02  DICLASSL    COMP  PIC  S9(4).
           02  DICLASSF    PICTURE X.
           02  FILLER REDEFINES DICLASSF.
             03 DICLASSA    PICTURE X.
           02  DICLASSI  PIC X(1).
           02  DIRECPTL    COMP  PIC  S9(4).
           02  DIRECPTF    PICTURE X.
           02  FILLER REDEFINES DIRECPTF.
             03 DIRECPTA    PICTURE X.
           02  DIRECPTI  PIC X(5).
           02  DIITEML    COMP  PIC  S9(4).
           02  DIITEMF    PICTURE X.
           02  FILLER REDEFINES DIITEMF.
             03 DIITEMA    PICTURE X.
           02  DIITEMI  PIC X(2).
           02  DICKDIGL    COMP  PIC  S9(4).
           02  DICKDIGF    PICTURE X.
           02  FILLER REDEFINES DICKDIGF.
             03 DICKDIGA    PICTURE X.
           02  DICKDIGI  PIC X(1).
           02  DIPOSTL    COMP  PIC  S9(4).
           02  DIPOSTF    PICTURE X.
           02  FILLER REDEFINES DIPOSTF.
             03 DIPOSTA    PICTURE X.
           02  DIPOSTI  PIC X(1).
           02  DIOFFICL    COMP  PIC  S9(4).
           02  DIOFFICF    PICTURE X.
           02  FILLER REDEFINES DIOFFICF.
             03 DIOFFICA    PICTURE X.
           02  DIOFFICI  PIC X(3).
           02  DITDATEL    COMP  PIC  S9(4).
           02  DITDATEF    PICTURE X.
           02  FILLER REDEFINES DITDATEF.
             03 DITDATEA    PICTURE X.
           02  DITDATEI  PIC X(6).
           02  DIRATEL    COMP  PIC  S9(4).
           02  DIRATEF    PICTURE X.
           02  FILLER REDEFINES DIRATEF.
             03 DIRATEA    PICTURE X.
           02  DIRATEI  PIC X(10).
           02  DIBACKL    COMP  PIC  S9(4).
           02  DIBACKF    PICTURE X.
           02  FILLER REDEFINES DIBACKF.
             03 DIBACKA    PICTURE X.
           02  DIBACKI  PIC X(1).
           02  DIPUSEL    COMP  PIC  S9(4).
           02  DIPUSEF    PICTURE X.
           02  FILLER REDEFINES DIPUSEF.
             03 DIPUSEA    PICTURE X.
           02  DIPUSEI  PIC X(1).
           02  DIIDX1L    COMP  PIC  S9(4).
           02  DIIDX1F    PICTURE X.
           02  FILLER REDEFINES DIIDX1F.
             03 DIIDX1A    PICTURE X.
           02  DIIDX1I  PIC X(2).
           02  DIIDX2L    COMP  PIC  S9(4).
           02  DIIDX2F    PICTURE X.
           02  FILLER REDEFINES DIIDX2F.
             03 DIIDX2A    PICTURE X.
           02  DIIDX2I  PIC X(2).
           02  DIIDX3L    COMP  PIC  S9(4).
           02  DIIDX3F    PICTURE X.
           02  FILLER REDEFINES DIIDX3F.
             03 DIIDX3A    PICTURE X.
           02  DIIDX3I  PIC X(2).
           02  DIADJT1L    COMP  PIC  S9(4).
           02  DIADJT1F    PICTURE X.
           02  FILLER REDEFINES DIADJT1F.
             03 DIADJT1A    PICTURE X.
           02  DIADJT1I  PIC X(1).
           02  DIADJP1L    COMP  PIC  S9(4).
           02  DIADJP1F    PICTURE X.
           02  FILLER REDEFINES DIADJP1F.
             03 DIADJP1A    PICTURE X.
           02  DIADJP1I  PIC X(10).
           02  DIPRVCDL    COMP  PIC  S9(4).
           02  DIPRVCDF    PICTURE X.
           02  FILLER REDEFINES DIPRVCDF.
             03 DIPRVCDA    PICTURE X.
           02  DIPRVCDI  PIC X(1).
           02  DIADJT2L    COMP  PIC  S9(4).
           02  DIADJT2F    PICTURE X.
           02  FILLER REDEFINES DIADJT2F.
             03 DIADJT2A    PICTURE X.
           02  DIADJT2I  PIC X(1).
           02  DIADJP2L    COMP  PIC  S9(4).
           02  DIADJP2F    PICTURE X.
           02  FILLER REDEFINES DIADJP2F.
             03 DIADJP2A    PICTURE X.
           02  DIADJP2I  PIC X(10).
           02  DIPTIERL    COMP  PIC  S9(4).
           02  DIPTIERF    PICTURE X.
           02  FILLER REDEFINES DIPTIERF.
             03 DIPTIERA    PICTURE X.
           02  DIPTIERI  PIC X(1).
           02  DITIECDL    COMP  PIC  S9(4).
           02  DITIECDF    PICTURE X.
           02  FILLER REDEFINES DITIECDF.
             03 DITIECDA    PICTURE X.
           02  DITIECDI  PIC X(1).
           02  DITIEDAL    COMP  PIC  S9(4).
           02  DITIEDAF    PICTURE X.
           02  FILLER REDEFINES DITIEDAF.
             03 DITIEDAA    PICTURE X.
           02  DITIEDAI  PIC X(3).
           02  DITIEDTL    COMP  PIC  S9(4).
           02  DITIEDTF    PICTURE X.
           02  FILLER REDEFINES DITIEDTF.
             03 DITIEDTA    PICTURE X.
           02  DITIEDTI  PIC X(6).
           02  DITIEFRL    COMP  PIC  S9(4).
           02  DITIEFRF    PICTURE X.
           02  FILLER REDEFINES DITIEFRF.
             03 DITIEFRA    PICTURE X.
           02  DITIEFRI  PIC X(1).
           02  DIBUSDAL    COMP  PIC  S9(4).
           02  DIBUSDAF    PICTURE X.
           02  FILLER REDEFINES DIBUSDAF.
             03 DIBUSDAA    PICTURE X.
           02  DIBUSDAI  PIC X(1).
           02  DIPNRTEL    COMP  PIC  S9(4).
           02  DIPNRTEF    PICTURE X.
           02  FILLER REDEFINES DIPNRTEF.
             03 DIPNRTEA    PICTURE X.
           02  DIPNRTEI  PIC X(10).
           02  DIPNSTAL    COMP  PIC  S9(4).
           02  DIPNSTAF    PICTURE X.
           02  FILLER REDEFINES DIPNSTAF.
             03 DIPNSTAA    PICTURE X.
           02  DIPNSTAI  PIC X(1).
           02  DIFCUSEL    COMP  PIC  S9(4).
           02  DIFCUSEF    PICTURE X.
           02  FILLER REDEFINES DIFCUSEF.
             03 DIFCUSEA    PICTURE X.
           02  DIFCUSEI  PIC X(1).
           02  DIFLRTEL    COMP  PIC  S9(4).
           02  DIFLRTEF    PICTURE X.
           02  FILLER REDEFINES DIFLRTEF.
             03 DIFLRTEA    PICTURE X.
           02  DIFLRTEI  PIC X(10).
           02  DICLRTEL    COMP  PIC  S9(4).
           02  DICLRTEF    PICTURE X.
           02  FILLER REDEFINES DICLRTEF.
             03 DICLRTEA    PICTURE X.
           02  DICLRTEI  PIC X(10).
           02  DIABML    COMP  PIC  S9(4).
           02  DIABMF    PICTURE X.
           02  FILLER REDEFINES DIABMF.
             03 DIABMA    PICTURE X.
           02  DIABMI  PIC X(1).
           02  DIABYL    COMP  PIC  S9(4).
           02  DIABYF    PICTURE X.
           02  FILLER REDEFINES DIABYF.
             03 DIABYA    PICTURE X.
           02  DIABYI  PIC X(1).
           02  DIAMETHL    COMP  PIC  S9(4).
           02  DIAMETHF    PICTURE X.
           02  FILLER REDEFINES DIAMETHF.
             03 DIAMETHA    PICTURE X.
           02  DIAMETHI  PIC X(2).
           02  DIOAPRL    COMP  PIC  S9(4).
           02  DIOAPRF    PICTURE X.
           02  FILLER REDEFINES DIOAPRF.
             03 DIOAPRA    PICTURE X.
           02  DIOAPRI  PIC X(10).
           02  DIERRORL    COMP  PIC  S9(4).
           02  DIERRORF    PICTURE X.
           02  FILLER REDEFINES DIERRORF.
             03 DIERRORA    PICTURE X.
           02  DIERRORI  PIC X(79).
       01  FIDI2CAO REDEFINES FIDI2CAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DITRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DIDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DITIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DICTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIDEALO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DILINEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICLASSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIRECPTO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  DIITEMO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICKDIGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIPOSTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIOFFICO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DITDATEO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIRATEO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DIBACKO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIPUSEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIIDX1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIIDX2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIIDX3O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIADJT1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIADJP1O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  DIPRVCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIADJT2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIADJP2O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  DIPTIERO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DITIECDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DITIEDAO PIC ZZ9.
           02  FILLER PICTURE X(3).
           02  DITIEDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DITIEFRO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIBUSDAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIPNRTEO PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  DIPNSTAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIFCUSEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIFLRTEO PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  DICLRTEO PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  DIABMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIABYO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIAMETHO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIOAPRO PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  DIERRORO  PIC X(79).