       01  FIDI24AI.
           02  FILLER PIC X(12).
           02  CLTRANL    COMP  PIC  S9(4).
           02  CLTRANF    PICTURE X.
           02  FILLER REDEFINES CLTRANF.
             03 CLTRANA    PICTURE X.
           02  CLTRANI  PIC X(4).
           02  CLDATEL    COMP  PIC  S9(4).
           02  CLDATEF    PICTURE X.
           02  FILLER REDEFINES CLDATEF.
             03 CLDATEA    PICTURE X.
           02  CLDATEI  PIC X(8).
           02  CLTIMEL    COMP  PIC  S9(4).
           02  CLTIMEF    PICTURE X.
           02  FILLER REDEFINES CLTIMEF.
             03 CLTIMEA    PICTURE X.
           02  CLTIMEI  PIC X(8).
           02  DICTL2L    COMP  PIC  S9(4).
           02  DICTL2F    PICTURE X.
           02  FILLER REDEFINES DICTL2F.
             03 DICTL2A    PICTURE X.
           02  DICTL2I  PIC X(3).
           02  DICTL3L    COMP  PIC  S9(4).
           02  DICTL3F    PICTURE X.
           02  FILLER REDEFINES DICTL3F.
             03 DICTL3A    PICTURE X.
           02  DICTL3I  PIC X(3).
           02  DIDEALRL    COMP  PIC  S9(4).
           02  DIDEALRF    PICTURE X.
           02  FILLER REDEFINES DIDEALRF.
             03 DIDEALRA    PICTURE X.
           02  DIDEALRI  PIC X(7).
           02  DILINEL    COMP  PIC  S9(4).
           02  DILINEF    PICTURE X.
           02  FILLER REDEFINES DILINEF.
             03 DILINEA    PICTURE X.
           02  DILINEI  PIC X(2).
           02  DICLASSL    COMP  PIC  S9(4).
           02  DICLASSF    PICTURE X.
           02  FILLER REDEFINES DICLASSF.
             03 DICLASSA    PICTURE X.
           02  DICLASSI  PIC X(1).
           02  DIRECPTL    COMP  PIC  S9(4).
           02  DIRECPTF    PICTURE X.
           02  FILLER REDEFINES DIRECPTF.
             03 DIRECPTA    PICTURE X.
           02  DIRECPTI  PIC X(5).
           02  DIITEML    COMP  PIC  S9(4).
           02  DIITEMF    PICTURE X.
           02  FILLER REDEFINES DIITEMF.
             03 DIITEMA    PICTURE X.
           02  DIITEMI  PIC X(2).
           02  DIDIGITL    COMP  PIC  S9(4).
           02  DIDIGITF    PICTURE X.
           02  FILLER REDEFINES DIDIGITF.
             03 DIDIGITA    PICTURE X.
           02  DIDIGITI  PIC X(1).
           02  CLOFFL    COMP  PIC  S9(4).
           02  CLOFFF    PICTURE X.
           02  FILLER REDEFINES CLOFFF.
             03 CLOFFA    PICTURE X.
           02  CLOFFI  PIC X(3).
           02  CLMDTEL    COMP  PIC  S9(4).
           02  CLMDTEF    PICTURE X.
           02  FILLER REDEFINES CLMDTEF.
             03 CLMDTEA    PICTURE X.
           02  CLMDTEI  PIC X(6).
           02  CLFLAG1L    COMP  PIC  S9(4).
           02  CLFLAG1F    PICTURE X.
           02  FILLER REDEFINES CLFLAG1F.
             03 CLFLAG1A    PICTURE X.
           02  CLFLAG1I  PIC X(1).
           02  CLTYPE1L    COMP  PIC  S9(4).
           02  CLTYPE1F    PICTURE X.
           02  FILLER REDEFINES CLTYPE1F.
             03 CLTYPE1A    PICTURE X.
           02  CLTYPE1I  PIC X(1).
           02  CLFREQ1L    COMP  PIC  S9(4).
           02  CLFREQ1F    PICTURE X.
           02  FILLER REDEFINES CLFREQ1F.
             03 CLFREQ1A    PICTURE X.
           02  CLFREQ1I  PIC X(1).
           02  CLINCR1L    COMP  PIC  S9(4).
           02  CLINCR1F    PICTURE X.
           02  FILLER REDEFINES CLINCR1F.
             03 CLINCR1A    PICTURE X.
           02  CLINCR1I  PIC X(3).
           02  CLDATE1L    COMP  PIC  S9(4).
           02  CLDATE1F    PICTURE X.
           02  FILLER REDEFINES CLDATE1F.
             03 CLDATE1A    PICTURE X.
           02  CLDATE1I  PIC X(6).
           02  CLAMT1L    COMP  PIC  S9(4).
           02  CLAMT1F    PICTURE X.
           02  FILLER REDEFINES CLAMT1F.
             03 CLAMT1A    PICTURE X.
           02  CLAMT1I  PIC X(16).
           02  CLNO1L    COMP  PIC  S9(4).
           02  CLNO1F    PICTURE X.
           02  FILLER REDEFINES CLNO1F.
             03 CLNO1A    PICTURE X.
           02  CLNO1I  PIC X(3).
           02  CLTYPE2L    COMP  PIC  S9(4).
           02  CLTYPE2F    PICTURE X.
           02  FILLER REDEFINES CLTYPE2F.
             03 CLTYPE2A    PICTURE X.
           02  CLTYPE2I  PIC X(1).
           02  CLFREQ2L    COMP  PIC  S9(4).
           02  CLFREQ2F    PICTURE X.
           02  FILLER REDEFINES CLFREQ2F.
             03 CLFREQ2A    PICTURE X.
           02  CLFREQ2I  PIC X(1).
           02  CLINCR2L    COMP  PIC  S9(4).
           02  CLINCR2F    PICTURE X.
           02  FILLER REDEFINES CLINCR2F.
             03 CLINCR2A    PICTURE X.
           02  CLINCR2I  PIC X(3).
           02  CLDATE2L    COMP  PIC  S9(4).
           02  CLDATE2F    PICTURE X.
           02  FILLER REDEFINES CLDATE2F.
             03 CLDATE2A    PICTURE X.
           02  CLDATE2I  PIC X(6).
           02  CLAMT2L    COMP  PIC  S9(4).
           02  CLAMT2F    PICTURE X.
           02  FILLER REDEFINES CLAMT2F.
             03 CLAMT2A    PICTURE X.
           02  CLAMT2I  PIC X(16).
           02  CLNO2L    COMP  PIC  S9(4).
           02  CLNO2F    PICTURE X.
           02  FILLER REDEFINES CLNO2F.
             03 CLNO2A    PICTURE X.
           02  CLNO2I  PIC X(3).
           02  CLTYPE3L    COMP  PIC  S9(4).
           02  CLTYPE3F    PICTURE X.
           02  FILLER REDEFINES CLTYPE3F.
             03 CLTYPE3A    PICTURE X.
           02  CLTYPE3I  PIC X(1).
           02  CLFREQ3L    COMP  PIC  S9(4).
           02  CLFREQ3F    PICTURE X.
           02  FILLER REDEFINES CLFREQ3F.
             03 CLFREQ3A    PICTURE X.
           02  CLFREQ3I  PIC X(1).
           02  CLINCR3L    COMP  PIC  S9(4).
           02  CLINCR3F    PICTURE X.
           02  FILLER REDEFINES CLINCR3F.
             03 CLINCR3A    PICTURE X.
           02  CLINCR3I  PIC X(3).
           02  CLDATE3L    COMP  PIC  S9(4).
           02  CLDATE3F    PICTURE X.
           02  FILLER REDEFINES CLDATE3F.
             03 CLDATE3A    PICTURE X.
           02  CLDATE3I  PIC X(6).
           02  CLAMT3L    COMP  PIC  S9(4).
           02  CLAMT3F    PICTURE X.
           02  FILLER REDEFINES CLAMT3F.
             03 CLAMT3A    PICTURE X.
           02  CLAMT3I  PIC X(16).
           02  CLNO3L    COMP  PIC  S9(4).
           02  CLNO3F    PICTURE X.
           02  FILLER REDEFINES CLNO3F.
             03 CLNO3A    PICTURE X.
           02  CLNO3I  PIC X(3).
           02  CLTYPE4L    COMP  PIC  S9(4).
           02  CLTYPE4F    PICTURE X.
           02  FILLER REDEFINES CLTYPE4F.
             03 CLTYPE4A    PICTURE X.
           02  CLTYPE4I  PIC X(1).
           02  CLFREQ4L    COMP  PIC  S9(4).
           02  CLFREQ4F    PICTURE X.
           02  FILLER REDEFINES CLFREQ4F.
             03 CLFREQ4A    PICTURE X.
           02  CLFREQ4I  PIC X(1).
           02  CLINCR4L    COMP  PIC  S9(4).
           02  CLINCR4F    PICTURE X.
           02  FILLER REDEFINES CLINCR4F.
             03 CLINCR4A    PICTURE X.
           02  CLINCR4I  PIC X(3).
           02  CLDATE4L    COMP  PIC  S9(4).
           02  CLDATE4F    PICTURE X.
           02  FILLER REDEFINES CLDATE4F.
             03 CLDATE4A    PICTURE X.
           02  CLDATE4I  PIC X(6).
           02  CLAMT4L    COMP  PIC  S9(4).
           02  CLAMT4F    PICTURE X.
           02  FILLER REDEFINES CLAMT4F.
             03 CLAMT4A    PICTURE X.
           02  CLAMT4I  PIC X(16).
           02  CLNO4L    COMP  PIC  S9(4).
           02  CLNO4F    PICTURE X.
           02  FILLER REDEFINES CLNO4F.
             03 CLNO4A    PICTURE X.
           02  CLNO4I  PIC X(3).
           02  CLTYPE5L    COMP  PIC  S9(4).
           02  CLTYPE5F    PICTURE X.
           02  FILLER REDEFINES CLTYPE5F.
             03 CLTYPE5A    PICTURE X.
           02  CLTYPE5I  PIC X(1).
           02  CLFREQ5L    COMP  PIC  S9(4).
           02  CLFREQ5F    PICTURE X.
           02  FILLER REDEFINES CLFREQ5F.
             03 CLFREQ5A    PICTURE X.
           02  CLFREQ5I  PIC X(1).
           02  CLINCR5L    COMP  PIC  S9(4).
           02  CLINCR5F    PICTURE X.
           02  FILLER REDEFINES CLINCR5F.
             03 CLINCR5A    PICTURE X.
           02  CLINCR5I  PIC X(3).
           02  CLDATE5L    COMP  PIC  S9(4).
           02  CLDATE5F    PICTURE X.
           02  FILLER REDEFINES CLDATE5F.
             03 CLDATE5A    PICTURE X.
           02  CLDATE5I  PIC X(6).
           02  CLAMT5L    COMP  PIC  S9(4).
           02  CLAMT5F    PICTURE X.
           02  FILLER REDEFINES CLAMT5F.
             03 CLAMT5A    PICTURE X.
           02  CLAMT5I  PIC X(16).
           02  CLNO5L    COMP  PIC  S9(4).
           02  CLNO5F    PICTURE X.
           02  FILLER REDEFINES CLNO5F.
             03 CLNO5A    PICTURE X.
           02  CLNO5I  PIC X(3).
           02  CLERRORL    COMP  PIC  S9(4).
           02  CLERRORF    PICTURE X.
           02  FILLER REDEFINES CLERRORF.
             03 CLERRORA    PICTURE X.
           02  CLERRORI  PIC X(79).
       01  FIDI24AO REDEFINES FIDI24AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  CLTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  CLDATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  CLTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DICTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIDEALRO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DILINEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICLASSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIRECPTO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  DIITEMO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIDIGITO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLOFFO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLMDTEO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  CLFLAG1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLTYPE1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLFREQ1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLINCR1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLDATE1O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  CLAMT1O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CLNO1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLTYPE2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLFREQ2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLINCR2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLDATE2O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  CLAMT2O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CLNO2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLTYPE3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLFREQ3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLINCR3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLDATE3O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  CLAMT3O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CLNO3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLTYPE4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLFREQ4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLINCR4O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLDATE4O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  CLAMT4O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CLNO4O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLTYPE5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLFREQ5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CLINCR5O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLDATE5O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  CLAMT5O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CLNO5O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CLERRORO  PIC X(79).