       01  FIDI01CI.
           02  FILLER PIC X(12).
           02  DITRANBL    COMP  PIC  S9(4).
           02  DITRANBF    PICTURE X.
           02  FILLER REDEFINES DITRANBF.
             03 DITRANBA    PICTURE X.
           02  DITRANBI  PIC X(4).
           02  DIDATEBL    COMP  PIC  S9(4).
           02  DIDATEBF    PICTURE X.
           02  FILLER REDEFINES DIDATEBF.
             03 DIDATEBA    PICTURE X.
           02  DIDATEBI  PIC X(8).
           02  DITIMEBL    COMP  PIC  S9(4).
           02  DITIMEBF    PICTURE X.
           02  FILLER REDEFINES DITIMEBF.
             03 DITIMEBA    PICTURE X.
           02  DITIMEBI  PIC X(8).
           02  DICTL2BL    COMP  PIC  S9(4).
           02  DICTL2BF    PICTURE X.
           02  FILLER REDEFINES DICTL2BF.
             03 DICTL2BA    PICTURE X.
           02  DICTL2BI  PIC X(3).
           02  DICTL3BL    COMP  PIC  S9(4).
           02  DICTL3BF    PICTURE X.
           02  FILLER REDEFINES DICTL3BF.
             03 DICTL3BA    PICTURE X.
           02  DICTL3BI  PIC X(3).
           02  DIDEALBL    COMP  PIC  S9(4).
           02  DIDEALBF    PICTURE X.
           02  FILLER REDEFINES DIDEALBF.
             03 DIDEALBA    PICTURE X.
           02  DIDEALBI  PIC X(7).
           02  DILINEBL    COMP  PIC  S9(4).
           02  DILINEBF    PICTURE X.
           02  FILLER REDEFINES DILINEBF.
             03 DILINEBA    PICTURE X.
           02  DILINEBI  PIC X(2).
           02  DICLASBL    COMP  PIC  S9(4).
           02  DICLASBF    PICTURE X.
           02  FILLER REDEFINES DICLASBF.
             03 DICLASBA    PICTURE X.
           02  DICLASBI  PIC X(1).
           02  DIRECPBL    COMP  PIC  S9(4).
           02  DIRECPBF    PICTURE X.
           02  FILLER REDEFINES DIRECPBF.
             03 DIRECPBA    PICTURE X.
           02  DIRECPBI  PIC X(5).
           02  DIITEMBL    COMP  PIC  S9(4).
           02  DIITEMBF    PICTURE X.
           02  FILLER REDEFINES DIITEMBF.
             03 DIITEMBA    PICTURE X.
           02  DIITEMBI  PIC X(2).
           02  DICKDIBL    COMP  PIC  S9(4).
           02  DICKDIBF    PICTURE X.
           02  FILLER REDEFINES DICKDIBF.
             03 DICKDIBA    PICTURE X.
           02  DICKDIBI  PIC X(1).
           02  DIITEM1L    COMP  PIC  S9(4).
           02  DIITEM1F    PICTURE X.
           02  FILLER REDEFINES DIITEM1F.
             03 DIITEM1A    PICTURE X.
           02  DIITEM1I  PIC X(2).
           02  DICKDG1L    COMP  PIC  S9(4).
           02  DICKDG1F    PICTURE X.
           02  FILLER REDEFINES DICKDG1F.
             03 DICKDG1A    PICTURE X.
           02  DICKDG1I  PIC X(1).
           02  DIYEAR1L    COMP  PIC  S9(4).
           02  DIYEAR1F    PICTURE X.
           02  FILLER REDEFINES DIYEAR1F.
             03 DIYEAR1A    PICTURE X.
           02  DIYEAR1I  PIC X(2).
           02  DIMFG1L    COMP  PIC  S9(4).
           02  DIMFG1F    PICTURE X.
           02  FILLER REDEFINES DIMFG1F.
             03 DIMFG1A    PICTURE X.
           02  DIMFG1I  PIC X(6).
           02  DIMOD1L    COMP  PIC  S9(4).
           02  DIMOD1F    PICTURE X.
           02  FILLER REDEFINES DIMOD1F.
             03 DIMOD1A    PICTURE X.
           02  DIMOD1I  PIC X(6).
           02  DISTYL1L    COMP  PIC  S9(4).
           02  DISTYL1F    PICTURE X.
           02  FILLER REDEFINES DISTYL1F.
             03 DISTYL1A    PICTURE X.
           02  DISTYL1I  PIC X(6).
           02  DICOLR1L    COMP  PIC  S9(4).
           02  DICOLR1F    PICTURE X.
           02  FILLER REDEFINES DICOLR1F.
             03 DICOLR1A    PICTURE X.
           02  DICOLR1I  PIC X(3).
           02  DICAT1L    COMP  PIC  S9(4).
           02  DICAT1F    PICTURE X.
           02  FILLER REDEFINES DICAT1F.
             03 DICAT1A    PICTURE X.
           02  DICAT1I  PIC X(2).
           02  DISTK1L    COMP  PIC  S9(4).
           02  DISTK1F    PICTURE X.
           02  FILLER REDEFINES DISTK1F.
             03 DISTK1A    PICTURE X.
           02  DISTK1I  PIC X(6).
           02  DIMILE1L    COMP  PIC  S9(4).
           02  DIMILE1F    PICTURE X.
           02  FILLER REDEFINES DIMILE1F.
             03 DIMILE1A    PICTURE X.
           02  DIMILE1I  PIC X(7).
           02  DISER1L    COMP  PIC  S9(4).
           02  DISER1F    PICTURE X.
           02  FILLER REDEFINES DISER1F.
             03 DISER1A    PICTURE X.
           02  DISER1I  PIC X(20).
           02  DIFEES1L    COMP  PIC  S9(4).
           02  DIFEES1F    PICTURE X.
           02  FILLER REDEFINES DIFEES1F.
             03 DIFEES1A    PICTURE X.
           02  DIFEES1I  PIC X(16).
           02  DIPRIC1L    COMP  PIC  S9(4).
           02  DIPRIC1F    PICTURE X.
           02  FILLER REDEFINES DIPRIC1F.
             03 DIPRIC1A    PICTURE X.
           02  DIPRIC1I  PIC X(16).
           02  DIINRT1L    COMP  PIC  S9(4).
           02  DIINRT1F    PICTURE X.
           02  FILLER REDEFINES DIINRT1F.
             03 DIINRT1A    PICTURE X.
           02  DIINRT1I  PIC X(10).
           02  DIITEM2L    COMP  PIC  S9(4).
           02  DIITEM2F    PICTURE X.
           02  FILLER REDEFINES DIITEM2F.
             03 DIITEM2A    PICTURE X.
           02  DIITEM2I  PIC X(2).
           02  DICKDG2L    COMP  PIC  S9(4).
           02  DICKDG2F    PICTURE X.
           02  FILLER REDEFINES DICKDG2F.
             03 DICKDG2A    PICTURE X.
           02  DICKDG2I  PIC X(1).
           02  DIYEAR2L    COMP  PIC  S9(4).
           02  DIYEAR2F    PICTURE X.
           02  FILLER REDEFINES DIYEAR2F.
             03 DIYEAR2A    PICTURE X.
           02  DIYEAR2I  PIC X(2).
           02  DIMFG2L    COMP  PIC  S9(4).
           02  DIMFG2F    PICTURE X.
           02  FILLER REDEFINES DIMFG2F.
             03 DIMFG2A    PICTURE X.
           02  DIMFG2I  PIC X(6).
           02  DIMOD2L    COMP  PIC  S9(4).
           02  DIMOD2F    PICTURE X.
           02  FILLER REDEFINES DIMOD2F.
             03 DIMOD2A    PICTURE X.
           02  DIMOD2I  PIC X(6).
           02  DISTYL2L    COMP  PIC  S9(4).
           02  DISTYL2F    PICTURE X.
           02  FILLER REDEFINES DISTYL2F.
             03 DISTYL2A    PICTURE X.
           02  DISTYL2I  PIC X(6).
           02  DICOLR2L    COMP  PIC  S9(4).
           02  DICOLR2F    PICTURE X.
           02  FILLER REDEFINES DICOLR2F.
             03 DICOLR2A    PICTURE X.
           02  DICOLR2I  PIC X(3).
           02  DICAT2L    COMP  PIC  S9(4).
           02  DICAT2F    PICTURE X.
           02  FILLER REDEFINES DICAT2F.
             03 DICAT2A    PICTURE X.
           02  DICAT2I  PIC X(2).
           02  DISTK2L    COMP  PIC  S9(4).
           02  DISTK2F    PICTURE X.
           02  FILLER REDEFINES DISTK2F.
             03 DISTK2A    PICTURE X.
           02  DISTK2I  PIC X(6).
           02  DIMILE2L    COMP  PIC  S9(4).
           02  DIMILE2F    PICTURE X.
           02  FILLER REDEFINES DIMILE2F.
             03 DIMILE2A    PICTURE X.
           02  DIMILE2I  PIC X(7).
           02  DISER2L    COMP  PIC  S9(4).
           02  DISER2F    PICTURE X.
           02  FILLER REDEFINES DISER2F.
             03 DISER2A    PICTURE X.
           02  DISER2I  PIC X(20).
           02  DIFEES2L    COMP  PIC  S9(4).
           02  DIFEES2F    PICTURE X.
           02  FILLER REDEFINES DIFEES2F.
             03 DIFEES2A    PICTURE X.
           02  DIFEES2I  PIC X(16).
           02  DIPRIC2L    COMP  PIC  S9(4).
           02  DIPRIC2F    PICTURE X.
           02  FILLER REDEFINES DIPRIC2F.
             03 DIPRIC2A    PICTURE X.
           02  DIPRIC2I  PIC X(16).
           02  DIINRT2L    COMP  PIC  S9(4).
           02  DIINRT2F    PICTURE X.
           02  FILLER REDEFINES DIINRT2F.
             03 DIINRT2A    PICTURE X.
           02  DIINRT2I  PIC X(10).
           02  DIITEM3L    COMP  PIC  S9(4).
           02  DIITEM3F    PICTURE X.
           02  FILLER REDEFINES DIITEM3F.
             03 DIITEM3A    PICTURE X.
           02  DIITEM3I  PIC X(2).
           02  DICKDG3L    COMP  PIC  S9(4).
           02  DICKDG3F    PICTURE X.
           02  FILLER REDEFINES DICKDG3F.
             03 DICKDG3A    PICTURE X.
           02  DICKDG3I  PIC X(1).
           02  DIYEAR3L    COMP  PIC  S9(4).
           02  DIYEAR3F    PICTURE X.
           02  FILLER REDEFINES DIYEAR3F.
             03 DIYEAR3A    PICTURE X.
           02  DIYEAR3I  PIC X(2).
           02  DIMFG3L    COMP  PIC  S9(4).
           02  DIMFG3F    PICTURE X.
           02  FILLER REDEFINES DIMFG3F.
             03 DIMFG3A    PICTURE X.
           02  DIMFG3I  PIC X(6).
           02  DIMOD3L    COMP  PIC  S9(4).
           02  DIMOD3F    PICTURE X.
           02  FILLER REDEFINES DIMOD3F.
             03 DIMOD3A    PICTURE X.
           02  DIMOD3I  PIC X(6).
           02  DISTYL3L    COMP  PIC  S9(4).
           02  DISTYL3F    PICTURE X.
           02  FILLER REDEFINES DISTYL3F.
             03 DISTYL3A    PICTURE X.
           02  DISTYL3I  PIC X(6).
           02  DICOLR3L    COMP  PIC  S9(4).
           02  DICOLR3F    PICTURE X.
           02  FILLER REDEFINES DICOLR3F.
             03 DICOLR3A    PICTURE X.
           02  DICOLR3I  PIC X(3).
           02  DICAT3L    COMP  PIC  S9(4).
           02  DICAT3F    PICTURE X.
           02  FILLER REDEFINES DICAT3F.
             03 DICAT3A    PICTURE X.
           02  DICAT3I  PIC X(2).
           02  DISTK3L    COMP  PIC  S9(4).
           02  DISTK3F    PICTURE X.
           02  FILLER REDEFINES DISTK3F.
             03 DISTK3A    PICTURE X.
           02  DISTK3I  PIC X(6).
           02  DIMILE3L    COMP  PIC  S9(4).
           02  DIMILE3F    PICTURE X.
           02  FILLER REDEFINES DIMILE3F.
             03 DIMILE3A    PICTURE X.
           02  DIMILE3I  PIC X(7).
           02  DISER3L    COMP  PIC  S9(4).
           02  DISER3F    PICTURE X.
           02  FILLER REDEFINES DISER3F.
             03 DISER3A    PICTURE X.
           02  DISER3I  PIC X(20).
           02  DIFEES3L    COMP  PIC  S9(4).
           02  DIFEES3F    PICTURE X.
           02  FILLER REDEFINES DIFEES3F.
             03 DIFEES3A    PICTURE X.
           02  DIFEES3I  PIC X(16).
           02  DIPRIC3L    COMP  PIC  S9(4).
           02  DIPRIC3F    PICTURE X.
           02  FILLER REDEFINES DIPRIC3F.
             03 DIPRIC3A    PICTURE X.
           02  DIPRIC3I  PIC X(16).
           02  DIINRT3L    COMP  PIC  S9(4).
           02  DIINRT3F    PICTURE X.
           02  FILLER REDEFINES DIINRT3F.
             03 DIINRT3A    PICTURE X.
           02  DIINRT3I  PIC X(10).
           02  DIITEM4L    COMP  PIC  S9(4).
           02  DIITEM4F    PICTURE X.
           02  FILLER REDEFINES DIITEM4F.
             03 DIITEM4A    PICTURE X.
           02  DIITEM4I  PIC X(2).
           02  DICKDG4L    COMP  PIC  S9(4).
           02  DICKDG4F    PICTURE X.
           02  FILLER REDEFINES DICKDG4F.
             03 DICKDG4A    PICTURE X.
           02  DICKDG4I  PIC X(1).
           02  DIYEAR4L    COMP  PIC  S9(4).
           02  DIYEAR4F    PICTURE X.
           02  FILLER REDEFINES DIYEAR4F.
             03 DIYEAR4A    PICTURE X.
           02  DIYEAR4I  PIC X(2).
           02  DIMFG4L    COMP  PIC  S9(4).
           02  DIMFG4F    PICTURE X.
           02  FILLER REDEFINES DIMFG4F.
             03 DIMFG4A    PICTURE X.
           02  DIMFG4I  PIC X(6).
           02  DIMOD4L    COMP  PIC  S9(4).
           02  DIMOD4F    PICTURE X.
           02  FILLER REDEFINES DIMOD4F.
             03 DIMOD4A    PICTURE X.
           02  DIMOD4I  PIC X(6).
           02  DISTYL4L    COMP  PIC  S9(4).
           02  DISTYL4F    PICTURE X.
           02  FILLER REDEFINES DISTYL4F.
             03 DISTYL4A    PICTURE X.
           02  DISTYL4I  PIC X(6).
           02  DICOLR4L    COMP  PIC  S9(4).
           02  DICOLR4F    PICTURE X.
           02  FILLER REDEFINES DICOLR4F.
             03 DICOLR4A    PICTURE X.
           02  DICOLR4I  PIC X(3).
           02  DICAT4L    COMP  PIC  S9(4).
           02  DICAT4F    PICTURE X.
           02  FILLER REDEFINES DICAT4F.
             03 DICAT4A    PICTURE X.
           02  DICAT4I  PIC X(2).
           02  DISTK4L    COMP  PIC  S9(4).
           02  DISTK4F    PICTURE X.
           02  FILLER REDEFINES DISTK4F.
             03 DISTK4A    PICTURE X.
           02  DISTK4I  PIC X(6).
           02  DIMILE4L    COMP  PIC  S9(4).
           02  DIMILE4F    PICTURE X.
           02  FILLER REDEFINES DIMILE4F.
             03 DIMILE4A    PICTURE X.
           02  DIMILE4I  PIC X(7).
           02  DISER4L    COMP  PIC  S9(4).
           02  DISER4F    PICTURE X.
           02  FILLER REDEFINES DISER4F.
             03 DISER4A    PICTURE X.
           02  DISER4I  PIC X(20).
           02  DIFEES4L    COMP  PIC  S9(4).
           02  DIFEES4F    PICTURE X.
           02  FILLER REDEFINES DIFEES4F.
             03 DIFEES4A    PICTURE X.
           02  DIFEES4I  PIC X(16).
           02  DIPRIC4L    COMP  PIC  S9(4).
           02  DIPRIC4F    PICTURE X.
           02  FILLER REDEFINES DIPRIC4F.
             03 DIPRIC4A    PICTURE X.
           02  DIPRIC4I  PIC X(16).
           02  DIINRT4L    COMP  PIC  S9(4).
           02  DIINRT4F    PICTURE X.
           02  FILLER REDEFINES DIINRT4F.
             03 DIINRT4A    PICTURE X.
           02  DIINRT4I  PIC X(10).
           02  DIMOREL    COMP  PIC  S9(4).
           02  DIMOREF    PICTURE X.
           02  FILLER REDEFINES DIMOREF.
             03 DIMOREA    PICTURE X.
           02  DIMOREI  PIC X(1).
           02  DIERRBL    COMP  PIC  S9(4).
           02  DIERRBF    PICTURE X.
           02  FILLER REDEFINES DIERRBF.
             03 DIERRBA    PICTURE X.
           02  DIERRBI  PIC X(79).
       01  FIDI01CO REDEFINES FIDI01CI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DITRANBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DIDATEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DITIMEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DICTL2BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICTL3BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIDEALBO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DILINEBO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICLASBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIRECPBO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  DIITEMBO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICKDIBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIITEM1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICKDG1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIYEAR1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIMFG1O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMOD1O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DISTYL1O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DICOLR1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICAT1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DISTK1O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMILE1O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DISER1O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  DIFEES1O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIPRIC1O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIINRT1O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DIITEM2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICKDG2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIYEAR2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIMFG2O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMOD2O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DISTYL2O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DICOLR2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICAT2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DISTK2O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMILE2O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DISER2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  DIFEES2O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIPRIC2O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIINRT2O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DIITEM3O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICKDG3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIYEAR3O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIMFG3O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMOD3O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DISTYL3O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DICOLR3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICAT3O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DISTK3O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMILE3O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DISER3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  DIFEES3O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIPRIC3O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIINRT3O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DIITEM4O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICKDG4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIYEAR4O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIMFG4O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMOD4O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DISTYL4O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DICOLR4O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICAT4O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DISTK4O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMILE4O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DISER4O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  DIFEES4O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIPRIC4O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIINRT4O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DIMOREO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIERRBO  PIC X(79).
       01  FIDI01BI REDEFINES FIDI01CI.
           02  FILLER PIC X(12).
           02  DITRANL    COMP  PIC  S9(4).
           02  DITRANF    PICTURE X.
           02  FILLER REDEFINES DITRANF.
             03 DITRANA    PICTURE X.
           02  DITRANI  PIC X(4).
           02  DIDATEL    COMP  PIC  S9(4).
           02  DIDATEF    PICTURE X.
           02  FILLER REDEFINES DIDATEF.
             03 DIDATEA    PICTURE X.
           02  DIDATEI  PIC X(8).
           02  DITIMEL    COMP  PIC  S9(4).
           02  DITIMEF    PICTURE X.
           02  FILLER REDEFINES DITIMEF.
             03 DITIMEA    PICTURE X.
           02  DITIMEI  PIC X(8).
           02  DICTL2L    COMP  PIC  S9(4).
           02  DICTL2F    PICTURE X.
           02  FILLER REDEFINES DICTL2F.
             03 DICTL2A    PICTURE X.
           02  DICTL2I  PIC X(3).
           02  DICTL3L    COMP  PIC  S9(4).
           02  DICTL3F    PICTURE X.
           02  FILLER REDEFINES DICTL3F.
             03 DICTL3A    PICTURE X.
           02  DICTL3I  PIC X(3).
           02  DIDEALL    COMP  PIC  S9(4).
           02  DIDEALF    PICTURE X.
           02  FILLER REDEFINES DIDEALF.
             03 DIDEALA    PICTURE X.
           02  DIDEALI  PIC X(7).
           02  DILINEL    COMP  PIC  S9(4).
           02  DILINEF    PICTURE X.
           02  FILLER REDEFINES DILINEF.
             03 DILINEA    PICTURE X.
           02  DILINEI  PIC X(2).
           02  DICLASSL    COMP  PIC  S9(4).
           02  DICLASSF    PICTURE X.
           02  FILLER REDEFINES DICLASSF.
             03 DICLASSA    PICTURE X.
           02  DICLASSI  PIC X(1).
           02  DIRECPTL    COMP  PIC  S9(4).
           02  DIRECPTF    PICTURE X.
           02  FILLER REDEFINES DIRECPTF.
             03 DIRECPTA    PICTURE X.
           02  DIRECPTI  PIC X(5).
           02  DIITEML    COMP  PIC  S9(4).
           02  DIITEMF    PICTURE X.
           02  FILLER REDEFINES DIITEMF.
             03 DIITEMA    PICTURE X.
           02  DIITEMI  PIC X(2).
           02  DICKDIGL    COMP  PIC  S9(4).
           02  DICKDIGF    PICTURE X.
           02  FILLER REDEFINES DICKDIGF.
             03 DICKDIGA    PICTURE X.
           02  DICKDIGI  PIC X(1).
           02  DITRUSTL    COMP  PIC  S9(4).
           02  DITRUSTF    PICTURE X.
           02  FILLER REDEFINES DITRUSTF.
             03 DITRUSTA    PICTURE X.
           02  DITRUSTI  PIC X(16).
           02  DIFLRDTL    COMP  PIC  S9(4).
           02  DIFLRDTF    PICTURE X.
           02  FILLER REDEFINES DIFLRDTF.
             03 DIFLRDTA    PICTURE X.
           02  DIFLRDTI  PIC X(6).
           02  DIMATDTL    COMP  PIC  S9(4).
           02  DIMATDTF    PICTURE X.
           02  FILLER REDEFINES DIMATDTF.
             03 DIMATDTA    PICTURE X.
           02  DIMATDTI  PIC X(6).
           02  DIMOBASL    COMP  PIC  S9(4).
           02  DIMOBASF    PICTURE X.
           02  FILLER REDEFINES DIMOBASF.
             03 DIMOBASA    PICTURE X.
           02  DIMOBASI  PIC X(1).
           02  DIYRBASL    COMP  PIC  S9(4).
           02  DIYRBASF    PICTURE X.
           02  FILLER REDEFINES DIYRBASF.
             03 DIYRBASA    PICTURE X.
           02  DIYRBASI  PIC X(1).
           02  DIINTDTL    COMP  PIC  S9(4).
           02  DIINTDTF    PICTURE X.
           02  FILLER REDEFINES DIINTDTF.
             03 DIINTDTA    PICTURE X.
           02  DIINTDTI  PIC X(6).
           02  DIINTRTL    COMP  PIC  S9(4).
           02  DIINTRTF    PICTURE X.
           02  FILLER REDEFINES DIINTRTF.
             03 DIINTRTA    PICTURE X.
           02  DIINTRTI  PIC X(10).
           02  DISHTNML    COMP  PIC  S9(4).
           02  DISHTNMF    PICTURE X.
           02  FILLER REDEFINES DISHTNMF.
             03 DISHTNMA    PICTURE X.
           02  DISHTNMI  PIC X(13).
           02  DITMECLL    COMP  PIC  S9(4).
           02  DITMECLF    PICTURE X.
           02  FILLER REDEFINES DITMECLF.
             03 DITMECLA    PICTURE X.
           02  DITMECLI  PIC X(1).
           02  DICOLLL    COMP  PIC  S9(4).
           02  DICOLLF    PICTURE X.
           02  FILLER REDEFINES DICOLLF.
             03 DICOLLA    PICTURE X.
           02  DICOLLI  PIC X(3).
           02  DI416TGL    COMP  PIC  S9(4).
           02  DI416TGF    PICTURE X.
           02  FILLER REDEFINES DI416TGF.
             03 DI416TGA    PICTURE X.
           02  DI416TGI  PIC X(7).
           02  DI416L    COMP  PIC  S9(4).
           02  DI416F    PICTURE X.
           02  FILLER REDEFINES DI416F.
             03 DI416A    PICTURE X.
           02  DI416I  PIC X(3).
           02  DIFLTACL    COMP  PIC  S9(4).
           02  DIFLTACF    PICTURE X.
           02  FILLER REDEFINES DIFLTACF.
             03 DIFLTACA    PICTURE X.
           02  DIFLTACI  PIC X(1).
           02  DIGLCODL    COMP  PIC  S9(4).
           02  DIGLCODF    PICTURE X.
           02  FILLER REDEFINES DIGLCODF.
             03 DIGLCODA    PICTURE X.
           02  DIGLCODI  PIC X(4).
           02  DIRELPRL    COMP  PIC  S9(4).
           02  DIRELPRF    PICTURE X.
           02  FILLER REDEFINES DIRELPRF.
             03 DIRELPRA    PICTURE X.
           02  DIRELPRI  PIC X(1).
           02  DIIDX1L    COMP  PIC  S9(4).
           02  DIIDX1F    PICTURE X.
           02  FILLER REDEFINES DIIDX1F.
             03 DIIDX1A    PICTURE X.
           02  DIIDX1I  PIC X(2).
           02  DIIDX2L    COMP  PIC  S9(4).
           02  DIIDX2F    PICTURE X.
           02  FILLER REDEFINES DIIDX2F.
             03 DIIDX2A    PICTURE X.
           02  DIIDX2I  PIC X(2).
           02  DIPRREVL    COMP  PIC  S9(4).
           02  DIPRREVF    PICTURE X.
           02  FILLER REDEFINES DIPRREVF.
             03 DIPRREVA    PICTURE X.
           02  DIPRREVI  PIC X(1).
           02  DIPRTIEL    COMP  PIC  S9(4).
           02  DIPRTIEF    PICTURE X.
           02  FILLER REDEFINES DIPRTIEF.
             03 DIPRTIEA    PICTURE X.
           02  DIPRTIEI  PIC X(1).
           02  DIPRDYSL    COMP  PIC  S9(4).
           02  DIPRDYSF    PICTURE X.
           02  FILLER REDEFINES DIPRDYSF.
             03 DIPRDYSA    PICTURE X.
           02  DIPRDYSI  PIC X(3).
           02  DITYADJL    COMP  PIC  S9(4).
           02  DITYADJF    PICTURE X.
           02  FILLER REDEFINES DITYADJF.
             03 DITYADJA    PICTURE X.
           02  DITYADJI  PIC X(1).
           02  DIADJPRL    COMP  PIC  S9(4).
           02  DIADJPRF    PICTURE X.
           02  FILLER REDEFINES DIADJPRF.
             03 DIADJPRA    PICTURE X.
           02  DIADJPRI  PIC X(10).
           02  DIFCUSEL    COMP  PIC  S9(4).
           02  DIFCUSEF    PICTURE X.
           02  FILLER REDEFINES DIFCUSEF.
             03 DIFCUSEA    PICTURE X.
           02  DIFCUSEI  PIC X(1).
           02  DIFLRRTL    COMP  PIC  S9(4).
           02  DIFLRRTF    PICTURE X.
           02  FILLER REDEFINES DIFLRRTF.
             03 DIFLRRTA    PICTURE X.
           02  DIFLRRTI  PIC X(10).
           02  DICEIRTL    COMP  PIC  S9(4).
           02  DICEIRTF    PICTURE X.
           02  FILLER REDEFINES DICEIRTF.
             03 DICEIRTA    PICTURE X.
           02  DICEIRTI  PIC X(10).
           02  DIEFFDTL    COMP  PIC  S9(4).
           02  DIEFFDTF    PICTURE X.
           02  FILLER REDEFINES DIEFFDTF.
             03 DIEFFDTA    PICTURE X.
           02  DIEFFDTI  PIC X(6).
           02  DIPFREQL    COMP  PIC  S9(4).
           02  DIPFREQF    PICTURE X.
           02  FILLER REDEFINES DIPFREQF.
             03 DIPFREQA    PICTURE X.
           02  DIPFREQI  PIC X(1).
           02  DIBUSDAL    COMP  PIC  S9(4).
           02  DIBUSDAF    PICTURE X.
           02  FILLER REDEFINES DIBUSDAF.
             03 DIBUSDAA    PICTURE X.
           02  DIBUSDAI  PIC X(1).
           02  DIPTYPEL    COMP  PIC  S9(4).
           02  DIPTYPEF    PICTURE X.
           02  FILLER REDEFINES DIPTYPEF.
             03 DIPTYPEA    PICTURE X.
           02  DIPTYPEI  PIC X(1).
           02  DIFREQL    COMP  PIC  S9(4).
           02  DIFREQF    PICTURE X.
           02  FILLER REDEFINES DIFREQF.
             03 DIFREQA    PICTURE X.
           02  DIFREQI  PIC X(1).
           02  DIINCRL    COMP  PIC  S9(4).
           02  DIINCRF    PICTURE X.
           02  FILLER REDEFINES DIINCRF.
             03 DIINCRA    PICTURE X.
           02  DIINCRI  PIC X(3).
           02  DIPRSTRL    COMP  PIC  S9(4).
           02  DIPRSTRF    PICTURE X.
           02  FILLER REDEFINES DIPRSTRF.
             03 DIPRSTRA    PICTURE X.
           02  DIPRSTRI  PIC X(6).
           02  DIPRAMTL    COMP  PIC  S9(4).
           02  DIPRAMTF    PICTURE X.
           02  FILLER REDEFINES DIPRAMTF.
             03 DIPRAMTA    PICTURE X.
           02  DIPRAMTI  PIC X(16).
           02  DIPRPAYL    COMP  PIC  S9(4).
           02  DIPRPAYF    PICTURE X.
           02  FILLER REDEFINES DIPRPAYF.
             03 DIPRPAYA    PICTURE X.
           02  DIPRPAYI  PIC X(3).
           02  DIITYPEL    COMP  PIC  S9(4).
           02  DIITYPEF    PICTURE X.
           02  FILLER REDEFINES DIITYPEF.
             03 DIITYPEA    PICTURE X.
           02  DIITYPEI  PIC X(1).
           02  DIINTFRL    COMP  PIC  S9(4).
           02  DIINTFRF    PICTURE X.
           02  FILLER REDEFINES DIINTFRF.
             03 DIINTFRA    PICTURE X.
           02  DIINTFRI  PIC X(1).
           02  DIINTINL    COMP  PIC  S9(4).
           02  DIINTINF    PICTURE X.
           02  FILLER REDEFINES DIINTINF.
             03 DIINTINA    PICTURE X.
           02  DIINTINI  PIC X(3).
           02  DIINSTRL    COMP  PIC  S9(4).
           02  DIINSTRF    PICTURE X.
           02  FILLER REDEFINES DIINSTRF.
             03 DIINSTRA    PICTURE X.
           02  DIINSTRI  PIC X(6).
           02  DIINAMTL    COMP  PIC  S9(4).
           02  DIINAMTF    PICTURE X.
           02  FILLER REDEFINES DIINAMTF.
             03 DIINAMTA    PICTURE X.
           02  DIINAMTI  PIC X(16).
           02  DIINPAYL    COMP  PIC  S9(4).
           02  DIINPAYF    PICTURE X.
           02  FILLER REDEFINES DIINPAYF.
             03 DIINPAYA    PICTURE X.
           02  DIINPAYI  PIC X(3).
           02  DICAPFL    COMP  PIC  S9(4).
           02  DICAPFF    PICTURE X.
           02  FILLER REDEFINES DICAPFF.
             03 DICAPFA    PICTURE X.
           02  DICAPFI  PIC X(1).
           02  DICAPFQL    COMP  PIC  S9(4).
           02  DICAPFQF    PICTURE X.
           02  FILLER REDEFINES DICAPFQF.
             03 DICAPFQA    PICTURE X.
           02  DICAPFQI  PIC X(1).
           02  DICAPICL    COMP  PIC  S9(4).
           02  DICAPICF    PICTURE X.
           02  FILLER REDEFINES DICAPICF.
             03 DICAPICA    PICTURE X.
           02  DICAPICI  PIC X(3).
           02  DICAPDTL    COMP  PIC  S9(4).
           02  DICAPDTF    PICTURE X.
           02  FILLER REDEFINES DICAPDTF.
             03 DICAPDTA    PICTURE X.
           02  DICAPDTI  PIC X(6).
           02  DICAPITL    COMP  PIC  S9(4).
           02  DICAPITF    PICTURE X.
           02  FILLER REDEFINES DICAPITF.
             03 DICAPITA    PICTURE X.
           02  DICAPITI  PIC X(1).
           02  DICAPCBL    COMP  PIC  S9(4).
           02  DICAPCBF    PICTURE X.
           02  FILLER REDEFINES DICAPCBF.
             03 DICAPCBA    PICTURE X.
           02  DICAPCBI  PIC X(1).
           02  DICAPI1L    COMP  PIC  S9(4).
           02  DICAPI1F    PICTURE X.
           02  FILLER REDEFINES DICAPI1F.
             03 DICAPI1A    PICTURE X.
           02  DICAPI1I  PIC X(1).
           02  DICAPI2L    COMP  PIC  S9(4).
           02  DICAPI2F    PICTURE X.
           02  FILLER REDEFINES DICAPI2F.
             03 DICAPI2A    PICTURE X.
           02  DICAPI2I  PIC X(1).
           02  DICAPI3L    COMP  PIC  S9(4).
           02  DICAPI3F    PICTURE X.
           02  FILLER REDEFINES DICAPI3F.
             03 DICAPI3A    PICTURE X.
           02  DICAPI3I  PIC X(1).
           02  DICAPI4L    COMP  PIC  S9(4).
           02  DICAPI4F    PICTURE X.
           02  FILLER REDEFINES DICAPI4F.
             03 DICAPI4A    PICTURE X.
           02  DICAPI4I  PIC X(1).
           02  DICAPFEL    COMP  PIC  S9(4).
           02  DICAPFEF    PICTURE X.
           02  FILLER REDEFINES DICAPFEF.
             03 DICAPFEA    PICTURE X.
           02  DICAPFEI  PIC X(1).
           02  DIERRORL    COMP  PIC  S9(4).
           02  DIERRORF    PICTURE X.
           02  FILLER REDEFINES DIERRORF.
             03 DIERRORA    PICTURE X.
           02  DIERRORI  PIC X(79).
       01  FIDI01BO REDEFINES FIDI01BI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DITRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DIDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DITIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DICTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIDEALO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DILINEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICLASSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIRECPTO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  DIITEMO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICKDIGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DITRUSTO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIFLRDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMATDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIMOBASO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIYRBASO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIINTDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIINTRTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DISHTNMO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DITMECLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DICOLLO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DI416TGO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DI416O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIFLTACO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIGLCODO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DIRELPRO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIIDX1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIIDX2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DIPRREVO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIPRTIEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIPRDYSO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DITYADJO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIADJPRO PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  DIFCUSEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIFLRRTO PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  DICEIRTO PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  DIEFFDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIPFREQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIBUSDAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIPTYPEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIFREQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIINCRO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIPRSTRO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIPRAMTO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIPRPAYO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIITYPEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIINTFRO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIINTINO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIINSTRO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DIINAMTO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DIINPAYO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICAPFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DICAPFQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DICAPICO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICAPDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DICAPITO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DICAPCBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DICAPI1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DICAPI2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DICAPI3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DICAPI4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DICAPFEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIERRORO  PIC X(79).
       01  FIDI01DI REDEFINES FIDI01CI.
           02  FILLER PIC X(12).
           02  DITRANAL    COMP  PIC  S9(4).
           02  DITRANAF    PICTURE X.
           02  FILLER REDEFINES DITRANAF.
             03 DITRANAA    PICTURE X.
           02  DITRANAI  PIC X(4).
           02  DIDATEAL    COMP  PIC  S9(4).
           02  DIDATEAF    PICTURE X.
           02  FILLER REDEFINES DIDATEAF.
             03 DIDATEAA    PICTURE X.
           02  DIDATEAI  PIC X(8).
           02  DITIMEAL    COMP  PIC  S9(4).
           02  DITIMEAF    PICTURE X.
           02  FILLER REDEFINES DITIMEAF.
             03 DITIMEAA    PICTURE X.
           02  DITIMEAI  PIC X(8).
           02  DICTL2AL    COMP  PIC  S9(4).
           02  DICTL2AF    PICTURE X.
           02  FILLER REDEFINES DICTL2AF.
             03 DICTL2AA    PICTURE X.
           02  DICTL2AI  PIC X(3).
           02  DICTL3AL    COMP  PIC  S9(4).
           02  DICTL3AF    PICTURE X.
           02  FILLER REDEFINES DICTL3AF.
             03 DICTL3AA    PICTURE X.
           02  DICTL3AI  PIC X(3).
           02  DIDEALAL    COMP  PIC  S9(4).
           02  DIDEALAF    PICTURE X.
           02  FILLER REDEFINES DIDEALAF.
             03 DIDEALAA    PICTURE X.
           02  DIDEALAI  PIC X(7).
           02  DILINEAL    COMP  PIC  S9(4).
           02  DILINEAF    PICTURE X.
           02  FILLER REDEFINES DILINEAF.
             03 DILINEAA    PICTURE X.
           02  DILINEAI  PIC X(2).
           02  DICLASAL    COMP  PIC  S9(4).
           02  DICLASAF    PICTURE X.
           02  FILLER REDEFINES DICLASAF.
             03 DICLASAA    PICTURE X.
           02  DICLASAI  PIC X(1).
           02  DIRECPAL    COMP  PIC  S9(4).
           02  DIRECPAF    PICTURE X.
           02  FILLER REDEFINES DIRECPAF.
             03 DIRECPAA    PICTURE X.
           02  DIRECPAI  PIC X(5).
           02  DIITEMAL    COMP  PIC  S9(4).
           02  DIITEMAF    PICTURE X.
           02  FILLER REDEFINES DIITEMAF.
             03 DIITEMAA    PICTURE X.
           02  DIITEMAI  PIC X(2).
           02  DICKDGAL    COMP  PIC  S9(4).
           02  DICKDGAF    PICTURE X.
           02  FILLER REDEFINES DICKDGAF.
             03 DICKDGAA    PICTURE X.
           02  DICKDGAI  PIC X(1).
           02  DITYPEL    COMP  PIC  S9(4).
           02  DITYPEF    PICTURE X.
           02  FILLER REDEFINES DITYPEF.
             03 DITYPEA    PICTURE X.
           02  DITYPEI  PIC X(3).
           02  DIERRAL    COMP  PIC  S9(4).
           02  DIERRAF    PICTURE X.
           02  FILLER REDEFINES DIERRAF.
             03 DIERRAA    PICTURE X.
           02  DIERRAI  PIC X(79).
       01  FIDI01DO REDEFINES FIDI01DI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DITRANAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DIDATEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DITIMEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DICTL2AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DICTL3AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIDEALAO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DILINEAO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICLASAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DIRECPAO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  DIITEMAO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DICKDGAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DITYPEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DIERRAO  PIC X(79).