       01  FIDL20AI.
           02  FILLER PIC X(12).
           02  DLTRANL    COMP  PIC  S9(4).
           02  DLTRANF    PICTURE X.
           02  FILLER REDEFINES DLTRANF.
             03 DLTRANA    PICTURE X.
           02  DLTRANI  PIC X(4).
           02  DLDATEL    COMP  PIC  S9(4).
           02  DLDATEF    PICTURE X.
           02  FILLER REDEFINES DLDATEF.
             03 DLDATEA    PICTURE X.
           02  DLDATEI  PIC X(8).
           02  DLTIMEL    COMP  PIC  S9(4).
           02  DLTIMEF    PICTURE X.
           02  FILLER REDEFINES DLTIMEF.
             03 DLTIMEA    PICTURE X.
           02  DLTIMEI  PIC X(8).
           02  DLCTL2L    COMP  PIC  S9(4).
           02  DLCTL2F    PICTURE X.
           02  FILLER REDEFINES DLCTL2F.
             03 DLCTL2A    PICTURE X.
           02  DLCTL2I  PIC X(3).
           02  DLCTL3L    COMP  PIC  S9(4).
           02  DLCTL3F    PICTURE X.
           02  FILLER REDEFINES DLCTL3F.
             03 DLCTL3A    PICTURE X.
           02  DLCTL3I  PIC X(3).
           02  DLDEALL    COMP  PIC  S9(4).
           02  DLDEALF    PICTURE X.
           02  FILLER REDEFINES DLDEALF.
             03 DLDEALA    PICTURE X.
           02  DLDEALI  PIC X(7).
           02  DLLINEL    COMP  PIC  S9(4).
           02  DLLINEF    PICTURE X.
           02  FILLER REDEFINES DLLINEF.
             03 DLLINEA    PICTURE X.
           02  DLLINEI  PIC X(2).
           02  DLCLASSL    COMP  PIC  S9(4).
           02  DLCLASSF    PICTURE X.
           02  FILLER REDEFINES DLCLASSF.
             03 DLCLASSA    PICTURE X.
           02  DLCLASSI  PIC X(1).
           02  DLPOSTL    COMP  PIC  S9(4).
           02  DLPOSTF    PICTURE X.
           02  FILLER REDEFINES DLPOSTF.
             03 DLPOSTA    PICTURE X.
           02  DLPOSTI  PIC X(1).
           02  DLSHORTL    COMP  PIC  S9(4).
           02  DLSHORTF    PICTURE X.
           02  FILLER REDEFINES DLSHORTF.
             03 DLSHORTA    PICTURE X.
           02  DLSHORTI  PIC X(13).
           02  DLSSNCDL    COMP  PIC  S9(4).
           02  DLSSNCDF    PICTURE X.
           02  FILLER REDEFINES DLSSNCDF.
             03 DLSSNCDA    PICTURE X.
           02  DLSSNCDI  PIC X(1).
           02  DLSSPFXL    COMP  PIC  S9(4).
           02  DLSSPFXF    PICTURE X.
           02  FILLER REDEFINES DLSSPFXF.
             03 DLSSPFXA    PICTURE X.
           02  DLSSPFXI  PIC X(1).
           02  DLSSNBRL    COMP  PIC  S9(4).
           02  DLSSNBRF    PICTURE X.
           02  FILLER REDEFINES DLSSNBRF.
             03 DLSSNBRA    PICTURE X.
           02  DLSSNBRI  PIC X(9).
           02  DLSSSUFL    COMP  PIC  S9(4).
           02  DLSSSUFF    PICTURE X.
           02  FILLER REDEFINES DLSSSUFF.
             03 DLSSSUFA    PICTURE X.
           02  DLSSSUFI  PIC X(1).
           02  DLPHONEL    COMP  PIC  S9(4).
           02  DLPHONEF    PICTURE X.
           02  FILLER REDEFINES DLPHONEF.
             03 DLPHONEA    PICTURE X.
           02  DLPHONEI  PIC X(14).
           02  DLBRNCHL    COMP  PIC  S9(4).
           02  DLBRNCHF    PICTURE X.
           02  FILLER REDEFINES DLBRNCHF.
             03 DLBRNCHA    PICTURE X.
           02  DLBRNCHI  PIC X(3).
           02  DLDTESTL    COMP  PIC  S9(4).
           02  DLDTESTF    PICTURE X.
           02  FILLER REDEFINES DLDTESTF.
             03 DLDTESTA    PICTURE X.
           02  DLDTESTI  PIC X(6).
           02  DLDTNASL    COMP  PIC  S9(4).
           02  DLDTNASF    PICTURE X.
           02  FILLER REDEFINES DLDTNASF.
             03 DLDTNASA    PICTURE X.
           02  DLDTNASI  PIC X(6).
           02  DLFREQL    COMP  PIC  S9(4).
           02  DLFREQF    PICTURE X.
           02  FILLER REDEFINES DLFREQF.
             03 DLFREQA    PICTURE X.
           02  DLFREQI  PIC X(1).
           02  DLMOSYRL    COMP  PIC  S9(4).
           02  DLMOSYRF    PICTURE X.
           02  FILLER REDEFINES DLMOSYRF.
             03 DLMOSYRA    PICTURE X.
           02  DLMOSYRI  PIC X(3).
           02  DLDAYSL    COMP  PIC  S9(4).
           02  DLDAYSF    PICTURE X.
           02  FILLER REDEFINES DLDAYSF.
             03 DLDAYSA    PICTURE X.
           02  DLDAYSI  PIC X(3).
           02  DLERRORL    COMP  PIC  S9(4).
           02  DLERRORF    PICTURE X.
           02  FILLER REDEFINES DLERRORF.
             03 DLERRORA    PICTURE X.
           02  DLERRORI  PIC X(79).
       01  FIDL20AO REDEFINES FIDL20AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DLTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DLDATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  DLTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DLCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLDEALO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DLLINEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DLCLASSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLPOSTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLSHORTO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DLSSNCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLSSPFXO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLSSNBRO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  DLSSSUFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLPHONEO  PIC X(14).
           02  FILLER PICTURE X(3).
           02  DLBRNCHO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLDTESTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DLDTNASO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DLFREQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLMOSYRO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLDAYSO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLERRORO  PIC X(79).