       01  FIDL01AI.
           02  FILLER PIC X(12).
           02  DLTRANL    COMP  PIC  S9(4).
           02  DLTRANF    PICTURE X.
           02  FILLER REDEFINES DLTRANF.
             03 DLTRANA    PICTURE X.
           02  DLTRANI  PIC X(4).
           02  DLDATEL    COMP  PIC  S9(4).
           02  DLDATEF    PICTURE X.
           02  FILLER REDEFINES DLDATEF.
             03 DLDATEA    PICTURE X.
           02  DLDATEI  PIC X(8).
           02  DLTIMEL    COMP  PIC  S9(4).
           02  DLTIMEF    PICTURE X.
           02  FILLER REDEFINES DLTIMEF.
             03 DLTIMEA    PICTURE X.
           02  DLTIMEI  PIC X(8).
           02  DLCTL2L    COMP  PIC  S9(4).
           02  DLCTL2F    PICTURE X.
           02  FILLER REDEFINES DLCTL2F.
             03 DLCTL2A    PICTURE X.
           02  DLCTL2I  PIC X(3).
           02  DLCTL3L    COMP  PIC  S9(4).
           02  DLCTL3F    PICTURE X.
           02  FILLER REDEFINES DLCTL3F.
             03 DLCTL3A    PICTURE X.
           02  DLCTL3I  PIC X(3).
           02  DLDEALL    COMP  PIC  S9(4).
           02  DLDEALF    PICTURE X.
           02  FILLER REDEFINES DLDEALF.
             03 DLDEALA    PICTURE X.
           02  DLDEALI  PIC X(7).
           02  DLLINEL    COMP  PIC  S9(4).
           02  DLLINEF    PICTURE X.
           02  FILLER REDEFINES DLLINEF.
             03 DLLINEA    PICTURE X.
           02  DLLINEI  PIC X(2).
           02  DLCLASSL    COMP  PIC  S9(4).
           02  DLCLASSF    PICTURE X.
           02  FILLER REDEFINES DLCLASSF.
             03 DLCLASSA    PICTURE X.
           02  DLCLASSI  PIC X(1).
           02  DLFADDRL    COMP  PIC  S9(4).
           02  DLFADDRF    PICTURE X.
           02  FILLER REDEFINES DLFADDRF.
             03 DLFADDRA    PICTURE X.
           02  DLFADDRI  PIC X(1).
           02  DLNA1CL    COMP  PIC  S9(4).
           02  DLNA1CF    PICTURE X.
           02  FILLER REDEFINES DLNA1CF.
             03 DLNA1CA    PICTURE X.
           02  DLNA1CI  PIC X(1).
           02  DLNA1NL    COMP  PIC  S9(4).
           02  DLNA1NF    PICTURE X.
           02  FILLER REDEFINES DLNA1NF.
             03 DLNA1NA    PICTURE X.
           02  DLNA1NI  PIC X(32).
           02  DLNA2CL    COMP  PIC  S9(4).
           02  DLNA2CF    PICTURE X.
           02  FILLER REDEFINES DLNA2CF.
             03 DLNA2CA    PICTURE X.
           02  DLNA2CI  PIC X(1).
           02  DLNA2NL    COMP  PIC  S9(4).
           02  DLNA2NF    PICTURE X.
           02  FILLER REDEFINES DLNA2NF.
             03 DLNA2NA    PICTURE X.
           02  DLNA2NI  PIC X(32).
           02  DLNA3CL    COMP  PIC  S9(4).
           02  DLNA3CF    PICTURE X.
           02  FILLER REDEFINES DLNA3CF.
             03 DLNA3CA    PICTURE X.
           02  DLNA3CI  PIC X(1).
           02  DLNA3NL    COMP  PIC  S9(4).
           02  DLNA3NF    PICTURE X.
           02  FILLER REDEFINES DLNA3NF.
             03 DLNA3NA    PICTURE X.
           02  DLNA3NI  PIC X(32).
           02  DLNA4CL    COMP  PIC  S9(4).
           02  DLNA4CF    PICTURE X.
           02  FILLER REDEFINES DLNA4CF.
             03 DLNA4CA    PICTURE X.
           02  DLNA4CI  PIC X(1).
           02  DLNA4NL    COMP  PIC  S9(4).
           02  DLNA4NF    PICTURE X.
           02  FILLER REDEFINES DLNA4NF.
             03 DLNA4NA    PICTURE X.
           02  DLNA4NI  PIC X(32).
           02  DLNA5CL    COMP  PIC  S9(4).
           02  DLNA5CF    PICTURE X.
           02  FILLER REDEFINES DLNA5CF.
             03 DLNA5CA    PICTURE X.
           02  DLNA5CI  PIC X(1).
           02  DLNA5NL    COMP  PIC  S9(4).
           02  DLNA5NF    PICTURE X.
           02  FILLER REDEFINES DLNA5NF.
             03 DLNA5NA    PICTURE X.
           02  DLNA5NI  PIC X(32).
           02  DLNA6CL    COMP  PIC  S9(4).
           02  DLNA6CF    PICTURE X.
           02  FILLER REDEFINES DLNA6CF.
             03 DLNA6CA    PICTURE X.
           02  DLNA6CI  PIC X(1).
           02  DLNA6NL    COMP  PIC  S9(4).
           02  DLNA6NF    PICTURE X.
           02  FILLER REDEFINES DLNA6NF.
             03 DLNA6NA    PICTURE X.
           02  DLNA6NI  PIC X(32).
           02  DLZIPL    COMP  PIC  S9(4).
           02  DLZIPF    PICTURE X.
           02  FILLER REDEFINES DLZIPF.
             03 DLZIPA    PICTURE X.
           02  DLZIPI  PIC X(10).
           02  DLSHTNML    COMP  PIC  S9(4).
           02  DLSHTNMF    PICTURE X.
           02  FILLER REDEFINES DLSHTNMF.
             03 DLSHTNMA    PICTURE X.
           02  DLSHTNMI  PIC X(13).
           02  DLSSNCDL    COMP  PIC  S9(4).
           02  DLSSNCDF    PICTURE X.
           02  FILLER REDEFINES DLSSNCDF.
             03 DLSSNCDA    PICTURE X.
           02  DLSSNCDI  PIC X(1).
           02  DLSSPFXL    COMP  PIC  S9(4).
           02  DLSSPFXF    PICTURE X.
           02  FILLER REDEFINES DLSSPFXF.
             03 DLSSPFXA    PICTURE X.
           02  DLSSPFXI  PIC X(1).
           02  DLSSNBRL    COMP  PIC  S9(4).
           02  DLSSNBRF    PICTURE X.
           02  FILLER REDEFINES DLSSNBRF.
             03 DLSSNBRA    PICTURE X.
           02  DLSSNBRI  PIC X(9).
           02  DLSSSUFL    COMP  PIC  S9(4).
           02  DLSSSUFF    PICTURE X.
           02  FILLER REDEFINES DLSSSUFF.
             03 DLSSSUFA    PICTURE X.
           02  DLSSSUFI  PIC X(1).
           02  DLESTDTL    COMP  PIC  S9(4).
           02  DLESTDTF    PICTURE X.
           02  FILLER REDEFINES DLESTDTF.
             03 DLESTDTA    PICTURE X.
           02  DLESTDTI  PIC X(6).
           02  DLPHONEL    COMP  PIC  S9(4).
           02  DLPHONEF    PICTURE X.
           02  FILLER REDEFINES DLPHONEF.
             03 DLPHONEA    PICTURE X.
           02  DLPHONEI  PIC X(14).
           02  DLBRNCHL    COMP  PIC  S9(4).
           02  DLBRNCHF    PICTURE X.
           02  FILLER REDEFINES DLBRNCHF.
             03 DLBRNCHA    PICTURE X.
           02  DLBRNCHI  PIC X(3).
           02  DLSTMTL    COMP  PIC  S9(4).
           02  DLSTMTF    PICTURE X.
           02  FILLER REDEFINES DLSTMTF.
             03 DLSTMTA    PICTURE X.
           02  DLSTMTI  PIC X(6).
           02  DLFREQL    COMP  PIC  S9(4).
           02  DLFREQF    PICTURE X.
           02  FILLER REDEFINES DLFREQF.
             03 DLFREQA    PICTURE X.
           02  DLFREQI  PIC X(1).
           02  DLINCRL    COMP  PIC  S9(4).
           02  DLINCRF    PICTURE X.
           02  FILLER REDEFINES DLINCRF.
             03 DLINCRA    PICTURE X.
           02  DLINCRI  PIC X(3).
           02  DLDAYSL    COMP  PIC  S9(4).
           02  DLDAYSF    PICTURE X.
           02  FILLER REDEFINES DLDAYSF.
             03 DLDAYSA    PICTURE X.
           02  DLDAYSI  PIC X(3).
           02  DLERRORL    COMP  PIC  S9(4).
           02  DLERRORF    PICTURE X.
           02  FILLER REDEFINES DLERRORF.
             03 DLERRORA    PICTURE X.
           02  DLERRORI  PIC X(79).
       01  FIDL01AO REDEFINES FIDL01AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DLTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DLDATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  DLTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DLCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLDEALO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DLLINEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DLCLASSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLFADDRO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLNA1CO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLNA1NO  PIC X(32).
           02  FILLER PICTURE X(3).
           02  DLNA2CO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLNA2NO  PIC X(32).
           02  FILLER PICTURE X(3).
           02  DLNA3CO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLNA3NO  PIC X(32).
           02  FILLER PICTURE X(3).
           02  DLNA4CO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLNA4NO  PIC X(32).
           02  FILLER PICTURE X(3).
           02  DLNA5CO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLNA5NO  PIC X(32).
           02  FILLER PICTURE X(3).
           02  DLNA6CO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLNA6NO  PIC X(32).
           02  FILLER PICTURE X(3).
           02  DLZIPO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DLSHTNMO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DLSSNCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLSSPFXO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLSSNBRO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  DLSSSUFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLESTDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DLPHONEO  PIC X(14).
           02  FILLER PICTURE X(3).
           02  DLBRNCHO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLSTMTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  DLFREQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLINCRO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLDAYSO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLERRORO  PIC X(79).