       01  FIDL99AI.
           02  FILLER PIC X(12).
           02  DLTRANL    COMP  PIC  S9(4).
           02  DLTRANF    PICTURE X.
           02  FILLER REDEFINES DLTRANF.
             03 DLTRANA    PICTURE X.
           02  DLTRANI  PIC X(4).
           02  DLDATEL    COMP  PIC  S9(4).
           02  DLDATEF    PICTURE X.
           02  FILLER REDEFINES DLDATEF.
             03 DLDATEA    PICTURE X.
           02  DLDATEI  PIC X(8).
           02  DLTIMEL    COMP  PIC  S9(4).
           02  DLTIMEF    PICTURE X.
           02  FILLER REDEFINES DLTIMEF.
             03 DLTIMEA    PICTURE X.
           02  DLTIMEI  PIC X(8).
           02  DLCTL2L    COMP  PIC  S9(4).
           02  DLCTL2F    PICTURE X.
           02  FILLER REDEFINES DLCTL2F.
             03 DLCTL2A    PICTURE X.
           02  DLCTL2I  PIC X(3).
           02  DLCTL3L    COMP  PIC  S9(4).
           02  DLCTL3F    PICTURE X.
           02  FILLER REDEFINES DLCTL3F.
             03 DLCTL3A    PICTURE X.
           02  DLCTL3I  PIC X(3).
           02  DLDEALL    COMP  PIC  S9(4).
           02  DLDEALF    PICTURE X.
           02  FILLER REDEFINES DLDEALF.
             03 DLDEALA    PICTURE X.
           02  DLDEALI  PIC X(7).
           02  DLLINEL    COMP  PIC  S9(4).
           02  DLLINEF    PICTURE X.
           02  FILLER REDEFINES DLLINEF.
             03 DLLINEA    PICTURE X.
           02  DLLINEI  PIC X(2).
           02  DLCLASSL    COMP  PIC  S9(4).
           02  DLCLASSF    PICTURE X.
           02  FILLER REDEFINES DLCLASSF.
             03 DLCLASSA    PICTURE X.
           02  DLCLASSI  PIC X(1).
           02  DLOFFL    COMP  PIC  S9(4).
           02  DLOFFF    PICTURE X.
           02  FILLER REDEFINES DLOFFF.
             03 DLOFFA    PICTURE X.
           02  DLOFFI  PIC X(3).
           02  DLERRORL    COMP  PIC  S9(4).
           02  DLERRORF    PICTURE X.
           02  FILLER REDEFINES DLERRORF.
             03 DLERRORA    PICTURE X.
           02  DLERRORI  PIC X(79).
       01  FIDL99AO REDEFINES FIDL99AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  DLTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DLDATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  DLTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  DLCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLDEALO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  DLLINEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DLCLASSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DLOFFO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DLERRORO  PIC X(79).