       01  FIFMIPDI.
           02  FILLER PIC X(12).
           02  FMFLLR1L    COMP  PIC  S9(4).
           02  FMFLLR1F    PICTURE X.
           02  FILLER REDEFINES FMFLLR1F.
             03 FMFLLR1A    PICTURE X.
           02  FMFLLR1I  PIC X(239).
           02  FMFLLR2L    COMP  PIC  S9(4).
           02  FMFLLR2F    PICTURE X.
           02  FILLER REDEFINES FMFLLR2F.
             03 FMFLLR2A    PICTURE X.
           02  FMFLLR2I  PIC X(239).
           02  FMFLLR3L    COMP  PIC  S9(4).
           02  FMFLLR3F    PICTURE X.
           02  FILLER REDEFINES FMFLLR3F.
             03 FMFLLR3A    PICTURE X.
           02  FMFLLR3I  PIC X(239).
           02  FMFLLR4L    COMP  PIC  S9(4).
           02  FMFLLR4F    PICTURE X.
           02  FILLER REDEFINES FMFLLR4F.
             03 FMFLLR4A    PICTURE X.
           02  FMFLLR4I  PIC X(239).
           02  FMFLLR5L    COMP  PIC  S9(4).
           02  FMFLLR5F    PICTURE X.
           02  FILLER REDEFINES FMFLLR5F.
             03 FMFLLR5A    PICTURE X.
           02  FMFLLR5I  PIC X(239).
           02  FMFLLR6L    COMP  PIC  S9(4).
           02  FMFLLR6F    PICTURE X.
           02  FILLER REDEFINES FMFLLR6F.
             03 FMFLLR6A    PICTURE X.
           02  FMFLLR6I  PIC X(239).
           02  FMFLLR7L    COMP  PIC  S9(4).
           02  FMFLLR7F    PICTURE X.
           02  FILLER REDEFINES FMFLLR7F.
             03 FMFLLR7A    PICTURE X.
           02  FMFLLR7I  PIC X(239).
           02  FMFLLR8L    COMP  PIC  S9(4).
           02  FMFLLR8F    PICTURE X.
           02  FILLER REDEFINES FMFLLR8F.
             03 FMFLLR8A    PICTURE X.
           02  FMFLLR8I  PIC X(220).
       01  FIFMIPDO REDEFINES FIFMIPDI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMFLLR1O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR2O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR3O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR4O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR5O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR6O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR7O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR8O  PIC X(220).
       01  FIFMIPBI REDEFINES FIFMIPDI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMRCL    COMP  PIC  S9(4).
           02  FMRCF    PICTURE X.
           02  FILLER REDEFINES FMRCF.
             03 FMRCA    PICTURE X.
           02  FMRCI  PIC X(10).
           02  FMACCTL    COMP  PIC  S9(4).
           02  FMACCTF    PICTURE X.
           02  FILLER REDEFINES FMACCTF.
             03 FMACCTA    PICTURE X.
           02  FMACCTI  PIC X(10).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFMIPBO REDEFINES FIFMIPBI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).
       01  FIFMIPCI REDEFINES FIFMIPDI.
           02  FILLER PIC X(12).
           02  FMTRIDCL    COMP  PIC  S9(4).
           02  FMTRIDCF    PICTURE X.
           02  FILLER REDEFINES FMTRIDCF.
             03 FMTRIDCA    PICTURE X.
           02  FMTRIDCI  PIC X(4).
           02  FMDATECL    COMP  PIC  S9(4).
           02  FMDATECF    PICTURE X.
           02  FILLER REDEFINES FMDATECF.
             03 FMDATECA    PICTURE X.
           02  FMDATECI  PIC X(8).
           02  FMTIMECL    COMP  PIC  S9(4).
           02  FMTIMECF    PICTURE X.
           02  FILLER REDEFINES FMTIMECF.
             03 FMTIMECA    PICTURE X.
           02  FMTIMECI  PIC X(8).
           02  FMRCCL    COMP  PIC  S9(4).
           02  FMRCCF    PICTURE X.
           02  FILLER REDEFINES FMRCCF.
             03 FMRCCA    PICTURE X.
           02  FMRCCI  PIC X(10).
           02  FMACCTCL    COMP  PIC  S9(4).
           02  FMACCTCF    PICTURE X.
           02  FILLER REDEFINES FMACCTCF.
             03 FMACCTCA    PICTURE X.
           02  FMACCTCI  PIC X(10).
           02  FMCUSTCL    COMP  PIC  S9(4).
           02  FMCUSTCF    PICTURE X.
           02  FILLER REDEFINES FMCUSTCF.
             03 FMCUSTCA    PICTURE X.
           02  FMCUSTCI  PIC X(4).
           02  FMAMLITL    COMP  PIC  S9(4).
           02  FMAMLITF    PICTURE X.
           02  FILLER REDEFINES FMAMLITF.
             03 FMAMLITA    PICTURE X.
           02  FMAMLITI  PIC X(16).
           02  FMAMAMTL    COMP  PIC  S9(4).
           02  FMAMAMTF    PICTURE X.
           02  FILLER REDEFINES FMAMAMTF.
             03 FMAMAMTA    PICTURE X.
           02  FMAMAMTI  PIC X(16).
           02  FMMO01L    COMP  PIC  S9(4).
           02  FMMO01F    PICTURE X.
           02  FILLER REDEFINES FMMO01F.
             03 FMMO01A    PICTURE X.
           02  FMMO01I  PIC X(10).
           02  FMAMT01L    COMP  PIC  S9(4).
           02  FMAMT01F    PICTURE X.
           02  FILLER REDEFINES FMAMT01F.
             03 FMAMT01A    PICTURE X.
           02  FMAMT01I  PIC X(16).
           02  FMMO02L    COMP  PIC  S9(4).
           02  FMMO02F    PICTURE X.
           02  FILLER REDEFINES FMMO02F.
             03 FMMO02A    PICTURE X.
           02  FMMO02I  PIC X(10).
           02  FMAMT02L    COMP  PIC  S9(4).
           02  FMAMT02F    PICTURE X.
           02  FILLER REDEFINES FMAMT02F.
             03 FMAMT02A    PICTURE X.
           02  FMAMT02I  PIC X(16).
           02  FMMO03L    COMP  PIC  S9(4).
           02  FMMO03F    PICTURE X.
           02  FILLER REDEFINES FMMO03F.
             03 FMMO03A    PICTURE X.
           02  FMMO03I  PIC X(10).
           02  FMAMT03L    COMP  PIC  S9(4).
           02  FMAMT03F    PICTURE X.
           02  FILLER REDEFINES FMAMT03F.
             03 FMAMT03A    PICTURE X.
           02  FMAMT03I  PIC X(16).
           02  FMMO04L    COMP  PIC  S9(4).
           02  FMMO04F    PICTURE X.
           02  FILLER REDEFINES FMMO04F.
             03 FMMO04A    PICTURE X.
           02  FMMO04I  PIC X(10).
           02  FMAMT04L    COMP  PIC  S9(4).
           02  FMAMT04F    PICTURE X.
           02  FILLER REDEFINES FMAMT04F.
             03 FMAMT04A    PICTURE X.
           02  FMAMT04I  PIC X(16).
           02  FMMO05L    COMP  PIC  S9(4).
           02  FMMO05F    PICTURE X.
           02  FILLER REDEFINES FMMO05F.
             03 FMMO05A    PICTURE X.
           02  FMMO05I  PIC X(10).
           02  FMAMT05L    COMP  PIC  S9(4).
           02  FMAMT05F    PICTURE X.
           02  FILLER REDEFINES FMAMT05F.
             03 FMAMT05A    PICTURE X.
           02  FMAMT05I  PIC X(16).
           02  FMMO06L    COMP  PIC  S9(4).
           02  FMMO06F    PICTURE X.
           02  FILLER REDEFINES FMMO06F.
             03 FMMO06A    PICTURE X.
           02  FMMO06I  PIC X(10).
           02  FMAMT06L    COMP  PIC  S9(4).
           02  FMAMT06F    PICTURE X.
           02  FILLER REDEFINES FMAMT06F.
             03 FMAMT06A    PICTURE X.
           02  FMAMT06I  PIC X(16).
           02  FMMO07L    COMP  PIC  S9(4).
           02  FMMO07F    PICTURE X.
           02  FILLER REDEFINES FMMO07F.
             03 FMMO07A    PICTURE X.
           02  FMMO07I  PIC X(10).
           02  FMAMT07L    COMP  PIC  S9(4).
           02  FMAMT07F    PICTURE X.
           02  FILLER REDEFINES FMAMT07F.
             03 FMAMT07A    PICTURE X.
           02  FMAMT07I  PIC X(16).
           02  FMMO08L    COMP  PIC  S9(4).
           02  FMMO08F    PICTURE X.
           02  FILLER REDEFINES FMMO08F.
             03 FMMO08A    PICTURE X.
           02  FMMO08I  PIC X(10).
           02  FMAMT08L    COMP  PIC  S9(4).
           02  FMAMT08F    PICTURE X.
           02  FILLER REDEFINES FMAMT08F.
             03 FMAMT08A    PICTURE X.
           02  FMAMT08I  PIC X(16).
           02  FMMO09L    COMP  PIC  S9(4).
           02  FMMO09F    PICTURE X.
           02  FILLER REDEFINES FMMO09F.
             03 FMMO09A    PICTURE X.
           02  FMMO09I  PIC X(10).
           02  FMAMT09L    COMP  PIC  S9(4).
           02  FMAMT09F    PICTURE X.
           02  FILLER REDEFINES FMAMT09F.
             03 FMAMT09A    PICTURE X.
           02  FMAMT09I  PIC X(16).
           02  FMMO10L    COMP  PIC  S9(4).
           02  FMMO10F    PICTURE X.
           02  FILLER REDEFINES FMMO10F.
             03 FMMO10A    PICTURE X.
           02  FMMO10I  PIC X(10).
           02  FMAMT10L    COMP  PIC  S9(4).
           02  FMAMT10F    PICTURE X.
           02  FILLER REDEFINES FMAMT10F.
             03 FMAMT10A    PICTURE X.
           02  FMAMT10I  PIC X(16).
           02  FMMO11L    COMP  PIC  S9(4).
           02  FMMO11F    PICTURE X.
           02  FILLER REDEFINES FMMO11F.
             03 FMMO11A    PICTURE X.
           02  FMMO11I  PIC X(10).
           02  FMAMT11L    COMP  PIC  S9(4).
           02  FMAMT11F    PICTURE X.
           02  FILLER REDEFINES FMAMT11F.
             03 FMAMT11A    PICTURE X.
           02  FMAMT11I  PIC X(16).
           02  FMMO12L    COMP  PIC  S9(4).
           02  FMMO12F    PICTURE X.
           02  FILLER REDEFINES FMMO12F.
             03 FMMO12A    PICTURE X.
           02  FMMO12I  PIC X(10).
           02  FMAMT12L    COMP  PIC  S9(4).
           02  FMAMT12F    PICTURE X.
           02  FILLER REDEFINES FMAMT12F.
             03 FMAMT12A    PICTURE X.
           02  FMAMT12I  PIC X(16).
           02  FMERRL    COMP  PIC  S9(4).
           02  FMERRF    PICTURE X.
           02  FILLER REDEFINES FMERRF.
             03 FMERRA    PICTURE X.
           02  FMERRI  PIC X(79).
       01  FIFMIPCO REDEFINES FIFMIPCI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSTCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMAMLITO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMAMAMTO PIC Z(14)9-.
           02  FILLER PICTURE X(3).
           02  FMMO01O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT01O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO02O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT02O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO03O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT03O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO04O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT04O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO05O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT05O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO06O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT06O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO07O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT07O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO08O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT08O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO09O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT09O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO10O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT10O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO11O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT11O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMMO12O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMT12O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMERRO  PIC X(79).