       01  FIFMMTDI.
           02  FILLER PIC X(12).
           02  FMFLLR1L    COMP  PIC  S9(4).
           02  FMFLLR1F    PICTURE X.
           02  FILLER REDEFINES FMFLLR1F.
             03 FMFLLR1A    PICTURE X.
           02  FMFLLR1I  PIC X(239).
           02  FMFLLR2L    COMP  PIC  S9(4).
           02  FMFLLR2F    PICTURE X.
           02  FILLER REDEFINES FMFLLR2F.
             03 FMFLLR2A    PICTURE X.
           02  FMFLLR2I  PIC X(239).
           02  FMFLLR3L    COMP  PIC  S9(4).
           02  FMFLLR3F    PICTURE X.
           02  FILLER REDEFINES FMFLLR3F.
             03 FMFLLR3A    PICTURE X.
           02  FMFLLR3I  PIC X(239).
           02  FMFLLR4L    COMP  PIC  S9(4).
           02  FMFLLR4F    PICTURE X.
           02  FILLER REDEFINES FMFLLR4F.
             03 FMFLLR4A    PICTURE X.
           02  FMFLLR4I  PIC X(239).
           02  FMFLLR5L    COMP  PIC  S9(4).
           02  FMFLLR5F    PICTURE X.
           02  FILLER REDEFINES FMFLLR5F.
             03 FMFLLR5A    PICTURE X.
           02  FMFLLR5I  PIC X(239).
           02  FMFLLR6L    COMP  PIC  S9(4).
           02  FMFLLR6F    PICTURE X.
           02  FILLER REDEFINES FMFLLR6F.
             03 FMFLLR6A    PICTURE X.
           02  FMFLLR6I  PIC X(239).
           02  FMFLLR7L    COMP  PIC  S9(4).
           02  FMFLLR7F    PICTURE X.
           02  FILLER REDEFINES FMFLLR7F.
             03 FMFLLR7A    PICTURE X.
           02  FMFLLR7I  PIC X(239).
           02  FMFLLR8L    COMP  PIC  S9(4).
           02  FMFLLR8F    PICTURE X.
           02  FILLER REDEFINES FMFLLR8F.
             03 FMFLLR8A    PICTURE X.
           02  FMFLLR8I  PIC X(220).
       01  FIFMMTDO REDEFINES FIFMMTDI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMFLLR1O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR2O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR3O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR4O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR5O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR6O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR7O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR8O  PIC X(220).
       01  FIFMMTBI REDEFINES FIFMMTDI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMBTCHBL    COMP  PIC  S9(4).
           02  FMBTCHBF    PICTURE X.
           02  FILLER REDEFINES FMBTCHBF.
             03 FMBTCHBA    PICTURE X.
           02  FMBTCHBI  PIC X(5).
           02  FMDEPTBL    COMP  PIC  S9(4).
           02  FMDEPTBF    PICTURE X.
           02  FILLER REDEFINES FMDEPTBF.
             03 FMDEPTBA    PICTURE X.
           02  FMDEPTBI  PIC X(3).
           02  FMCUSTBL    COMP  PIC  S9(4).
           02  FMCUSTBF    PICTURE X.
           02  FILLER REDEFINES FMCUSTBF.
             03 FMCUSTBA    PICTURE X.
           02  FMCUSTBI  PIC X(4).
           02  FMPFKBL    COMP  PIC  S9(4).
           02  FMPFKBF    PICTURE X.
           02  FILLER REDEFINES FMPFKBF.
             03 FMPFKBA    PICTURE X.
           02  FMPFKBI  PIC X(75).
           02  FMERRBL    COMP  PIC  S9(4).
           02  FMERRBF    PICTURE X.
           02  FILLER REDEFINES FMERRBF.
             03 FMERRBA    PICTURE X.
           02  FMERRBI  PIC X(79).
       01  FIFMMTBO REDEFINES FIFMMTBI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMBTCHBO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  FMDEPTBO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMCUSTBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMPFKBO  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMERRBO  PIC X(79).
       01  FIFMMTCI REDEFINES FIFMMTDI.
           02  FILLER PIC X(12).
           02  FMTRIDCL    COMP  PIC  S9(4).
           02  FMTRIDCF    PICTURE X.
           02  FILLER REDEFINES FMTRIDCF.
             03 FMTRIDCA    PICTURE X.
           02  FMTRIDCI  PIC X(4).
           02  FMDATECL    COMP  PIC  S9(4).
           02  FMDATECF    PICTURE X.
           02  FILLER REDEFINES FMDATECF.
             03 FMDATECA    PICTURE X.
           02  FMDATECI  PIC X(8).
           02  FMTIMECL    COMP  PIC  S9(4).
           02  FMTIMECF    PICTURE X.
           02  FILLER REDEFINES FMTIMECF.
             03 FMTIMECA    PICTURE X.
           02  FMTIMECI  PIC X(8).
           02  FMBATCHL    COMP  PIC  S9(4).
           02  FMBATCHF    PICTURE X.
           02  FILLER REDEFINES FMBATCHF.
             03 FMBATCHA    PICTURE X.
           02  FMBATCHI  PIC X(5).
           02  FMDEPTL    COMP  PIC  S9(4).
           02  FMDEPTF    PICTURE X.
           02  FILLER REDEFINES FMDEPTF.
             03 FMDEPTA    PICTURE X.
           02  FMDEPTI  PIC X(3).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMFUNCL    COMP  PIC  S9(4).
           02  FMFUNCF    PICTURE X.
           02  FILLER REDEFINES FMFUNCF.
             03 FMFUNCA    PICTURE X.
           02  FMFUNCI  PIC X(1).
           02  FMTYPEL    COMP  PIC  S9(4).
           02  FMTYPEF    PICTURE X.
           02  FILLER REDEFINES FMTYPEF.
             03 FMTYPEA    PICTURE X.
           02  FMTYPEI  PIC X(13).
           02  FMDATELL    COMP  PIC  S9(4).
           02  FMDATELF    PICTURE X.
           02  FILLER REDEFINES FMDATELF.
             03 FMDATELA    PICTURE X.
           02  FMDATELI  PIC X(11).
           02  FMDATE3L    COMP  PIC  S9(4).
           02  FMDATE3F    PICTURE X.
           02  FILLER REDEFINES FMDATE3F.
             03 FMDATE3A    PICTURE X.
           02  FMDATE3I  PIC X(8).
           02  FMPERMLL    COMP  PIC  S9(4).
           02  FMPERMLF    PICTURE X.
           02  FILLER REDEFINES FMPERMLF.
             03 FMPERMLA    PICTURE X.
           02  FMPERMLI  PIC X(15).
           02  FMFDATLL    COMP  PIC  S9(4).
           02  FMFDATLF    PICTURE X.
           02  FILLER REDEFINES FMFDATLF.
             03 FMFDATLA    PICTURE X.
           02  FMFDATLI  PIC X(9).
           02  FMFDATL    COMP  PIC  S9(4).
           02  FMFDATF    PICTURE X.
           02  FILLER REDEFINES FMFDATF.
             03 FMFDATA    PICTURE X.
           02  FMFDATI  PIC X(8).
           02  FMCNTRLL    COMP  PIC  S9(4).
           02  FMCNTRLF    PICTURE X.
           02  FILLER REDEFINES FMCNTRLF.
             03 FMCNTRLA    PICTURE X.
           02  FMCNTRLI  PIC X(65).
           02  FMENTERL    COMP  PIC  S9(4).
           02  FMENTERF    PICTURE X.
           02  FILLER REDEFINES FMENTERF.
             03 FMENTERA    PICTURE X.
           02  FMENTERI  PIC X(65).
           02  FMDIFFL    COMP  PIC  S9(4).
           02  FMDIFFF    PICTURE X.
           02  FILLER REDEFINES FMDIFFF.
             03 FMDIFFA    PICTURE X.
           02  FMDIFFI  PIC X(55).
           02  FMSTATL    COMP  PIC  S9(4).
           02  FMSTATF    PICTURE X.
           02  FILLER REDEFINES FMSTATF.
             03 FMSTATA    PICTURE X.
           02  FMSTATI  PIC X(60).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFMMTCO REDEFINES FIFMMTCI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMBATCHO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  FMDEPTO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMFUNCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTYPEO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  FMDATELO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  FMDATE3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPERMLO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMFDATLO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMFDATO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCNTRLO  PIC X(65).
           02  FILLER PICTURE X(3).
           02  FMENTERO  PIC X(65).
           02  FILLER PICTURE X(3).
           02  FMDIFFO  PIC X(55).
           02  FILLER PICTURE X(3).
           02  FMSTATO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).