       01  FIFM01DI.
           02  FILLER PIC X(12).
           02  FMFLLR1L    COMP  PIC  S9(4).
           02  FMFLLR1F    PICTURE X.
           02  FILLER REDEFINES FMFLLR1F.
             03 FMFLLR1A    PICTURE X.
           02  FMFLLR1I  PIC X(239).
           02  FMFLLR2L    COMP  PIC  S9(4).
           02  FMFLLR2F    PICTURE X.
           02  FILLER REDEFINES FMFLLR2F.
             03 FMFLLR2A    PICTURE X.
           02  FMFLLR2I  PIC X(239).
           02  FMFLLR3L    COMP  PIC  S9(4).
           02  FMFLLR3F    PICTURE X.
           02  FILLER REDEFINES FMFLLR3F.
             03 FMFLLR3A    PICTURE X.
           02  FMFLLR3I  PIC X(239).
           02  FMFLLR4L    COMP  PIC  S9(4).
           02  FMFLLR4F    PICTURE X.
           02  FILLER REDEFINES FMFLLR4F.
             03 FMFLLR4A    PICTURE X.
           02  FMFLLR4I  PIC X(239).
           02  FMFLLR5L    COMP  PIC  S9(4).
           02  FMFLLR5F    PICTURE X.
           02  FILLER REDEFINES FMFLLR5F.
             03 FMFLLR5A    PICTURE X.
           02  FMFLLR5I  PIC X(239).
           02  FMFLLR6L    COMP  PIC  S9(4).
           02  FMFLLR6F    PICTURE X.
           02  FILLER REDEFINES FMFLLR6F.
             03 FMFLLR6A    PICTURE X.
           02  FMFLLR6I  PIC X(239).
           02  FMFLLR7L    COMP  PIC  S9(4).
           02  FMFLLR7F    PICTURE X.
           02  FILLER REDEFINES FMFLLR7F.
             03 FMFLLR7A    PICTURE X.
           02  FMFLLR7I  PIC X(239).
           02  FMFLLR8L    COMP  PIC  S9(4).
           02  FMFLLR8F    PICTURE X.
           02  FILLER REDEFINES FMFLLR8F.
             03 FMFLLR8A    PICTURE X.
           02  FMFLLR8I  PIC X(220).
       01  FIFM01DO REDEFINES FIFM01DI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMFLLR1O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR2O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR3O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR4O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR5O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR6O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR7O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR8O  PIC X(220).
       01  FIFM01BI REDEFINES FIFM01DI.
           02  FILLER PIC X(12).
           02  FMTRIDBL    COMP  PIC  S9(4).
           02  FMTRIDBF    PICTURE X.
           02  FILLER REDEFINES FMTRIDBF.
             03 FMTRIDBA    PICTURE X.
           02  FMTRIDBI  PIC X(4).
           02  FMDATEBL    COMP  PIC  S9(4).
           02  FMDATEBF    PICTURE X.
           02  FILLER REDEFINES FMDATEBF.
             03 FMDATEBA    PICTURE X.
           02  FMDATEBI  PIC X(8).
           02  FMTIMEBL    COMP  PIC  S9(4).
           02  FMTIMEBF    PICTURE X.
           02  FILLER REDEFINES FMTIMEBF.
             03 FMTIMEBA    PICTURE X.
           02  FMTIMEBI  PIC X(8).
           02  FMRCBL    COMP  PIC  S9(4).
           02  FMRCBF    PICTURE X.
           02  FILLER REDEFINES FMRCBF.
             03 FMRCBA    PICTURE X.
           02  FMRCBI  PIC X(10).
           02  FMACCTBL    COMP  PIC  S9(4).
           02  FMACCTBF    PICTURE X.
           02  FILLER REDEFINES FMACCTBF.
             03 FMACCTBA    PICTURE X.
           02  FMACCTBI  PIC X(10).
           02  FMCUSTBL    COMP  PIC  S9(4).
           02  FMCUSTBF    PICTURE X.
           02  FILLER REDEFINES FMCUSTBF.
             03 FMCUSTBA    PICTURE X.
           02  FMCUSTBI  PIC X(4).
           02  FMERRBL    COMP  PIC  S9(4).
           02  FMERRBF    PICTURE X.
           02  FILLER REDEFINES FMERRBF.
             03 FMERRBA    PICTURE X.
           02  FMERRBI  PIC X(79).
       01  FIFM01BO REDEFINES FIFM01BI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSTBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMERRBO  PIC X(79).
       01  FIFM01CI REDEFINES FIFM01DI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMRCL    COMP  PIC  S9(4).
           02  FMRCF    PICTURE X.
           02  FILLER REDEFINES FMRCF.
             03 FMRCA    PICTURE X.
           02  FMRCI  PIC X(10).
           02  FMACCTL    COMP  PIC  S9(4).
           02  FMACCTF    PICTURE X.
           02  FILLER REDEFINES FMACCTF.
             03 FMACCTA    PICTURE X.
           02  FMACCTI  PIC X(10).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMTITLXL    COMP  PIC  S9(4).
           02  FMTITLXF    PICTURE X.
           02  FILLER REDEFINES FMTITLXF.
             03 FMTITLXA    PICTURE X.
           02  FMTITLXI  PIC X(13).
           02  FMTITLEL    COMP  PIC  S9(4).
           02  FMTITLEF    PICTURE X.
           02  FILLER REDEFINES FMTITLEF.
             03 FMTITLEA    PICTURE X.
           02  FMTITLEI  PIC X(40).
           02  FMREGNXL    COMP  PIC  S9(4).
           02  FMREGNXF    PICTURE X.
           02  FILLER REDEFINES FMREGNXF.
             03 FMREGNXA    PICTURE X.
           02  FMREGNXI  PIC X(7).
           02  FMREGNBL    COMP  PIC  S9(4).
           02  FMREGNBF    PICTURE X.
           02  FILLER REDEFINES FMREGNBF.
             03 FMREGNBA    PICTURE X.
           02  FMREGNBI  PIC X(10).
           02  FMTYPXL    COMP  PIC  S9(4).
           02  FMTYPXF    PICTURE X.
           02  FILLER REDEFINES FMTYPXF.
             03 FMTYPXA    PICTURE X.
           02  FMTYPXI  PIC X(4).
           02  FMTYPEL    COMP  PIC  S9(4).
           02  FMTYPEF    PICTURE X.
           02  FILLER REDEFINES FMTYPEF.
             03 FMTYPEA    PICTURE X.
           02  FMTYPEI  PIC X(1).
           02  FMPRTXL    COMP  PIC  S9(4).
           02  FMPRTXF    PICTURE X.
           02  FILLER REDEFINES FMPRTXF.
             03 FMPRTXA    PICTURE X.
           02  FMPRTXI  PIC X(11).
           02  FMPRNTL    COMP  PIC  S9(4).
           02  FMPRNTF    PICTURE X.
           02  FILLER REDEFINES FMPRNTF.
             03 FMPRNTA    PICTURE X.
           02  FMPRNTI  PIC X(1).
           02  FMBRKXL    COMP  PIC  S9(4).
           02  FMBRKXF    PICTURE X.
           02  FILLER REDEFINES FMBRKXF.
             03 FMBRKXA    PICTURE X.
           02  FMBRKXI  PIC X(12).
           02  FMBRKTL    COMP  PIC  S9(4).
           02  FMBRKTF    PICTURE X.
           02  FILLER REDEFINES FMBRKTF.
             03 FMBRKTA    PICTURE X.
           02  FMBRKTI  PIC X(1).
           02  FMDBCXL    COMP  PIC  S9(4).
           02  FMDBCXF    PICTURE X.
           02  FILLER REDEFINES FMDBCXF.
             03 FMDBCXA    PICTURE X.
           02  FMDBCXI  PIC X(5).
           02  FMDBCRL    COMP  PIC  S9(4).
           02  FMDBCRF    PICTURE X.
           02  FILLER REDEFINES FMDBCRF.
             03 FMDBCRA    PICTURE X.
           02  FMDBCRI  PIC X(1).
           02  FMALFLL    COMP  PIC  S9(4).
           02  FMALFLF    PICTURE X.
           02  FILLER REDEFINES FMALFLF.
             03 FMALFLA    PICTURE X.
           02  FMALFLI  PIC X(1).
           02  FMSORTL    COMP  PIC  S9(4).
           02  FMSORTF    PICTURE X.
           02  FILLER REDEFINES FMSORTF.
             03 FMSORTA    PICTURE X.
           02  FMSORTI  PIC X(1).
           02  FMFR01L    COMP  PIC  S9(4).
           02  FMFR01F    PICTURE X.
           02  FILLER REDEFINES FMFR01F.
             03 FMFR01A    PICTURE X.
           02  FMFR01I  PIC X(1).
           02  FMFR02L    COMP  PIC  S9(4).
           02  FMFR02F    PICTURE X.
           02  FILLER REDEFINES FMFR02F.
             03 FMFR02A    PICTURE X.
           02  FMFR02I  PIC X(1).
           02  FMFR03L    COMP  PIC  S9(4).
           02  FMFR03F    PICTURE X.
           02  FILLER REDEFINES FMFR03F.
             03 FMFR03A    PICTURE X.
           02  FMFR03I  PIC X(1).
           02  FMFR06L    COMP  PIC  S9(4).
           02  FMFR06F    PICTURE X.
           02  FILLER REDEFINES FMFR06F.
             03 FMFR06A    PICTURE X.
           02  FMFR06I  PIC X(1).
           02  FMFR07L    COMP  PIC  S9(4).
           02  FMFR07F    PICTURE X.
           02  FILLER REDEFINES FMFR07F.
             03 FMFR07A    PICTURE X.
           02  FMFR07I  PIC X(1).
           02  FMFR11L    COMP  PIC  S9(4).
           02  FMFR11F    PICTURE X.
           02  FILLER REDEFINES FMFR11F.
             03 FMFR11A    PICTURE X.
           02  FMFR11I  PIC X(2).
           02  FMSRT1L    COMP  PIC  S9(4).
           02  FMSRT1F    PICTURE X.
           02  FILLER REDEFINES FMSRT1F.
             03 FMSRT1A    PICTURE X.
           02  FMSRT1I  PIC X(2).
           02  FMSRT2L    COMP  PIC  S9(4).
           02  FMSRT2F    PICTURE X.
           02  FILLER REDEFINES FMSRT2F.
             03 FMSRT2A    PICTURE X.
           02  FMSRT2I  PIC X(2).
           02  FMSRT3L    COMP  PIC  S9(4).
           02  FMSRT3F    PICTURE X.
           02  FILLER REDEFINES FMSRT3F.
             03 FMSRT3A    PICTURE X.
           02  FMSRT3I  PIC X(2).
           02  FMSRT4L    COMP  PIC  S9(4).
           02  FMSRT4F    PICTURE X.
           02  FILLER REDEFINES FMSRT4F.
             03 FMSRT4A    PICTURE X.
           02  FMSRT4I  PIC X(2).
           02  FMSRT5L    COMP  PIC  S9(4).
           02  FMSRT5F    PICTURE X.
           02  FILLER REDEFINES FMSRT5F.
             03 FMSRT5A    PICTURE X.
           02  FMSRT5I  PIC X(2).
           02  FMRP1L    COMP  PIC  S9(4).
           02  FMRP1F    PICTURE X.
           02  FILLER REDEFINES FMRP1F.
             03 FMRP1A    PICTURE X.
           02  FMRP1I  PIC X(1).
           02  FMRP2L    COMP  PIC  S9(4).
           02  FMRP2F    PICTURE X.
           02  FILLER REDEFINES FMRP2F.
             03 FMRP2A    PICTURE X.
           02  FMRP2I  PIC X(1).
           02  FMRP3L    COMP  PIC  S9(4).
           02  FMRP3F    PICTURE X.
           02  FILLER REDEFINES FMRP3F.
             03 FMRP3A    PICTURE X.
           02  FMRP3I  PIC X(1).
           02  FMRP4L    COMP  PIC  S9(4).
           02  FMRP4F    PICTURE X.
           02  FILLER REDEFINES FMRP4F.
             03 FMRP4A    PICTURE X.
           02  FMRP4I  PIC X(1).
           02  FMRP5L    COMP  PIC  S9(4).
           02  FMRP5F    PICTURE X.
           02  FILLER REDEFINES FMRP5F.
             03 FMRP5A    PICTURE X.
           02  FMRP5I  PIC X(1).
           02  FMRP6L    COMP  PIC  S9(4).
           02  FMRP6F    PICTURE X.
           02  FILLER REDEFINES FMRP6F.
             03 FMRP6A    PICTURE X.
           02  FMRP6I  PIC X(1).
           02  FMRP7L    COMP  PIC  S9(4).
           02  FMRP7F    PICTURE X.
           02  FILLER REDEFINES FMRP7F.
             03 FMRP7A    PICTURE X.
           02  FMRP7I  PIC X(1).
           02  FMRP8L    COMP  PIC  S9(4).
           02  FMRP8F    PICTURE X.
           02  FILLER REDEFINES FMRP8F.
             03 FMRP8A    PICTURE X.
           02  FMRP8I  PIC X(1).
           02  FMRP9L    COMP  PIC  S9(4).
           02  FMRP9F    PICTURE X.
           02  FILLER REDEFINES FMRP9F.
             03 FMRP9A    PICTURE X.
           02  FMRP9I  PIC X(1).
           02  FMRP10L    COMP  PIC  S9(4).
           02  FMRP10F    PICTURE X.
           02  FILLER REDEFINES FMRP10F.
             03 FMRP10A    PICTURE X.
           02  FMRP10I  PIC X(1).
           02  FMRP11L    COMP  PIC  S9(4).
           02  FMRP11F    PICTURE X.
           02  FILLER REDEFINES FMRP11F.
             03 FMRP11A    PICTURE X.
           02  FMRP11I  PIC X(1).
           02  FMRP12L    COMP  PIC  S9(4).
           02  FMRP12F    PICTURE X.
           02  FILLER REDEFINES FMRP12F.
             03 FMRP12A    PICTURE X.
           02  FMRP12I  PIC X(1).
           02  FMRP13L    COMP  PIC  S9(4).
           02  FMRP13F    PICTURE X.
           02  FILLER REDEFINES FMRP13F.
             03 FMRP13A    PICTURE X.
           02  FMRP13I  PIC X(1).
           02  FMRP14L    COMP  PIC  S9(4).
           02  FMRP14F    PICTURE X.
           02  FILLER REDEFINES FMRP14F.
             03 FMRP14A    PICTURE X.
           02  FMRP14I  PIC X(1).
           02  FMRP15L    COMP  PIC  S9(4).
           02  FMRP15F    PICTURE X.
           02  FILLER REDEFINES FMRP15F.
             03 FMRP15A    PICTURE X.
           02  FMRP15I  PIC X(1).
           02  FMRP16L    COMP  PIC  S9(4).
           02  FMRP16F    PICTURE X.
           02  FILLER REDEFINES FMRP16F.
             03 FMRP16A    PICTURE X.
           02  FMRP16I  PIC X(1).
           02  FMRP17L    COMP  PIC  S9(4).
           02  FMRP17F    PICTURE X.
           02  FILLER REDEFINES FMRP17F.
             03 FMRP17A    PICTURE X.
           02  FMRP17I  PIC X(1).
           02  FMRP18L    COMP  PIC  S9(4).
           02  FMRP18F    PICTURE X.
           02  FILLER REDEFINES FMRP18F.
             03 FMRP18A    PICTURE X.
           02  FMRP18I  PIC X(1).
           02  FMRP19L    COMP  PIC  S9(4).
           02  FMRP19F    PICTURE X.
           02  FILLER REDEFINES FMRP19F.
             03 FMRP19A    PICTURE X.
           02  FMRP19I  PIC X(1).
           02  FMRP20L    COMP  PIC  S9(4).
           02  FMRP20F    PICTURE X.
           02  FILLER REDEFINES FMRP20F.
             03 FMRP20A    PICTURE X.
           02  FMRP20I  PIC X(1).
           02  FMSRCL    COMP  PIC  S9(4).
           02  FMSRCF    PICTURE X.
           02  FILLER REDEFINES FMSRCF.
             03 FMSRCA    PICTURE X.
           02  FMSRCI  PIC X(1).
           02  FMSRC1L    COMP  PIC  S9(4).
           02  FMSRC1F    PICTURE X.
           02  FILLER REDEFINES FMSRC1F.
             03 FMSRC1A    PICTURE X.
           02  FMSRC1I  PIC X(3).
           02  FMSRC2L    COMP  PIC  S9(4).
           02  FMSRC2F    PICTURE X.
           02  FILLER REDEFINES FMSRC2F.
             03 FMSRC2A    PICTURE X.
           02  FMSRC2I  PIC X(3).
           02  FMSRC3L    COMP  PIC  S9(4).
           02  FMSRC3F    PICTURE X.
           02  FILLER REDEFINES FMSRC3F.
             03 FMSRC3A    PICTURE X.
           02  FMSRC3I  PIC X(3).
           02  FMSRC4L    COMP  PIC  S9(4).
           02  FMSRC4F    PICTURE X.
           02  FILLER REDEFINES FMSRC4F.
             03 FMSRC4A    PICTURE X.
           02  FMSRC4I  PIC X(3).
           02  FMSRC5L    COMP  PIC  S9(4).
           02  FMSRC5F    PICTURE X.
           02  FILLER REDEFINES FMSRC5F.
             03 FMSRC5A    PICTURE X.
           02  FMSRC5I  PIC X(3).
           02  FMSRC6L    COMP  PIC  S9(4).
           02  FMSRC6F    PICTURE X.
           02  FILLER REDEFINES FMSRC6F.
             03 FMSRC6A    PICTURE X.
           02  FMSRC6I  PIC X(3).
           02  FMSRC7L    COMP  PIC  S9(4).
           02  FMSRC7F    PICTURE X.
           02  FILLER REDEFINES FMSRC7F.
             03 FMSRC7A    PICTURE X.
           02  FMSRC7I  PIC X(3).
           02  FMSRC8L    COMP  PIC  S9(4).
           02  FMSRC8F    PICTURE X.
           02  FILLER REDEFINES FMSRC8F.
             03 FMSRC8A    PICTURE X.
           02  FMSRC8I  PIC X(3).
           02  FMSRC9L    COMP  PIC  S9(4).
           02  FMSRC9F    PICTURE X.
           02  FILLER REDEFINES FMSRC9F.
             03 FMSRC9A    PICTURE X.
           02  FMSRC9I  PIC X(3).
           02  FMSRC0L    COMP  PIC  S9(4).
           02  FMSRC0F    PICTURE X.
           02  FILLER REDEFINES FMSRC0F.
             03 FMSRC0A    PICTURE X.
           02  FMSRC0I  PIC X(3).
           02  FMLST3L    COMP  PIC  S9(4).
           02  FMLST3F    PICTURE X.
           02  FILLER REDEFINES FMLST3F.
             03 FMLST3A    PICTURE X.
           02  FMLST3I  PIC X(1).
           02  FMLMTL    COMP  PIC  S9(4).
           02  FMLMTF    PICTURE X.
           02  FILLER REDEFINES FMLMTF.
             03 FMLMTA    PICTURE X.
           02  FMLMTI  PIC X(18).
           02  FMLST1L    COMP  PIC  S9(4).
           02  FMLST1F    PICTURE X.
           02  FILLER REDEFINES FMLST1F.
             03 FMLST1A    PICTURE X.
           02  FMLST1I  PIC X(1).
           02  FMLST2L    COMP  PIC  S9(4).
           02  FMLST2F    PICTURE X.
           02  FILLER REDEFINES FMLST2F.
             03 FMLST2A    PICTURE X.
           02  FMLST2I  PIC X(1).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFM01CO REDEFINES FIFM01CI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTITLXO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  FMTITLEO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  FMREGNXO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMREGNBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTYPXO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTYPEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPRTXO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  FMPRNTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMBRKXO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMBRKTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDBCXO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  FMDBCRO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMALFLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSORTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFR01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFR02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFR03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFR06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFR07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFR11O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMSRT1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMSRT2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMSRT3O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMSRT4O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMSRT5O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRP1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP14O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP15O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP16O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP17O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP18O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP19O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRP20O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSRCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSRC1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSRC2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSRC3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSRC4O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSRC5O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSRC6O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSRC7O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSRC8O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSRC9O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSRC0O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMLST3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMLMTO PIC Z(14)9.99.
           02  FILLER PICTURE X(3).
           02  FMLST1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMLST2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).