       01  FIFM47AI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMPAGEL    COMP  PIC  S9(4).
           02  FMPAGEF    PICTURE X.
           02  FILLER REDEFINES FMPAGEF.
             03 FMPAGEA    PICTURE X.
           02  FMPAGEI  PIC X(4).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMNUMNL    COMP  PIC  S9(4).
           02  FMNUMNF    PICTURE X.
           02  FILLER REDEFINES FMNUMNF.
             03 FMNUMNA    PICTURE X.
           02  FMNUMNI  PIC X(4).
           02  FMFUNCL    COMP  PIC  S9(4).
           02  FMFUNCF    PICTURE X.
           02  FILLER REDEFINES FMFUNCF.
             03 FMFUNCA    PICTURE X.
           02  FMFUNCI  PIC X(1).
           02  FMPROCL    COMP  PIC  S9(4).
           02  FMPROCF    PICTURE X.
           02  FILLER REDEFINES FMPROCF.
             03 FMPROCA    PICTURE X.
           02  FMPROCI  PIC X(1).
           02  FMRCN1L    COMP  PIC  S9(4).
           02  FMRCN1F    PICTURE X.
           02  FILLER REDEFINES FMRCN1F.
             03 FMRCN1A    PICTURE X.
           02  FMRCN1I  PIC X(10).
           02  FMPCT1L    COMP  PIC  S9(4).
           02  FMPCT1F    PICTURE X.
           02  FILLER REDEFINES FMPCT1F.
             03 FMPCT1A    PICTURE X.
           02  FMPCT1I  PIC X(4).
           02  FMRCN2L    COMP  PIC  S9(4).
           02  FMRCN2F    PICTURE X.
           02  FILLER REDEFINES FMRCN2F.
             03 FMRCN2A    PICTURE X.
           02  FMRCN2I  PIC X(10).
           02  FMPCT2L    COMP  PIC  S9(4).
           02  FMPCT2F    PICTURE X.
           02  FILLER REDEFINES FMPCT2F.
             03 FMPCT2A    PICTURE X.
           02  FMPCT2I  PIC X(4).
           02  FMRCN3L    COMP  PIC  S9(4).
           02  FMRCN3F    PICTURE X.
           02  FILLER REDEFINES FMRCN3F.
             03 FMRCN3A    PICTURE X.
           02  FMRCN3I  PIC X(10).
           02  FMPCT3L    COMP  PIC  S9(4).
           02  FMPCT3F    PICTURE X.
           02  FILLER REDEFINES FMPCT3F.
             03 FMPCT3A    PICTURE X.
           02  FMPCT3I  PIC X(4).
           02  FMRCN4L    COMP  PIC  S9(4).
           02  FMRCN4F    PICTURE X.
           02  FILLER REDEFINES FMRCN4F.
             03 FMRCN4A    PICTURE X.
           02  FMRCN4I  PIC X(10).
           02  FMPCT4L    COMP  PIC  S9(4).
           02  FMPCT4F    PICTURE X.
           02  FILLER REDEFINES FMPCT4F.
             03 FMPCT4A    PICTURE X.
           02  FMPCT4I  PIC X(4).
           02  FMRCN5L    COMP  PIC  S9(4).
           02  FMRCN5F    PICTURE X.
           02  FILLER REDEFINES FMRCN5F.
             03 FMRCN5A    PICTURE X.
           02  FMRCN5I  PIC X(10).
           02  FMPCT5L    COMP  PIC  S9(4).
           02  FMPCT5F    PICTURE X.
           02  FILLER REDEFINES FMPCT5F.
             03 FMPCT5A    PICTURE X.
           02  FMPCT5I  PIC X(4).
           02  FMRCN6L    COMP  PIC  S9(4).
           02  FMRCN6F    PICTURE X.
           02  FILLER REDEFINES FMRCN6F.
             03 FMRCN6A    PICTURE X.
           02  FMRCN6I  PIC X(10).
           02  FMPCT6L    COMP  PIC  S9(4).
           02  FMPCT6F    PICTURE X.
           02  FILLER REDEFINES FMPCT6F.
             03 FMPCT6A    PICTURE X.
           02  FMPCT6I  PIC X(4).
           02  FMRCN7L    COMP  PIC  S9(4).
           02  FMRCN7F    PICTURE X.
           02  FILLER REDEFINES FMRCN7F.
             03 FMRCN7A    PICTURE X.
           02  FMRCN7I  PIC X(10).
           02  FMPCT7L    COMP  PIC  S9(4).
           02  FMPCT7F    PICTURE X.
           02  FILLER REDEFINES FMPCT7F.
             03 FMPCT7A    PICTURE X.
           02  FMPCT7I  PIC X(4).
           02  FMRCN8L    COMP  PIC  S9(4).
           02  FMRCN8F    PICTURE X.
           02  FILLER REDEFINES FMRCN8F.
             03 FMRCN8A    PICTURE X.
           02  FMRCN8I  PIC X(10).
           02  FMPCT8L    COMP  PIC  S9(4).
           02  FMPCT8F    PICTURE X.
           02  FILLER REDEFINES FMPCT8F.
             03 FMPCT8A    PICTURE X.
           02  FMPCT8I  PIC X(4).
           02  FMRCN9L    COMP  PIC  S9(4).
           02  FMRCN9F    PICTURE X.
           02  FILLER REDEFINES FMRCN9F.
             03 FMRCN9A    PICTURE X.
           02  FMRCN9I  PIC X(10).
           02  FMPCT9L    COMP  PIC  S9(4).
           02  FMPCT9F    PICTURE X.
           02  FILLER REDEFINES FMPCT9F.
             03 FMPCT9A    PICTURE X.
           02  FMPCT9I  PIC X(4).
           02  FMRCN10L    COMP  PIC  S9(4).
           02  FMRCN10F    PICTURE X.
           02  FILLER REDEFINES FMRCN10F.
             03 FMRCN10A    PICTURE X.
           02  FMRCN10I  PIC X(10).
           02  FMPCT10L    COMP  PIC  S9(4).
           02  FMPCT10F    PICTURE X.
           02  FILLER REDEFINES FMPCT10F.
             03 FMPCT10A    PICTURE X.
           02  FMPCT10I  PIC X(4).
           02  FMRCN11L    COMP  PIC  S9(4).
           02  FMRCN11F    PICTURE X.
           02  FILLER REDEFINES FMRCN11F.
             03 FMRCN11A    PICTURE X.
           02  FMRCN11I  PIC X(10).
           02  FMPCT11L    COMP  PIC  S9(4).
           02  FMPCT11F    PICTURE X.
           02  FILLER REDEFINES FMPCT11F.
             03 FMPCT11A    PICTURE X.
           02  FMPCT11I  PIC X(4).
           02  FMRCN12L    COMP  PIC  S9(4).
           02  FMRCN12F    PICTURE X.
           02  FILLER REDEFINES FMRCN12F.
             03 FMRCN12A    PICTURE X.
           02  FMRCN12I  PIC X(10).
           02  FMPCT12L    COMP  PIC  S9(4).
           02  FMPCT12F    PICTURE X.
           02  FILLER REDEFINES FMPCT12F.
             03 FMPCT12A    PICTURE X.
           02  FMPCT12I  PIC X(4).
           02  FMRCN13L    COMP  PIC  S9(4).
           02  FMRCN13F    PICTURE X.
           02  FILLER REDEFINES FMRCN13F.
             03 FMRCN13A    PICTURE X.
           02  FMRCN13I  PIC X(10).
           02  FMPCT13L    COMP  PIC  S9(4).
           02  FMPCT13F    PICTURE X.
           02  FILLER REDEFINES FMPCT13F.
             03 FMPCT13A    PICTURE X.
           02  FMPCT13I  PIC X(4).
           02  FMRCN14L    COMP  PIC  S9(4).
           02  FMRCN14F    PICTURE X.
           02  FILLER REDEFINES FMRCN14F.
             03 FMRCN14A    PICTURE X.
           02  FMRCN14I  PIC X(10).
           02  FMPCT14L    COMP  PIC  S9(4).
           02  FMPCT14F    PICTURE X.
           02  FILLER REDEFINES FMPCT14F.
             03 FMPCT14A    PICTURE X.
           02  FMPCT14I  PIC X(4).
           02  FMRCN15L    COMP  PIC  S9(4).
           02  FMRCN15F    PICTURE X.
           02  FILLER REDEFINES FMRCN15F.
             03 FMRCN15A    PICTURE X.
           02  FMRCN15I  PIC X(10).
           02  FMPCT15L    COMP  PIC  S9(4).
           02  FMPCT15F    PICTURE X.
           02  FILLER REDEFINES FMPCT15F.
             03 FMPCT15A    PICTURE X.
           02  FMPCT15I  PIC X(4).
           02  FMRCN16L    COMP  PIC  S9(4).
           02  FMRCN16F    PICTURE X.
           02  FILLER REDEFINES FMRCN16F.
             03 FMRCN16A    PICTURE X.
           02  FMRCN16I  PIC X(10).
           02  FMPCT16L    COMP  PIC  S9(4).
           02  FMPCT16F    PICTURE X.
           02  FILLER REDEFINES FMPCT16F.
             03 FMPCT16A    PICTURE X.
           02  FMPCT16I  PIC X(4).
           02  FMRCN17L    COMP  PIC  S9(4).
           02  FMRCN17F    PICTURE X.
           02  FILLER REDEFINES FMRCN17F.
             03 FMRCN17A    PICTURE X.
           02  FMRCN17I  PIC X(10).
           02  FMPCT17L    COMP  PIC  S9(4).
           02  FMPCT17F    PICTURE X.
           02  FILLER REDEFINES FMPCT17F.
             03 FMPCT17A    PICTURE X.
           02  FMPCT17I  PIC X(4).
           02  FMRCN18L    COMP  PIC  S9(4).
           02  FMRCN18F    PICTURE X.
           02  FILLER REDEFINES FMRCN18F.
             03 FMRCN18A    PICTURE X.
           02  FMRCN18I  PIC X(10).
           02  FMPCT18L    COMP  PIC  S9(4).
           02  FMPCT18F    PICTURE X.
           02  FILLER REDEFINES FMPCT18F.
             03 FMPCT18A    PICTURE X.
           02  FMPCT18I  PIC X(4).
           02  FMRCN19L    COMP  PIC  S9(4).
           02  FMRCN19F    PICTURE X.
           02  FILLER REDEFINES FMRCN19F.
             03 FMRCN19A    PICTURE X.
           02  FMRCN19I  PIC X(10).
           02  FMPCT19L    COMP  PIC  S9(4).
           02  FMPCT19F    PICTURE X.
           02  FILLER REDEFINES FMPCT19F.
             03 FMPCT19A    PICTURE X.
           02  FMPCT19I  PIC X(4).
           02  FMRCN20L    COMP  PIC  S9(4).
           02  FMRCN20F    PICTURE X.
           02  FILLER REDEFINES FMRCN20F.
             03 FMRCN20A    PICTURE X.
           02  FMRCN20I  PIC X(10).
           02  FMPCT20L    COMP  PIC  S9(4).
           02  FMPCT20F    PICTURE X.
           02  FILLER REDEFINES FMPCT20F.
             03 FMPCT20A    PICTURE X.
           02  FMPCT20I  PIC X(4).
           02  FMRCN21L    COMP  PIC  S9(4).
           02  FMRCN21F    PICTURE X.
           02  FILLER REDEFINES FMRCN21F.
             03 FMRCN21A    PICTURE X.
           02  FMRCN21I  PIC X(10).
           02  FMPCT21L    COMP  PIC  S9(4).
           02  FMPCT21F    PICTURE X.
           02  FILLER REDEFINES FMPCT21F.
             03 FMPCT21A    PICTURE X.
           02  FMPCT21I  PIC X(4).
           02  FMRCN22L    COMP  PIC  S9(4).
           02  FMRCN22F    PICTURE X.
           02  FILLER REDEFINES FMRCN22F.
             03 FMRCN22A    PICTURE X.
           02  FMRCN22I  PIC X(10).
           02  FMPCT22L    COMP  PIC  S9(4).
           02  FMPCT22F    PICTURE X.
           02  FILLER REDEFINES FMPCT22F.
             03 FMPCT22A    PICTURE X.
           02  FMPCT22I  PIC X(4).
           02  FMRCN23L    COMP  PIC  S9(4).
           02  FMRCN23F    PICTURE X.
           02  FILLER REDEFINES FMRCN23F.
             03 FMRCN23A    PICTURE X.
           02  FMRCN23I  PIC X(10).
           02  FMPCT23L    COMP  PIC  S9(4).
           02  FMPCT23F    PICTURE X.
           02  FILLER REDEFINES FMPCT23F.
             03 FMPCT23A    PICTURE X.
           02  FMPCT23I  PIC X(4).
           02  FMRCN24L    COMP  PIC  S9(4).
           02  FMRCN24F    PICTURE X.
           02  FILLER REDEFINES FMRCN24F.
             03 FMRCN24A    PICTURE X.
           02  FMRCN24I  PIC X(10).
           02  FMPCT24L    COMP  PIC  S9(4).
           02  FMPCT24F    PICTURE X.
           02  FILLER REDEFINES FMPCT24F.
             03 FMPCT24A    PICTURE X.
           02  FMPCT24I  PIC X(4).
           02  FMRCN25L    COMP  PIC  S9(4).
           02  FMRCN25F    PICTURE X.
           02  FILLER REDEFINES FMRCN25F.
             03 FMRCN25A    PICTURE X.
           02  FMRCN25I  PIC X(10).
           02  FMPCT25L    COMP  PIC  S9(4).
           02  FMPCT25F    PICTURE X.
           02  FILLER REDEFINES FMPCT25F.
             03 FMPCT25A    PICTURE X.
           02  FMPCT25I  PIC X(4).
           02  FMRCN26L    COMP  PIC  S9(4).
           02  FMRCN26F    PICTURE X.
           02  FILLER REDEFINES FMRCN26F.
             03 FMRCN26A    PICTURE X.
           02  FMRCN26I  PIC X(10).
           02  FMPCT26L    COMP  PIC  S9(4).
           02  FMPCT26F    PICTURE X.
           02  FILLER REDEFINES FMPCT26F.
             03 FMPCT26A    PICTURE X.
           02  FMPCT26I  PIC X(4).
           02  FMRCN27L    COMP  PIC  S9(4).
           02  FMRCN27F    PICTURE X.
           02  FILLER REDEFINES FMRCN27F.
             03 FMRCN27A    PICTURE X.
           02  FMRCN27I  PIC X(10).
           02  FMPCT27L    COMP  PIC  S9(4).
           02  FMPCT27F    PICTURE X.
           02  FILLER REDEFINES FMPCT27F.
             03 FMPCT27A    PICTURE X.
           02  FMPCT27I  PIC X(4).
           02  FMRCN28L    COMP  PIC  S9(4).
           02  FMRCN28F    PICTURE X.
           02  FILLER REDEFINES FMRCN28F.
             03 FMRCN28A    PICTURE X.
           02  FMRCN28I  PIC X(10).
           02  FMPCT28L    COMP  PIC  S9(4).
           02  FMPCT28F    PICTURE X.
           02  FILLER REDEFINES FMPCT28F.
             03 FMPCT28A    PICTURE X.
           02  FMPCT28I  PIC X(4).
           02  FMRCN29L    COMP  PIC  S9(4).
           02  FMRCN29F    PICTURE X.
           02  FILLER REDEFINES FMRCN29F.
             03 FMRCN29A    PICTURE X.
           02  FMRCN29I  PIC X(10).
           02  FMPCT29L    COMP  PIC  S9(4).
           02  FMPCT29F    PICTURE X.
           02  FILLER REDEFINES FMPCT29F.
             03 FMPCT29A    PICTURE X.
           02  FMPCT29I  PIC X(4).
           02  FMRCN30L    COMP  PIC  S9(4).
           02  FMRCN30F    PICTURE X.
           02  FILLER REDEFINES FMRCN30F.
             03 FMRCN30A    PICTURE X.
           02  FMRCN30I  PIC X(10).
           02  FMPCT30L    COMP  PIC  S9(4).
           02  FMPCT30F    PICTURE X.
           02  FILLER REDEFINES FMPCT30F.
             03 FMPCT30A    PICTURE X.
           02  FMPCT30I  PIC X(4).
           02  FMRCN31L    COMP  PIC  S9(4).
           02  FMRCN31F    PICTURE X.
           02  FILLER REDEFINES FMRCN31F.
             03 FMRCN31A    PICTURE X.
           02  FMRCN31I  PIC X(10).
           02  FMPCT31L    COMP  PIC  S9(4).
           02  FMPCT31F    PICTURE X.
           02  FILLER REDEFINES FMPCT31F.
             03 FMPCT31A    PICTURE X.
           02  FMPCT31I  PIC X(4).
           02  FMRCN32L    COMP  PIC  S9(4).
           02  FMRCN32F    PICTURE X.
           02  FILLER REDEFINES FMRCN32F.
             03 FMRCN32A    PICTURE X.
           02  FMRCN32I  PIC X(10).
           02  FMPCT32L    COMP  PIC  S9(4).
           02  FMPCT32F    PICTURE X.
           02  FILLER REDEFINES FMPCT32F.
             03 FMPCT32A    PICTURE X.
           02  FMPCT32I  PIC X(4).
           02  FMRCN33L    COMP  PIC  S9(4).
           02  FMRCN33F    PICTURE X.
           02  FILLER REDEFINES FMRCN33F.
             03 FMRCN33A    PICTURE X.
           02  FMRCN33I  PIC X(10).
           02  FMPCT33L    COMP  PIC  S9(4).
           02  FMPCT33F    PICTURE X.
           02  FILLER REDEFINES FMPCT33F.
             03 FMPCT33A    PICTURE X.
           02  FMPCT33I  PIC X(4).
           02  FMRCN34L    COMP  PIC  S9(4).
           02  FMRCN34F    PICTURE X.
           02  FILLER REDEFINES FMRCN34F.
             03 FMRCN34A    PICTURE X.
           02  FMRCN34I  PIC X(10).
           02  FMPCT34L    COMP  PIC  S9(4).
           02  FMPCT34F    PICTURE X.
           02  FILLER REDEFINES FMPCT34F.
             03 FMPCT34A    PICTURE X.
           02  FMPCT34I  PIC X(4).
           02  FMRCN35L    COMP  PIC  S9(4).
           02  FMRCN35F    PICTURE X.
           02  FILLER REDEFINES FMRCN35F.
             03 FMRCN35A    PICTURE X.
           02  FMRCN35I  PIC X(10).
           02  FMPCT35L    COMP  PIC  S9(4).
           02  FMPCT35F    PICTURE X.
           02  FILLER REDEFINES FMPCT35F.
             03 FMPCT35A    PICTURE X.
           02  FMPCT35I  PIC X(4).
           02  FMRCN36L    COMP  PIC  S9(4).
           02  FMRCN36F    PICTURE X.
           02  FILLER REDEFINES FMRCN36F.
             03 FMRCN36A    PICTURE X.
           02  FMRCN36I  PIC X(10).
           02  FMPCT36L    COMP  PIC  S9(4).
           02  FMPCT36F    PICTURE X.
           02  FILLER REDEFINES FMPCT36F.
             03 FMPCT36A    PICTURE X.
           02  FMPCT36I  PIC X(4).
           02  FMRCN37L    COMP  PIC  S9(4).
           02  FMRCN37F    PICTURE X.
           02  FILLER REDEFINES FMRCN37F.
             03 FMRCN37A    PICTURE X.
           02  FMRCN37I  PIC X(10).
           02  FMPCT37L    COMP  PIC  S9(4).
           02  FMPCT37F    PICTURE X.
           02  FILLER REDEFINES FMPCT37F.
             03 FMPCT37A    PICTURE X.
           02  FMPCT37I  PIC X(4).
           02  FMRCN38L    COMP  PIC  S9(4).
           02  FMRCN38F    PICTURE X.
           02  FILLER REDEFINES FMRCN38F.
             03 FMRCN38A    PICTURE X.
           02  FMRCN38I  PIC X(10).
           02  FMPCT38L    COMP  PIC  S9(4).
           02  FMPCT38F    PICTURE X.
           02  FILLER REDEFINES FMPCT38F.
             03 FMPCT38A    PICTURE X.
           02  FMPCT38I  PIC X(4).
           02  FMRCN39L    COMP  PIC  S9(4).
           02  FMRCN39F    PICTURE X.
           02  FILLER REDEFINES FMRCN39F.
             03 FMRCN39A    PICTURE X.
           02  FMRCN39I  PIC X(10).
           02  FMPCT39L    COMP  PIC  S9(4).
           02  FMPCT39F    PICTURE X.
           02  FILLER REDEFINES FMPCT39F.
             03 FMPCT39A    PICTURE X.
           02  FMPCT39I  PIC X(4).
           02  FMRCN40L    COMP  PIC  S9(4).
           02  FMRCN40F    PICTURE X.
           02  FILLER REDEFINES FMRCN40F.
             03 FMRCN40A    PICTURE X.
           02  FMRCN40I  PIC X(10).
           02  FMPCT40L    COMP  PIC  S9(4).
           02  FMPCT40F    PICTURE X.
           02  FILLER REDEFINES FMPCT40F.
             03 FMPCT40A    PICTURE X.
           02  FMPCT40I  PIC X(4).
           02  FMRCN41L    COMP  PIC  S9(4).
           02  FMRCN41F    PICTURE X.
           02  FILLER REDEFINES FMRCN41F.
             03 FMRCN41A    PICTURE X.
           02  FMRCN41I  PIC X(10).
           02  FMPCT41L    COMP  PIC  S9(4).
           02  FMPCT41F    PICTURE X.
           02  FILLER REDEFINES FMPCT41F.
             03 FMPCT41A    PICTURE X.
           02  FMPCT41I  PIC X(4).
           02  FMRCN42L    COMP  PIC  S9(4).
           02  FMRCN42F    PICTURE X.
           02  FILLER REDEFINES FMRCN42F.
             03 FMRCN42A    PICTURE X.
           02  FMRCN42I  PIC X(10).
           02  FMPCT42L    COMP  PIC  S9(4).
           02  FMPCT42F    PICTURE X.
           02  FILLER REDEFINES FMPCT42F.
             03 FMPCT42A    PICTURE X.
           02  FMPCT42I  PIC X(4).
           02  FMRCN43L    COMP  PIC  S9(4).
           02  FMRCN43F    PICTURE X.
           02  FILLER REDEFINES FMRCN43F.
             03 FMRCN43A    PICTURE X.
           02  FMRCN43I  PIC X(10).
           02  FMPCT43L    COMP  PIC  S9(4).
           02  FMPCT43F    PICTURE X.
           02  FILLER REDEFINES FMPCT43F.
             03 FMPCT43A    PICTURE X.
           02  FMPCT43I  PIC X(4).
           02  FMRCN44L    COMP  PIC  S9(4).
           02  FMRCN44F    PICTURE X.
           02  FILLER REDEFINES FMRCN44F.
             03 FMRCN44A    PICTURE X.
           02  FMRCN44I  PIC X(10).
           02  FMPCT44L    COMP  PIC  S9(4).
           02  FMPCT44F    PICTURE X.
           02  FILLER REDEFINES FMPCT44F.
             03 FMPCT44A    PICTURE X.
           02  FMPCT44I  PIC X(4).
           02  FMRCN45L    COMP  PIC  S9(4).
           02  FMRCN45F    PICTURE X.
           02  FILLER REDEFINES FMRCN45F.
             03 FMRCN45A    PICTURE X.
           02  FMRCN45I  PIC X(10).
           02  FMPCT45L    COMP  PIC  S9(4).
           02  FMPCT45F    PICTURE X.
           02  FILLER REDEFINES FMPCT45F.
             03 FMPCT45A    PICTURE X.
           02  FMPCT45I  PIC X(4).
           02  FMPGFWDL    COMP  PIC  S9(4).
           02  FMPGFWDF    PICTURE X.
           02  FILLER REDEFINES FMPGFWDF.
             03 FMPGFWDA    PICTURE X.
           02  FMPGFWDI  PIC X(18).
           02  FMPGBKDL    COMP  PIC  S9(4).
           02  FMPGBKDF    PICTURE X.
           02  FILLER REDEFINES FMPGBKDF.
             03 FMPGBKDA    PICTURE X.
           02  FMPGBKDI  PIC X(19).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFM47AO REDEFINES FIFM47AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAGEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMNUMNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMFUNCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPROCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRCN1O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT1O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN2O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT2O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN3O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT3O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN4O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN5O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT5O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN6O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT6O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN7O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT7O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN8O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT8O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN9O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT9O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN10O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT10O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN11O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT11O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN12O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT12O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN13O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT13O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN14O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT14O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN15O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT15O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN16O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT16O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN17O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT17O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN18O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT18O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN19O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT19O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN20O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT20O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN21O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT21O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN22O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT22O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN23O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT23O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN24O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT24O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN25O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT25O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN26O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT26O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN27O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT27O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN28O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT28O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN29O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT29O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN30O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT30O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN31O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT31O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN32O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT32O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN33O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT33O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN34O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT34O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN35O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT35O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN36O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT36O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN37O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT37O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN38O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT38O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN39O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT39O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN40O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT40O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN41O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT41O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN42O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT42O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN43O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT43O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN44O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT44O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCN45O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMPCT45O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMPGFWDO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMPGBKDO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).