       01  FIFMI2CI.
           02  FILLER PIC X(12).
           02  FMTRIDAL    COMP  PIC  S9(4).
           02  FMTRIDAF    PICTURE X.
           02  FILLER REDEFINES FMTRIDAF.
             03 FMTRIDAA    PICTURE X.
           02  FMTRIDAI  PIC X(4).
           02  FMDATEAL    COMP  PIC  S9(4).
           02  FMDATEAF    PICTURE X.
           02  FILLER REDEFINES FMDATEAF.
             03 FMDATEAA    PICTURE X.
           02  FMDATEAI  PIC X(8).
           02  FMTIMEAL    COMP  PIC  S9(4).
           02  FMTIMEAF    PICTURE X.
           02  FILLER REDEFINES FMTIMEAF.
             03 FMTIMEAA    PICTURE X.
           02  FMTIMEAI  PIC X(8).
           02  FMACCTAL    COMP  PIC  S9(4).
           02  FMACCTAF    PICTURE X.
           02  FILLER REDEFINES FMACCTAF.
             03 FMACCTAA    PICTURE X.
           02  FMACCTAI  PIC X(10).
           02  FMCOAL    COMP  PIC  S9(4).
           02  FMCOAF    PICTURE X.
           02  FILLER REDEFINES FMCOAF.
             03 FMCOAA    PICTURE X.
           02  FMCOAI  PIC X(4).
           02  FMTITLAL    COMP  PIC  S9(4).
           02  FMTITLAF    PICTURE X.
           02  FILLER REDEFINES FMTITLAF.
             03 FMTITLAA    PICTURE X.
           02  FMTITLAI  PIC X(40).
           02  FMTYPEAL    COMP  PIC  S9(4).
           02  FMTYPEAF    PICTURE X.
           02  FILLER REDEFINES FMTYPEAF.
             03 FMTYPEAA    PICTURE X.
           02  FMTYPEAI  PIC X(20).
           02  FMDT01AL    COMP  PIC  S9(4).
           02  FMDT01AF    PICTURE X.
           02  FILLER REDEFINES FMDT01AF.
             03 FMDT01AA    PICTURE X.
           02  FMDT01AI  PIC X(20).
           02  FMDS01AL    COMP  PIC  S9(4).
           02  FMDS01AF    PICTURE X.
           02  FILLER REDEFINES FMDS01AF.
             03 FMDS01AA    PICTURE X.
           02  FMDS01AI  PIC X(25).
           02  FMRF01AL    COMP  PIC  S9(4).
           02  FMRF01AF    PICTURE X.
           02  FILLER REDEFINES FMRF01AF.
             03 FMRF01AA    PICTURE X.
           02  FMRF01AI  PIC X(8).
           02  FMSR01AL    COMP  PIC  S9(4).
           02  FMSR01AF    PICTURE X.
           02  FILLER REDEFINES FMSR01AF.
             03 FMSR01AA    PICTURE X.
           02  FMSR01AI  PIC X(23).
           02  FMDT02AL    COMP  PIC  S9(4).
           02  FMDT02AF    PICTURE X.
           02  FILLER REDEFINES FMDT02AF.
             03 FMDT02AA    PICTURE X.
           02  FMDT02AI  PIC X(20).
           02  FMDS02AL    COMP  PIC  S9(4).
           02  FMDS02AF    PICTURE X.
           02  FILLER REDEFINES FMDS02AF.
             03 FMDS02AA    PICTURE X.
           02  FMDS02AI  PIC X(25).
           02  FMRF02AL    COMP  PIC  S9(4).
           02  FMRF02AF    PICTURE X.
           02  FILLER REDEFINES FMRF02AF.
             03 FMRF02AA    PICTURE X.
           02  FMRF02AI  PIC X(8).
           02  FMDS0RAL    COMP  PIC  S9(4).
           02  FMDS0RAF    PICTURE X.
           02  FILLER REDEFINES FMDS0RAF.
             03 FMDS0RAA    PICTURE X.
           02  FMDS0RAI  PIC X(23).
           02  FMDT03AL    COMP  PIC  S9(4).
           02  FMDT03AF    PICTURE X.
           02  FILLER REDEFINES FMDT03AF.
             03 FMDT03AA    PICTURE X.
           02  FMDT03AI  PIC X(20).
           02  FMDS03AL    COMP  PIC  S9(4).
           02  FMDS03AF    PICTURE X.
           02  FILLER REDEFINES FMDS03AF.
             03 FMDS03AA    PICTURE X.
           02  FMDS03AI  PIC X(25).
           02  FMRF03AL    COMP  PIC  S9(4).
           02  FMRF03AF    PICTURE X.
           02  FILLER REDEFINES FMRF03AF.
             03 FMRF03AA    PICTURE X.
           02  FMRF03AI  PIC X(8).
           02  FMSR03AL    COMP  PIC  S9(4).
           02  FMSR03AF    PICTURE X.
           02  FILLER REDEFINES FMSR03AF.
             03 FMSR03AA    PICTURE X.
           02  FMSR03AI  PIC X(23).
           02  FMDT04AL    COMP  PIC  S9(4).
           02  FMDT04AF    PICTURE X.
           02  FILLER REDEFINES FMDT04AF.
             03 FMDT04AA    PICTURE X.
           02  FMDT04AI  PIC X(20).
           02  FMDS04AL    COMP  PIC  S9(4).
           02  FMDS04AF    PICTURE X.
           02  FILLER REDEFINES FMDS04AF.
             03 FMDS04AA    PICTURE X.
           02  FMDS04AI  PIC X(25).
           02  FMRF04AL    COMP  PIC  S9(4).
           02  FMRF04AF    PICTURE X.
           02  FILLER REDEFINES FMRF04AF.
             03 FMRF04AA    PICTURE X.
           02  FMRF04AI  PIC X(8).
           02  FMSR04AL    COMP  PIC  S9(4).
           02  FMSR04AF    PICTURE X.
           02  FILLER REDEFINES FMSR04AF.
             03 FMSR04AA    PICTURE X.
           02  FMSR04AI  PIC X(23).
           02  FMDT05AL    COMP  PIC  S9(4).
           02  FMDT05AF    PICTURE X.
           02  FILLER REDEFINES FMDT05AF.
             03 FMDT05AA    PICTURE X.
           02  FMDT05AI  PIC X(20).
           02  FMDS05AL    COMP  PIC  S9(4).
           02  FMDS05AF    PICTURE X.
           02  FILLER REDEFINES FMDS05AF.
             03 FMDS05AA    PICTURE X.
           02  FMDS05AI  PIC X(25).
           02  FMRF05AL    COMP  PIC  S9(4).
           02  FMRF05AF    PICTURE X.
           02  FILLER REDEFINES FMRF05AF.
             03 FMRF05AA    PICTURE X.
           02  FMRF05AI  PIC X(8).
           02  FMSR05AL    COMP  PIC  S9(4).
           02  FMSR05AF    PICTURE X.
           02  FILLER REDEFINES FMSR05AF.
             03 FMSR05AA    PICTURE X.
           02  FMSR05AI  PIC X(23).
           02  FMDT06AL    COMP  PIC  S9(4).
           02  FMDT06AF    PICTURE X.
           02  FILLER REDEFINES FMDT06AF.
             03 FMDT06AA    PICTURE X.
           02  FMDT06AI  PIC X(20).
           02  FMDS06AL    COMP  PIC  S9(4).
           02  FMDS06AF    PICTURE X.
           02  FILLER REDEFINES FMDS06AF.
             03 FMDS06AA    PICTURE X.
           02  FMDS06AI  PIC X(25).
           02  FMRF06AL    COMP  PIC  S9(4).
           02  FMRF06AF    PICTURE X.
           02  FILLER REDEFINES FMRF06AF.
             03 FMRF06AA    PICTURE X.
           02  FMRF06AI  PIC X(8).
           02  FMSR06AL    COMP  PIC  S9(4).
           02  FMSR06AF    PICTURE X.
           02  FILLER REDEFINES FMSR06AF.
             03 FMSR06AA    PICTURE X.
           02  FMSR06AI  PIC X(23).
           02  FMDT07AL    COMP  PIC  S9(4).
           02  FMDT07AF    PICTURE X.
           02  FILLER REDEFINES FMDT07AF.
             03 FMDT07AA    PICTURE X.
           02  FMDT07AI  PIC X(20).
           02  FMDS07AL    COMP  PIC  S9(4).
           02  FMDS07AF    PICTURE X.
           02  FILLER REDEFINES FMDS07AF.
             03 FMDS07AA    PICTURE X.
           02  FMDS07AI  PIC X(25).
           02  FMRF07AL    COMP  PIC  S9(4).
           02  FMRF07AF    PICTURE X.
           02  FILLER REDEFINES FMRF07AF.
             03 FMRF07AA    PICTURE X.
           02  FMRF07AI  PIC X(8).
           02  FMSR07AL    COMP  PIC  S9(4).
           02  FMSR07AF    PICTURE X.
           02  FILLER REDEFINES FMSR07AF.
             03 FMSR07AA    PICTURE X.
           02  FMSR07AI  PIC X(23).
           02  FMDT08AL    COMP  PIC  S9(4).
           02  FMDT08AF    PICTURE X.
           02  FILLER REDEFINES FMDT08AF.
             03 FMDT08AA    PICTURE X.
           02  FMDT08AI  PIC X(20).
           02  FMDS08AL    COMP  PIC  S9(4).
           02  FMDS08AF    PICTURE X.
           02  FILLER REDEFINES FMDS08AF.
             03 FMDS08AA    PICTURE X.
           02  FMDS08AI  PIC X(25).
           02  FMRF08AL    COMP  PIC  S9(4).
           02  FMRF08AF    PICTURE X.
           02  FILLER REDEFINES FMRF08AF.
             03 FMRF08AA    PICTURE X.
           02  FMRF08AI  PIC X(8).
           02  FMSR08AL    COMP  PIC  S9(4).
           02  FMSR08AF    PICTURE X.
           02  FILLER REDEFINES FMSR08AF.
             03 FMSR08AA    PICTURE X.
           02  FMSR08AI  PIC X(23).
           02  FMDT09AL    COMP  PIC  S9(4).
           02  FMDT09AF    PICTURE X.
           02  FILLER REDEFINES FMDT09AF.
             03 FMDT09AA    PICTURE X.
           02  FMDT09AI  PIC X(20).
           02  FMDS09AL    COMP  PIC  S9(4).
           02  FMDS09AF    PICTURE X.
           02  FILLER REDEFINES FMDS09AF.
             03 FMDS09AA    PICTURE X.
           02  FMDS09AI  PIC X(25).
           02  FMRF09AL    COMP  PIC  S9(4).
           02  FMRF09AF    PICTURE X.
           02  FILLER REDEFINES FMRF09AF.
             03 FMRF09AA    PICTURE X.
           02  FMRF09AI  PIC X(8).
           02  FMSR09AL    COMP  PIC  S9(4).
           02  FMSR09AF    PICTURE X.
           02  FILLER REDEFINES FMSR09AF.
             03 FMSR09AA    PICTURE X.
           02  FMSR09AI  PIC X(23).
           02  FMDT10AL    COMP  PIC  S9(4).
           02  FMDT10AF    PICTURE X.
           02  FILLER REDEFINES FMDT10AF.
             03 FMDT10AA    PICTURE X.
           02  FMDT10AI  PIC X(20).
           02  FMDS10AL    COMP  PIC  S9(4).
           02  FMDS10AF    PICTURE X.
           02  FILLER REDEFINES FMDS10AF.
             03 FMDS10AA    PICTURE X.
           02  FMDS10AI  PIC X(25).
           02  FMRF10AL    COMP  PIC  S9(4).
           02  FMRF10AF    PICTURE X.
           02  FILLER REDEFINES FMRF10AF.
             03 FMRF10AA    PICTURE X.
           02  FMRF10AI  PIC X(8).
           02  FMSR10AL    COMP  PIC  S9(4).
           02  FMSR10AF    PICTURE X.
           02  FILLER REDEFINES FMSR10AF.
             03 FMSR10AA    PICTURE X.
           02  FMSR10AI  PIC X(23).
           02  FMDT11AL    COMP  PIC  S9(4).
           02  FMDT11AF    PICTURE X.
           02  FILLER REDEFINES FMDT11AF.
             03 FMDT11AA    PICTURE X.
           02  FMDT11AI  PIC X(20).
           02  FMDS11AL    COMP  PIC  S9(4).
           02  FMDS11AF    PICTURE X.
           02  FILLER REDEFINES FMDS11AF.
             03 FMDS11AA    PICTURE X.
           02  FMDS11AI  PIC X(25).
           02  FMRF11AL    COMP  PIC  S9(4).
           02  FMRF11AF    PICTURE X.
           02  FILLER REDEFINES FMRF11AF.
             03 FMRF11AA    PICTURE X.
           02  FMRF11AI  PIC X(8).
           02  FMSR11AL    COMP  PIC  S9(4).
           02  FMSR11AF    PICTURE X.
           02  FILLER REDEFINES FMSR11AF.
             03 FMSR11AA    PICTURE X.
           02  FMSR11AI  PIC X(23).
           02  FMDT12AL    COMP  PIC  S9(4).
           02  FMDT12AF    PICTURE X.
           02  FILLER REDEFINES FMDT12AF.
             03 FMDT12AA    PICTURE X.
           02  FMDT12AI  PIC X(20).
           02  FMDS12AL    COMP  PIC  S9(4).
           02  FMDS12AF    PICTURE X.
           02  FILLER REDEFINES FMDS12AF.
             03 FMDS12AA    PICTURE X.
           02  FMDS12AI  PIC X(25).
           02  FMRF12AL    COMP  PIC  S9(4).
           02  FMRF12AF    PICTURE X.
           02  FILLER REDEFINES FMRF12AF.
             03 FMRF12AA    PICTURE X.
           02  FMRF12AI  PIC X(8).
           02  FMSR12AL    COMP  PIC  S9(4).
           02  FMSR12AF    PICTURE X.
           02  FILLER REDEFINES FMSR12AF.
             03 FMSR12AA    PICTURE X.
           02  FMSR12AI  PIC X(23).
           02  FMDT13AL    COMP  PIC  S9(4).
           02  FMDT13AF    PICTURE X.
           02  FILLER REDEFINES FMDT13AF.
             03 FMDT13AA    PICTURE X.
           02  FMDT13AI  PIC X(20).
           02  FMDS13AL    COMP  PIC  S9(4).
           02  FMDS13AF    PICTURE X.
           02  FILLER REDEFINES FMDS13AF.
             03 FMDS13AA    PICTURE X.
           02  FMDS13AI  PIC X(25).
           02  FMRF13AL    COMP  PIC  S9(4).
           02  FMRF13AF    PICTURE X.
           02  FILLER REDEFINES FMRF13AF.
             03 FMRF13AA    PICTURE X.
           02  FMRF13AI  PIC X(8).
           02  FMSR13AL    COMP  PIC  S9(4).
           02  FMSR13AF    PICTURE X.
           02  FILLER REDEFINES FMSR13AF.
             03 FMSR13AA    PICTURE X.
           02  FMSR13AI  PIC X(23).
           02  FMDT14AL    COMP  PIC  S9(4).
           02  FMDT14AF    PICTURE X.
           02  FILLER REDEFINES FMDT14AF.
             03 FMDT14AA    PICTURE X.
           02  FMDT14AI  PIC X(20).
           02  FMDS14AL    COMP  PIC  S9(4).
           02  FMDS14AF    PICTURE X.
           02  FILLER REDEFINES FMDS14AF.
             03 FMDS14AA    PICTURE X.
           02  FMDS14AI  PIC X(25).
           02  FMRF14AL    COMP  PIC  S9(4).
           02  FMRF14AF    PICTURE X.
           02  FILLER REDEFINES FMRF14AF.
             03 FMRF14AA    PICTURE X.
           02  FMRF14AI  PIC X(8).
           02  FMSR14AL    COMP  PIC  S9(4).
           02  FMSR14AF    PICTURE X.
           02  FILLER REDEFINES FMSR14AF.
             03 FMSR14AA    PICTURE X.
           02  FMSR14AI  PIC X(23).
           02  FMDT15AL    COMP  PIC  S9(4).
           02  FMDT15AF    PICTURE X.
           02  FILLER REDEFINES FMDT15AF.
             03 FMDT15AA    PICTURE X.
           02  FMDT15AI  PIC X(20).
           02  FMDS15AL    COMP  PIC  S9(4).
           02  FMDS15AF    PICTURE X.
           02  FILLER REDEFINES FMDS15AF.
             03 FMDS15AA    PICTURE X.
           02  FMDS15AI  PIC X(25).
           02  FMRF15AL    COMP  PIC  S9(4).
           02  FMRF15AF    PICTURE X.
           02  FILLER REDEFINES FMRF15AF.
             03 FMRF15AA    PICTURE X.
           02  FMRF15AI  PIC X(8).
           02  FMSR15AL    COMP  PIC  S9(4).
           02  FMSR15AF    PICTURE X.
           02  FILLER REDEFINES FMSR15AF.
             03 FMSR15AA    PICTURE X.
           02  FMSR15AI  PIC X(23).
           02  FMMSGAL    COMP  PIC  S9(4).
           02  FMMSGAF    PICTURE X.
           02  FILLER REDEFINES FMMSGAF.
             03 FMMSGAA    PICTURE X.
           02  FMMSGAI  PIC X(79).
           02  FMPFAL    COMP  PIC  S9(4).
           02  FMPFAF    PICTURE X.
           02  FILLER REDEFINES FMPFAF.
             03 FMPFAA    PICTURE X.
           02  FMPFAI  PIC X(79).
           02  FMERRAL    COMP  PIC  S9(4).
           02  FMERRAF    PICTURE X.
           02  FILLER REDEFINES FMERRAF.
             03 FMERRAA    PICTURE X.
           02  FMERRAI  PIC X(79).
       01  FIFMI2CO REDEFINES FIFMI2CI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACCTAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCOAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTITLAO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  FMTYPEAO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDT01AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS01AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF01AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR01AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT02AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS02AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF02AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDS0RAO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT03AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS03AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF03AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR03AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT04AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS04AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF04AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR04AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT05AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS05AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF05AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR05AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT06AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS06AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF06AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR06AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT07AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS07AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF07AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR07AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT08AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS08AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF08AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR08AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT09AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS09AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF09AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR09AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT10AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS10AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF10AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR10AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT11AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS11AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF11AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR11AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT12AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS12AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF12AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR12AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT13AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS13AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF13AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR13AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT14AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS14AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF14AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR14AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMDT15AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDS15AO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMRF15AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSR15AO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMMSGAO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMPFAO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERRAO  PIC X(79).
       01  FIFMI2BI REDEFINES FIFMI2CI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMACCTL    COMP  PIC  S9(4).
           02  FMACCTF    PICTURE X.
           02  FILLER REDEFINES FMACCTF.
             03 FMACCTA    PICTURE X.
           02  FMACCTI  PIC X(10).
           02  FMCOL    COMP  PIC  S9(4).
           02  FMCOF    PICTURE X.
           02  FILLER REDEFINES FMCOF.
             03 FMCOA    PICTURE X.
           02  FMCOI  PIC X(4).
           02  FMFREFFL    COMP  PIC  S9(4).
           02  FMFREFFF    PICTURE X.
           02  FILLER REDEFINES FMFREFFF.
             03 FMFREFFA    PICTURE X.
           02  FMFREFFI  PIC X(6).
           02  FMTOEFFL    COMP  PIC  S9(4).
           02  FMTOEFFF    PICTURE X.
           02  FILLER REDEFINES FMTOEFFF.
             03 FMTOEFFA    PICTURE X.
           02  FMTOEFFI  PIC X(6).
           02  FMFRRCL    COMP  PIC  S9(4).
           02  FMFRRCF    PICTURE X.
           02  FILLER REDEFINES FMFRRCF.
             03 FMFRRCA    PICTURE X.
           02  FMFRRCI  PIC X(10).
           02  FMTORCL    COMP  PIC  S9(4).
           02  FMTORCF    PICTURE X.
           02  FILLER REDEFINES FMTORCF.
             03 FMTORCA    PICTURE X.
           02  FMTORCI  PIC X(10).
           02  FMFRENTL    COMP  PIC  S9(4).
           02  FMFRENTF    PICTURE X.
           02  FILLER REDEFINES FMFRENTF.
             03 FMFRENTA    PICTURE X.
           02  FMFRENTI  PIC X(6).
           02  FMTOENTL    COMP  PIC  S9(4).
           02  FMTOENTF    PICTURE X.
           02  FILLER REDEFINES FMTOENTF.
             03 FMTOENTA    PICTURE X.
           02  FMTOENTI  PIC X(6).
           02  FMFRAMTL    COMP  PIC  S9(4).
           02  FMFRAMTF    PICTURE X.
           02  FILLER REDEFINES FMFRAMTF.
             03 FMFRAMTA    PICTURE X.
           02  FMFRAMTI  PIC X(18).
           02  FMTOAMTL    COMP  PIC  S9(4).
           02  FMTOAMTF    PICTURE X.
           02  FILLER REDEFINES FMTOAMTF.
             03 FMTOAMTA    PICTURE X.
           02  FMTOAMTI  PIC X(18).
           02  FMREFL    COMP  PIC  S9(4).
           02  FMREFF    PICTURE X.
           02  FILLER REDEFINES FMREFF.
             03 FMREFA    PICTURE X.
           02  FMREFI  PIC X(8).
           02  FMSRCL    COMP  PIC  S9(4).
           02  FMSRCF    PICTURE X.
           02  FILLER REDEFINES FMSRCF.
             03 FMSRCA    PICTURE X.
           02  FMSRCI  PIC X(3).
           02  FMEXSRCL    COMP  PIC  S9(4).
           02  FMEXSRCF    PICTURE X.
           02  FILLER REDEFINES FMEXSRCF.
             03 FMEXSRCA    PICTURE X.
           02  FMEXSRCI  PIC X(3).
           02  FMTRANL    COMP  PIC  S9(4).
           02  FMTRANF    PICTURE X.
           02  FILLER REDEFINES FMTRANF.
             03 FMTRANA    PICTURE X.
           02  FMTRANI  PIC X(2).
           02  FMPFL    COMP  PIC  S9(4).
           02  FMPFF    PICTURE X.
           02  FILLER REDEFINES FMPFF.
             03 FMPFA    PICTURE X.
           02  FMPFI  PIC X(79).
           02  FMERRL    COMP  PIC  S9(4).
           02  FMERRF    PICTURE X.
           02  FILLER REDEFINES FMERRF.
             03 FMERRA    PICTURE X.
           02  FMERRI  PIC X(79).
       01  FIFMI2BO REDEFINES FIFMI2BI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCOO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMFREFFO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMTOEFFO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMFRRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTORCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMFRENTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMTOENTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMFRAMTO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMTOAMTO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMEXSRCO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMTRANO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMPFO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERRO  PIC X(79).