       01  FIFM49AI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMTRNNL    COMP  PIC  S9(4).
           02  FMTRNNF    PICTURE X.
           02  FILLER REDEFINES FMTRNNF.
             03 FMTRNNA    PICTURE X.
           02  FMTRNNI  PIC X(4).
           02  FMFUNCL    COMP  PIC  S9(4).
           02  FMFUNCF    PICTURE X.
           02  FILLER REDEFINES FMFUNCF.
             03 FMFUNCA    PICTURE X.
           02  FMFUNCI  PIC X(1).
           02  FMDBACTL    COMP  PIC  S9(4).
           02  FMDBACTF    PICTURE X.
           02  FILLER REDEFINES FMDBACTF.
             03 FMDBACTA    PICTURE X.
           02  FMDBACTI  PIC X(10).
           02  FMDBRCL    COMP  PIC  S9(4).
           02  FMDBRCF    PICTURE X.
           02  FILLER REDEFINES FMDBRCF.
             03 FMDBRCA    PICTURE X.
           02  FMDBRCI  PIC X(10).
           02  FMCRACTL    COMP  PIC  S9(4).
           02  FMCRACTF    PICTURE X.
           02  FILLER REDEFINES FMCRACTF.
             03 FMCRACTA    PICTURE X.
           02  FMCRACTI  PIC X(10).
           02  FMCRRCL    COMP  PIC  S9(4).
           02  FMCRRCF    PICTURE X.
           02  FILLER REDEFINES FMCRRCF.
             03 FMCRRCA    PICTURE X.
           02  FMCRRCI  PIC X(10).
           02  FMAMTL    COMP  PIC  S9(4).
           02  FMAMTF    PICTURE X.
           02  FILLER REDEFINES FMAMTF.
             03 FMAMTA    PICTURE X.
           02  FMAMTI  PIC X(18).
           02  FMSTDTL    COMP  PIC  S9(4).
           02  FMSTDTF    PICTURE X.
           02  FILLER REDEFINES FMSTDTF.
             03 FMSTDTA    PICTURE X.
           02  FMSTDTI  PIC X(6).
           02  FMEDDTL    COMP  PIC  S9(4).
           02  FMEDDTF    PICTURE X.
           02  FILLER REDEFINES FMEDDTF.
             03 FMEDDTA    PICTURE X.
           02  FMEDDTI  PIC X(6).
           02  FMFREQL    COMP  PIC  S9(4).
           02  FMFREQF    PICTURE X.
           02  FILLER REDEFINES FMFREQF.
             03 FMFREQA    PICTURE X.
           02  FMFREQI  PIC X(1).
           02  FMPSTDYL    COMP  PIC  S9(4).
           02  FMPSTDYF    PICTURE X.
           02  FILLER REDEFINES FMPSTDYF.
             03 FMPSTDYA    PICTURE X.
           02  FMPSTDYI  PIC X(2).
           02  FMDESCL    COMP  PIC  S9(4).
           02  FMDESCF    PICTURE X.
           02  FILLER REDEFINES FMDESCF.
             03 FMDESCA    PICTURE X.
           02  FMDESCI.
             03  FMDESCAI  PIC X(1).
             03  FMDESCNI  PIC X(4).
             03  FMDESCFI  PIC X(20).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFM49AO REDEFINES FIFM49AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTRNNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMFUNCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDBACTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMDBRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCRACTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCRRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMAMTO PIC Z(15).99.
           02  FILLER PICTURE X(3).
           02  FMSTDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMEDDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMFREQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPSTDYO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMDESCO.
             03  FMDESCAO  PIC X(1).
             03  FMDESCNO  PIC X(4).
             03  FMDESCFO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).