       01  FIFMWHAI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMTRNNL    COMP  PIC  S9(4).
           02  FMTRNNF    PICTURE X.
           02  FILLER REDEFINES FMTRNNF.
             03 FMTRNNA    PICTURE X.
           02  FMTRNNI  PIC X(4).
           02  FMACT1L    COMP  PIC  S9(4).
           02  FMACT1F    PICTURE X.
           02  FILLER REDEFINES FMACT1F.
             03 FMACT1A    PICTURE X.
           02  FMACT1I  PIC X(1).
           02  FMTRN1L    COMP  PIC  S9(4).
           02  FMTRN1F    PICTURE X.
           02  FILLER REDEFINES FMTRN1F.
             03 FMTRN1A    PICTURE X.
           02  FMTRN1I  PIC X(4).
           02  FMDSC1L    COMP  PIC  S9(4).
           02  FMDSC1F    PICTURE X.
           02  FILLER REDEFINES FMDSC1F.
             03 FMDSC1A    PICTURE X.
           02  FMDSC1I  PIC X(25).
           02  FMAMT1L    COMP  PIC  S9(4).
           02  FMAMT1F    PICTURE X.
           02  FILLER REDEFINES FMAMT1F.
             03 FMAMT1A    PICTURE X.
           02  FMAMT1I  PIC X(19).
           02  FMSTD1L    COMP  PIC  S9(4).
           02  FMSTD1F    PICTURE X.
           02  FILLER REDEFINES FMSTD1F.
             03 FMSTD1A    PICTURE X.
           02  FMSTD1I  PIC X(8).
           02  FMEDD1L    COMP  PIC  S9(4).
           02  FMEDD1F    PICTURE X.
           02  FILLER REDEFINES FMEDD1F.
             03 FMEDD1A    PICTURE X.
           02  FMEDD1I  PIC X(8).
           02  FMACT2L    COMP  PIC  S9(4).
           02  FMACT2F    PICTURE X.
           02  FILLER REDEFINES FMACT2F.
             03 FMACT2A    PICTURE X.
           02  FMACT2I  PIC X(1).
           02  FMTRN2L    COMP  PIC  S9(4).
           02  FMTRN2F    PICTURE X.
           02  FILLER REDEFINES FMTRN2F.
             03 FMTRN2A    PICTURE X.
           02  FMTRN2I  PIC X(4).
           02  FMDSC2L    COMP  PIC  S9(4).
           02  FMDSC2F    PICTURE X.
           02  FILLER REDEFINES FMDSC2F.
             03 FMDSC2A    PICTURE X.
           02  FMDSC2I  PIC X(25).
           02  FMAMT2L    COMP  PIC  S9(4).
           02  FMAMT2F    PICTURE X.
           02  FILLER REDEFINES FMAMT2F.
             03 FMAMT2A    PICTURE X.
           02  FMAMT2I  PIC X(19).
           02  FMSTD2L    COMP  PIC  S9(4).
           02  FMSTD2F    PICTURE X.
           02  FILLER REDEFINES FMSTD2F.
             03 FMSTD2A    PICTURE X.
           02  FMSTD2I  PIC X(8).
           02  FMEDD2L    COMP  PIC  S9(4).
           02  FMEDD2F    PICTURE X.
           02  FILLER REDEFINES FMEDD2F.
             03 FMEDD2A    PICTURE X.
           02  FMEDD2I  PIC X(8).
           02  FMACT3L    COMP  PIC  S9(4).
           02  FMACT3F    PICTURE X.
           02  FILLER REDEFINES FMACT3F.
             03 FMACT3A    PICTURE X.
           02  FMACT3I  PIC X(1).
           02  FMTRN3L    COMP  PIC  S9(4).
           02  FMTRN3F    PICTURE X.
           02  FILLER REDEFINES FMTRN3F.
             03 FMTRN3A    PICTURE X.
           02  FMTRN3I  PIC X(4).
           02  FMDSC3L    COMP  PIC  S9(4).
           02  FMDSC3F    PICTURE X.
           02  FILLER REDEFINES FMDSC3F.
             03 FMDSC3A    PICTURE X.
           02  FMDSC3I  PIC X(25).
           02  FMAMT3L    COMP  PIC  S9(4).
           02  FMAMT3F    PICTURE X.
           02  FILLER REDEFINES FMAMT3F.
             03 FMAMT3A    PICTURE X.
           02  FMAMT3I  PIC X(19).
           02  FMSTD3L    COMP  PIC  S9(4).
           02  FMSTD3F    PICTURE X.
           02  FILLER REDEFINES FMSTD3F.
             03 FMSTD3A    PICTURE X.
           02  FMSTD3I  PIC X(8).
           02  FMEDD3L    COMP  PIC  S9(4).
           02  FMEDD3F    PICTURE X.
           02  FILLER REDEFINES FMEDD3F.
             03 FMEDD3A    PICTURE X.
           02  FMEDD3I  PIC X(8).
           02  FMACT4L    COMP  PIC  S9(4).
           02  FMACT4F    PICTURE X.
           02  FILLER REDEFINES FMACT4F.
             03 FMACT4A    PICTURE X.
           02  FMACT4I  PIC X(1).
           02  FMTRN4L    COMP  PIC  S9(4).
           02  FMTRN4F    PICTURE X.
           02  FILLER REDEFINES FMTRN4F.
             03 FMTRN4A    PICTURE X.
           02  FMTRN4I  PIC X(4).
           02  FMDSC4L    COMP  PIC  S9(4).
           02  FMDSC4F    PICTURE X.
           02  FILLER REDEFINES FMDSC4F.
             03 FMDSC4A    PICTURE X.
           02  FMDSC4I  PIC X(25).
           02  FMAMT4L    COMP  PIC  S9(4).
           02  FMAMT4F    PICTURE X.
           02  FILLER REDEFINES FMAMT4F.
             03 FMAMT4A    PICTURE X.
           02  FMAMT4I  PIC X(19).
           02  FMSTD4L    COMP  PIC  S9(4).
           02  FMSTD4F    PICTURE X.
           02  FILLER REDEFINES FMSTD4F.
             03 FMSTD4A    PICTURE X.
           02  FMSTD4I  PIC X(8).
           02  FMEDD4L    COMP  PIC  S9(4).
           02  FMEDD4F    PICTURE X.
           02  FILLER REDEFINES FMEDD4F.
             03 FMEDD4A    PICTURE X.
           02  FMEDD4I  PIC X(8).
           02  FMACT5L    COMP  PIC  S9(4).
           02  FMACT5F    PICTURE X.
           02  FILLER REDEFINES FMACT5F.
             03 FMACT5A    PICTURE X.
           02  FMACT5I  PIC X(1).
           02  FMTRN5L    COMP  PIC  S9(4).
           02  FMTRN5F    PICTURE X.
           02  FILLER REDEFINES FMTRN5F.
             03 FMTRN5A    PICTURE X.
           02  FMTRN5I  PIC X(4).
           02  FMDSC5L    COMP  PIC  S9(4).
           02  FMDSC5F    PICTURE X.
           02  FILLER REDEFINES FMDSC5F.
             03 FMDSC5A    PICTURE X.
           02  FMDSC5I  PIC X(25).
           02  FMAMT5L    COMP  PIC  S9(4).
           02  FMAMT5F    PICTURE X.
           02  FILLER REDEFINES FMAMT5F.
             03 FMAMT5A    PICTURE X.
           02  FMAMT5I  PIC X(19).
           02  FMSTD5L    COMP  PIC  S9(4).
           02  FMSTD5F    PICTURE X.
           02  FILLER REDEFINES FMSTD5F.
             03 FMSTD5A    PICTURE X.
           02  FMSTD5I  PIC X(8).
           02  FMEDD5L    COMP  PIC  S9(4).
           02  FMEDD5F    PICTURE X.
           02  FILLER REDEFINES FMEDD5F.
             03 FMEDD5A    PICTURE X.
           02  FMEDD5I  PIC X(8).
           02  FMACT6L    COMP  PIC  S9(4).
           02  FMACT6F    PICTURE X.
           02  FILLER REDEFINES FMACT6F.
             03 FMACT6A    PICTURE X.
           02  FMACT6I  PIC X(1).
           02  FMTRN6L    COMP  PIC  S9(4).
           02  FMTRN6F    PICTURE X.
           02  FILLER REDEFINES FMTRN6F.
             03 FMTRN6A    PICTURE X.
           02  FMTRN6I  PIC X(4).
           02  FMDSC6L    COMP  PIC  S9(4).
           02  FMDSC6F    PICTURE X.
           02  FILLER REDEFINES FMDSC6F.
             03 FMDSC6A    PICTURE X.
           02  FMDSC6I  PIC X(25).
           02  FMAMT6L    COMP  PIC  S9(4).
           02  FMAMT6F    PICTURE X.
           02  FILLER REDEFINES FMAMT6F.
             03 FMAMT6A    PICTURE X.
           02  FMAMT6I  PIC X(19).
           02  FMSTD6L    COMP  PIC  S9(4).
           02  FMSTD6F    PICTURE X.
           02  FILLER REDEFINES FMSTD6F.
             03 FMSTD6A    PICTURE X.
           02  FMSTD6I  PIC X(8).
           02  FMEDD6L    COMP  PIC  S9(4).
           02  FMEDD6F    PICTURE X.
           02  FILLER REDEFINES FMEDD6F.
             03 FMEDD6A    PICTURE X.
           02  FMEDD6I  PIC X(8).
           02  FMACT7L    COMP  PIC  S9(4).
           02  FMACT7F    PICTURE X.
           02  FILLER REDEFINES FMACT7F.
             03 FMACT7A    PICTURE X.
           02  FMACT7I  PIC X(1).
           02  FMTRN7L    COMP  PIC  S9(4).
           02  FMTRN7F    PICTURE X.
           02  FILLER REDEFINES FMTRN7F.
             03 FMTRN7A    PICTURE X.
           02  FMTRN7I  PIC X(4).
           02  FMDSC7L    COMP  PIC  S9(4).
           02  FMDSC7F    PICTURE X.
           02  FILLER REDEFINES FMDSC7F.
             03 FMDSC7A    PICTURE X.
           02  FMDSC7I  PIC X(25).
           02  FMAMT7L    COMP  PIC  S9(4).
           02  FMAMT7F    PICTURE X.
           02  FILLER REDEFINES FMAMT7F.
             03 FMAMT7A    PICTURE X.
           02  FMAMT7I  PIC X(19).
           02  FMSTD7L    COMP  PIC  S9(4).
           02  FMSTD7F    PICTURE X.
           02  FILLER REDEFINES FMSTD7F.
             03 FMSTD7A    PICTURE X.
           02  FMSTD7I  PIC X(8).
           02  FMEDD7L    COMP  PIC  S9(4).
           02  FMEDD7F    PICTURE X.
           02  FILLER REDEFINES FMEDD7F.
             03 FMEDD7A    PICTURE X.
           02  FMEDD7I  PIC X(8).
           02  FMACT8L    COMP  PIC  S9(4).
           02  FMACT8F    PICTURE X.
           02  FILLER REDEFINES FMACT8F.
             03 FMACT8A    PICTURE X.
           02  FMACT8I  PIC X(1).
           02  FMTRN8L    COMP  PIC  S9(4).
           02  FMTRN8F    PICTURE X.
           02  FILLER REDEFINES FMTRN8F.
             03 FMTRN8A    PICTURE X.
           02  FMTRN8I  PIC X(4).
           02  FMDSC8L    COMP  PIC  S9(4).
           02  FMDSC8F    PICTURE X.
           02  FILLER REDEFINES FMDSC8F.
             03 FMDSC8A    PICTURE X.
           02  FMDSC8I  PIC X(25).
           02  FMAMT8L    COMP  PIC  S9(4).
           02  FMAMT8F    PICTURE X.
           02  FILLER REDEFINES FMAMT8F.
             03 FMAMT8A    PICTURE X.
           02  FMAMT8I  PIC X(19).
           02  FMSTD8L    COMP  PIC  S9(4).
           02  FMSTD8F    PICTURE X.
           02  FILLER REDEFINES FMSTD8F.
             03 FMSTD8A    PICTURE X.
           02  FMSTD8I  PIC X(8).
           02  FMEDD8L    COMP  PIC  S9(4).
           02  FMEDD8F    PICTURE X.
           02  FILLER REDEFINES FMEDD8F.
             03 FMEDD8A    PICTURE X.
           02  FMEDD8I  PIC X(8).
           02  FMACT9L    COMP  PIC  S9(4).
           02  FMACT9F    PICTURE X.
           02  FILLER REDEFINES FMACT9F.
             03 FMACT9A    PICTURE X.
           02  FMACT9I  PIC X(1).
           02  FMTRN9L    COMP  PIC  S9(4).
           02  FMTRN9F    PICTURE X.
           02  FILLER REDEFINES FMTRN9F.
             03 FMTRN9A    PICTURE X.
           02  FMTRN9I  PIC X(4).
           02  FMDSC9L    COMP  PIC  S9(4).
           02  FMDSC9F    PICTURE X.
           02  FILLER REDEFINES FMDSC9F.
             03 FMDSC9A    PICTURE X.
           02  FMDSC9I  PIC X(25).
           02  FMAMT9L    COMP  PIC  S9(4).
           02  FMAMT9F    PICTURE X.
           02  FILLER REDEFINES FMAMT9F.
             03 FMAMT9A    PICTURE X.
           02  FMAMT9I  PIC X(19).
           02  FMSTD9L    COMP  PIC  S9(4).
           02  FMSTD9F    PICTURE X.
           02  FILLER REDEFINES FMSTD9F.
             03 FMSTD9A    PICTURE X.
           02  FMSTD9I  PIC X(8).
           02  FMEDD9L    COMP  PIC  S9(4).
           02  FMEDD9F    PICTURE X.
           02  FILLER REDEFINES FMEDD9F.
             03 FMEDD9A    PICTURE X.
           02  FMEDD9I  PIC X(8).
           02  FMACT10L    COMP  PIC  S9(4).
           02  FMACT10F    PICTURE X.
           02  FILLER REDEFINES FMACT10F.
             03 FMACT10A    PICTURE X.
           02  FMACT10I  PIC X(1).
           02  FMTRN10L    COMP  PIC  S9(4).
           02  FMTRN10F    PICTURE X.
           02  FILLER REDEFINES FMTRN10F.
             03 FMTRN10A    PICTURE X.
           02  FMTRN10I  PIC X(4).
           02  FMDSC10L    COMP  PIC  S9(4).
           02  FMDSC10F    PICTURE X.
           02  FILLER REDEFINES FMDSC10F.
             03 FMDSC10A    PICTURE X.
           02  FMDSC10I  PIC X(25).
           02  FMAMT10L    COMP  PIC  S9(4).
           02  FMAMT10F    PICTURE X.
           02  FILLER REDEFINES FMAMT10F.
             03 FMAMT10A    PICTURE X.
           02  FMAMT10I  PIC X(19).
           02  FMSTD10L    COMP  PIC  S9(4).
           02  FMSTD10F    PICTURE X.
           02  FILLER REDEFINES FMSTD10F.
             03 FMSTD10A    PICTURE X.
           02  FMSTD10I  PIC X(8).
           02  FMEDD10L    COMP  PIC  S9(4).
           02  FMEDD10F    PICTURE X.
           02  FILLER REDEFINES FMEDD10F.
             03 FMEDD10A    PICTURE X.
           02  FMEDD10I  PIC X(8).
           02  FMACT11L    COMP  PIC  S9(4).
           02  FMACT11F    PICTURE X.
           02  FILLER REDEFINES FMACT11F.
             03 FMACT11A    PICTURE X.
           02  FMACT11I  PIC X(1).
           02  FMTRN11L    COMP  PIC  S9(4).
           02  FMTRN11F    PICTURE X.
           02  FILLER REDEFINES FMTRN11F.
             03 FMTRN11A    PICTURE X.
           02  FMTRN11I  PIC X(4).
           02  FMDSC11L    COMP  PIC  S9(4).
           02  FMDSC11F    PICTURE X.
           02  FILLER REDEFINES FMDSC11F.
             03 FMDSC11A    PICTURE X.
           02  FMDSC11I  PIC X(25).
           02  FMAMT11L    COMP  PIC  S9(4).
           02  FMAMT11F    PICTURE X.
           02  FILLER REDEFINES FMAMT11F.
             03 FMAMT11A    PICTURE X.
           02  FMAMT11I  PIC X(19).
           02  FMSTD11L    COMP  PIC  S9(4).
           02  FMSTD11F    PICTURE X.
           02  FILLER REDEFINES FMSTD11F.
             03 FMSTD11A    PICTURE X.
           02  FMSTD11I  PIC X(8).
           02  FMEDD11L    COMP  PIC  S9(4).
           02  FMEDD11F    PICTURE X.
           02  FILLER REDEFINES FMEDD11F.
             03 FMEDD11A    PICTURE X.
           02  FMEDD11I  PIC X(8).
           02  FMACT12L    COMP  PIC  S9(4).
           02  FMACT12F    PICTURE X.
           02  FILLER REDEFINES FMACT12F.
             03 FMACT12A    PICTURE X.
           02  FMACT12I  PIC X(1).
           02  FMTRN12L    COMP  PIC  S9(4).
           02  FMTRN12F    PICTURE X.
           02  FILLER REDEFINES FMTRN12F.
             03 FMTRN12A    PICTURE X.
           02  FMTRN12I  PIC X(4).
           02  FMDSC12L    COMP  PIC  S9(4).
           02  FMDSC12F    PICTURE X.
           02  FILLER REDEFINES FMDSC12F.
             03 FMDSC12A    PICTURE X.
           02  FMDSC12I  PIC X(25).
           02  FMAMT12L    COMP  PIC  S9(4).
           02  FMAMT12F    PICTURE X.
           02  FILLER REDEFINES FMAMT12F.
             03 FMAMT12A    PICTURE X.
           02  FMAMT12I  PIC X(19).
           02  FMSTD12L    COMP  PIC  S9(4).
           02  FMSTD12F    PICTURE X.
           02  FILLER REDEFINES FMSTD12F.
             03 FMSTD12A    PICTURE X.
           02  FMSTD12I  PIC X(8).
           02  FMEDD12L    COMP  PIC  S9(4).
           02  FMEDD12F    PICTURE X.
           02  FILLER REDEFINES FMEDD12F.
             03 FMEDD12A    PICTURE X.
           02  FMEDD12I  PIC X(8).
           02  FMACT13L    COMP  PIC  S9(4).
           02  FMACT13F    PICTURE X.
           02  FILLER REDEFINES FMACT13F.
             03 FMACT13A    PICTURE X.
           02  FMACT13I  PIC X(1).
           02  FMTRN13L    COMP  PIC  S9(4).
           02  FMTRN13F    PICTURE X.
           02  FILLER REDEFINES FMTRN13F.
             03 FMTRN13A    PICTURE X.
           02  FMTRN13I  PIC X(4).
           02  FMDSC13L    COMP  PIC  S9(4).
           02  FMDSC13F    PICTURE X.
           02  FILLER REDEFINES FMDSC13F.
             03 FMDSC13A    PICTURE X.
           02  FMDSC13I  PIC X(25).
           02  FMAMT13L    COMP  PIC  S9(4).
           02  FMAMT13F    PICTURE X.
           02  FILLER REDEFINES FMAMT13F.
             03 FMAMT13A    PICTURE X.
           02  FMAMT13I  PIC X(19).
           02  FMSTD13L    COMP  PIC  S9(4).
           02  FMSTD13F    PICTURE X.
           02  FILLER REDEFINES FMSTD13F.
             03 FMSTD13A    PICTURE X.
           02  FMSTD13I  PIC X(8).
           02  FMEDD13L    COMP  PIC  S9(4).
           02  FMEDD13F    PICTURE X.
           02  FILLER REDEFINES FMEDD13F.
             03 FMEDD13A    PICTURE X.
           02  FMEDD13I  PIC X(8).
           02  FMACT14L    COMP  PIC  S9(4).
           02  FMACT14F    PICTURE X.
           02  FILLER REDEFINES FMACT14F.
             03 FMACT14A    PICTURE X.
           02  FMACT14I  PIC X(1).
           02  FMTRN14L    COMP  PIC  S9(4).
           02  FMTRN14F    PICTURE X.
           02  FILLER REDEFINES FMTRN14F.
             03 FMTRN14A    PICTURE X.
           02  FMTRN14I  PIC X(4).
           02  FMDSC14L    COMP  PIC  S9(4).
           02  FMDSC14F    PICTURE X.
           02  FILLER REDEFINES FMDSC14F.
             03 FMDSC14A    PICTURE X.
           02  FMDSC14I  PIC X(25).
           02  FMAMT14L    COMP  PIC  S9(4).
           02  FMAMT14F    PICTURE X.
           02  FILLER REDEFINES FMAMT14F.
             03 FMAMT14A    PICTURE X.
           02  FMAMT14I  PIC X(19).
           02  FMSTD14L    COMP  PIC  S9(4).
           02  FMSTD14F    PICTURE X.
           02  FILLER REDEFINES FMSTD14F.
             03 FMSTD14A    PICTURE X.
           02  FMSTD14I  PIC X(8).
           02  FMEDD14L    COMP  PIC  S9(4).
           02  FMEDD14F    PICTURE X.
           02  FILLER REDEFINES FMEDD14F.
             03 FMEDD14A    PICTURE X.
           02  FMEDD14I  PIC X(8).
           02  FMACT15L    COMP  PIC  S9(4).
           02  FMACT15F    PICTURE X.
           02  FILLER REDEFINES FMACT15F.
             03 FMACT15A    PICTURE X.
           02  FMACT15I  PIC X(1).
           02  FMTRN15L    COMP  PIC  S9(4).
           02  FMTRN15F    PICTURE X.
           02  FILLER REDEFINES FMTRN15F.
             03 FMTRN15A    PICTURE X.
           02  FMTRN15I  PIC X(4).
           02  FMDSC15L    COMP  PIC  S9(4).
           02  FMDSC15F    PICTURE X.
           02  FILLER REDEFINES FMDSC15F.
             03 FMDSC15A    PICTURE X.
           02  FMDSC15I  PIC X(25).
           02  FMAMT15L    COMP  PIC  S9(4).
           02  FMAMT15F    PICTURE X.
           02  FILLER REDEFINES FMAMT15F.
             03 FMAMT15A    PICTURE X.
           02  FMAMT15I  PIC X(19).
           02  FMSTD15L    COMP  PIC  S9(4).
           02  FMSTD15F    PICTURE X.
           02  FILLER REDEFINES FMSTD15F.
             03 FMSTD15A    PICTURE X.
           02  FMSTD15I  PIC X(8).
           02  FMEDD15L    COMP  PIC  S9(4).
           02  FMEDD15F    PICTURE X.
           02  FILLER REDEFINES FMEDD15F.
             03 FMEDD15A    PICTURE X.
           02  FMEDD15I  PIC X(8).
           02  FMPGFWDL    COMP  PIC  S9(4).
           02  FMPGFWDF    PICTURE X.
           02  FILLER REDEFINES FMPGFWDF.
             03 FMPGFWDA    PICTURE X.
           02  FMPGFWDI  PIC X(18).
           02  FMPGBKDL    COMP  PIC  S9(4).
           02  FMPGBKDF    PICTURE X.
           02  FILLER REDEFINES FMPGBKDF.
             03 FMPGBKDA    PICTURE X.
           02  FMPGBKDI  PIC X(19).
           02  FMERRL    COMP  PIC  S9(4).
           02  FMERRF    PICTURE X.
           02  FILLER REDEFINES FMERRF.
             03 FMERRA    PICTURE X.
           02  FMERRI  PIC X(79).
       01  FIFMWHAO REDEFINES FIFMWHAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTRNNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN1O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC1O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT1O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN2O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC2O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT2O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN3O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC3O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT3O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC4O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT4O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD4O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD4O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN5O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC5O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT5O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD5O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD5O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN6O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC6O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT6O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD6O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD6O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN7O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC7O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT7O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD7O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD7O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN8O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC8O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT8O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD8O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD8O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN9O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC9O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT9O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD9O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD9O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN10O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC10O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT10O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN11O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC11O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT11O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD11O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD11O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN12O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC12O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT12O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN13O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC13O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT13O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT14O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN14O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC14O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT14O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD14O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD14O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT15O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN15O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC15O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT15O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMSTD15O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEDD15O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPGFWDO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMPGBKDO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMERRO  PIC X(79).