       01  FIFM50AI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMTRNNL    COMP  PIC  S9(4).
           02  FMTRNNF    PICTURE X.
           02  FILLER REDEFINES FMTRNNF.
             03 FMTRNNA    PICTURE X.
           02  FMTRNNI  PIC X(4).
           02  FMFUNCL    COMP  PIC  S9(4).
           02  FMFUNCF    PICTURE X.
           02  FILLER REDEFINES FMFUNCF.
             03 FMFUNCA    PICTURE X.
           02  FMFUNCI  PIC X(1).
           02  FMDBACTL    COMP  PIC  S9(4).
           02  FMDBACTF    PICTURE X.
           02  FILLER REDEFINES FMDBACTF.
             03 FMDBACTA    PICTURE X.
           02  FMDBACTI  PIC X(10).
           02  FMDBRCL    COMP  PIC  S9(4).
           02  FMDBRCF    PICTURE X.
           02  FILLER REDEFINES FMDBRCF.
             03 FMDBRCA    PICTURE X.
           02  FMDBRCI  PIC X(10).
           02  FMCRACTL    COMP  PIC  S9(4).
           02  FMCRACTF    PICTURE X.
           02  FILLER REDEFINES FMCRACTF.
             03 FMCRACTA    PICTURE X.
           02  FMCRACTI  PIC X(10).
           02  FMCRRCL    COMP  PIC  S9(4).
           02  FMCRRCF    PICTURE X.
           02  FILLER REDEFINES FMCRRCF.
             03 FMCRRCA    PICTURE X.
           02  FMCRRCI  PIC X(10).
           02  FMOAMTL    COMP  PIC  S9(4).
           02  FMOAMTF    PICTURE X.
           02  FILLER REDEFINES FMOAMTF.
             03 FMOAMTA    PICTURE X.
           02  FMOAMTI  PIC X(18).
           02  FMOMONSL    COMP  PIC  S9(4).
           02  FMOMONSF    PICTURE X.
           02  FILLER REDEFINES FMOMONSF.
             03 FMOMONSA    PICTURE X.
           02  FMOMONSI  PIC X(3).
           02  FMRAMTL    COMP  PIC  S9(4).
           02  FMRAMTF    PICTURE X.
           02  FILLER REDEFINES FMRAMTF.
             03 FMRAMTA    PICTURE X.
           02  FMRAMTI  PIC X(18).
           02  FMRMONSL    COMP  PIC  S9(4).
           02  FMRMONSF    PICTURE X.
           02  FILLER REDEFINES FMRMONSF.
             03 FMRMONSA    PICTURE X.
           02  FMRMONSI  PIC X(3).
           02  FMNPMOL    COMP  PIC  S9(4).
           02  FMNPMOF    PICTURE X.
           02  FILLER REDEFINES FMNPMOF.
             03 FMNPMOA    PICTURE X.
           02  FMNPMOI  PIC X(2).
           02  FMPSTDYL    COMP  PIC  S9(4).
           02  FMPSTDYF    PICTURE X.
           02  FILLER REDEFINES FMPSTDYF.
             03 FMPSTDYA    PICTURE X.
           02  FMPSTDYI  PIC X(2).
           02  FMDESCL    COMP  PIC  S9(4).
           02  FMDESCF    PICTURE X.
           02  FILLER REDEFINES FMDESCF.
             03 FMDESCA    PICTURE X.
           02  FMDESCI.
             03  FMDESCAI  PIC X(1).
             03  FMDESCNI  PIC X(4).
             03  FMDESCFI  PIC X(20).
           02  FMNPDTL    COMP  PIC  S9(4).
           02  FMNPDTF    PICTURE X.
           02  FILLER REDEFINES FMNPDTF.
             03 FMNPDTA    PICTURE X.
           02  FMNPDTI  PIC X(8).
           02  FMEXPDTL    COMP  PIC  S9(4).
           02  FMEXPDTF    PICTURE X.
           02  FILLER REDEFINES FMEXPDTF.
             03 FMEXPDTA    PICTURE X.
           02  FMEXPDTI  PIC X(8).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFM50AO REDEFINES FIFM50AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTRNNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMFUNCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDBACTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMDBRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCRACTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCRRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMOAMTO PIC Z(14)9.99.
           02  FILLER PICTURE X(3).
           02  FMOMONSO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMRAMTO PIC Z(14)9.99.
           02  FILLER PICTURE X(3).
           02  FMRMONSO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMNPMOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMPSTDYO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMDESCO.
             03  FMDESCAO  PIC X(1).
             03  FMDESCNO  PIC X(4).
             03  FMDESCFO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMNPDTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXPDTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).