       01  FIFM20AI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMFM99L    COMP  PIC  S9(4).
           02  FMFM99F    PICTURE X.
           02  FILLER REDEFINES FMFM99F.
             03 FMFM99A    PICTURE X.
           02  FMFM99I  PIC X(1).
           02  FMFM2DL    COMP  PIC  S9(4).
           02  FMFM2DF    PICTURE X.
           02  FILLER REDEFINES FMFM2DF.
             03 FMFM2DA    PICTURE X.
           02  FMFM2DI  PIC X(1).
           02  FMFM2AL    COMP  PIC  S9(4).
           02  FMFM2AF    PICTURE X.
           02  FILLER REDEFINES FMFM2AF.
             03 FMFM2AA    PICTURE X.
           02  FMFM2AI  PIC X(1).
           02  FMFM2EL    COMP  PIC  S9(4).
           02  FMFM2EF    PICTURE X.
           02  FILLER REDEFINES FMFM2EF.
             03 FMFM2EA    PICTURE X.
           02  FMFM2EI  PIC X(1).
           02  FMFM2CL    COMP  PIC  S9(4).
           02  FMFM2CF    PICTURE X.
           02  FILLER REDEFINES FMFM2CF.
             03 FMFM2CA    PICTURE X.
           02  FMFM2CI  PIC X(1).
           02  FMFM98L    COMP  PIC  S9(4).
           02  FMFM98F    PICTURE X.
           02  FILLER REDEFINES FMFM98F.
             03 FMFM98A    PICTURE X.
           02  FMFM98I  PIC X(1).
           02  FMFM2GL    COMP  PIC  S9(4).
           02  FMFM2GF    PICTURE X.
           02  FILLER REDEFINES FMFM2GF.
             03 FMFM2GA    PICTURE X.
           02  FMFM2GI  PIC X(1).
           02  FMFM2BL    COMP  PIC  S9(4).
           02  FMFM2BF    PICTURE X.
           02  FILLER REDEFINES FMFM2BF.
             03 FMFM2BA    PICTURE X.
           02  FMFM2BI  PIC X(1).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFM20AO REDEFINES FIFM20AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMFM99O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM2DO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM2AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM2EO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM2CO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM98O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM2GO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM2BO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).