       01  FIFMPPAI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMTRNNL    COMP  PIC  S9(4).
           02  FMTRNNF    PICTURE X.
           02  FILLER REDEFINES FMTRNNF.
             03 FMTRNNA    PICTURE X.
           02  FMTRNNI  PIC X(4).
           02  FMACT1L    COMP  PIC  S9(4).
           02  FMACT1F    PICTURE X.
           02  FILLER REDEFINES FMACT1F.
             03 FMACT1A    PICTURE X.
           02  FMACT1I  PIC X(1).
           02  FMTRN1L    COMP  PIC  S9(4).
           02  FMTRN1F    PICTURE X.
           02  FILLER REDEFINES FMTRN1F.
             03 FMTRN1A    PICTURE X.
           02  FMTRN1I  PIC X(4).
           02  FMDSC1L    COMP  PIC  S9(4).
           02  FMDSC1F    PICTURE X.
           02  FILLER REDEFINES FMDSC1F.
             03 FMDSC1A    PICTURE X.
           02  FMDSC1I  PIC X(25).
           02  FMAMT1L    COMP  PIC  S9(4).
           02  FMAMT1F    PICTURE X.
           02  FILLER REDEFINES FMAMT1F.
             03 FMAMT1A    PICTURE X.
           02  FMAMT1I  PIC X(19).
           02  FMNPD1L    COMP  PIC  S9(4).
           02  FMNPD1F    PICTURE X.
           02  FILLER REDEFINES FMNPD1F.
             03 FMNPD1A    PICTURE X.
           02  FMNPD1I  PIC X(8).
           02  FMEXD1L    COMP  PIC  S9(4).
           02  FMEXD1F    PICTURE X.
           02  FILLER REDEFINES FMEXD1F.
             03 FMEXD1A    PICTURE X.
           02  FMEXD1I  PIC X(8).
           02  FMACT2L    COMP  PIC  S9(4).
           02  FMACT2F    PICTURE X.
           02  FILLER REDEFINES FMACT2F.
             03 FMACT2A    PICTURE X.
           02  FMACT2I  PIC X(1).
           02  FMTRN2L    COMP  PIC  S9(4).
           02  FMTRN2F    PICTURE X.
           02  FILLER REDEFINES FMTRN2F.
             03 FMTRN2A    PICTURE X.
           02  FMTRN2I  PIC X(4).
           02  FMDSC2L    COMP  PIC  S9(4).
           02  FMDSC2F    PICTURE X.
           02  FILLER REDEFINES FMDSC2F.
             03 FMDSC2A    PICTURE X.
           02  FMDSC2I  PIC X(25).
           02  FMAMT2L    COMP  PIC  S9(4).
           02  FMAMT2F    PICTURE X.
           02  FILLER REDEFINES FMAMT2F.
             03 FMAMT2A    PICTURE X.
           02  FMAMT2I  PIC X(19).
           02  FMNPD2L    COMP  PIC  S9(4).
           02  FMNPD2F    PICTURE X.
           02  FILLER REDEFINES FMNPD2F.
             03 FMNPD2A    PICTURE X.
           02  FMNPD2I  PIC X(8).
           02  FMEXD2L    COMP  PIC  S9(4).
           02  FMEXD2F    PICTURE X.
           02  FILLER REDEFINES FMEXD2F.
             03 FMEXD2A    PICTURE X.
           02  FMEXD2I  PIC X(8).
           02  FMACT3L    COMP  PIC  S9(4).
           02  FMACT3F    PICTURE X.
           02  FILLER REDEFINES FMACT3F.
             03 FMACT3A    PICTURE X.
           02  FMACT3I  PIC X(1).
           02  FMTRN3L    COMP  PIC  S9(4).
           02  FMTRN3F    PICTURE X.
           02  FILLER REDEFINES FMTRN3F.
             03 FMTRN3A    PICTURE X.
           02  FMTRN3I  PIC X(4).
           02  FMDSC3L    COMP  PIC  S9(4).
           02  FMDSC3F    PICTURE X.
           02  FILLER REDEFINES FMDSC3F.
             03 FMDSC3A    PICTURE X.
           02  FMDSC3I  PIC X(25).
           02  FMAMT3L    COMP  PIC  S9(4).
           02  FMAMT3F    PICTURE X.
           02  FILLER REDEFINES FMAMT3F.
             03 FMAMT3A    PICTURE X.
           02  FMAMT3I  PIC X(19).
           02  FMNPD3L    COMP  PIC  S9(4).
           02  FMNPD3F    PICTURE X.
           02  FILLER REDEFINES FMNPD3F.
             03 FMNPD3A    PICTURE X.
           02  FMNPD3I  PIC X(8).
           02  FMEXD3L    COMP  PIC  S9(4).
           02  FMEXD3F    PICTURE X.
           02  FILLER REDEFINES FMEXD3F.
             03 FMEXD3A    PICTURE X.
           02  FMEXD3I  PIC X(8).
           02  FMACT4L    COMP  PIC  S9(4).
           02  FMACT4F    PICTURE X.
           02  FILLER REDEFINES FMACT4F.
             03 FMACT4A    PICTURE X.
           02  FMACT4I  PIC X(1).
           02  FMTRN4L    COMP  PIC  S9(4).
           02  FMTRN4F    PICTURE X.
           02  FILLER REDEFINES FMTRN4F.
             03 FMTRN4A    PICTURE X.
           02  FMTRN4I  PIC X(4).
           02  FMDSC4L    COMP  PIC  S9(4).
           02  FMDSC4F    PICTURE X.
           02  FILLER REDEFINES FMDSC4F.
             03 FMDSC4A    PICTURE X.
           02  FMDSC4I  PIC X(25).
           02  FMAMT4L    COMP  PIC  S9(4).
           02  FMAMT4F    PICTURE X.
           02  FILLER REDEFINES FMAMT4F.
             03 FMAMT4A    PICTURE X.
           02  FMAMT4I  PIC X(19).
           02  FMNPD4L    COMP  PIC  S9(4).
           02  FMNPD4F    PICTURE X.
           02  FILLER REDEFINES FMNPD4F.
             03 FMNPD4A    PICTURE X.
           02  FMNPD4I  PIC X(8).
           02  FMEXD4L    COMP  PIC  S9(4).
           02  FMEXD4F    PICTURE X.
           02  FILLER REDEFINES FMEXD4F.
             03 FMEXD4A    PICTURE X.
           02  FMEXD4I  PIC X(8).
           02  FMACT5L    COMP  PIC  S9(4).
           02  FMACT5F    PICTURE X.
           02  FILLER REDEFINES FMACT5F.
             03 FMACT5A    PICTURE X.
           02  FMACT5I  PIC X(1).
           02  FMTRN5L    COMP  PIC  S9(4).
           02  FMTRN5F    PICTURE X.
           02  FILLER REDEFINES FMTRN5F.
             03 FMTRN5A    PICTURE X.
           02  FMTRN5I  PIC X(4).
           02  FMDSC5L    COMP  PIC  S9(4).
           02  FMDSC5F    PICTURE X.
           02  FILLER REDEFINES FMDSC5F.
             03 FMDSC5A    PICTURE X.
           02  FMDSC5I  PIC X(25).
           02  FMAMT5L    COMP  PIC  S9(4).
           02  FMAMT5F    PICTURE X.
           02  FILLER REDEFINES FMAMT5F.
             03 FMAMT5A    PICTURE X.
           02  FMAMT5I  PIC X(19).
           02  FMNPD5L    COMP  PIC  S9(4).
           02  FMNPD5F    PICTURE X.
           02  FILLER REDEFINES FMNPD5F.
             03 FMNPD5A    PICTURE X.
           02  FMNPD5I  PIC X(8).
           02  FMEXD5L    COMP  PIC  S9(4).
           02  FMEXD5F    PICTURE X.
           02  FILLER REDEFINES FMEXD5F.
             03 FMEXD5A    PICTURE X.
           02  FMEXD5I  PIC X(8).
           02  FMACT6L    COMP  PIC  S9(4).
           02  FMACT6F    PICTURE X.
           02  FILLER REDEFINES FMACT6F.
             03 FMACT6A    PICTURE X.
           02  FMACT6I  PIC X(1).
           02  FMTRN6L    COMP  PIC  S9(4).
           02  FMTRN6F    PICTURE X.
           02  FILLER REDEFINES FMTRN6F.
             03 FMTRN6A    PICTURE X.
           02  FMTRN6I  PIC X(4).
           02  FMDSC6L    COMP  PIC  S9(4).
           02  FMDSC6F    PICTURE X.
           02  FILLER REDEFINES FMDSC6F.
             03 FMDSC6A    PICTURE X.
           02  FMDSC6I  PIC X(25).
           02  FMAMT6L    COMP  PIC  S9(4).
           02  FMAMT6F    PICTURE X.
           02  FILLER REDEFINES FMAMT6F.
             03 FMAMT6A    PICTURE X.
           02  FMAMT6I  PIC X(19).
           02  FMNPD6L    COMP  PIC  S9(4).
           02  FMNPD6F    PICTURE X.
           02  FILLER REDEFINES FMNPD6F.
             03 FMNPD6A    PICTURE X.
           02  FMNPD6I  PIC X(8).
           02  FMEXD6L    COMP  PIC  S9(4).
           02  FMEXD6F    PICTURE X.
           02  FILLER REDEFINES FMEXD6F.
             03 FMEXD6A    PICTURE X.
           02  FMEXD6I  PIC X(8).
           02  FMACT7L    COMP  PIC  S9(4).
           02  FMACT7F    PICTURE X.
           02  FILLER REDEFINES FMACT7F.
             03 FMACT7A    PICTURE X.
           02  FMACT7I  PIC X(1).
           02  FMTRN7L    COMP  PIC  S9(4).
           02  FMTRN7F    PICTURE X.
           02  FILLER REDEFINES FMTRN7F.
             03 FMTRN7A    PICTURE X.
           02  FMTRN7I  PIC X(4).
           02  FMDSC7L    COMP  PIC  S9(4).
           02  FMDSC7F    PICTURE X.
           02  FILLER REDEFINES FMDSC7F.
             03 FMDSC7A    PICTURE X.
           02  FMDSC7I  PIC X(25).
           02  FMAMT7L    COMP  PIC  S9(4).
           02  FMAMT7F    PICTURE X.
           02  FILLER REDEFINES FMAMT7F.
             03 FMAMT7A    PICTURE X.
           02  FMAMT7I  PIC X(19).
           02  FMNPD7L    COMP  PIC  S9(4).
           02  FMNPD7F    PICTURE X.
           02  FILLER REDEFINES FMNPD7F.
             03 FMNPD7A    PICTURE X.
           02  FMNPD7I  PIC X(8).
           02  FMEXD7L    COMP  PIC  S9(4).
           02  FMEXD7F    PICTURE X.
           02  FILLER REDEFINES FMEXD7F.
             03 FMEXD7A    PICTURE X.
           02  FMEXD7I  PIC X(8).
           02  FMACT8L    COMP  PIC  S9(4).
           02  FMACT8F    PICTURE X.
           02  FILLER REDEFINES FMACT8F.
             03 FMACT8A    PICTURE X.
           02  FMACT8I  PIC X(1).
           02  FMTRN8L    COMP  PIC  S9(4).
           02  FMTRN8F    PICTURE X.
           02  FILLER REDEFINES FMTRN8F.
             03 FMTRN8A    PICTURE X.
           02  FMTRN8I  PIC X(4).
           02  FMDSC8L    COMP  PIC  S9(4).
           02  FMDSC8F    PICTURE X.
           02  FILLER REDEFINES FMDSC8F.
             03 FMDSC8A    PICTURE X.
           02  FMDSC8I  PIC X(25).
           02  FMAMT8L    COMP  PIC  S9(4).
           02  FMAMT8F    PICTURE X.
           02  FILLER REDEFINES FMAMT8F.
             03 FMAMT8A    PICTURE X.
           02  FMAMT8I  PIC X(19).
           02  FMNPD8L    COMP  PIC  S9(4).
           02  FMNPD8F    PICTURE X.
           02  FILLER REDEFINES FMNPD8F.
             03 FMNPD8A    PICTURE X.
           02  FMNPD8I  PIC X(8).
           02  FMEXD8L    COMP  PIC  S9(4).
           02  FMEXD8F    PICTURE X.
           02  FILLER REDEFINES FMEXD8F.
             03 FMEXD8A    PICTURE X.
           02  FMEXD8I  PIC X(8).
           02  FMACT9L    COMP  PIC  S9(4).
           02  FMACT9F    PICTURE X.
           02  FILLER REDEFINES FMACT9F.
             03 FMACT9A    PICTURE X.
           02  FMACT9I  PIC X(1).
           02  FMTRN9L    COMP  PIC  S9(4).
           02  FMTRN9F    PICTURE X.
           02  FILLER REDEFINES FMTRN9F.
             03 FMTRN9A    PICTURE X.
           02  FMTRN9I  PIC X(4).
           02  FMDSC9L    COMP  PIC  S9(4).
           02  FMDSC9F    PICTURE X.
           02  FILLER REDEFINES FMDSC9F.
             03 FMDSC9A    PICTURE X.
           02  FMDSC9I  PIC X(25).
           02  FMAMT9L    COMP  PIC  S9(4).
           02  FMAMT9F    PICTURE X.
           02  FILLER REDEFINES FMAMT9F.
             03 FMAMT9A    PICTURE X.
           02  FMAMT9I  PIC X(19).
           02  FMNPD9L    COMP  PIC  S9(4).
           02  FMNPD9F    PICTURE X.
           02  FILLER REDEFINES FMNPD9F.
             03 FMNPD9A    PICTURE X.
           02  FMNPD9I  PIC X(8).
           02  FMEXD9L    COMP  PIC  S9(4).
           02  FMEXD9F    PICTURE X.
           02  FILLER REDEFINES FMEXD9F.
             03 FMEXD9A    PICTURE X.
           02  FMEXD9I  PIC X(8).
           02  FMACT10L    COMP  PIC  S9(4).
           02  FMACT10F    PICTURE X.
           02  FILLER REDEFINES FMACT10F.
             03 FMACT10A    PICTURE X.
           02  FMACT10I  PIC X(1).
           02  FMTRN10L    COMP  PIC  S9(4).
           02  FMTRN10F    PICTURE X.
           02  FILLER REDEFINES FMTRN10F.
             03 FMTRN10A    PICTURE X.
           02  FMTRN10I  PIC X(4).
           02  FMDSC10L    COMP  PIC  S9(4).
           02  FMDSC10F    PICTURE X.
           02  FILLER REDEFINES FMDSC10F.
             03 FMDSC10A    PICTURE X.
           02  FMDSC10I  PIC X(25).
           02  FMAMT10L    COMP  PIC  S9(4).
           02  FMAMT10F    PICTURE X.
           02  FILLER REDEFINES FMAMT10F.
             03 FMAMT10A    PICTURE X.
           02  FMAMT10I  PIC X(19).
           02  FMNPD10L    COMP  PIC  S9(4).
           02  FMNPD10F    PICTURE X.
           02  FILLER REDEFINES FMNPD10F.
             03 FMNPD10A    PICTURE X.
           02  FMNPD10I  PIC X(8).
           02  FMEXD10L    COMP  PIC  S9(4).
           02  FMEXD10F    PICTURE X.
           02  FILLER REDEFINES FMEXD10F.
             03 FMEXD10A    PICTURE X.
           02  FMEXD10I  PIC X(8).
           02  FMACT11L    COMP  PIC  S9(4).
           02  FMACT11F    PICTURE X.
           02  FILLER REDEFINES FMACT11F.
             03 FMACT11A    PICTURE X.
           02  FMACT11I  PIC X(1).
           02  FMTRN11L    COMP  PIC  S9(4).
           02  FMTRN11F    PICTURE X.
           02  FILLER REDEFINES FMTRN11F.
             03 FMTRN11A    PICTURE X.
           02  FMTRN11I  PIC X(4).
           02  FMDSC11L    COMP  PIC  S9(4).
           02  FMDSC11F    PICTURE X.
           02  FILLER REDEFINES FMDSC11F.
             03 FMDSC11A    PICTURE X.
           02  FMDSC11I  PIC X(25).
           02  FMAMT11L    COMP  PIC  S9(4).
           02  FMAMT11F    PICTURE X.
           02  FILLER REDEFINES FMAMT11F.
             03 FMAMT11A    PICTURE X.
           02  FMAMT11I  PIC X(19).
           02  FMNPD11L    COMP  PIC  S9(4).
           02  FMNPD11F    PICTURE X.
           02  FILLER REDEFINES FMNPD11F.
             03 FMNPD11A    PICTURE X.
           02  FMNPD11I  PIC X(8).
           02  FMEXD11L    COMP  PIC  S9(4).
           02  FMEXD11F    PICTURE X.
           02  FILLER REDEFINES FMEXD11F.
             03 FMEXD11A    PICTURE X.
           02  FMEXD11I  PIC X(8).
           02  FMACT12L    COMP  PIC  S9(4).
           02  FMACT12F    PICTURE X.
           02  FILLER REDEFINES FMACT12F.
             03 FMACT12A    PICTURE X.
           02  FMACT12I  PIC X(1).
           02  FMTRN12L    COMP  PIC  S9(4).
           02  FMTRN12F    PICTURE X.
           02  FILLER REDEFINES FMTRN12F.
             03 FMTRN12A    PICTURE X.
           02  FMTRN12I  PIC X(4).
           02  FMDSC12L    COMP  PIC  S9(4).
           02  FMDSC12F    PICTURE X.
           02  FILLER REDEFINES FMDSC12F.
             03 FMDSC12A    PICTURE X.
           02  FMDSC12I  PIC X(25).
           02  FMAMT12L    COMP  PIC  S9(4).
           02  FMAMT12F    PICTURE X.
           02  FILLER REDEFINES FMAMT12F.
             03 FMAMT12A    PICTURE X.
           02  FMAMT12I  PIC X(19).
           02  FMNPD12L    COMP  PIC  S9(4).
           02  FMNPD12F    PICTURE X.
           02  FILLER REDEFINES FMNPD12F.
             03 FMNPD12A    PICTURE X.
           02  FMNPD12I  PIC X(8).
           02  FMEXD12L    COMP  PIC  S9(4).
           02  FMEXD12F    PICTURE X.
           02  FILLER REDEFINES FMEXD12F.
             03 FMEXD12A    PICTURE X.
           02  FMEXD12I  PIC X(8).
           02  FMACT13L    COMP  PIC  S9(4).
           02  FMACT13F    PICTURE X.
           02  FILLER REDEFINES FMACT13F.
             03 FMACT13A    PICTURE X.
           02  FMACT13I  PIC X(1).
           02  FMTRN13L    COMP  PIC  S9(4).
           02  FMTRN13F    PICTURE X.
           02  FILLER REDEFINES FMTRN13F.
             03 FMTRN13A    PICTURE X.
           02  FMTRN13I  PIC X(4).
           02  FMDSC13L    COMP  PIC  S9(4).
           02  FMDSC13F    PICTURE X.
           02  FILLER REDEFINES FMDSC13F.
             03 FMDSC13A    PICTURE X.
           02  FMDSC13I  PIC X(25).
           02  FMAMT13L    COMP  PIC  S9(4).
           02  FMAMT13F    PICTURE X.
           02  FILLER REDEFINES FMAMT13F.
             03 FMAMT13A    PICTURE X.
           02  FMAMT13I  PIC X(19).
           02  FMNPD13L    COMP  PIC  S9(4).
           02  FMNPD13F    PICTURE X.
           02  FILLER REDEFINES FMNPD13F.
             03 FMNPD13A    PICTURE X.
           02  FMNPD13I  PIC X(8).
           02  FMEXD13L    COMP  PIC  S9(4).
           02  FMEXD13F    PICTURE X.
           02  FILLER REDEFINES FMEXD13F.
             03 FMEXD13A    PICTURE X.
           02  FMEXD13I  PIC X(8).
           02  FMACT14L    COMP  PIC  S9(4).
           02  FMACT14F    PICTURE X.
           02  FILLER REDEFINES FMACT14F.
             03 FMACT14A    PICTURE X.
           02  FMACT14I  PIC X(1).
           02  FMTRN14L    COMP  PIC  S9(4).
           02  FMTRN14F    PICTURE X.
           02  FILLER REDEFINES FMTRN14F.
             03 FMTRN14A    PICTURE X.
           02  FMTRN14I  PIC X(4).
           02  FMDSC14L    COMP  PIC  S9(4).
           02  FMDSC14F    PICTURE X.
           02  FILLER REDEFINES FMDSC14F.
             03 FMDSC14A    PICTURE X.
           02  FMDSC14I  PIC X(25).
           02  FMAMT14L    COMP  PIC  S9(4).
           02  FMAMT14F    PICTURE X.
           02  FILLER REDEFINES FMAMT14F.
             03 FMAMT14A    PICTURE X.
           02  FMAMT14I  PIC X(19).
           02  FMNPD14L    COMP  PIC  S9(4).
           02  FMNPD14F    PICTURE X.
           02  FILLER REDEFINES FMNPD14F.
             03 FMNPD14A    PICTURE X.
           02  FMNPD14I  PIC X(8).
           02  FMEXD14L    COMP  PIC  S9(4).
           02  FMEXD14F    PICTURE X.
           02  FILLER REDEFINES FMEXD14F.
             03 FMEXD14A    PICTURE X.
           02  FMEXD14I  PIC X(8).
           02  FMACT15L    COMP  PIC  S9(4).
           02  FMACT15F    PICTURE X.
           02  FILLER REDEFINES FMACT15F.
             03 FMACT15A    PICTURE X.
           02  FMACT15I  PIC X(1).
           02  FMTRN15L    COMP  PIC  S9(4).
           02  FMTRN15F    PICTURE X.
           02  FILLER REDEFINES FMTRN15F.
             03 FMTRN15A    PICTURE X.
           02  FMTRN15I  PIC X(4).
           02  FMDSC15L    COMP  PIC  S9(4).
           02  FMDSC15F    PICTURE X.
           02  FILLER REDEFINES FMDSC15F.
             03 FMDSC15A    PICTURE X.
           02  FMDSC15I  PIC X(25).
           02  FMAMT15L    COMP  PIC  S9(4).
           02  FMAMT15F    PICTURE X.
           02  FILLER REDEFINES FMAMT15F.
             03 FMAMT15A    PICTURE X.
           02  FMAMT15I  PIC X(19).
           02  FMNPD15L    COMP  PIC  S9(4).
           02  FMNPD15F    PICTURE X.
           02  FILLER REDEFINES FMNPD15F.
             03 FMNPD15A    PICTURE X.
           02  FMNPD15I  PIC X(8).
           02  FMEXD15L    COMP  PIC  S9(4).
           02  FMEXD15F    PICTURE X.
           02  FILLER REDEFINES FMEXD15F.
             03 FMEXD15A    PICTURE X.
           02  FMEXD15I  PIC X(8).
           02  FMPGFWDL    COMP  PIC  S9(4).
           02  FMPGFWDF    PICTURE X.
           02  FILLER REDEFINES FMPGFWDF.
             03 FMPGFWDA    PICTURE X.
           02  FMPGFWDI  PIC X(18).
           02  FMPGBKDL    COMP  PIC  S9(4).
           02  FMPGBKDF    PICTURE X.
           02  FILLER REDEFINES FMPGBKDF.
             03 FMPGBKDA    PICTURE X.
           02  FMPGBKDI  PIC X(19).
           02  FMERRL    COMP  PIC  S9(4).
           02  FMERRF    PICTURE X.
           02  FILLER REDEFINES FMERRF.
             03 FMERRA    PICTURE X.
           02  FMERRI  PIC X(79).
       01  FIFMPPAO REDEFINES FIFMPPAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTRNNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN1O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC1O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT1O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN2O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC2O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT2O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN3O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC3O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT3O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC4O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT4O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD4O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD4O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN5O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC5O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT5O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD5O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD5O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN6O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC6O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT6O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD6O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD6O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN7O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC7O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT7O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD7O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD7O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN8O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC8O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT8O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD8O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD8O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN9O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC9O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT9O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD9O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD9O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN10O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC10O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT10O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN11O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC11O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT11O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD11O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD11O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN12O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC12O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT12O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN13O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC13O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT13O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT14O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN14O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC14O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT14O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD14O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD14O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMACT15O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTRN15O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDSC15O  PIC X(25).
           02  FILLER PICTURE X(3).
           02  FMAMT15O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMNPD15O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMEXD15O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPGFWDO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMPGBKDO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMERRO  PIC X(79).