       01  FIFMMADI.
           02  FILLER PIC X(12).
           02  FMFLLR1L    COMP  PIC  S9(4).
           02  FMFLLR1F    PICTURE X.
           02  FILLER REDEFINES FMFLLR1F.
             03 FMFLLR1A    PICTURE X.
           02  FMFLLR1I  PIC X(239).
           02  FMFLLR2L    COMP  PIC  S9(4).
           02  FMFLLR2F    PICTURE X.
           02  FILLER REDEFINES FMFLLR2F.
             03 FMFLLR2A    PICTURE X.
           02  FMFLLR2I  PIC X(239).
           02  FMFLLR3L    COMP  PIC  S9(4).
           02  FMFLLR3F    PICTURE X.
           02  FILLER REDEFINES FMFLLR3F.
             03 FMFLLR3A    PICTURE X.
           02  FMFLLR3I  PIC X(239).
           02  FMFLLR4L    COMP  PIC  S9(4).
           02  FMFLLR4F    PICTURE X.
           02  FILLER REDEFINES FMFLLR4F.
             03 FMFLLR4A    PICTURE X.
           02  FMFLLR4I  PIC X(239).
           02  FMFLLR5L    COMP  PIC  S9(4).
           02  FMFLLR5F    PICTURE X.
           02  FILLER REDEFINES FMFLLR5F.
             03 FMFLLR5A    PICTURE X.
           02  FMFLLR5I  PIC X(239).
           02  FMFLLR6L    COMP  PIC  S9(4).
           02  FMFLLR6F    PICTURE X.
           02  FILLER REDEFINES FMFLLR6F.
             03 FMFLLR6A    PICTURE X.
           02  FMFLLR6I  PIC X(239).
           02  FMFLLR7L    COMP  PIC  S9(4).
           02  FMFLLR7F    PICTURE X.
           02  FILLER REDEFINES FMFLLR7F.
             03 FMFLLR7A    PICTURE X.
           02  FMFLLR7I  PIC X(239).
           02  FMFLLR8L    COMP  PIC  S9(4).
           02  FMFLLR8F    PICTURE X.
           02  FILLER REDEFINES FMFLLR8F.
             03 FMFLLR8A    PICTURE X.
           02  FMFLLR8I  PIC X(220).
       01  FIFMMADO REDEFINES FIFMMADI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMFLLR1O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR2O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR3O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR4O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR5O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR6O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR7O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR8O  PIC X(220).
       01  FIFMMABI REDEFINES FIFMMADI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMBTCHBL    COMP  PIC  S9(4).
           02  FMBTCHBF    PICTURE X.
           02  FILLER REDEFINES FMBTCHBF.
             03 FMBTCHBA    PICTURE X.
           02  FMBTCHBI  PIC X(5).
           02  FMDEPTBL    COMP  PIC  S9(4).
           02  FMDEPTBF    PICTURE X.
           02  FILLER REDEFINES FMDEPTBF.
             03 FMDEPTBA    PICTURE X.
           02  FMDEPTBI  PIC X(3).
           02  FMCUSTBL    COMP  PIC  S9(4).
           02  FMCUSTBF    PICTURE X.
           02  FILLER REDEFINES FMCUSTBF.
             03 FMCUSTBA    PICTURE X.
           02  FMCUSTBI  PIC X(4).
           02  FMERRL    COMP  PIC  S9(4).
           02  FMERRF    PICTURE X.
           02  FILLER REDEFINES FMERRF.
             03 FMERRA    PICTURE X.
           02  FMERRI  PIC X(79).
       01  FIFMMABO REDEFINES FIFMMABI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMBTCHBO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  FMDEPTBO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMCUSTBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMERRO  PIC X(79).
       01  FIFMMACI REDEFINES FIFMMADI.
           02  FILLER PIC X(12).
           02  FMTRIDCL    COMP  PIC  S9(4).
           02  FMTRIDCF    PICTURE X.
           02  FILLER REDEFINES FMTRIDCF.
             03 FMTRIDCA    PICTURE X.
           02  FMTRIDCI  PIC X(4).
           02  FMDATE2L    COMP  PIC  S9(4).
           02  FMDATE2F    PICTURE X.
           02  FILLER REDEFINES FMDATE2F.
             03 FMDATE2A    PICTURE X.
           02  FMDATE2I  PIC X(8).
           02  FMTIMECL    COMP  PIC  S9(4).
           02  FMTIMECF    PICTURE X.
           02  FILLER REDEFINES FMTIMECF.
             03 FMTIMECA    PICTURE X.
           02  FMTIMECI  PIC X(8).
           02  FMBATCHL    COMP  PIC  S9(4).
           02  FMBATCHF    PICTURE X.
           02  FILLER REDEFINES FMBATCHF.
             03 FMBATCHA    PICTURE X.
           02  FMBATCHI  PIC X(5).
           02  FMDEPTL    COMP  PIC  S9(4).
           02  FMDEPTF    PICTURE X.
           02  FILLER REDEFINES FMDEPTF.
             03 FMDEPTA    PICTURE X.
           02  FMDEPTI  PIC X(3).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMTYPEL    COMP  PIC  S9(4).
           02  FMTYPEF    PICTURE X.
           02  FILLER REDEFINES FMTYPEF.
             03 FMTYPEA    PICTURE X.
           02  FMTYPEI  PIC X(13).
           02  FMDATELL    COMP  PIC  S9(4).
           02  FMDATELF    PICTURE X.
           02  FILLER REDEFINES FMDATELF.
             03 FMDATELA    PICTURE X.
           02  FMDATELI  PIC X(11).
           02  FMDATE3L    COMP  PIC  S9(4).
           02  FMDATE3F    PICTURE X.
           02  FILLER REDEFINES FMDATE3F.
             03 FMDATE3A    PICTURE X.
           02  FMDATE3I  PIC X(8).
           02  FMSTATL    COMP  PIC  S9(4).
           02  FMSTATF    PICTURE X.
           02  FILLER REDEFINES FMSTATF.
             03 FMSTATA    PICTURE X.
           02  FMSTATI  PIC X(35).
           02  FMPERMLL    COMP  PIC  S9(4).
           02  FMPERMLF    PICTURE X.
           02  FILLER REDEFINES FMPERMLF.
             03 FMPERMLA    PICTURE X.
           02  FMPERMLI  PIC X(15).
           02  FMFDATLL    COMP  PIC  S9(4).
           02  FMFDATLF    PICTURE X.
           02  FILLER REDEFINES FMFDATLF.
             03 FMFDATLA    PICTURE X.
           02  FMFDATLI  PIC X(9).
           02  FMFDATL    COMP  PIC  S9(4).
           02  FMFDATF    PICTURE X.
           02  FILLER REDEFINES FMFDATF.
             03 FMFDATA    PICTURE X.
           02  FMFDATI  PIC X(8).
           02  FMRCAL    COMP  PIC  S9(4).
           02  FMRCAF    PICTURE X.
           02  FILLER REDEFINES FMRCAF.
             03 FMRCAA    PICTURE X.
           02  FMRCAI  PIC X(10).
           02  FMACCTAL    COMP  PIC  S9(4).
           02  FMACCTAF    PICTURE X.
           02  FILLER REDEFINES FMACCTAF.
             03 FMACCTAA    PICTURE X.
           02  FMACCTAI  PIC X(10).
           02  FMTRCDAL    COMP  PIC  S9(4).
           02  FMTRCDAF    PICTURE X.
           02  FILLER REDEFINES FMTRCDAF.
             03 FMTRCDAA    PICTURE X.
           02  FMTRCDAI  PIC X(2).
           02  FMAMTAL    COMP  PIC  S9(4).
           02  FMAMTAF    PICTURE X.
           02  FILLER REDEFINES FMAMTAF.
             03 FMAMTAA    PICTURE X.
           02  FMAMTAI  PIC X(18).
           02  FMREFNAL    COMP  PIC  S9(4).
           02  FMREFNAF    PICTURE X.
           02  FILLER REDEFINES FMREFNAF.
             03 FMREFNAA    PICTURE X.
           02  FMREFNAI  PIC X(8).
           02  FMSRCAL    COMP  PIC  S9(4).
           02  FMSRCAF    PICTURE X.
           02  FILLER REDEFINES FMSRCAF.
             03 FMSRCAA    PICTURE X.
           02  FMSRCAI  PIC X(3).
           02  FMDESCAL    COMP  PIC  S9(4).
           02  FMDESCAF    PICTURE X.
           02  FILLER REDEFINES FMDESCAF.
             03 FMDESCAA    PICTURE X.
           02  FMDESCAI  PIC X(19).
           02  FMOFFSAL    COMP  PIC  S9(4).
           02  FMOFFSAF    PICTURE X.
           02  FILLER REDEFINES FMOFFSAF.
             03 FMOFFSAA    PICTURE X.
           02  FMOFFSAI  PIC X(2).
           02  FMRCBL    COMP  PIC  S9(4).
           02  FMRCBF    PICTURE X.
           02  FILLER REDEFINES FMRCBF.
             03 FMRCBA    PICTURE X.
           02  FMRCBI  PIC X(10).
           02  FMACCTBL    COMP  PIC  S9(4).
           02  FMACCTBF    PICTURE X.
           02  FILLER REDEFINES FMACCTBF.
             03 FMACCTBA    PICTURE X.
           02  FMACCTBI  PIC X(10).
           02  FMTRCDBL    COMP  PIC  S9(4).
           02  FMTRCDBF    PICTURE X.
           02  FILLER REDEFINES FMTRCDBF.
             03 FMTRCDBA    PICTURE X.
           02  FMTRCDBI  PIC X(2).
           02  FMAMTBL    COMP  PIC  S9(4).
           02  FMAMTBF    PICTURE X.
           02  FILLER REDEFINES FMAMTBF.
             03 FMAMTBA    PICTURE X.
           02  FMAMTBI  PIC X(18).
           02  FMREFNBL    COMP  PIC  S9(4).
           02  FMREFNBF    PICTURE X.
           02  FILLER REDEFINES FMREFNBF.
             03 FMREFNBA    PICTURE X.
           02  FMREFNBI  PIC X(8).
           02  FMSRCBL    COMP  PIC  S9(4).
           02  FMSRCBF    PICTURE X.
           02  FILLER REDEFINES FMSRCBF.
             03 FMSRCBA    PICTURE X.
           02  FMSRCBI  PIC X(3).
           02  FMDESCBL    COMP  PIC  S9(4).
           02  FMDESCBF    PICTURE X.
           02  FILLER REDEFINES FMDESCBF.
             03 FMDESCBA    PICTURE X.
           02  FMDESCBI  PIC X(19).
           02  FMOFFSBL    COMP  PIC  S9(4).
           02  FMOFFSBF    PICTURE X.
           02  FILLER REDEFINES FMOFFSBF.
             03 FMOFFSBA    PICTURE X.
           02  FMOFFSBI  PIC X(2).
           02  FMRCCL    COMP  PIC  S9(4).
           02  FMRCCF    PICTURE X.
           02  FILLER REDEFINES FMRCCF.
             03 FMRCCA    PICTURE X.
           02  FMRCCI  PIC X(10).
           02  FMACCTCL    COMP  PIC  S9(4).
           02  FMACCTCF    PICTURE X.
           02  FILLER REDEFINES FMACCTCF.
             03 FMACCTCA    PICTURE X.
           02  FMACCTCI  PIC X(10).
           02  FMTRCDCL    COMP  PIC  S9(4).
           02  FMTRCDCF    PICTURE X.
           02  FILLER REDEFINES FMTRCDCF.
             03 FMTRCDCA    PICTURE X.
           02  FMTRCDCI  PIC X(2).
           02  FMAMTCL    COMP  PIC  S9(4).
           02  FMAMTCF    PICTURE X.
           02  FILLER REDEFINES FMAMTCF.
             03 FMAMTCA    PICTURE X.
           02  FMAMTCI  PIC X(18).
           02  FMREFNCL    COMP  PIC  S9(4).
           02  FMREFNCF    PICTURE X.
           02  FILLER REDEFINES FMREFNCF.
             03 FMREFNCA    PICTURE X.
           02  FMREFNCI  PIC X(8).
           02  FMSRCCL    COMP  PIC  S9(4).
           02  FMSRCCF    PICTURE X.
           02  FILLER REDEFINES FMSRCCF.
             03 FMSRCCA    PICTURE X.
           02  FMSRCCI  PIC X(3).
           02  FMDESCCL    COMP  PIC  S9(4).
           02  FMDESCCF    PICTURE X.
           02  FILLER REDEFINES FMDESCCF.
             03 FMDESCCA    PICTURE X.
           02  FMDESCCI  PIC X(19).
           02  FMOFFSCL    COMP  PIC  S9(4).
           02  FMOFFSCF    PICTURE X.
           02  FILLER REDEFINES FMOFFSCF.
             03 FMOFFSCA    PICTURE X.
           02  FMOFFSCI  PIC X(2).
           02  FMRCDL    COMP  PIC  S9(4).
           02  FMRCDF    PICTURE X.
           02  FILLER REDEFINES FMRCDF.
             03 FMRCDA    PICTURE X.
           02  FMRCDI  PIC X(10).
           02  FMACCTDL    COMP  PIC  S9(4).
           02  FMACCTDF    PICTURE X.
           02  FILLER REDEFINES FMACCTDF.
             03 FMACCTDA    PICTURE X.
           02  FMACCTDI  PIC X(10).
           02  FMTRCDDL    COMP  PIC  S9(4).
           02  FMTRCDDF    PICTURE X.
           02  FILLER REDEFINES FMTRCDDF.
             03 FMTRCDDA    PICTURE X.
           02  FMTRCDDI  PIC X(2).
           02  FMAMTDL    COMP  PIC  S9(4).
           02  FMAMTDF    PICTURE X.
           02  FILLER REDEFINES FMAMTDF.
             03 FMAMTDA    PICTURE X.
           02  FMAMTDI  PIC X(18).
           02  FMREFNDL    COMP  PIC  S9(4).
           02  FMREFNDF    PICTURE X.
           02  FILLER REDEFINES FMREFNDF.
             03 FMREFNDA    PICTURE X.
           02  FMREFNDI  PIC X(8).
           02  FMSRCDL    COMP  PIC  S9(4).
           02  FMSRCDF    PICTURE X.
           02  FILLER REDEFINES FMSRCDF.
             03 FMSRCDA    PICTURE X.
           02  FMSRCDI  PIC X(3).
           02  FMDESCDL    COMP  PIC  S9(4).
           02  FMDESCDF    PICTURE X.
           02  FILLER REDEFINES FMDESCDF.
             03 FMDESCDA    PICTURE X.
           02  FMDESCDI  PIC X(19).
           02  FMOFFSDL    COMP  PIC  S9(4).
           02  FMOFFSDF    PICTURE X.
           02  FILLER REDEFINES FMOFFSDF.
             03 FMOFFSDA    PICTURE X.
           02  FMOFFSDI  PIC X(2).
           02  FMRCEL    COMP  PIC  S9(4).
           02  FMRCEF    PICTURE X.
           02  FILLER REDEFINES FMRCEF.
             03 FMRCEA    PICTURE X.
           02  FMRCEI  PIC X(10).
           02  FMACCTEL    COMP  PIC  S9(4).
           02  FMACCTEF    PICTURE X.
           02  FILLER REDEFINES FMACCTEF.
             03 FMACCTEA    PICTURE X.
           02  FMACCTEI  PIC X(10).
           02  FMTRCDEL    COMP  PIC  S9(4).
           02  FMTRCDEF    PICTURE X.
           02  FILLER REDEFINES FMTRCDEF.
             03 FMTRCDEA    PICTURE X.
           02  FMTRCDEI  PIC X(2).
           02  FMAMTEL    COMP  PIC  S9(4).
           02  FMAMTEF    PICTURE X.
           02  FILLER REDEFINES FMAMTEF.
             03 FMAMTEA    PICTURE X.
           02  FMAMTEI  PIC X(18).
           02  FMREFNEL    COMP  PIC  S9(4).
           02  FMREFNEF    PICTURE X.
           02  FILLER REDEFINES FMREFNEF.
             03 FMREFNEA    PICTURE X.
           02  FMREFNEI  PIC X(8).
           02  FMSRCEL    COMP  PIC  S9(4).
           02  FMSRCEF    PICTURE X.
           02  FILLER REDEFINES FMSRCEF.
             03 FMSRCEA    PICTURE X.
           02  FMSRCEI  PIC X(3).
           02  FMDESCEL    COMP  PIC  S9(4).
           02  FMDESCEF    PICTURE X.
           02  FILLER REDEFINES FMDESCEF.
             03 FMDESCEA    PICTURE X.
           02  FMDESCEI  PIC X(19).
           02  FMOFFSEL    COMP  PIC  S9(4).
           02  FMOFFSEF    PICTURE X.
           02  FILLER REDEFINES FMOFFSEF.
             03 FMOFFSEA    PICTURE X.
           02  FMOFFSEI  PIC X(2).
           02  FMRCFL    COMP  PIC  S9(4).
           02  FMRCFF    PICTURE X.
           02  FILLER REDEFINES FMRCFF.
             03 FMRCFA    PICTURE X.
           02  FMRCFI  PIC X(10).
           02  FMACCTFL    COMP  PIC  S9(4).
           02  FMACCTFF    PICTURE X.
           02  FILLER REDEFINES FMACCTFF.
             03 FMACCTFA    PICTURE X.
           02  FMACCTFI  PIC X(10).
           02  FMTRCDFL    COMP  PIC  S9(4).
           02  FMTRCDFF    PICTURE X.
           02  FILLER REDEFINES FMTRCDFF.
             03 FMTRCDFA    PICTURE X.
           02  FMTRCDFI  PIC X(2).
           02  FMAMTFL    COMP  PIC  S9(4).
           02  FMAMTFF    PICTURE X.
           02  FILLER REDEFINES FMAMTFF.
             03 FMAMTFA    PICTURE X.
           02  FMAMTFI  PIC X(18).
           02  FMREFNFL    COMP  PIC  S9(4).
           02  FMREFNFF    PICTURE X.
           02  FILLER REDEFINES FMREFNFF.
             03 FMREFNFA    PICTURE X.
           02  FMREFNFI  PIC X(8).
           02  FMSRCFL    COMP  PIC  S9(4).
           02  FMSRCFF    PICTURE X.
           02  FILLER REDEFINES FMSRCFF.
             03 FMSRCFA    PICTURE X.
           02  FMSRCFI  PIC X(3).
           02  FMDESCFL    COMP  PIC  S9(4).
           02  FMDESCFF    PICTURE X.
           02  FILLER REDEFINES FMDESCFF.
             03 FMDESCFA    PICTURE X.
           02  FMDESCFI  PIC X(19).
           02  FMOFFSFL    COMP  PIC  S9(4).
           02  FMOFFSFF    PICTURE X.
           02  FILLER REDEFINES FMOFFSFF.
             03 FMOFFSFA    PICTURE X.
           02  FMOFFSFI  PIC X(2).
           02  FMRCGL    COMP  PIC  S9(4).
           02  FMRCGF    PICTURE X.
           02  FILLER REDEFINES FMRCGF.
             03 FMRCGA    PICTURE X.
           02  FMRCGI  PIC X(10).
           02  FMACCTGL    COMP  PIC  S9(4).
           02  FMACCTGF    PICTURE X.
           02  FILLER REDEFINES FMACCTGF.
             03 FMACCTGA    PICTURE X.
           02  FMACCTGI  PIC X(10).
           02  FMTRCDGL    COMP  PIC  S9(4).
           02  FMTRCDGF    PICTURE X.
           02  FILLER REDEFINES FMTRCDGF.
             03 FMTRCDGA    PICTURE X.
           02  FMTRCDGI  PIC X(2).
           02  FMAMTGL    COMP  PIC  S9(4).
           02  FMAMTGF    PICTURE X.
           02  FILLER REDEFINES FMAMTGF.
             03 FMAMTGA    PICTURE X.
           02  FMAMTGI  PIC X(18).
           02  FMREFNGL    COMP  PIC  S9(4).
           02  FMREFNGF    PICTURE X.
           02  FILLER REDEFINES FMREFNGF.
             03 FMREFNGA    PICTURE X.
           02  FMREFNGI  PIC X(8).
           02  FMSRCGL    COMP  PIC  S9(4).
           02  FMSRCGF    PICTURE X.
           02  FILLER REDEFINES FMSRCGF.
             03 FMSRCGA    PICTURE X.
           02  FMSRCGI  PIC X(3).
           02  FMDESCGL    COMP  PIC  S9(4).
           02  FMDESCGF    PICTURE X.
           02  FILLER REDEFINES FMDESCGF.
             03 FMDESCGA    PICTURE X.
           02  FMDESCGI  PIC X(19).
           02  FMOFFSGL    COMP  PIC  S9(4).
           02  FMOFFSGF    PICTURE X.
           02  FILLER REDEFINES FMOFFSGF.
             03 FMOFFSGA    PICTURE X.
           02  FMOFFSGI  PIC X(2).
           02  FMRCHL    COMP  PIC  S9(4).
           02  FMRCHF    PICTURE X.
           02  FILLER REDEFINES FMRCHF.
             03 FMRCHA    PICTURE X.
           02  FMRCHI  PIC X(10).
           02  FMACCTHL    COMP  PIC  S9(4).
           02  FMACCTHF    PICTURE X.
           02  FILLER REDEFINES FMACCTHF.
             03 FMACCTHA    PICTURE X.
           02  FMACCTHI  PIC X(10).
           02  FMTRCDHL    COMP  PIC  S9(4).
           02  FMTRCDHF    PICTURE X.
           02  FILLER REDEFINES FMTRCDHF.
             03 FMTRCDHA    PICTURE X.
           02  FMTRCDHI  PIC X(2).
           02  FMAMTHL    COMP  PIC  S9(4).
           02  FMAMTHF    PICTURE X.
           02  FILLER REDEFINES FMAMTHF.
             03 FMAMTHA    PICTURE X.
           02  FMAMTHI  PIC X(18).
           02  FMREFNHL    COMP  PIC  S9(4).
           02  FMREFNHF    PICTURE X.
           02  FILLER REDEFINES FMREFNHF.
             03 FMREFNHA    PICTURE X.
           02  FMREFNHI  PIC X(8).
           02  FMSRCHL    COMP  PIC  S9(4).
           02  FMSRCHF    PICTURE X.
           02  FILLER REDEFINES FMSRCHF.
             03 FMSRCHA    PICTURE X.
           02  FMSRCHI  PIC X(3).
           02  FMDESCHL    COMP  PIC  S9(4).
           02  FMDESCHF    PICTURE X.
           02  FILLER REDEFINES FMDESCHF.
             03 FMDESCHA    PICTURE X.
           02  FMDESCHI  PIC X(19).
           02  FMOFFSHL    COMP  PIC  S9(4).
           02  FMOFFSHF    PICTURE X.
           02  FILLER REDEFINES FMOFFSHF.
             03 FMOFFSHA    PICTURE X.
           02  FMOFFSHI  PIC X(2).
           02  FMRCIL    COMP  PIC  S9(4).
           02  FMRCIF    PICTURE X.
           02  FILLER REDEFINES FMRCIF.
             03 FMRCIA    PICTURE X.
           02  FMRCII  PIC X(10).
           02  FMACCTIL    COMP  PIC  S9(4).
           02  FMACCTIF    PICTURE X.
           02  FILLER REDEFINES FMACCTIF.
             03 FMACCTIA    PICTURE X.
           02  FMACCTII  PIC X(10).
           02  FMTRCDIL    COMP  PIC  S9(4).
           02  FMTRCDIF    PICTURE X.
           02  FILLER REDEFINES FMTRCDIF.
             03 FMTRCDIA    PICTURE X.
           02  FMTRCDII  PIC X(2).
           02  FMAMTIL    COMP  PIC  S9(4).
           02  FMAMTIF    PICTURE X.
           02  FILLER REDEFINES FMAMTIF.
             03 FMAMTIA    PICTURE X.
           02  FMAMTII  PIC X(18).
           02  FMREFNIL    COMP  PIC  S9(4).
           02  FMREFNIF    PICTURE X.
           02  FILLER REDEFINES FMREFNIF.
             03 FMREFNIA    PICTURE X.
           02  FMREFNII  PIC X(8).
           02  FMSRCIL    COMP  PIC  S9(4).
           02  FMSRCIF    PICTURE X.
           02  FILLER REDEFINES FMSRCIF.
             03 FMSRCIA    PICTURE X.
           02  FMSRCII  PIC X(3).
           02  FMDESCIL    COMP  PIC  S9(4).
           02  FMDESCIF    PICTURE X.
           02  FILLER REDEFINES FMDESCIF.
             03 FMDESCIA    PICTURE X.
           02  FMDESCII  PIC X(19).
           02  FMOFFSIL    COMP  PIC  S9(4).
           02  FMOFFSIF    PICTURE X.
           02  FILLER REDEFINES FMOFFSIF.
             03 FMOFFSIA    PICTURE X.
           02  FMOFFSII  PIC X(2).
           02  FMRCJL    COMP  PIC  S9(4).
           02  FMRCJF    PICTURE X.
           02  FILLER REDEFINES FMRCJF.
             03 FMRCJA    PICTURE X.
           02  FMRCJI  PIC X(10).
           02  FMACCTJL    COMP  PIC  S9(4).
           02  FMACCTJF    PICTURE X.
           02  FILLER REDEFINES FMACCTJF.
             03 FMACCTJA    PICTURE X.
           02  FMACCTJI  PIC X(10).
           02  FMTRCDJL    COMP  PIC  S9(4).
           02  FMTRCDJF    PICTURE X.
           02  FILLER REDEFINES FMTRCDJF.
             03 FMTRCDJA    PICTURE X.
           02  FMTRCDJI  PIC X(2).
           02  FMAMTJL    COMP  PIC  S9(4).
           02  FMAMTJF    PICTURE X.
           02  FILLER REDEFINES FMAMTJF.
             03 FMAMTJA    PICTURE X.
           02  FMAMTJI  PIC X(18).
           02  FMREFNJL    COMP  PIC  S9(4).
           02  FMREFNJF    PICTURE X.
           02  FILLER REDEFINES FMREFNJF.
             03 FMREFNJA    PICTURE X.
           02  FMREFNJI  PIC X(8).
           02  FMSRCJL    COMP  PIC  S9(4).
           02  FMSRCJF    PICTURE X.
           02  FILLER REDEFINES FMSRCJF.
             03 FMSRCJA    PICTURE X.
           02  FMSRCJI  PIC X(3).
           02  FMDESCJL    COMP  PIC  S9(4).
           02  FMDESCJF    PICTURE X.
           02  FILLER REDEFINES FMDESCJF.
             03 FMDESCJA    PICTURE X.
           02  FMDESCJI  PIC X(19).
           02  FMOFFSJL    COMP  PIC  S9(4).
           02  FMOFFSJF    PICTURE X.
           02  FILLER REDEFINES FMOFFSJF.
             03 FMOFFSJA    PICTURE X.
           02  FMOFFSJI  PIC X(2).
           02  FMRCKL    COMP  PIC  S9(4).
           02  FMRCKF    PICTURE X.
           02  FILLER REDEFINES FMRCKF.
             03 FMRCKA    PICTURE X.
           02  FMRCKI  PIC X(10).
           02  FMACCTKL    COMP  PIC  S9(4).
           02  FMACCTKF    PICTURE X.
           02  FILLER REDEFINES FMACCTKF.
             03 FMACCTKA    PICTURE X.
           02  FMACCTKI  PIC X(10).
           02  FMTRCDKL    COMP  PIC  S9(4).
           02  FMTRCDKF    PICTURE X.
           02  FILLER REDEFINES FMTRCDKF.
             03 FMTRCDKA    PICTURE X.
           02  FMTRCDKI  PIC X(2).
           02  FMAMTKL    COMP  PIC  S9(4).
           02  FMAMTKF    PICTURE X.
           02  FILLER REDEFINES FMAMTKF.
             03 FMAMTKA    PICTURE X.
           02  FMAMTKI  PIC X(18).
           02  FMREFNKL    COMP  PIC  S9(4).
           02  FMREFNKF    PICTURE X.
           02  FILLER REDEFINES FMREFNKF.
             03 FMREFNKA    PICTURE X.
           02  FMREFNKI  PIC X(8).
           02  FMSRCKL    COMP  PIC  S9(4).
           02  FMSRCKF    PICTURE X.
           02  FILLER REDEFINES FMSRCKF.
             03 FMSRCKA    PICTURE X.
           02  FMSRCKI  PIC X(3).
           02  FMDESCKL    COMP  PIC  S9(4).
           02  FMDESCKF    PICTURE X.
           02  FILLER REDEFINES FMDESCKF.
             03 FMDESCKA    PICTURE X.
           02  FMDESCKI  PIC X(19).
           02  FMOFFSKL    COMP  PIC  S9(4).
           02  FMOFFSKF    PICTURE X.
           02  FILLER REDEFINES FMOFFSKF.
             03 FMOFFSKA    PICTURE X.
           02  FMOFFSKI  PIC X(2).
           02  FMRCLL    COMP  PIC  S9(4).
           02  FMRCLF    PICTURE X.
           02  FILLER REDEFINES FMRCLF.
             03 FMRCLA    PICTURE X.
           02  FMRCLI  PIC X(10).
           02  FMACCTLL    COMP  PIC  S9(4).
           02  FMACCTLF    PICTURE X.
           02  FILLER REDEFINES FMACCTLF.
             03 FMACCTLA    PICTURE X.
           02  FMACCTLI  PIC X(10).
           02  FMTRCDLL    COMP  PIC  S9(4).
           02  FMTRCDLF    PICTURE X.
           02  FILLER REDEFINES FMTRCDLF.
             03 FMTRCDLA    PICTURE X.
           02  FMTRCDLI  PIC X(2).
           02  FMAMTLL    COMP  PIC  S9(4).
           02  FMAMTLF    PICTURE X.
           02  FILLER REDEFINES FMAMTLF.
             03 FMAMTLA    PICTURE X.
           02  FMAMTLI  PIC X(18).
           02  FMREFNLL    COMP  PIC  S9(4).
           02  FMREFNLF    PICTURE X.
           02  FILLER REDEFINES FMREFNLF.
             03 FMREFNLA    PICTURE X.
           02  FMREFNLI  PIC X(8).
           02  FMSRCLL    COMP  PIC  S9(4).
           02  FMSRCLF    PICTURE X.
           02  FILLER REDEFINES FMSRCLF.
             03 FMSRCLA    PICTURE X.
           02  FMSRCLI  PIC X(3).
           02  FMDESCLL    COMP  PIC  S9(4).
           02  FMDESCLF    PICTURE X.
           02  FILLER REDEFINES FMDESCLF.
             03 FMDESCLA    PICTURE X.
           02  FMDESCLI  PIC X(19).
           02  FMOFFSLL    COMP  PIC  S9(4).
           02  FMOFFSLF    PICTURE X.
           02  FILLER REDEFINES FMOFFSLF.
             03 FMOFFSLA    PICTURE X.
           02  FMOFFSLI  PIC X(2).
           02  FMRCML    COMP  PIC  S9(4).
           02  FMRCMF    PICTURE X.
           02  FILLER REDEFINES FMRCMF.
             03 FMRCMA    PICTURE X.
           02  FMRCMI  PIC X(10).
           02  FMACCTML    COMP  PIC  S9(4).
           02  FMACCTMF    PICTURE X.
           02  FILLER REDEFINES FMACCTMF.
             03 FMACCTMA    PICTURE X.
           02  FMACCTMI  PIC X(10).
           02  FMTRCDML    COMP  PIC  S9(4).
           02  FMTRCDMF    PICTURE X.
           02  FILLER REDEFINES FMTRCDMF.
             03 FMTRCDMA    PICTURE X.
           02  FMTRCDMI  PIC X(2).
           02  FMAMTML    COMP  PIC  S9(4).
           02  FMAMTMF    PICTURE X.
           02  FILLER REDEFINES FMAMTMF.
             03 FMAMTMA    PICTURE X.
           02  FMAMTMI  PIC X(18).
           02  FMREFNML    COMP  PIC  S9(4).
           02  FMREFNMF    PICTURE X.
           02  FILLER REDEFINES FMREFNMF.
             03 FMREFNMA    PICTURE X.
           02  FMREFNMI  PIC X(8).
           02  FMSRCML    COMP  PIC  S9(4).
           02  FMSRCMF    PICTURE X.
           02  FILLER REDEFINES FMSRCMF.
             03 FMSRCMA    PICTURE X.
           02  FMSRCMI  PIC X(3).
           02  FMDESCML    COMP  PIC  S9(4).
           02  FMDESCMF    PICTURE X.
           02  FILLER REDEFINES FMDESCMF.
             03 FMDESCMA    PICTURE X.
           02  FMDESCMI  PIC X(19).
           02  FMOFFSML    COMP  PIC  S9(4).
           02  FMOFFSMF    PICTURE X.
           02  FILLER REDEFINES FMOFFSMF.
             03 FMOFFSMA    PICTURE X.
           02  FMOFFSMI  PIC X(2).
           02  FMRCNL    COMP  PIC  S9(4).
           02  FMRCNF    PICTURE X.
           02  FILLER REDEFINES FMRCNF.
             03 FMRCNA    PICTURE X.
           02  FMRCNI  PIC X(10).
           02  FMACCTNL    COMP  PIC  S9(4).
           02  FMACCTNF    PICTURE X.
           02  FILLER REDEFINES FMACCTNF.
             03 FMACCTNA    PICTURE X.
           02  FMACCTNI  PIC X(10).
           02  FMTRCDNL    COMP  PIC  S9(4).
           02  FMTRCDNF    PICTURE X.
           02  FILLER REDEFINES FMTRCDNF.
             03 FMTRCDNA    PICTURE X.
           02  FMTRCDNI  PIC X(2).
           02  FMAMTNL    COMP  PIC  S9(4).
           02  FMAMTNF    PICTURE X.
           02  FILLER REDEFINES FMAMTNF.
             03 FMAMTNA    PICTURE X.
           02  FMAMTNI  PIC X(18).
           02  FMREFNNL    COMP  PIC  S9(4).
           02  FMREFNNF    PICTURE X.
           02  FILLER REDEFINES FMREFNNF.
             03 FMREFNNA    PICTURE X.
           02  FMREFNNI  PIC X(8).
           02  FMSRCNL    COMP  PIC  S9(4).
           02  FMSRCNF    PICTURE X.
           02  FILLER REDEFINES FMSRCNF.
             03 FMSRCNA    PICTURE X.
           02  FMSRCNI  PIC X(3).
           02  FMDESCNL    COMP  PIC  S9(4).
           02  FMDESCNF    PICTURE X.
           02  FILLER REDEFINES FMDESCNF.
             03 FMDESCNA    PICTURE X.
           02  FMDESCNI  PIC X(19).
           02  FMOFFSNL    COMP  PIC  S9(4).
           02  FMOFFSNF    PICTURE X.
           02  FILLER REDEFINES FMOFFSNF.
             03 FMOFFSNA    PICTURE X.
           02  FMOFFSNI  PIC X(2).
           02  FMRCOL    COMP  PIC  S9(4).
           02  FMRCOF    PICTURE X.
           02  FILLER REDEFINES FMRCOF.
             03 FMRCOA    PICTURE X.
           02  FMRCOI  PIC X(10).
           02  FMACCTOL    COMP  PIC  S9(4).
           02  FMACCTOF    PICTURE X.
           02  FILLER REDEFINES FMACCTOF.
             03 FMACCTOA    PICTURE X.
           02  FMACCTOI  PIC X(10).
           02  FMTRCDOL    COMP  PIC  S9(4).
           02  FMTRCDOF    PICTURE X.
           02  FILLER REDEFINES FMTRCDOF.
             03 FMTRCDOA    PICTURE X.
           02  FMTRCDOI  PIC X(2).
           02  FMAMTOL    COMP  PIC  S9(4).
           02  FMAMTOF    PICTURE X.
           02  FILLER REDEFINES FMAMTOF.
             03 FMAMTOA    PICTURE X.
           02  FMAMTOI  PIC X(18).
           02  FMREFNOL    COMP  PIC  S9(4).
           02  FMREFNOF    PICTURE X.
           02  FILLER REDEFINES FMREFNOF.
             03 FMREFNOA    PICTURE X.
           02  FMREFNOI  PIC X(8).
           02  FMSRCOL    COMP  PIC  S9(4).
           02  FMSRCOF    PICTURE X.
           02  FILLER REDEFINES FMSRCOF.
             03 FMSRCOA    PICTURE X.
           02  FMSRCOI  PIC X(3).
           02  FMDESCOL    COMP  PIC  S9(4).
           02  FMDESCOF    PICTURE X.
           02  FILLER REDEFINES FMDESCOF.
             03 FMDESCOA    PICTURE X.
           02  FMDESCOI  PIC X(19).
           02  FMOFFSOL    COMP  PIC  S9(4).
           02  FMOFFSOF    PICTURE X.
           02  FILLER REDEFINES FMOFFSOF.
             03 FMOFFSOA    PICTURE X.
           02  FMOFFSOI  PIC X(2).
           02  FMMSG1L    COMP  PIC  S9(4).
           02  FMMSG1F    PICTURE X.
           02  FILLER REDEFINES FMMSG1F.
             03 FMMSG1A    PICTURE X.
           02  FMMSG1I  PIC X(79).
           02  FMMSG2L    COMP  PIC  S9(4).
           02  FMMSG2F    PICTURE X.
           02  FILLER REDEFINES FMMSG2F.
             03 FMMSG2A    PICTURE X.
           02  FMMSG2I  PIC X(79).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFMMACO REDEFINES FIFMMACI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATE2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMBATCHO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  FMDEPTO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTYPEO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  FMDATELO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  FMDATE3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSTATO  PIC X(35).
           02  FILLER PICTURE X(3).
           02  FMPERMLO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMFDATLO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMFDATO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDAO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTAO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCAO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCAO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSAO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDBO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTBO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCBO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCBO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSBO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDCO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTCO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNCO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCCO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCCO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSCO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCDO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTDO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTDO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCDO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCDO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCEO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTEO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTEO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCEO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCFO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTFO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDFO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTFO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNFO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCFO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCFO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSFO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCGO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTGO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDGO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTGO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNGO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCGO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCGO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSGO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCHO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTHO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDHO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTHO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNHO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCHO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCHO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSHO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCIO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTIO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDIO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTIO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNIO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCIO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCIO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSIO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCJO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTJO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDJO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTJO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNJO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCJO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCJO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSJO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCKO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTKO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDKO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTKO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNKO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCKO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCKO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSKO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCLO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTLO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDLO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTLO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNLO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCLO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCLO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSLO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCMO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTMO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDMO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTMO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCMO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCMO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSMO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCNO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTNO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDNO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTNO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNNO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCNO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCNO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSNO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMRCOO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTOO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMTRCDOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAMTOO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FMREFNOO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMSRCOO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDESCOO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMOFFSOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMMSG1O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMMSG2O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).