       01  FIFMI1EI.
           02  FILLER PIC X(12).
           02  FMFLLR1L    COMP  PIC  S9(4).
           02  FMFLLR1F    PICTURE X.
           02  FILLER REDEFINES FMFLLR1F.
             03 FMFLLR1A    PICTURE X.
           02  FMFLLR1I  PIC X(239).
           02  FMFLLR2L    COMP  PIC  S9(4).
           02  FMFLLR2F    PICTURE X.
           02  FILLER REDEFINES FMFLLR2F.
             03 FMFLLR2A    PICTURE X.
           02  FMFLLR2I  PIC X(239).
           02  FMFLLR3L    COMP  PIC  S9(4).
           02  FMFLLR3F    PICTURE X.
           02  FILLER REDEFINES FMFLLR3F.
             03 FMFLLR3A    PICTURE X.
           02  FMFLLR3I  PIC X(239).
           02  FMFLLR4L    COMP  PIC  S9(4).
           02  FMFLLR4F    PICTURE X.
           02  FILLER REDEFINES FMFLLR4F.
             03 FMFLLR4A    PICTURE X.
           02  FMFLLR4I  PIC X(239).
           02  FMFLLR5L    COMP  PIC  S9(4).
           02  FMFLLR5F    PICTURE X.
           02  FILLER REDEFINES FMFLLR5F.
             03 FMFLLR5A    PICTURE X.
           02  FMFLLR5I  PIC X(239).
           02  FMFLLR6L    COMP  PIC  S9(4).
           02  FMFLLR6F    PICTURE X.
           02  FILLER REDEFINES FMFLLR6F.
             03 FMFLLR6A    PICTURE X.
           02  FMFLLR6I  PIC X(239).
           02  FMFLLR7L    COMP  PIC  S9(4).
           02  FMFLLR7F    PICTURE X.
           02  FILLER REDEFINES FMFLLR7F.
             03 FMFLLR7A    PICTURE X.
           02  FMFLLR7I  PIC X(239).
           02  FMFLLR8L    COMP  PIC  S9(4).
           02  FMFLLR8F    PICTURE X.
           02  FILLER REDEFINES FMFLLR8F.
             03 FMFLLR8A    PICTURE X.
           02  FMFLLR8I  PIC X(220).
       01  FIFMI1EO REDEFINES FIFMI1EI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMFLLR1O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR2O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR3O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR4O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR5O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR6O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR7O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR8O  PIC X(220).
       01  FIFMI1BI REDEFINES FIFMI1EI.
           02  FILLER PIC X(12).
           02  FMTRID1L    COMP  PIC  S9(4).
           02  FMTRID1F    PICTURE X.
           02  FILLER REDEFINES FMTRID1F.
             03 FMTRID1A    PICTURE X.
           02  FMTRID1I  PIC X(4).
           02  FMDATE1L    COMP  PIC  S9(4).
           02  FMDATE1F    PICTURE X.
           02  FILLER REDEFINES FMDATE1F.
             03 FMDATE1A    PICTURE X.
           02  FMDATE1I  PIC X(8).
           02  FMTIME1L    COMP  PIC  S9(4).
           02  FMTIME1F    PICTURE X.
           02  FILLER REDEFINES FMTIME1F.
             03 FMTIME1A    PICTURE X.
           02  FMTIME1I  PIC X(8).
           02  FMRCNO1L    COMP  PIC  S9(4).
           02  FMRCNO1F    PICTURE X.
           02  FILLER REDEFINES FMRCNO1F.
             03 FMRCNO1A    PICTURE X.
           02  FMRCNO1I  PIC X(10).
           02  FMACCT1L    COMP  PIC  S9(4).
           02  FMACCT1F    PICTURE X.
           02  FILLER REDEFINES FMACCT1F.
             03 FMACCT1A    PICTURE X.
           02  FMACCT1I  PIC X(10).
           02  FMCO1L    COMP  PIC  S9(4).
           02  FMCO1F    PICTURE X.
           02  FILLER REDEFINES FMCO1F.
             03 FMCO1A    PICTURE X.
           02  FMCO1I  PIC X(4).
           02  FMERR1L    COMP  PIC  S9(4).
           02  FMERR1F    PICTURE X.
           02  FILLER REDEFINES FMERR1F.
             03 FMERR1A    PICTURE X.
           02  FMERR1I  PIC X(79).
       01  FIFMI1BO REDEFINES FIFMI1BI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRID1O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATE1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIME1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCNO1O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCT1O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCO1O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMERR1O  PIC X(79).
       01  FIFMI1CI REDEFINES FIFMI1EI.
           02  FILLER PIC X(12).
           02  FMTRID2L    COMP  PIC  S9(4).
           02  FMTRID2F    PICTURE X.
           02  FILLER REDEFINES FMTRID2F.
             03 FMTRID2A    PICTURE X.
           02  FMTRID2I  PIC X(4).
           02  FMDATE2L    COMP  PIC  S9(4).
           02  FMDATE2F    PICTURE X.
           02  FILLER REDEFINES FMDATE2F.
             03 FMDATE2A    PICTURE X.
           02  FMDATE2I  PIC X(8).
           02  FMTIME2L    COMP  PIC  S9(4).
           02  FMTIME2F    PICTURE X.
           02  FILLER REDEFINES FMTIME2F.
             03 FMTIME2A    PICTURE X.
           02  FMTIME2I  PIC X(8).
           02  FMRCNO2L    COMP  PIC  S9(4).
           02  FMRCNO2F    PICTURE X.
           02  FILLER REDEFINES FMRCNO2F.
             03 FMRCNO2A    PICTURE X.
           02  FMRCNO2I  PIC X(10).
           02  FMACCT2L    COMP  PIC  S9(4).
           02  FMACCT2F    PICTURE X.
           02  FILLER REDEFINES FMACCT2F.
             03 FMACCT2A    PICTURE X.
           02  FMACCT2I  PIC X(10).
           02  FMCO2L    COMP  PIC  S9(4).
           02  FMCO2F    PICTURE X.
           02  FILLER REDEFINES FMCO2F.
             03 FMCO2A    PICTURE X.
           02  FMCO2I  PIC X(4).
           02  FMTITL2L    COMP  PIC  S9(4).
           02  FMTITL2F    PICTURE X.
           02  FILLER REDEFINES FMTITL2F.
             03 FMTITL2A    PICTURE X.
           02  FMTITL2I  PIC X(39).
           02  FMDBCR2L    COMP  PIC  S9(4).
           02  FMDBCR2F    PICTURE X.
           02  FILLER REDEFINES FMDBCR2F.
             03 FMDBCR2A    PICTURE X.
           02  FMDBCR2I  PIC X(1).
           02  FMTYPE2L    COMP  PIC  S9(4).
           02  FMTYPE2F    PICTURE X.
           02  FILLER REDEFINES FMTYPE2F.
             03 FMTYPE2A    PICTURE X.
           02  FMTYPE2I  PIC X(11).
           02  FMCURB2L    COMP  PIC  S9(4).
           02  FMCURB2F    PICTURE X.
           02  FILLER REDEFINES FMCURB2F.
             03 FMCURB2A    PICTURE X.
           02  FMCURB2I  PIC X(21).
           02  FMPRDA2L    COMP  PIC  S9(4).
           02  FMPRDA2F    PICTURE X.
           02  FILLER REDEFINES FMPRDA2F.
             03 FMPRDA2A    PICTURE X.
           02  FMPRDA2I  PIC X(21).
           02  FMMEMT2L    COMP  PIC  S9(4).
           02  FMMEMT2F    PICTURE X.
           02  FILLER REDEFINES FMMEMT2F.
             03 FMMEMT2A    PICTURE X.
           02  FMMEMT2I  PIC X(8).
           02  FMMEMB2L    COMP  PIC  S9(4).
           02  FMMEMB2F    PICTURE X.
           02  FILLER REDEFINES FMMEMB2F.
             03 FMMEMB2A    PICTURE X.
           02  FMMEMB2I  PIC X(21).
           02  FMMTDC2L    COMP  PIC  S9(4).
           02  FMMTDC2F    PICTURE X.
           02  FILLER REDEFINES FMMTDC2F.
             03 FMMTDC2A    PICTURE X.
           02  FMMTDC2I  PIC X(20).
           02  FMMTDB2L    COMP  PIC  S9(4).
           02  FMMTDB2F    PICTURE X.
           02  FILLER REDEFINES FMMTDB2F.
             03 FMMTDB2A    PICTURE X.
           02  FMMTDB2I  PIC X(20).
           02  FMMTDV2L    COMP  PIC  S9(4).
           02  FMMTDV2F    PICTURE X.
           02  FILLER REDEFINES FMMTDV2F.
             03 FMMTDV2A    PICTURE X.
           02  FMMTDV2I  PIC X(20).
           02  FMMTDP2L    COMP  PIC  S9(4).
           02  FMMTDP2F    PICTURE X.
           02  FILLER REDEFINES FMMTDP2F.
             03 FMMTDP2A    PICTURE X.
           02  FMMTDP2I  PIC X(7).
           02  FMQTDC2L    COMP  PIC  S9(4).
           02  FMQTDC2F    PICTURE X.
           02  FILLER REDEFINES FMQTDC2F.
             03 FMQTDC2A    PICTURE X.
           02  FMQTDC2I  PIC X(20).
           02  FMQTDB2L    COMP  PIC  S9(4).
           02  FMQTDB2F    PICTURE X.
           02  FILLER REDEFINES FMQTDB2F.
             03 FMQTDB2A    PICTURE X.
           02  FMQTDB2I  PIC X(20).
           02  FMQTDV2L    COMP  PIC  S9(4).
           02  FMQTDV2F    PICTURE X.
           02  FILLER REDEFINES FMQTDV2F.
             03 FMQTDV2A    PICTURE X.
           02  FMQTDV2I  PIC X(20).
           02  FMQTDP2L    COMP  PIC  S9(4).
           02  FMQTDP2F    PICTURE X.
           02  FILLER REDEFINES FMQTDP2F.
             03 FMQTDP2A    PICTURE X.
           02  FMQTDP2I  PIC X(7).
           02  FMYTDC2L    COMP  PIC  S9(4).
           02  FMYTDC2F    PICTURE X.
           02  FILLER REDEFINES FMYTDC2F.
             03 FMYTDC2A    PICTURE X.
           02  FMYTDC2I  PIC X(20).
           02  FMYTDB2L    COMP  PIC  S9(4).
           02  FMYTDB2F    PICTURE X.
           02  FILLER REDEFINES FMYTDB2F.
             03 FMYTDB2A    PICTURE X.
           02  FMYTDB2I  PIC X(20).
           02  FMYTDV2L    COMP  PIC  S9(4).
           02  FMYTDV2F    PICTURE X.
           02  FILLER REDEFINES FMYTDV2F.
             03 FMYTDV2A    PICTURE X.
           02  FMYTDV2I  PIC X(20).
           02  FMYTDP2L    COMP  PIC  S9(4).
           02  FMYTDP2F    PICTURE X.
           02  FILLER REDEFINES FMYTDP2F.
             03 FMYTDP2A    PICTURE X.
           02  FMYTDP2I  PIC X(7).
           02  FMPVMB2L    COMP  PIC  S9(4).
           02  FMPVMB2F    PICTURE X.
           02  FILLER REDEFINES FMPVMB2F.
             03 FMPVMB2A    PICTURE X.
           02  FMPVMB2I  PIC X(22).
           02  FMLSMO2L    COMP  PIC  S9(4).
           02  FMLSMO2F    PICTURE X.
           02  FILLER REDEFINES FMLSMO2F.
             03 FMLSMO2A    PICTURE X.
           02  FMLSMO2I  PIC X(22).
           02  FMPVQB2L    COMP  PIC  S9(4).
           02  FMPVQB2F    PICTURE X.
           02  FILLER REDEFINES FMPVQB2F.
             03 FMPVQB2A    PICTURE X.
           02  FMPVQB2I  PIC X(22).
           02  FMLSQT2L    COMP  PIC  S9(4).
           02  FMLSQT2F    PICTURE X.
           02  FILLER REDEFINES FMLSQT2F.
             03 FMLSQT2A    PICTURE X.
           02  FMLSQT2I  PIC X(22).
           02  FMPVFY2L    COMP  PIC  S9(4).
           02  FMPVFY2F    PICTURE X.
           02  FILLER REDEFINES FMPVFY2F.
             03 FMPVFY2A    PICTURE X.
           02  FMPVFY2I  PIC X(22).
           02  FMLSFY2L    COMP  PIC  S9(4).
           02  FMLSFY2F    PICTURE X.
           02  FILLER REDEFINES FMLSFY2F.
             03 FMLSFY2A    PICTURE X.
           02  FMLSFY2I  PIC X(22).
           02  FMPRMB2L    COMP  PIC  S9(4).
           02  FMPRMB2F    PICTURE X.
           02  FILLER REDEFINES FMPRMB2F.
             03 FMPRMB2A    PICTURE X.
           02  FMPRMB2I  PIC X(22).
           02  FMPRMO2L    COMP  PIC  S9(4).
           02  FMPRMO2F    PICTURE X.
           02  FILLER REDEFINES FMPRMO2F.
             03 FMPRMO2A    PICTURE X.
           02  FMPRMO2I  PIC X(22).
           02  FMPRQB2L    COMP  PIC  S9(4).
           02  FMPRQB2F    PICTURE X.
           02  FILLER REDEFINES FMPRQB2F.
             03 FMPRQB2A    PICTURE X.
           02  FMPRQB2I  PIC X(22).
           02  FMPRQT2L    COMP  PIC  S9(4).
           02  FMPRQT2F    PICTURE X.
           02  FILLER REDEFINES FMPRQT2F.
             03 FMPRQT2A    PICTURE X.
           02  FMPRQT2I  PIC X(22).
           02  FMPRFY2L    COMP  PIC  S9(4).
           02  FMPRFY2F    PICTURE X.
           02  FILLER REDEFINES FMPRFY2F.
             03 FMPRFY2A    PICTURE X.
           02  FMPRFY2I  PIC X(22).
           02  FMDTTL2L    COMP  PIC  S9(4).
           02  FMDTTL2F    PICTURE X.
           02  FILLER REDEFINES FMDTTL2F.
             03 FMDTTL2A    PICTURE X.
           02  FMDTTL2I  PIC X(5).
           02  FMDTT12L    COMP  PIC  S9(4).
           02  FMDTT12F    PICTURE X.
           02  FILLER REDEFINES FMDTT12F.
             03 FMDTT12A    PICTURE X.
           02  FMDTT12I  PIC X(8).
           02  FMDTD12L    COMP  PIC  S9(4).
           02  FMDTD12F    PICTURE X.
           02  FILLER REDEFINES FMDTD12F.
             03 FMDTD12A    PICTURE X.
           02  FMDTD12I  PIC X(8).
           02  FMDTT22L    COMP  PIC  S9(4).
           02  FMDTT22F    PICTURE X.
           02  FILLER REDEFINES FMDTT22F.
             03 FMDTT22A    PICTURE X.
           02  FMDTT22I  PIC X(8).
           02  FMDTD22L    COMP  PIC  S9(4).
           02  FMDTD22F    PICTURE X.
           02  FILLER REDEFINES FMDTD22F.
             03 FMDTD22A    PICTURE X.
           02  FMDTD22I  PIC X(8).
           02  FMDTT32L    COMP  PIC  S9(4).
           02  FMDTT32F    PICTURE X.
           02  FILLER REDEFINES FMDTT32F.
             03 FMDTT32A    PICTURE X.
           02  FMDTT32I  PIC X(8).
           02  FMDTD32L    COMP  PIC  S9(4).
           02  FMDTD32F    PICTURE X.
           02  FILLER REDEFINES FMDTD32F.
             03 FMDTD32A    PICTURE X.
           02  FMDTD32I  PIC X(8).
           02  FMERR2L    COMP  PIC  S9(4).
           02  FMERR2F    PICTURE X.
           02  FILLER REDEFINES FMERR2F.
             03 FMERR2A    PICTURE X.
           02  FMERR2I  PIC X(79).
       01  FIFMI1CO REDEFINES FIFMI1CI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRID2O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATE2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIME2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCNO2O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCT2O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCO2O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTITL2O  PIC X(39).
           02  FILLER PICTURE X(3).
           02  FMDBCR2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTYPE2O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  FMCURB2O  PIC X(21).
           02  FILLER PICTURE X(3).
           02  FMPRDA2O  PIC X(21).
           02  FILLER PICTURE X(3).
           02  FMMEMT2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMMEMB2O  PIC X(21).
           02  FILLER PICTURE X(3).
           02  FMMTDC2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMMTDB2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMMTDV2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMMTDP2O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMQTDC2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMQTDB2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMQTDV2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMQTDP2O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMYTDC2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMYTDB2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMYTDV2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMYTDP2O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMPVMB2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMLSMO2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPVQB2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMLSQT2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPVFY2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMLSFY2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPRMB2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPRMO2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPRQB2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPRQT2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPRFY2O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMDTTL2O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  FMDTT12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTD12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTT22O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTD22O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTT32O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTD32O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMERR2O  PIC X(79).
       01  FIFMI1DI REDEFINES FIFMI1EI.
           02  FILLER PIC X(12).
           02  FMTRID3L    COMP  PIC  S9(4).
           02  FMTRID3F    PICTURE X.
           02  FILLER REDEFINES FMTRID3F.
             03 FMTRID3A    PICTURE X.
           02  FMTRID3I  PIC X(4).
           02  FMDATE3L    COMP  PIC  S9(4).
           02  FMDATE3F    PICTURE X.
           02  FILLER REDEFINES FMDATE3F.
             03 FMDATE3A    PICTURE X.
           02  FMDATE3I  PIC X(8).
           02  FMTIME3L    COMP  PIC  S9(4).
           02  FMTIME3F    PICTURE X.
           02  FILLER REDEFINES FMTIME3F.
             03 FMTIME3A    PICTURE X.
           02  FMTIME3I  PIC X(8).
           02  FMRCNO3L    COMP  PIC  S9(4).
           02  FMRCNO3F    PICTURE X.
           02  FILLER REDEFINES FMRCNO3F.
             03 FMRCNO3A    PICTURE X.
           02  FMRCNO3I  PIC X(10).
           02  FMACCT3L    COMP  PIC  S9(4).
           02  FMACCT3F    PICTURE X.
           02  FILLER REDEFINES FMACCT3F.
             03 FMACCT3A    PICTURE X.
           02  FMACCT3I  PIC X(10).
           02  FMCO3L    COMP  PIC  S9(4).
           02  FMCO3F    PICTURE X.
           02  FILLER REDEFINES FMCO3F.
             03 FMCO3A    PICTURE X.
           02  FMCO3I  PIC X(4).
           02  FMTITL3L    COMP  PIC  S9(4).
           02  FMTITL3F    PICTURE X.
           02  FILLER REDEFINES FMTITL3F.
             03 FMTITL3A    PICTURE X.
           02  FMTITL3I  PIC X(39).
           02  FMDBCR3L    COMP  PIC  S9(4).
           02  FMDBCR3F    PICTURE X.
           02  FILLER REDEFINES FMDBCR3F.
             03 FMDBCR3A    PICTURE X.
           02  FMDBCR3I  PIC X(1).
           02  FMTYPE3L    COMP  PIC  S9(4).
           02  FMTYPE3F    PICTURE X.
           02  FILLER REDEFINES FMTYPE3F.
             03 FMTYPE3A    PICTURE X.
           02  FMTYPE3I  PIC X(11).
           02  FMCURB3L    COMP  PIC  S9(4).
           02  FMCURB3F    PICTURE X.
           02  FILLER REDEFINES FMCURB3F.
             03 FMCURB3A    PICTURE X.
           02  FMCURB3I  PIC X(21).
           02  FMPRDA3L    COMP  PIC  S9(4).
           02  FMPRDA3F    PICTURE X.
           02  FILLER REDEFINES FMPRDA3F.
             03 FMPRDA3A    PICTURE X.
           02  FMPRDA3I  PIC X(21).
           02  FMMEMT3L    COMP  PIC  S9(4).
           02  FMMEMT3F    PICTURE X.
           02  FILLER REDEFINES FMMEMT3F.
             03 FMMEMT3A    PICTURE X.
           02  FMMEMT3I  PIC X(8).
           02  FMMEMB3L    COMP  PIC  S9(4).
           02  FMMEMB3F    PICTURE X.
           02  FILLER REDEFINES FMMEMB3F.
             03 FMMEMB3A    PICTURE X.
           02  FMMEMB3I  PIC X(21).
           02  FMMTDA3L    COMP  PIC  S9(4).
           02  FMMTDA3F    PICTURE X.
           02  FILLER REDEFINES FMMTDA3F.
             03 FMMTDA3A    PICTURE X.
           02  FMMTDA3I  PIC X(20).
           02  FMMTDB3L    COMP  PIC  S9(4).
           02  FMMTDB3F    PICTURE X.
           02  FILLER REDEFINES FMMTDB3F.
             03 FMMTDB3A    PICTURE X.
           02  FMMTDB3I  PIC X(20).
           02  FMMTDV3L    COMP  PIC  S9(4).
           02  FMMTDV3F    PICTURE X.
           02  FILLER REDEFINES FMMTDV3F.
             03 FMMTDV3A    PICTURE X.
           02  FMMTDV3I  PIC X(20).
           02  FMMTDP3L    COMP  PIC  S9(4).
           02  FMMTDP3F    PICTURE X.
           02  FILLER REDEFINES FMMTDP3F.
             03 FMMTDP3A    PICTURE X.
           02  FMMTDP3I  PIC X(7).
           02  FMQTDA3L    COMP  PIC  S9(4).
           02  FMQTDA3F    PICTURE X.
           02  FILLER REDEFINES FMQTDA3F.
             03 FMQTDA3A    PICTURE X.
           02  FMQTDA3I  PIC X(20).
           02  FMQTDB3L    COMP  PIC  S9(4).
           02  FMQTDB3F    PICTURE X.
           02  FILLER REDEFINES FMQTDB3F.
             03 FMQTDB3A    PICTURE X.
           02  FMQTDB3I  PIC X(20).
           02  FMQTDV3L    COMP  PIC  S9(4).
           02  FMQTDV3F    PICTURE X.
           02  FILLER REDEFINES FMQTDV3F.
             03 FMQTDV3A    PICTURE X.
           02  FMQTDV3I  PIC X(20).
           02  FMQTDP3L    COMP  PIC  S9(4).
           02  FMQTDP3F    PICTURE X.
           02  FILLER REDEFINES FMQTDP3F.
             03 FMQTDP3A    PICTURE X.
           02  FMQTDP3I  PIC X(7).
           02  FMYTDA3L    COMP  PIC  S9(4).
           02  FMYTDA3F    PICTURE X.
           02  FILLER REDEFINES FMYTDA3F.
             03 FMYTDA3A    PICTURE X.
           02  FMYTDA3I  PIC X(20).
           02  FMYTDB3L    COMP  PIC  S9(4).
           02  FMYTDB3F    PICTURE X.
           02  FILLER REDEFINES FMYTDB3F.
             03 FMYTDB3A    PICTURE X.
           02  FMYTDB3I  PIC X(20).
           02  FMYTDV3L    COMP  PIC  S9(4).
           02  FMYTDV3F    PICTURE X.
           02  FILLER REDEFINES FMYTDV3F.
             03 FMYTDV3A    PICTURE X.
           02  FMYTDV3I  PIC X(20).
           02  FMYTDP3L    COMP  PIC  S9(4).
           02  FMYTDP3F    PICTURE X.
           02  FILLER REDEFINES FMYTDP3F.
             03 FMYTDP3A    PICTURE X.
           02  FMYTDP3I  PIC X(7).
           02  FMLSMO3L    COMP  PIC  S9(4).
           02  FMLSMO3F    PICTURE X.
           02  FILLER REDEFINES FMLSMO3F.
             03 FMLSMO3A    PICTURE X.
           02  FMLSMO3I  PIC X(22).
           02  FMLSEM3L    COMP  PIC  S9(4).
           02  FMLSEM3F    PICTURE X.
           02  FILLER REDEFINES FMLSEM3F.
             03 FMLSEM3A    PICTURE X.
           02  FMLSEM3I  PIC X(22).
           02  FMLSQT3L    COMP  PIC  S9(4).
           02  FMLSQT3F    PICTURE X.
           02  FILLER REDEFINES FMLSQT3F.
             03 FMLSQT3A    PICTURE X.
           02  FMLSQT3I  PIC X(22).
           02  FMLSEQ3L    COMP  PIC  S9(4).
           02  FMLSEQ3F    PICTURE X.
           02  FILLER REDEFINES FMLSEQ3F.
             03 FMLSEQ3A    PICTURE X.
           02  FMLSEQ3I  PIC X(22).
           02  FMLSFY3L    COMP  PIC  S9(4).
           02  FMLSFY3F    PICTURE X.
           02  FILLER REDEFINES FMLSFY3F.
             03 FMLSFY3A    PICTURE X.
           02  FMLSFY3I  PIC X(22).
           02  FMPRMO3L    COMP  PIC  S9(4).
           02  FMPRMO3F    PICTURE X.
           02  FILLER REDEFINES FMPRMO3F.
             03 FMPRMO3A    PICTURE X.
           02  FMPRMO3I  PIC X(22).
           02  FMPREM3L    COMP  PIC  S9(4).
           02  FMPREM3F    PICTURE X.
           02  FILLER REDEFINES FMPREM3F.
             03 FMPREM3A    PICTURE X.
           02  FMPREM3I  PIC X(22).
           02  FMPRQT3L    COMP  PIC  S9(4).
           02  FMPRQT3F    PICTURE X.
           02  FILLER REDEFINES FMPRQT3F.
             03 FMPRQT3A    PICTURE X.
           02  FMPRQT3I  PIC X(22).
           02  FMPREQ3L    COMP  PIC  S9(4).
           02  FMPREQ3F    PICTURE X.
           02  FILLER REDEFINES FMPREQ3F.
             03 FMPREQ3A    PICTURE X.
           02  FMPREQ3I  PIC X(22).
           02  FMDTTL3L    COMP  PIC  S9(4).
           02  FMDTTL3F    PICTURE X.
           02  FILLER REDEFINES FMDTTL3F.
             03 FMDTTL3A    PICTURE X.
           02  FMDTTL3I  PIC X(5).
           02  FMDTT13L    COMP  PIC  S9(4).
           02  FMDTT13F    PICTURE X.
           02  FILLER REDEFINES FMDTT13F.
             03 FMDTT13A    PICTURE X.
           02  FMDTT13I  PIC X(8).
           02  FMDTD13L    COMP  PIC  S9(4).
           02  FMDTD13F    PICTURE X.
           02  FILLER REDEFINES FMDTD13F.
             03 FMDTD13A    PICTURE X.
           02  FMDTD13I  PIC X(8).
           02  FMDTT23L    COMP  PIC  S9(4).
           02  FMDTT23F    PICTURE X.
           02  FILLER REDEFINES FMDTT23F.
             03 FMDTT23A    PICTURE X.
           02  FMDTT23I  PIC X(8).
           02  FMDTD23L    COMP  PIC  S9(4).
           02  FMDTD23F    PICTURE X.
           02  FILLER REDEFINES FMDTD23F.
             03 FMDTD23A    PICTURE X.
           02  FMDTD23I  PIC X(8).
           02  FMDTT33L    COMP  PIC  S9(4).
           02  FMDTT33F    PICTURE X.
           02  FILLER REDEFINES FMDTT33F.
             03 FMDTT33A    PICTURE X.
           02  FMDTT33I  PIC X(8).
           02  FMDTD33L    COMP  PIC  S9(4).
           02  FMDTD33F    PICTURE X.
           02  FILLER REDEFINES FMDTD33F.
             03 FMDTD33A    PICTURE X.
           02  FMDTD33I  PIC X(8).
           02  FMERR3L    COMP  PIC  S9(4).
           02  FMERR3F    PICTURE X.
           02  FILLER REDEFINES FMERR3F.
             03 FMERR3A    PICTURE X.
           02  FMERR3I  PIC X(79).
       01  FIFMI1DO REDEFINES FIFMI1DI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRID3O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATE3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIME3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCNO3O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCT3O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCO3O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTITL3O  PIC X(39).
           02  FILLER PICTURE X(3).
           02  FMDBCR3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTYPE3O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  FMCURB3O  PIC X(21).
           02  FILLER PICTURE X(3).
           02  FMPRDA3O  PIC X(21).
           02  FILLER PICTURE X(3).
           02  FMMEMT3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMMEMB3O  PIC X(21).
           02  FILLER PICTURE X(3).
           02  FMMTDA3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMMTDB3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMMTDV3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMMTDP3O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMQTDA3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMQTDB3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMQTDV3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMQTDP3O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMYTDA3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMYTDB3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMYTDV3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMYTDP3O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMLSMO3O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMLSEM3O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMLSQT3O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMLSEQ3O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMLSFY3O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPRMO3O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPREM3O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPRQT3O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMPREQ3O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMDTTL3O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  FMDTT13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTD13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTT23O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTD23O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTT33O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMDTD33O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMERR3O  PIC X(79).