       01  FIFM2DDI.
           02  FILLER PIC X(12).
           02  FMFLLR1L    COMP  PIC  S9(4).
           02  FMFLLR1F    PICTURE X.
           02  FILLER REDEFINES FMFLLR1F.
             03 FMFLLR1A    PICTURE X.
           02  FMFLLR1I  PIC X(239).
           02  FMFLLR2L    COMP  PIC  S9(4).
           02  FMFLLR2F    PICTURE X.
           02  FILLER REDEFINES FMFLLR2F.
             03 FMFLLR2A    PICTURE X.
           02  FMFLLR2I  PIC X(239).
           02  FMFLLR3L    COMP  PIC  S9(4).
           02  FMFLLR3F    PICTURE X.
           02  FILLER REDEFINES FMFLLR3F.
             03 FMFLLR3A    PICTURE X.
           02  FMFLLR3I  PIC X(239).
           02  FMFLLR4L    COMP  PIC  S9(4).
           02  FMFLLR4F    PICTURE X.
           02  FILLER REDEFINES FMFLLR4F.
             03 FMFLLR4A    PICTURE X.
           02  FMFLLR4I  PIC X(239).
           02  FMFLLR5L    COMP  PIC  S9(4).
           02  FMFLLR5F    PICTURE X.
           02  FILLER REDEFINES FMFLLR5F.
             03 FMFLLR5A    PICTURE X.
           02  FMFLLR5I  PIC X(239).
           02  FMFLLR6L    COMP  PIC  S9(4).
           02  FMFLLR6F    PICTURE X.
           02  FILLER REDEFINES FMFLLR6F.
             03 FMFLLR6A    PICTURE X.
           02  FMFLLR6I  PIC X(239).
           02  FMFLLR7L    COMP  PIC  S9(4).
           02  FMFLLR7F    PICTURE X.
           02  FILLER REDEFINES FMFLLR7F.
             03 FMFLLR7A    PICTURE X.
           02  FMFLLR7I  PIC X(239).
           02  FMFLLR8L    COMP  PIC  S9(4).
           02  FMFLLR8F    PICTURE X.
           02  FILLER REDEFINES FMFLLR8F.
             03 FMFLLR8A    PICTURE X.
           02  FMFLLR8I  PIC X(220).
       01  FIFM2DDO REDEFINES FIFM2DDI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMFLLR1O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR2O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR3O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR4O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR5O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR6O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR7O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR8O  PIC X(220).
       01  FIFM2DBI REDEFINES FIFM2DDI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMRCL    COMP  PIC  S9(4).
           02  FMRCF    PICTURE X.
           02  FILLER REDEFINES FMRCF.
             03 FMRCA    PICTURE X.
           02  FMRCI  PIC X(10).
           02  FMACCTL    COMP  PIC  S9(4).
           02  FMACCTF    PICTURE X.
           02  FILLER REDEFINES FMACCTF.
             03 FMACCTA    PICTURE X.
           02  FMACCTI  PIC X(10).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMERRL    COMP  PIC  S9(4).
           02  FMERRF    PICTURE X.
           02  FILLER REDEFINES FMERRF.
             03 FMERRA    PICTURE X.
           02  FMERRI  PIC X(79).
       01  FIFM2DBO REDEFINES FIFM2DBI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMERRO  PIC X(79).
       01  FIFM2DCI REDEFINES FIFM2DDI.
           02  FILLER PIC X(12).
           02  FMTRIDCL    COMP  PIC  S9(4).
           02  FMTRIDCF    PICTURE X.
           02  FILLER REDEFINES FMTRIDCF.
             03 FMTRIDCA    PICTURE X.
           02  FMTRIDCI  PIC X(4).
           02  FMDATECL    COMP  PIC  S9(4).
           02  FMDATECF    PICTURE X.
           02  FILLER REDEFINES FMDATECF.
             03 FMDATECA    PICTURE X.
           02  FMDATECI  PIC X(8).
           02  FMTIMECL    COMP  PIC  S9(4).
           02  FMTIMECF    PICTURE X.
           02  FILLER REDEFINES FMTIMECF.
             03 FMTIMECA    PICTURE X.
           02  FMTIMECI  PIC X(8).
           02  FMRCCL    COMP  PIC  S9(4).
           02  FMRCCF    PICTURE X.
           02  FILLER REDEFINES FMRCCF.
             03 FMRCCA    PICTURE X.
           02  FMRCCI  PIC X(10).
           02  FMACCTCL    COMP  PIC  S9(4).
           02  FMACCTCF    PICTURE X.
           02  FILLER REDEFINES FMACCTCF.
             03 FMACCTCA    PICTURE X.
           02  FMACCTCI  PIC X(10).
           02  FMCUSTCL    COMP  PIC  S9(4).
           02  FMCUSTCF    PICTURE X.
           02  FILLER REDEFINES FMCUSTCF.
             03 FMCUSTCA    PICTURE X.
           02  FMCUSTCI  PIC X(4).
           02  FMTITLEL    COMP  PIC  S9(4).
           02  FMTITLEF    PICTURE X.
           02  FILLER REDEFINES FMTITLEF.
             03 FMTITLEA    PICTURE X.
           02  FMTITLEI  PIC X(40).
           02  FMMO1L    COMP  PIC  S9(4).
           02  FMMO1F    PICTURE X.
           02  FILLER REDEFINES FMMO1F.
             03 FMMO1A    PICTURE X.
           02  FMMO1I  PIC X(9).
           02  FMPS01L    COMP  PIC  S9(4).
           02  FMPS01F    PICTURE X.
           02  FILLER REDEFINES FMPS01F.
             03 FMPS01A    PICTURE X.
           02  FMPS01I  PIC X(19).
           02  FMM02L    COMP  PIC  S9(4).
           02  FMM02F    PICTURE X.
           02  FILLER REDEFINES FMM02F.
             03 FMM02A    PICTURE X.
           02  FMM02I  PIC X(9).
           02  FMPS02L    COMP  PIC  S9(4).
           02  FMPS02F    PICTURE X.
           02  FILLER REDEFINES FMPS02F.
             03 FMPS02A    PICTURE X.
           02  FMPS02I  PIC X(19).
           02  FMM03L    COMP  PIC  S9(4).
           02  FMM03F    PICTURE X.
           02  FILLER REDEFINES FMM03F.
             03 FMM03A    PICTURE X.
           02  FMM03I  PIC X(9).
           02  FMPS03L    COMP  PIC  S9(4).
           02  FMPS03F    PICTURE X.
           02  FILLER REDEFINES FMPS03F.
             03 FMPS03A    PICTURE X.
           02  FMPS03I  PIC X(19).
           02  FMM04L    COMP  PIC  S9(4).
           02  FMM04F    PICTURE X.
           02  FILLER REDEFINES FMM04F.
             03 FMM04A    PICTURE X.
           02  FMM04I  PIC X(9).
           02  FMPS04L    COMP  PIC  S9(4).
           02  FMPS04F    PICTURE X.
           02  FILLER REDEFINES FMPS04F.
             03 FMPS04A    PICTURE X.
           02  FMPS04I  PIC X(19).
           02  FMM05L    COMP  PIC  S9(4).
           02  FMM05F    PICTURE X.
           02  FILLER REDEFINES FMM05F.
             03 FMM05A    PICTURE X.
           02  FMM05I  PIC X(9).
           02  FMPS05L    COMP  PIC  S9(4).
           02  FMPS05F    PICTURE X.
           02  FILLER REDEFINES FMPS05F.
             03 FMPS05A    PICTURE X.
           02  FMPS05I  PIC X(19).
           02  FMM06L    COMP  PIC  S9(4).
           02  FMM06F    PICTURE X.
           02  FILLER REDEFINES FMM06F.
             03 FMM06A    PICTURE X.
           02  FMM06I  PIC X(9).
           02  FMPS06L    COMP  PIC  S9(4).
           02  FMPS06F    PICTURE X.
           02  FILLER REDEFINES FMPS06F.
             03 FMPS06A    PICTURE X.
           02  FMPS06I  PIC X(19).
           02  FMM07L    COMP  PIC  S9(4).
           02  FMM07F    PICTURE X.
           02  FILLER REDEFINES FMM07F.
             03 FMM07A    PICTURE X.
           02  FMM07I  PIC X(9).
           02  FMPS07L    COMP  PIC  S9(4).
           02  FMPS07F    PICTURE X.
           02  FILLER REDEFINES FMPS07F.
             03 FMPS07A    PICTURE X.
           02  FMPS07I  PIC X(19).
           02  FMM08L    COMP  PIC  S9(4).
           02  FMM08F    PICTURE X.
           02  FILLER REDEFINES FMM08F.
             03 FMM08A    PICTURE X.
           02  FMM08I  PIC X(9).
           02  FMPS08L    COMP  PIC  S9(4).
           02  FMPS08F    PICTURE X.
           02  FILLER REDEFINES FMPS08F.
             03 FMPS08A    PICTURE X.
           02  FMPS08I  PIC X(19).
           02  FMM09L    COMP  PIC  S9(4).
           02  FMM09F    PICTURE X.
           02  FILLER REDEFINES FMM09F.
             03 FMM09A    PICTURE X.
           02  FMM09I  PIC X(9).
           02  FMPS09L    COMP  PIC  S9(4).
           02  FMPS09F    PICTURE X.
           02  FILLER REDEFINES FMPS09F.
             03 FMPS09A    PICTURE X.
           02  FMPS09I  PIC X(19).
           02  FMM10L    COMP  PIC  S9(4).
           02  FMM10F    PICTURE X.
           02  FILLER REDEFINES FMM10F.
             03 FMM10A    PICTURE X.
           02  FMM10I  PIC X(9).
           02  FMPS10L    COMP  PIC  S9(4).
           02  FMPS10F    PICTURE X.
           02  FILLER REDEFINES FMPS10F.
             03 FMPS10A    PICTURE X.
           02  FMPS10I  PIC X(19).
           02  FMM11L    COMP  PIC  S9(4).
           02  FMM11F    PICTURE X.
           02  FILLER REDEFINES FMM11F.
             03 FMM11A    PICTURE X.
           02  FMM11I  PIC X(9).
           02  FMPS11L    COMP  PIC  S9(4).
           02  FMPS11F    PICTURE X.
           02  FILLER REDEFINES FMPS11F.
             03 FMPS11A    PICTURE X.
           02  FMPS11I  PIC X(19).
           02  FMM12L    COMP  PIC  S9(4).
           02  FMM12F    PICTURE X.
           02  FILLER REDEFINES FMM12F.
             03 FMM12A    PICTURE X.
           02  FMM12I  PIC X(9).
           02  FMPS12L    COMP  PIC  S9(4).
           02  FMPS12F    PICTURE X.
           02  FILLER REDEFINES FMPS12F.
             03 FMPS12A    PICTURE X.
           02  FMPS12I  PIC X(19).
           02  FMM1L    COMP  PIC  S9(4).
           02  FMM1F    PICTURE X.
           02  FILLER REDEFINES FMM1F.
             03 FMM1A    PICTURE X.
           02  FMM1I  PIC X(9).
           02  FMPR01L    COMP  PIC  S9(4).
           02  FMPR01F    PICTURE X.
           02  FILLER REDEFINES FMPR01F.
             03 FMPR01A    PICTURE X.
           02  FMPR01I  PIC X(19).
           02  FMM2L    COMP  PIC  S9(4).
           02  FMM2F    PICTURE X.
           02  FILLER REDEFINES FMM2F.
             03 FMM2A    PICTURE X.
           02  FMM2I  PIC X(9).
           02  FMPR02L    COMP  PIC  S9(4).
           02  FMPR02F    PICTURE X.
           02  FILLER REDEFINES FMPR02F.
             03 FMPR02A    PICTURE X.
           02  FMPR02I  PIC X(19).
           02  FMM3L    COMP  PIC  S9(4).
           02  FMM3F    PICTURE X.
           02  FILLER REDEFINES FMM3F.
             03 FMM3A    PICTURE X.
           02  FMM3I  PIC X(9).
           02  FMPR03L    COMP  PIC  S9(4).
           02  FMPR03F    PICTURE X.
           02  FILLER REDEFINES FMPR03F.
             03 FMPR03A    PICTURE X.
           02  FMPR03I  PIC X(19).
           02  FMM4L    COMP  PIC  S9(4).
           02  FMM4F    PICTURE X.
           02  FILLER REDEFINES FMM4F.
             03 FMM4A    PICTURE X.
           02  FMM4I  PIC X(9).
           02  FMPR04L    COMP  PIC  S9(4).
           02  FMPR04F    PICTURE X.
           02  FILLER REDEFINES FMPR04F.
             03 FMPR04A    PICTURE X.
           02  FMPR04I  PIC X(19).
           02  FMM5L    COMP  PIC  S9(4).
           02  FMM5F    PICTURE X.
           02  FILLER REDEFINES FMM5F.
             03 FMM5A    PICTURE X.
           02  FMM5I  PIC X(9).
           02  FMPR05L    COMP  PIC  S9(4).
           02  FMPR05F    PICTURE X.
           02  FILLER REDEFINES FMPR05F.
             03 FMPR05A    PICTURE X.
           02  FMPR05I  PIC X(19).
           02  FMM6L    COMP  PIC  S9(4).
           02  FMM6F    PICTURE X.
           02  FILLER REDEFINES FMM6F.
             03 FMM6A    PICTURE X.
           02  FMM6I  PIC X(9).
           02  FMPR06L    COMP  PIC  S9(4).
           02  FMPR06F    PICTURE X.
           02  FILLER REDEFINES FMPR06F.
             03 FMPR06A    PICTURE X.
           02  FMPR06I  PIC X(19).
           02  FMM7L    COMP  PIC  S9(4).
           02  FMM7F    PICTURE X.
           02  FILLER REDEFINES FMM7F.
             03 FMM7A    PICTURE X.
           02  FMM7I  PIC X(9).
           02  FMPR07L    COMP  PIC  S9(4).
           02  FMPR07F    PICTURE X.
           02  FILLER REDEFINES FMPR07F.
             03 FMPR07A    PICTURE X.
           02  FMPR07I  PIC X(19).
           02  FMM8L    COMP  PIC  S9(4).
           02  FMM8F    PICTURE X.
           02  FILLER REDEFINES FMM8F.
             03 FMM8A    PICTURE X.
           02  FMM8I  PIC X(9).
           02  FMPR08L    COMP  PIC  S9(4).
           02  FMPR08F    PICTURE X.
           02  FILLER REDEFINES FMPR08F.
             03 FMPR08A    PICTURE X.
           02  FMPR08I  PIC X(19).
           02  FMM9L    COMP  PIC  S9(4).
           02  FMM9F    PICTURE X.
           02  FILLER REDEFINES FMM9F.
             03 FMM9A    PICTURE X.
           02  FMM9I  PIC X(9).
           02  FMPR09L    COMP  PIC  S9(4).
           02  FMPR09F    PICTURE X.
           02  FILLER REDEFINES FMPR09F.
             03 FMPR09A    PICTURE X.
           02  FMPR09I  PIC X(19).
           02  FM10L    COMP  PIC  S9(4).
           02  FM10F    PICTURE X.
           02  FILLER REDEFINES FM10F.
             03 FM10A    PICTURE X.
           02  FM10I  PIC X(9).
           02  FMPR10L    COMP  PIC  S9(4).
           02  FMPR10F    PICTURE X.
           02  FILLER REDEFINES FMPR10F.
             03 FMPR10A    PICTURE X.
           02  FMPR10I  PIC X(19).
           02  FM11L    COMP  PIC  S9(4).
           02  FM11F    PICTURE X.
           02  FILLER REDEFINES FM11F.
             03 FM11A    PICTURE X.
           02  FM11I  PIC X(9).
           02  FMPR11L    COMP  PIC  S9(4).
           02  FMPR11F    PICTURE X.
           02  FILLER REDEFINES FMPR11F.
             03 FMPR11A    PICTURE X.
           02  FMPR11I  PIC X(19).
           02  FM12L    COMP  PIC  S9(4).
           02  FM12F    PICTURE X.
           02  FILLER REDEFINES FM12F.
             03 FM12A    PICTURE X.
           02  FM12I  PIC X(9).
           02  FMPR12L    COMP  PIC  S9(4).
           02  FMPR12F    PICTURE X.
           02  FILLER REDEFINES FMPR12F.
             03 FMPR12A    PICTURE X.
           02  FMPR12I  PIC X(19).
           02  FMAFTPL    COMP  PIC  S9(4).
           02  FMAFTPF    PICTURE X.
           02  FILLER REDEFINES FMAFTPF.
             03 FMAFTPA    PICTURE X.
           02  FMAFTPI  PIC X(1).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFM2DCO REDEFINES FIFM2DCI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSTCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMTITLEO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  FMMO1O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS01O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM02O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS02O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM03O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS03O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM04O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS04O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM05O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS05O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM06O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS06O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM07O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS07O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM08O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS08O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM09O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS09O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM10O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS10O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM11O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS11O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM12O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPS12O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM1O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR01O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM2O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR02O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM3O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR03O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM4O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR04O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM5O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR05O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM6O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR06O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM7O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR07O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM8O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR08O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMM9O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR09O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FM10O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR10O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FM11O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR11O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FM12O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMPR12O PIC Z(15).99-.
           02  FILLER PICTURE X(3).
           02  FMAFTPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).