       01  FIFMREDI.
           02  FILLER PIC X(12).
           02  FMFLLR1L    COMP  PIC  S9(4).
           02  FMFLLR1F    PICTURE X.
           02  FILLER REDEFINES FMFLLR1F.
             03 FMFLLR1A    PICTURE X.
           02  FMFLLR1I  PIC X(239).
           02  FMFLLR2L    COMP  PIC  S9(4).
           02  FMFLLR2F    PICTURE X.
           02  FILLER REDEFINES FMFLLR2F.
             03 FMFLLR2A    PICTURE X.
           02  FMFLLR2I  PIC X(239).
           02  FMFLLR3L    COMP  PIC  S9(4).
           02  FMFLLR3F    PICTURE X.
           02  FILLER REDEFINES FMFLLR3F.
             03 FMFLLR3A    PICTURE X.
           02  FMFLLR3I  PIC X(239).
           02  FMFLLR4L    COMP  PIC  S9(4).
           02  FMFLLR4F    PICTURE X.
           02  FILLER REDEFINES FMFLLR4F.
             03 FMFLLR4A    PICTURE X.
           02  FMFLLR4I  PIC X(239).
           02  FMFLLR5L    COMP  PIC  S9(4).
           02  FMFLLR5F    PICTURE X.
           02  FILLER REDEFINES FMFLLR5F.
             03 FMFLLR5A    PICTURE X.
           02  FMFLLR5I  PIC X(239).
           02  FMFLLR6L    COMP  PIC  S9(4).
           02  FMFLLR6F    PICTURE X.
           02  FILLER REDEFINES FMFLLR6F.
             03 FMFLLR6A    PICTURE X.
           02  FMFLLR6I  PIC X(239).
           02  FMFLLR7L    COMP  PIC  S9(4).
           02  FMFLLR7F    PICTURE X.
           02  FILLER REDEFINES FMFLLR7F.
             03 FMFLLR7A    PICTURE X.
           02  FMFLLR7I  PIC X(239).
           02  FMFLLR8L    COMP  PIC  S9(4).
           02  FMFLLR8F    PICTURE X.
           02  FILLER REDEFINES FMFLLR8F.
             03 FMFLLR8A    PICTURE X.
           02  FMFLLR8I  PIC X(220).
       01  FIFMREDO REDEFINES FIFMREDI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMFLLR1O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR2O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR3O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR4O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR5O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR6O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR7O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR8O  PIC X(220).
       01  FIFMREBI REDEFINES FIFMREDI.
           02  FILLER PIC X(12).
           02  FMTRIDBL    COMP  PIC  S9(4).
           02  FMTRIDBF    PICTURE X.
           02  FILLER REDEFINES FMTRIDBF.
             03 FMTRIDBA    PICTURE X.
           02  FMTRIDBI  PIC X(4).
           02  FMDATEBL    COMP  PIC  S9(4).
           02  FMDATEBF    PICTURE X.
           02  FILLER REDEFINES FMDATEBF.
             03 FMDATEBA    PICTURE X.
           02  FMDATEBI  PIC X(8).
           02  FMTIMEBL    COMP  PIC  S9(4).
           02  FMTIMEBF    PICTURE X.
           02  FILLER REDEFINES FMTIMEBF.
             03 FMTIMEBA    PICTURE X.
           02  FMTIMEBI  PIC X(8).
           02  FMPAGEBL    COMP  PIC  S9(4).
           02  FMPAGEBF    PICTURE X.
           02  FILLER REDEFINES FMPAGEBF.
             03 FMPAGEBA    PICTURE X.
           02  FMPAGEBI  PIC X(4).
           02  FMRCBL    COMP  PIC  S9(4).
           02  FMRCBF    PICTURE X.
           02  FILLER REDEFINES FMRCBF.
             03 FMRCBA    PICTURE X.
           02  FMRCBI  PIC X(10).
           02  FMACCTBL    COMP  PIC  S9(4).
           02  FMACCTBF    PICTURE X.
           02  FILLER REDEFINES FMACCTBF.
             03 FMACCTBA    PICTURE X.
           02  FMACCTBI  PIC X(10).
           02  FMCUSTBL    COMP  PIC  S9(4).
           02  FMCUSTBF    PICTURE X.
           02  FILLER REDEFINES FMCUSTBF.
             03 FMCUSTBA    PICTURE X.
           02  FMCUSTBI  PIC X(4).
           02  FMERRBL    COMP  PIC  S9(4).
           02  FMERRBF    PICTURE X.
           02  FILLER REDEFINES FMERRBF.
             03 FMERRBA    PICTURE X.
           02  FMERRBI  PIC X(79).
       01  FIFMREBO REDEFINES FIFMREBI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAGEBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSTBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMERRBO  PIC X(79).
       01  FIFMRECI REDEFINES FIFMREDI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMPAGEL    COMP  PIC  S9(4).
           02  FMPAGEF    PICTURE X.
           02  FILLER REDEFINES FMPAGEF.
             03 FMPAGEA    PICTURE X.
           02  FMPAGEI  PIC X(4).
           02  FMRCL    COMP  PIC  S9(4).
           02  FMRCF    PICTURE X.
           02  FILLER REDEFINES FMRCF.
             03 FMRCA    PICTURE X.
           02  FMRCI  PIC X(10).
           02  FMACCTL    COMP  PIC  S9(4).
           02  FMACCTF    PICTURE X.
           02  FILLER REDEFINES FMACCTF.
             03 FMACCTA    PICTURE X.
           02  FMACCTI  PIC X(10).
           02  FMCUSTL    COMP  PIC  S9(4).
           02  FMCUSTF    PICTURE X.
           02  FILLER REDEFINES FMCUSTF.
             03 FMCUSTA    PICTURE X.
           02  FMCUSTI  PIC X(4).
           02  FMACTAL    COMP  PIC  S9(4).
           02  FMACTAF    PICTURE X.
           02  FILLER REDEFINES FMACTAF.
             03 FMACTAA    PICTURE X.
           02  FMACTAI  PIC X(1).
           02  FMDTLAL    COMP  PIC  S9(4).
           02  FMDTLAF    PICTURE X.
           02  FILLER REDEFINES FMDTLAF.
             03 FMDTLAA    PICTURE X.
           02  FMDTLAI  PIC X(77).
           02  FMACTBL    COMP  PIC  S9(4).
           02  FMACTBF    PICTURE X.
           02  FILLER REDEFINES FMACTBF.
             03 FMACTBA    PICTURE X.
           02  FMACTBI  PIC X(1).
           02  FMDTLBL    COMP  PIC  S9(4).
           02  FMDTLBF    PICTURE X.
           02  FILLER REDEFINES FMDTLBF.
             03 FMDTLBA    PICTURE X.
           02  FMDTLBI  PIC X(77).
           02  FMACTCL    COMP  PIC  S9(4).
           02  FMACTCF    PICTURE X.
           02  FILLER REDEFINES FMACTCF.
             03 FMACTCA    PICTURE X.
           02  FMACTCI  PIC X(1).
           02  FMDTLCL    COMP  PIC  S9(4).
           02  FMDTLCF    PICTURE X.
           02  FILLER REDEFINES FMDTLCF.
             03 FMDTLCA    PICTURE X.
           02  FMDTLCI  PIC X(77).
           02  FMACTDL    COMP  PIC  S9(4).
           02  FMACTDF    PICTURE X.
           02  FILLER REDEFINES FMACTDF.
             03 FMACTDA    PICTURE X.
           02  FMACTDI  PIC X(1).
           02  FMDTLDL    COMP  PIC  S9(4).
           02  FMDTLDF    PICTURE X.
           02  FILLER REDEFINES FMDTLDF.
             03 FMDTLDA    PICTURE X.
           02  FMDTLDI  PIC X(77).
           02  FMACTEL    COMP  PIC  S9(4).
           02  FMACTEF    PICTURE X.
           02  FILLER REDEFINES FMACTEF.
             03 FMACTEA    PICTURE X.
           02  FMACTEI  PIC X(1).
           02  FMDTLEL    COMP  PIC  S9(4).
           02  FMDTLEF    PICTURE X.
           02  FILLER REDEFINES FMDTLEF.
             03 FMDTLEA    PICTURE X.
           02  FMDTLEI  PIC X(77).
           02  FMACTFL    COMP  PIC  S9(4).
           02  FMACTFF    PICTURE X.
           02  FILLER REDEFINES FMACTFF.
             03 FMACTFA    PICTURE X.
           02  FMACTFI  PIC X(1).
           02  FMDTLFL    COMP  PIC  S9(4).
           02  FMDTLFF    PICTURE X.
           02  FILLER REDEFINES FMDTLFF.
             03 FMDTLFA    PICTURE X.
           02  FMDTLFI  PIC X(77).
           02  FMACTGL    COMP  PIC  S9(4).
           02  FMACTGF    PICTURE X.
           02  FILLER REDEFINES FMACTGF.
             03 FMACTGA    PICTURE X.
           02  FMACTGI  PIC X(1).
           02  FMDTLGL    COMP  PIC  S9(4).
           02  FMDTLGF    PICTURE X.
           02  FILLER REDEFINES FMDTLGF.
             03 FMDTLGA    PICTURE X.
           02  FMDTLGI  PIC X(77).
           02  FMACTHL    COMP  PIC  S9(4).
           02  FMACTHF    PICTURE X.
           02  FILLER REDEFINES FMACTHF.
             03 FMACTHA    PICTURE X.
           02  FMACTHI  PIC X(1).
           02  FMDTLHL    COMP  PIC  S9(4).
           02  FMDTLHF    PICTURE X.
           02  FILLER REDEFINES FMDTLHF.
             03 FMDTLHA    PICTURE X.
           02  FMDTLHI  PIC X(77).
           02  FMACTIL    COMP  PIC  S9(4).
           02  FMACTIF    PICTURE X.
           02  FILLER REDEFINES FMACTIF.
             03 FMACTIA    PICTURE X.
           02  FMACTII  PIC X(1).
           02  FMDTLIL    COMP  PIC  S9(4).
           02  FMDTLIF    PICTURE X.
           02  FILLER REDEFINES FMDTLIF.
             03 FMDTLIA    PICTURE X.
           02  FMDTLII  PIC X(77).
           02  FMACTJL    COMP  PIC  S9(4).
           02  FMACTJF    PICTURE X.
           02  FILLER REDEFINES FMACTJF.
             03 FMACTJA    PICTURE X.
           02  FMACTJI  PIC X(1).
           02  FMDTLJL    COMP  PIC  S9(4).
           02  FMDTLJF    PICTURE X.
           02  FILLER REDEFINES FMDTLJF.
             03 FMDTLJA    PICTURE X.
           02  FMDTLJI  PIC X(77).
           02  FMACTKL    COMP  PIC  S9(4).
           02  FMACTKF    PICTURE X.
           02  FILLER REDEFINES FMACTKF.
             03 FMACTKA    PICTURE X.
           02  FMACTKI  PIC X(1).
           02  FMDTLKL    COMP  PIC  S9(4).
           02  FMDTLKF    PICTURE X.
           02  FILLER REDEFINES FMDTLKF.
             03 FMDTLKA    PICTURE X.
           02  FMDTLKI  PIC X(77).
           02  FMACTLL    COMP  PIC  S9(4).
           02  FMACTLF    PICTURE X.
           02  FILLER REDEFINES FMACTLF.
             03 FMACTLA    PICTURE X.
           02  FMACTLI  PIC X(1).
           02  FMDTLLL    COMP  PIC  S9(4).
           02  FMDTLLF    PICTURE X.
           02  FILLER REDEFINES FMDTLLF.
             03 FMDTLLA    PICTURE X.
           02  FMDTLLI  PIC X(77).
           02  FMACTML    COMP  PIC  S9(4).
           02  FMACTMF    PICTURE X.
           02  FILLER REDEFINES FMACTMF.
             03 FMACTMA    PICTURE X.
           02  FMACTMI  PIC X(1).
           02  FMDTLML    COMP  PIC  S9(4).
           02  FMDTLMF    PICTURE X.
           02  FILLER REDEFINES FMDTLMF.
             03 FMDTLMA    PICTURE X.
           02  FMDTLMI  PIC X(77).
           02  FMACTNL    COMP  PIC  S9(4).
           02  FMACTNF    PICTURE X.
           02  FILLER REDEFINES FMACTNF.
             03 FMACTNA    PICTURE X.
           02  FMACTNI  PIC X(1).
           02  FMDTLNL    COMP  PIC  S9(4).
           02  FMDTLNF    PICTURE X.
           02  FILLER REDEFINES FMDTLNF.
             03 FMDTLNA    PICTURE X.
           02  FMDTLNI  PIC X(77).
           02  FMACTOL    COMP  PIC  S9(4).
           02  FMACTOF    PICTURE X.
           02  FILLER REDEFINES FMACTOF.
             03 FMACTOA    PICTURE X.
           02  FMACTOI  PIC X(1).
           02  FMDTLOL    COMP  PIC  S9(4).
           02  FMDTLOF    PICTURE X.
           02  FILLER REDEFINES FMDTLOF.
             03 FMDTLOA    PICTURE X.
           02  FMDTLOI  PIC X(77).
           02  FMPF1L    COMP  PIC  S9(4).
           02  FMPF1F    PICTURE X.
           02  FILLER REDEFINES FMPF1F.
             03 FMPF1A    PICTURE X.
           02  FMPF1I  PIC X(20).
           02  FMPF2L    COMP  PIC  S9(4).
           02  FMPF2F    PICTURE X.
           02  FILLER REDEFINES FMPF2F.
             03 FMPF2A    PICTURE X.
           02  FMPF2I  PIC X(20).
           02  FMERRL    COMP  PIC  S9(4).
           02  FMERRF    PICTURE X.
           02  FILLER REDEFINES FMERRF.
             03 FMERRA    PICTURE X.
           02  FMERRI  PIC X(79).
       01  FIFMRECO REDEFINES FIFMRECI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAGEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACTAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLAO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLBO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLCO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLDO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLEO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLFO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLGO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTHO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLHO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLIO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTJO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLJO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTKO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLKO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLLO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLMO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLNO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMACTOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTLOO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  FMPF1O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMPF2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMERRO  PIC X(79).