       01  FIFMFPAI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMFMIPL    COMP  PIC  S9(4).
           02  FMFMIPF    PICTURE X.
           02  FILLER REDEFINES FMFMIPF.
             03 FMFMIPA    PICTURE X.
           02  FMFMIPI  PIC X(1).
           02  FMFM84L    COMP  PIC  S9(4).
           02  FMFM84F    PICTURE X.
           02  FILLER REDEFINES FMFM84F.
             03 FMFM84A    PICTURE X.
           02  FMFM84I  PIC X(1).
           02  FMFM85L    COMP  PIC  S9(4).
           02  FMFM85F    PICTURE X.
           02  FILLER REDEFINES FMFM85F.
             03 FMFM85A    PICTURE X.
           02  FMFM85I  PIC X(1).
           02  FMFM86L    COMP  PIC  S9(4).
           02  FMFM86F    PICTURE X.
           02  FILLER REDEFINES FMFM86F.
             03 FMFM86A    PICTURE X.
           02  FMFM86I  PIC X(1).
           02  FMFM81L    COMP  PIC  S9(4).
           02  FMFM81F    PICTURE X.
           02  FILLER REDEFINES FMFM81F.
             03 FMFM81A    PICTURE X.
           02  FMFM81I  PIC X(1).
           02  FMFM83L    COMP  PIC  S9(4).
           02  FMFM83F    PICTURE X.
           02  FILLER REDEFINES FMFM83F.
             03 FMFM83A    PICTURE X.
           02  FMFM83I  PIC X(1).
           02  FMFM87L    COMP  PIC  S9(4).
           02  FMFM87F    PICTURE X.
           02  FILLER REDEFINES FMFM87F.
             03 FMFM87A    PICTURE X.
           02  FMFM87I  PIC X(1).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFMFPAO REDEFINES FIFMFPAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMFMIPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM84O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM85O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM86O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM81O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM83O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM87O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).