       01  FIFM84DI.
           02  FILLER PIC X(12).
           02  FMFLLR1L    COMP  PIC  S9(4).
           02  FMFLLR1F    PICTURE X.
           02  FILLER REDEFINES FMFLLR1F.
             03 FMFLLR1A    PICTURE X.
           02  FMFLLR1I  PIC X(239).
           02  FMFLLR2L    COMP  PIC  S9(4).
           02  FMFLLR2F    PICTURE X.
           02  FILLER REDEFINES FMFLLR2F.
             03 FMFLLR2A    PICTURE X.
           02  FMFLLR2I  PIC X(239).
           02  FMFLLR3L    COMP  PIC  S9(4).
           02  FMFLLR3F    PICTURE X.
           02  FILLER REDEFINES FMFLLR3F.
             03 FMFLLR3A    PICTURE X.
           02  FMFLLR3I  PIC X(239).
           02  FMFLLR4L    COMP  PIC  S9(4).
           02  FMFLLR4F    PICTURE X.
           02  FILLER REDEFINES FMFLLR4F.
             03 FMFLLR4A    PICTURE X.
           02  FMFLLR4I  PIC X(239).
           02  FMFLLR5L    COMP  PIC  S9(4).
           02  FMFLLR5F    PICTURE X.
           02  FILLER REDEFINES FMFLLR5F.
             03 FMFLLR5A    PICTURE X.
           02  FMFLLR5I  PIC X(239).
           02  FMFLLR6L    COMP  PIC  S9(4).
           02  FMFLLR6F    PICTURE X.
           02  FILLER REDEFINES FMFLLR6F.
             03 FMFLLR6A    PICTURE X.
           02  FMFLLR6I  PIC X(239).
           02  FMFLLR7L    COMP  PIC  S9(4).
           02  FMFLLR7F    PICTURE X.
           02  FILLER REDEFINES FMFLLR7F.
             03 FMFLLR7A    PICTURE X.
           02  FMFLLR7I  PIC X(239).
           02  FMFLLR8L    COMP  PIC  S9(4).
           02  FMFLLR8F    PICTURE X.
           02  FILLER REDEFINES FMFLLR8F.
             03 FMFLLR8A    PICTURE X.
           02  FMFLLR8I  PIC X(220).
       01  FIFM84DO REDEFINES FIFM84DI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMFLLR1O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR2O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR3O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR4O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR5O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR6O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR7O  PIC X(239).
           02  FILLER PICTURE X(3).
           02  FMFLLR8O  PIC X(220).
       01  FIFM84BI REDEFINES FIFM84DI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMRCNOL    COMP  PIC  S9(4).
           02  FMRCNOF    PICTURE X.
           02  FILLER REDEFINES FMRCNOF.
             03 FMRCNOA    PICTURE X.
           02  FMRCNOI  PIC X(10).
           02  FMACTNOL    COMP  PIC  S9(4).
           02  FMACTNOF    PICTURE X.
           02  FILLER REDEFINES FMACTNOF.
             03 FMACTNOA    PICTURE X.
           02  FMACTNOI  PIC X(10).
           02  FMCUSNOL    COMP  PIC  S9(4).
           02  FMCUSNOF    PICTURE X.
           02  FILLER REDEFINES FMCUSNOF.
             03 FMCUSNOA    PICTURE X.
           02  FMCUSNOI  PIC X(4).
           02  FMJANP1L    COMP  PIC  S9(4).
           02  FMJANP1F    PICTURE X.
           02  FILLER REDEFINES FMJANP1F.
             03 FMJANP1A    PICTURE X.
           02  FMJANP1I  PIC X(3).
           02  FMJANP2L    COMP  PIC  S9(4).
           02  FMJANP2F    PICTURE X.
           02  FILLER REDEFINES FMJANP2F.
             03 FMJANP2A    PICTURE X.
           02  FMJANP2I  PIC X(2).
           02  FMFEBP1L    COMP  PIC  S9(4).
           02  FMFEBP1F    PICTURE X.
           02  FILLER REDEFINES FMFEBP1F.
             03 FMFEBP1A    PICTURE X.
           02  FMFEBP1I  PIC X(3).
           02  FMFEBP2L    COMP  PIC  S9(4).
           02  FMFEBP2F    PICTURE X.
           02  FILLER REDEFINES FMFEBP2F.
             03 FMFEBP2A    PICTURE X.
           02  FMFEBP2I  PIC X(2).
           02  FMMARP1L    COMP  PIC  S9(4).
           02  FMMARP1F    PICTURE X.
           02  FILLER REDEFINES FMMARP1F.
             03 FMMARP1A    PICTURE X.
           02  FMMARP1I  PIC X(3).
           02  FMMARP2L    COMP  PIC  S9(4).
           02  FMMARP2F    PICTURE X.
           02  FILLER REDEFINES FMMARP2F.
             03 FMMARP2A    PICTURE X.
           02  FMMARP2I  PIC X(2).
           02  FMAPRP1L    COMP  PIC  S9(4).
           02  FMAPRP1F    PICTURE X.
           02  FILLER REDEFINES FMAPRP1F.
             03 FMAPRP1A    PICTURE X.
           02  FMAPRP1I  PIC X(3).
           02  FMAPRP2L    COMP  PIC  S9(4).
           02  FMAPRP2F    PICTURE X.
           02  FILLER REDEFINES FMAPRP2F.
             03 FMAPRP2A    PICTURE X.
           02  FMAPRP2I  PIC X(2).
           02  FMMAYP1L    COMP  PIC  S9(4).
           02  FMMAYP1F    PICTURE X.
           02  FILLER REDEFINES FMMAYP1F.
             03 FMMAYP1A    PICTURE X.
           02  FMMAYP1I  PIC X(3).
           02  FMMAYP2L    COMP  PIC  S9(4).
           02  FMMAYP2F    PICTURE X.
           02  FILLER REDEFINES FMMAYP2F.
             03 FMMAYP2A    PICTURE X.
           02  FMMAYP2I  PIC X(2).
           02  FMJUNP1L    COMP  PIC  S9(4).
           02  FMJUNP1F    PICTURE X.
           02  FILLER REDEFINES FMJUNP1F.
             03 FMJUNP1A    PICTURE X.
           02  FMJUNP1I  PIC X(3).
           02  FMJUNP2L    COMP  PIC  S9(4).
           02  FMJUNP2F    PICTURE X.
           02  FILLER REDEFINES FMJUNP2F.
             03 FMJUNP2A    PICTURE X.
           02  FMJUNP2I  PIC X(2).
           02  FMJULP1L    COMP  PIC  S9(4).
           02  FMJULP1F    PICTURE X.
           02  FILLER REDEFINES FMJULP1F.
             03 FMJULP1A    PICTURE X.
           02  FMJULP1I  PIC X(3).
           02  FMJULP2L    COMP  PIC  S9(4).
           02  FMJULP2F    PICTURE X.
           02  FILLER REDEFINES FMJULP2F.
             03 FMJULP2A    PICTURE X.
           02  FMJULP2I  PIC X(2).
           02  FMAUGP1L    COMP  PIC  S9(4).
           02  FMAUGP1F    PICTURE X.
           02  FILLER REDEFINES FMAUGP1F.
             03 FMAUGP1A    PICTURE X.
           02  FMAUGP1I  PIC X(3).
           02  FMAUGP2L    COMP  PIC  S9(4).
           02  FMAUGP2F    PICTURE X.
           02  FILLER REDEFINES FMAUGP2F.
             03 FMAUGP2A    PICTURE X.
           02  FMAUGP2I  PIC X(2).
           02  FMSEPP1L    COMP  PIC  S9(4).
           02  FMSEPP1F    PICTURE X.
           02  FILLER REDEFINES FMSEPP1F.
             03 FMSEPP1A    PICTURE X.
           02  FMSEPP1I  PIC X(3).
           02  FMSEPP2L    COMP  PIC  S9(4).
           02  FMSEPP2F    PICTURE X.
           02  FILLER REDEFINES FMSEPP2F.
             03 FMSEPP2A    PICTURE X.
           02  FMSEPP2I  PIC X(2).
           02  FMOCTP1L    COMP  PIC  S9(4).
           02  FMOCTP1F    PICTURE X.
           02  FILLER REDEFINES FMOCTP1F.
             03 FMOCTP1A    PICTURE X.
           02  FMOCTP1I  PIC X(3).
           02  FMOCTP2L    COMP  PIC  S9(4).
           02  FMOCTP2F    PICTURE X.
           02  FILLER REDEFINES FMOCTP2F.
             03 FMOCTP2A    PICTURE X.
           02  FMOCTP2I  PIC X(2).
           02  FMNOVP1L    COMP  PIC  S9(4).
           02  FMNOVP1F    PICTURE X.
           02  FILLER REDEFINES FMNOVP1F.
             03 FMNOVP1A    PICTURE X.
           02  FMNOVP1I  PIC X(3).
           02  FMNOVP2L    COMP  PIC  S9(4).
           02  FMNOVP2F    PICTURE X.
           02  FILLER REDEFINES FMNOVP2F.
             03 FMNOVP2A    PICTURE X.
           02  FMNOVP2I  PIC X(2).
           02  FMDECP1L    COMP  PIC  S9(4).
           02  FMDECP1F    PICTURE X.
           02  FILLER REDEFINES FMDECP1F.
             03 FMDECP1A    PICTURE X.
           02  FMDECP1I  PIC X(3).
           02  FMDECP2L    COMP  PIC  S9(4).
           02  FMDECP2F    PICTURE X.
           02  FILLER REDEFINES FMDECP2F.
             03 FMDECP2A    PICTURE X.
           02  FMDECP2I  PIC X(2).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFM84BO REDEFINES FIFM84BI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCNOO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACTNOO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSNOO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMJANP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMJANP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMFEBP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMFEBP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMMARP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMMARP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAPRP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMAPRP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMMAYP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMMAYP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMJUNP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMJUNP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMJULP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMJULP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMAUGP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMAUGP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMSEPP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMSEPP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMOCTP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMOCTP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMNOVP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMNOVP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMDECP1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMDECP2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).
       01  FIFM84CI REDEFINES FIFM84DI.
           02  FILLER PIC X(12).
           02  FMTRIDCL    COMP  PIC  S9(4).
           02  FMTRIDCF    PICTURE X.
           02  FILLER REDEFINES FMTRIDCF.
             03 FMTRIDCA    PICTURE X.
           02  FMTRIDCI  PIC X(4).
           02  FMDATECL    COMP  PIC  S9(4).
           02  FMDATECF    PICTURE X.
           02  FILLER REDEFINES FMDATECF.
             03 FMDATECA    PICTURE X.
           02  FMDATECI  PIC X(8).
           02  FMTIMECL    COMP  PIC  S9(4).
           02  FMTIMECF    PICTURE X.
           02  FILLER REDEFINES FMTIMECF.
             03 FMTIMECA    PICTURE X.
           02  FMTIMECI  PIC X(8).
           02  FMRCNOCL    COMP  PIC  S9(4).
           02  FMRCNOCF    PICTURE X.
           02  FILLER REDEFINES FMRCNOCF.
             03 FMRCNOCA    PICTURE X.
           02  FMRCNOCI  PIC X(10).
           02  FMACTNCL    COMP  PIC  S9(4).
           02  FMACTNCF    PICTURE X.
           02  FILLER REDEFINES FMACTNCF.
             03 FMACTNCA    PICTURE X.
           02  FMACTNCI  PIC X(10).
           02  FMCUSNCL    COMP  PIC  S9(4).
           02  FMCUSNCF    PICTURE X.
           02  FILLER REDEFINES FMCUSNCF.
             03 FMCUSNCA    PICTURE X.
           02  FMCUSNCI  PIC X(4).
           02  FMAMLITL    COMP  PIC  S9(4).
           02  FMAMLITF    PICTURE X.
           02  FILLER REDEFINES FMAMLITF.
             03 FMAMLITA    PICTURE X.
           02  FMAMLITI  PIC X(16).
           02  FMAMAMTL    COMP  PIC  S9(4).
           02  FMAMAMTF    PICTURE X.
           02  FILLER REDEFINES FMAMAMTF.
             03 FMAMAMTA    PICTURE X.
           02  FMAMAMTI  PIC X(16).
           02  FMJANAML    COMP  PIC  S9(4).
           02  FMJANAMF    PICTURE X.
           02  FILLER REDEFINES FMJANAMF.
             03 FMJANAMA    PICTURE X.
           02  FMJANAMI  PIC X(15).
           02  FMFEBAML    COMP  PIC  S9(4).
           02  FMFEBAMF    PICTURE X.
           02  FILLER REDEFINES FMFEBAMF.
             03 FMFEBAMA    PICTURE X.
           02  FMFEBAMI  PIC X(15).
           02  FMMARAML    COMP  PIC  S9(4).
           02  FMMARAMF    PICTURE X.
           02  FILLER REDEFINES FMMARAMF.
             03 FMMARAMA    PICTURE X.
           02  FMMARAMI  PIC X(15).
           02  FMAPRAML    COMP  PIC  S9(4).
           02  FMAPRAMF    PICTURE X.
           02  FILLER REDEFINES FMAPRAMF.
             03 FMAPRAMA    PICTURE X.
           02  FMAPRAMI  PIC X(15).
           02  FMMAYAML    COMP  PIC  S9(4).
           02  FMMAYAMF    PICTURE X.
           02  FILLER REDEFINES FMMAYAMF.
             03 FMMAYAMA    PICTURE X.
           02  FMMAYAMI  PIC X(15).
           02  FMJUNAML    COMP  PIC  S9(4).
           02  FMJUNAMF    PICTURE X.
           02  FILLER REDEFINES FMJUNAMF.
             03 FMJUNAMA    PICTURE X.
           02  FMJUNAMI  PIC X(15).
           02  FMJULAML    COMP  PIC  S9(4).
           02  FMJULAMF    PICTURE X.
           02  FILLER REDEFINES FMJULAMF.
             03 FMJULAMA    PICTURE X.
           02  FMJULAMI  PIC X(15).
           02  FMAUGAML    COMP  PIC  S9(4).
           02  FMAUGAMF    PICTURE X.
           02  FILLER REDEFINES FMAUGAMF.
             03 FMAUGAMA    PICTURE X.
           02  FMAUGAMI  PIC X(15).
           02  FMSEPAML    COMP  PIC  S9(4).
           02  FMSEPAMF    PICTURE X.
           02  FILLER REDEFINES FMSEPAMF.
             03 FMSEPAMA    PICTURE X.
           02  FMSEPAMI  PIC X(15).
           02  FMOCTAML    COMP  PIC  S9(4).
           02  FMOCTAMF    PICTURE X.
           02  FILLER REDEFINES FMOCTAMF.
             03 FMOCTAMA    PICTURE X.
           02  FMOCTAMI  PIC X(15).
           02  FMNOVAML    COMP  PIC  S9(4).
           02  FMNOVAMF    PICTURE X.
           02  FILLER REDEFINES FMNOVAMF.
             03 FMNOVAMA    PICTURE X.
           02  FMNOVAMI  PIC X(15).
           02  FMDECAML    COMP  PIC  S9(4).
           02  FMDECAMF    PICTURE X.
           02  FILLER REDEFINES FMDECAMF.
             03 FMDECAMA    PICTURE X.
           02  FMDECAMI  PIC X(15).
           02  FMERRCL    COMP  PIC  S9(4).
           02  FMERRCF    PICTURE X.
           02  FILLER REDEFINES FMERRCF.
             03 FMERRCA    PICTURE X.
           02  FMERRCI  PIC X(79).
       01  FIFM84CO REDEFINES FIFM84CI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCNOCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMACTNCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCUSNCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMAMLITO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  FMAMAMTO PIC Z(14)9-.
           02  FILLER PICTURE X(3).
           02  FMJANAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMFEBAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMMARAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMAPRAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMMAYAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMJUNAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMJULAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMAUGAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMSEPAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMOCTAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMNOVAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMDECAMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMERRCO  PIC X(79).