       01  FIFMMNAI.
           02  FILLER PIC X(12).
           02  FMTRIDL    COMP  PIC  S9(4).
           02  FMTRIDF    PICTURE X.
           02  FILLER REDEFINES FMTRIDF.
             03 FMTRIDA    PICTURE X.
           02  FMTRIDI  PIC X(4).
           02  FMDATEL    COMP  PIC  S9(4).
           02  FMDATEF    PICTURE X.
           02  FILLER REDEFINES FMDATEF.
             03 FMDATEA    PICTURE X.
           02  FMDATEI  PIC X(8).
           02  FMTIMEL    COMP  PIC  S9(4).
           02  FMTIMEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEF.
             03 FMTIMEA    PICTURE X.
           02  FMTIMEI  PIC X(8).
           02  FMFMM9L    COMP  PIC  S9(4).
           02  FMFMM9F    PICTURE X.
           02  FILLER REDEFINES FMFMM9F.
             03 FMFMM9A    PICTURE X.
           02  FMFMM9I  PIC X(1).
           02  FMFM20L    COMP  PIC  S9(4).
           02  FMFM20F    PICTURE X.
           02  FILLER REDEFINES FMFM20F.
             03 FMFM20A    PICTURE X.
           02  FMFM20I  PIC X(1).
           02  FMFMFPL    COMP  PIC  S9(4).
           02  FMFMFPF    PICTURE X.
           02  FILLER REDEFINES FMFMFPF.
             03 FMFMFPA    PICTURE X.
           02  FMFMFPI  PIC X(1).
           02  FMFMM1L    COMP  PIC  S9(4).
           02  FMFMM1F    PICTURE X.
           02  FILLER REDEFINES FMFMM1F.
             03 FMFMM1A    PICTURE X.
           02  FMFMM1I  PIC X(1).
           02  FMFMM3L    COMP  PIC  S9(4).
           02  FMFMM3F    PICTURE X.
           02  FILLER REDEFINES FMFMM3F.
             03 FMFMM3A    PICTURE X.
           02  FMFMM3I  PIC X(1).
           02  FMFMTML    COMP  PIC  S9(4).
           02  FMFMTMF    PICTURE X.
           02  FILLER REDEFINES FMFMTMF.
             03 FMFMTMA    PICTURE X.
           02  FMFMTMI  PIC X(1).
           02  FMERRORL    COMP  PIC  S9(4).
           02  FMERRORF    PICTURE X.
           02  FILLER REDEFINES FMERRORF.
             03 FMERRORA    PICTURE X.
           02  FMERRORI  PIC X(79).
       01  FIFMMNAO REDEFINES FIFMMNAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMFMM9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFM20O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFMFPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFMM1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFMM3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMFMTMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMERRORO  PIC X(79).