       01  FIIMREAI.
           02  FILLER PIC X(12).
           02  FITRANL    COMP  PIC  S9(4).
           02  FITRANF    PICTURE X.
           02  FILLER REDEFINES FITRANF.
             03 FITRANA    PICTURE X.
           02  FITRANI  PIC X(4).
           02  FIDATEL    COMP  PIC  S9(4).
           02  FIDATEF    PICTURE X.
           02  FILLER REDEFINES FIDATEF.
             03 FIDATEA    PICTURE X.
           02  FIDATEI  PIC X(8).
           02  FITIMEL    COMP  PIC  S9(4).
           02  FITIMEF    PICTURE X.
           02  FILLER REDEFINES FITIMEF.
             03 FITIMEA    PICTURE X.
           02  FITIMEI  PIC X(8).
           02  FIPAGEL    COMP  PIC  S9(4).
           02  FIPAGEF    PICTURE X.
           02  FILLER REDEFINES FIPAGEF.
             03 FIPAGEA    PICTURE X.
           02  FIPAGEI  PIC X(4).
           02  FIPAGNL    COMP  PIC  S9(4).
           02  FIPAGNF    PICTURE X.
           02  FILLER REDEFINES FIPAGNF.
             03 FIPAGNA    PICTURE X.
           02  FIPAGNI  PIC X(3).
           02  FICTL2L    COMP  PIC  S9(4).
           02  FICTL2F    PICTURE X.
           02  FILLER REDEFINES FICTL2F.
             03 FICTL2A    PICTURE X.
           02  FICTL2I  PIC X(3).
           02  FICTL3L    COMP  PIC  S9(4).
           02  FICTL3F    PICTURE X.
           02  FILLER REDEFINES FICTL3F.
             03 FICTL3A    PICTURE X.
           02  FICTL3I  PIC X(3).
           02  FICTL4L    COMP  PIC  S9(4).
           02  FICTL4F    PICTURE X.
           02  FILLER REDEFINES FICTL4F.
             03 FICTL4A    PICTURE X.
           02  FICTL4I  PIC X(4).
           02  FIACCTL    COMP  PIC  S9(4).
           02  FIACCTF    PICTURE X.
           02  FILLER REDEFINES FIACCTF.
             03 FIACCTA    PICTURE X.
           02  FIACCTI  PIC X(10).
           02  FITITLEL    COMP  PIC  S9(4).
           02  FITITLEF    PICTURE X.
           02  FILLER REDEFINES FITITLEF.
             03 FITITLEA    PICTURE X.
           02  FITITLEI  PIC X(80).
           02  FIDELAL    COMP  PIC  S9(4).
           02  FIDELAF    PICTURE X.
           02  FILLER REDEFINES FIDELAF.
             03 FIDELAA    PICTURE X.
           02  FIDELAI  PIC X(1).
           02  FITRNAL    COMP  PIC  S9(4).
           02  FITRNAF    PICTURE X.
           02  FILLER REDEFINES FITRNAF.
             03 FITRNAA    PICTURE X.
           02  FITRNAI  PIC X(2).
           02  FIINPAL    COMP  PIC  S9(4).
           02  FIINPAF    PICTURE X.
           02  FILLER REDEFINES FIINPAF.
             03 FIINPAA    PICTURE X.
           02  FIINPAI  PIC X(73).
           02  FIDELBL    COMP  PIC  S9(4).
           02  FIDELBF    PICTURE X.
           02  FILLER REDEFINES FIDELBF.
             03 FIDELBA    PICTURE X.
           02  FIDELBI  PIC X(1).
           02  FITRNBL    COMP  PIC  S9(4).
           02  FITRNBF    PICTURE X.
           02  FILLER REDEFINES FITRNBF.
             03 FITRNBA    PICTURE X.
           02  FITRNBI  PIC X(2).
           02  FIINPBL    COMP  PIC  S9(4).
           02  FIINPBF    PICTURE X.
           02  FILLER REDEFINES FIINPBF.
             03 FIINPBA    PICTURE X.
           02  FIINPBI  PIC X(73).
           02  FIDELCL    COMP  PIC  S9(4).
           02  FIDELCF    PICTURE X.
           02  FILLER REDEFINES FIDELCF.
             03 FIDELCA    PICTURE X.
           02  FIDELCI  PIC X(1).
           02  FITRNCL    COMP  PIC  S9(4).
           02  FITRNCF    PICTURE X.
           02  FILLER REDEFINES FITRNCF.
             03 FITRNCA    PICTURE X.
           02  FITRNCI  PIC X(2).
           02  FIINPCL    COMP  PIC  S9(4).
           02  FIINPCF    PICTURE X.
           02  FILLER REDEFINES FIINPCF.
             03 FIINPCA    PICTURE X.
           02  FIINPCI  PIC X(73).
           02  FIDELDL    COMP  PIC  S9(4).
           02  FIDELDF    PICTURE X.
           02  FILLER REDEFINES FIDELDF.
             03 FIDELDA    PICTURE X.
           02  FIDELDI  PIC X(1).
           02  FITRNDL    COMP  PIC  S9(4).
           02  FITRNDF    PICTURE X.
           02  FILLER REDEFINES FITRNDF.
             03 FITRNDA    PICTURE X.
           02  FITRNDI  PIC X(2).
           02  FIINPDL    COMP  PIC  S9(4).
           02  FIINPDF    PICTURE X.
           02  FILLER REDEFINES FIINPDF.
             03 FIINPDA    PICTURE X.
           02  FIINPDI  PIC X(73).
           02  FIDELEL    COMP  PIC  S9(4).
           02  FIDELEF    PICTURE X.
           02  FILLER REDEFINES FIDELEF.
             03 FIDELEA    PICTURE X.
           02  FIDELEI  PIC X(1).
           02  FITRNEL    COMP  PIC  S9(4).
           02  FITRNEF    PICTURE X.
           02  FILLER REDEFINES FITRNEF.
             03 FITRNEA    PICTURE X.
           02  FITRNEI  PIC X(2).
           02  FIINPEL    COMP  PIC  S9(4).
           02  FIINPEF    PICTURE X.
           02  FILLER REDEFINES FIINPEF.
             03 FIINPEA    PICTURE X.
           02  FIINPEI  PIC X(73).
           02  FIDELFL    COMP  PIC  S9(4).
           02  FIDELFF    PICTURE X.
           02  FILLER REDEFINES FIDELFF.
             03 FIDELFA    PICTURE X.
           02  FIDELFI  PIC X(1).
           02  FITRNFL    COMP  PIC  S9(4).
           02  FITRNFF    PICTURE X.
           02  FILLER REDEFINES FITRNFF.
             03 FITRNFA    PICTURE X.
           02  FITRNFI  PIC X(2).
           02  FIINPFL    COMP  PIC  S9(4).
           02  FIINPFF    PICTURE X.
           02  FILLER REDEFINES FIINPFF.
             03 FIINPFA    PICTURE X.
           02  FIINPFI  PIC X(73).
           02  FIDELGL    COMP  PIC  S9(4).
           02  FIDELGF    PICTURE X.
           02  FILLER REDEFINES FIDELGF.
             03 FIDELGA    PICTURE X.
           02  FIDELGI  PIC X(1).
           02  FITRNGL    COMP  PIC  S9(4).
           02  FITRNGF    PICTURE X.
           02  FILLER REDEFINES FITRNGF.
             03 FITRNGA    PICTURE X.
           02  FITRNGI  PIC X(2).
           02  FIINPGL    COMP  PIC  S9(4).
           02  FIINPGF    PICTURE X.
           02  FILLER REDEFINES FIINPGF.
             03 FIINPGA    PICTURE X.
           02  FIINPGI  PIC X(73).
           02  FIDELHL    COMP  PIC  S9(4).
           02  FIDELHF    PICTURE X.
           02  FILLER REDEFINES FIDELHF.
             03 FIDELHA    PICTURE X.
           02  FIDELHI  PIC X(1).
           02  FITRNHL    COMP  PIC  S9(4).
           02  FITRNHF    PICTURE X.
           02  FILLER REDEFINES FITRNHF.
             03 FITRNHA    PICTURE X.
           02  FITRNHI  PIC X(2).
           02  FIINPHL    COMP  PIC  S9(4).
           02  FIINPHF    PICTURE X.
           02  FILLER REDEFINES FIINPHF.
             03 FIINPHA    PICTURE X.
           02  FIINPHI  PIC X(73).
           02  FIDELIL    COMP  PIC  S9(4).
           02  FIDELIF    PICTURE X.
           02  FILLER REDEFINES FIDELIF.
             03 FIDELIA    PICTURE X.
           02  FIDELII  PIC X(1).
           02  FITRNIL    COMP  PIC  S9(4).
           02  FITRNIF    PICTURE X.
           02  FILLER REDEFINES FITRNIF.
             03 FITRNIA    PICTURE X.
           02  FITRNII  PIC X(2).
           02  FIINPIL    COMP  PIC  S9(4).
           02  FIINPIF    PICTURE X.
           02  FILLER REDEFINES FIINPIF.
             03 FIINPIA    PICTURE X.
           02  FIINPII  PIC X(73).
           02  FIDELJL    COMP  PIC  S9(4).
           02  FIDELJF    PICTURE X.
           02  FILLER REDEFINES FIDELJF.
             03 FIDELJA    PICTURE X.
           02  FIDELJI  PIC X(1).
           02  FITRNJL    COMP  PIC  S9(4).
           02  FITRNJF    PICTURE X.
           02  FILLER REDEFINES FITRNJF.
             03 FITRNJA    PICTURE X.
           02  FITRNJI  PIC X(2).
           02  FIINPJL    COMP  PIC  S9(4).
           02  FIINPJF    PICTURE X.
           02  FILLER REDEFINES FIINPJF.
             03 FIINPJA    PICTURE X.
           02  FIINPJI  PIC X(73).
           02  FIDELKL    COMP  PIC  S9(4).
           02  FIDELKF    PICTURE X.
           02  FILLER REDEFINES FIDELKF.
             03 FIDELKA    PICTURE X.
           02  FIDELKI  PIC X(1).
           02  FITRNKL    COMP  PIC  S9(4).
           02  FITRNKF    PICTURE X.
           02  FILLER REDEFINES FITRNKF.
             03 FITRNKA    PICTURE X.
           02  FITRNKI  PIC X(2).
           02  FIINPKL    COMP  PIC  S9(4).
           02  FIINPKF    PICTURE X.
           02  FILLER REDEFINES FIINPKF.
             03 FIINPKA    PICTURE X.
           02  FIINPKI  PIC X(73).
           02  FIDELLL    COMP  PIC  S9(4).
           02  FIDELLF    PICTURE X.
           02  FILLER REDEFINES FIDELLF.
             03 FIDELLA    PICTURE X.
           02  FIDELLI  PIC X(1).
           02  FITRNLL    COMP  PIC  S9(4).
           02  FITRNLF    PICTURE X.
           02  FILLER REDEFINES FITRNLF.
             03 FITRNLA    PICTURE X.
           02  FITRNLI  PIC X(2).
           02  FIINPLL    COMP  PIC  S9(4).
           02  FIINPLF    PICTURE X.
           02  FILLER REDEFINES FIINPLF.
             03 FIINPLA    PICTURE X.
           02  FIINPLI  PIC X(73).
           02  FIDELML    COMP  PIC  S9(4).
           02  FIDELMF    PICTURE X.
           02  FILLER REDEFINES FIDELMF.
             03 FIDELMA    PICTURE X.
           02  FIDELMI  PIC X(1).
           02  FITRNML    COMP  PIC  S9(4).
           02  FITRNMF    PICTURE X.
           02  FILLER REDEFINES FITRNMF.
             03 FITRNMA    PICTURE X.
           02  FITRNMI  PIC X(2).
           02  FIINPML    COMP  PIC  S9(4).
           02  FIINPMF    PICTURE X.
           02  FILLER REDEFINES FIINPMF.
             03 FIINPMA    PICTURE X.
           02  FIINPMI  PIC X(73).
           02  FIDELNL    COMP  PIC  S9(4).
           02  FIDELNF    PICTURE X.
           02  FILLER REDEFINES FIDELNF.
             03 FIDELNA    PICTURE X.
           02  FIDELNI  PIC X(1).
           02  FITRNNL    COMP  PIC  S9(4).
           02  FITRNNF    PICTURE X.
           02  FILLER REDEFINES FITRNNF.
             03 FITRNNA    PICTURE X.
           02  FITRNNI  PIC X(2).
           02  FIINPNL    COMP  PIC  S9(4).
           02  FIINPNF    PICTURE X.
           02  FILLER REDEFINES FIINPNF.
             03 FIINPNA    PICTURE X.
           02  FIINPNI  PIC X(73).
           02  FIDELOL    COMP  PIC  S9(4).
           02  FIDELOF    PICTURE X.
           02  FILLER REDEFINES FIDELOF.
             03 FIDELOA    PICTURE X.
           02  FIDELOI  PIC X(1).
           02  FITRNOL    COMP  PIC  S9(4).
           02  FITRNOF    PICTURE X.
           02  FILLER REDEFINES FITRNOF.
             03 FITRNOA    PICTURE X.
           02  FITRNOI  PIC X(2).
           02  FIINPOL    COMP  PIC  S9(4).
           02  FIINPOF    PICTURE X.
           02  FILLER REDEFINES FIINPOF.
             03 FIINPOA    PICTURE X.
           02  FIINPOI  PIC X(73).
           02  FIDELPL    COMP  PIC  S9(4).
           02  FIDELPF    PICTURE X.
           02  FILLER REDEFINES FIDELPF.
             03 FIDELPA    PICTURE X.
           02  FIDELPI  PIC X(1).
           02  FITRNPL    COMP  PIC  S9(4).
           02  FITRNPF    PICTURE X.
           02  FILLER REDEFINES FITRNPF.
             03 FITRNPA    PICTURE X.
           02  FITRNPI  PIC X(2).
           02  FIINPPL    COMP  PIC  S9(4).
           02  FIINPPF    PICTURE X.
           02  FILLER REDEFINES FIINPPF.
             03 FIINPPA    PICTURE X.
           02  FIINPPI  PIC X(73).
           02  FIDELQL    COMP  PIC  S9(4).
           02  FIDELQF    PICTURE X.
           02  FILLER REDEFINES FIDELQF.
             03 FIDELQA    PICTURE X.
           02  FIDELQI  PIC X(1).
           02  FITRNQL    COMP  PIC  S9(4).
           02  FITRNQF    PICTURE X.
           02  FILLER REDEFINES FITRNQF.
             03 FITRNQA    PICTURE X.
           02  FITRNQI  PIC X(2).
           02  FIINPQL    COMP  PIC  S9(4).
           02  FIINPQF    PICTURE X.
           02  FILLER REDEFINES FIINPQF.
             03 FIINPQA    PICTURE X.
           02  FIINPQI  PIC X(73).
           02  FIPF1L    COMP  PIC  S9(4).
           02  FIPF1F    PICTURE X.
           02  FILLER REDEFINES FIPF1F.
             03 FIPF1A    PICTURE X.
           02  FIPF1I  PIC X(45).
           02  FIERRL    COMP  PIC  S9(4).
           02  FIERRF    PICTURE X.
           02  FILLER REDEFINES FIERRF.
             03 FIERRA    PICTURE X.
           02  FIERRI  PIC X(79).
       01  FIIMREAO REDEFINES FIIMREAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FITRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FIDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FITIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FIPAGEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FIPAGNO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FICTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FICTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FICTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FIACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FITITLEO  PIC X(80).
           02  FILLER PICTURE X(3).
           02  FIDELAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNAO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPAO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNBO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPBO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNCO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPCO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPDO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPEO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNFO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPFO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNGO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPGO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELHO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNHO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPHO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNIO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPIO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELJO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNJO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPJO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELKO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNKO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPKO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNLO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPLO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNMO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPMO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNNO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPNO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPOO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNPO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPPO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIDELQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITRNQO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FIINPQO  PIC X(73).
           02  FILLER PICTURE X(3).
           02  FIPF1O  PIC X(45).
           02  FILLER PICTURE X(3).
           02  FIERRO  PIC X(79).