       01  FIIMI1AI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTITLEL    COMP  PIC  S9(4).
           02  IMTITLEF    PICTURE X.
           02  FILLER REDEFINES IMTITLEF.
             03 IMTITLEA    PICTURE X.
           02  IMTITLEI  PIC X(30).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMCNTL2L    COMP  PIC  S9(4).
           02  IMCNTL2F    PICTURE X.
           02  FILLER REDEFINES IMCNTL2F.
             03 IMCNTL2A    PICTURE X.
           02  IMCNTL2I  PIC X(3).
           02  IMCNTL3L    COMP  PIC  S9(4).
           02  IMCNTL3F    PICTURE X.
           02  FILLER REDEFINES IMCNTL3F.
             03 IMCNTL3A    PICTURE X.
           02  IMCNTL3I  PIC X(3).
           02  IMCNTL4L    COMP  PIC  S9(4).
           02  IMCNTL4F    PICTURE X.
           02  FILLER REDEFINES IMCNTL4F.
             03 IMCNTL4A    PICTURE X.
           02  IMCNTL4I  PIC X(4).
           02  IMACCTL    COMP  PIC  S9(4).
           02  IMACCTF    PICTURE X.
           02  FILLER REDEFINES IMACCTF.
             03 IMACCTA    PICTURE X.
           02  IMACCTI  PIC X(10).
           02  IMBANKL    COMP  PIC  S9(4).
           02  IMBANKF    PICTURE X.
           02  FILLER REDEFINES IMBANKF.
             03 IMBANKA    PICTURE X.
           02  IMBANKI  PIC X(2).
           02  IMSELDSL    COMP  PIC  S9(4).
           02  IMSELDSF    PICTURE X.
           02  FILLER REDEFINES IMSELDSF.
             03 IMSELDSA    PICTURE X.
           02  IMSELDSI  PIC X(17).
           02  IMDOLDSL    COMP  PIC  S9(4).
           02  IMDOLDSF    PICTURE X.
           02  FILLER REDEFINES IMDOLDSF.
             03 IMDOLDSA    PICTURE X.
           02  IMDOLDSI  PIC X(6).
           02  IMDOLLWL    COMP  PIC  S9(4).
           02  IMDOLLWF    PICTURE X.
           02  FILLER REDEFINES IMDOLLWF.
             03 IMDOLLWA    PICTURE X.
           02  IMDOLLWI  PIC X(16).
           02  IMDOLTOL    COMP  PIC  S9(4).
           02  IMDOLTOF    PICTURE X.
           02  FILLER REDEFINES IMDOLTOF.
             03 IMDOLTOA    PICTURE X.
           02  IMDOLTOI  PIC X(2).
           02  IMDOLHIL    COMP  PIC  S9(4).
           02  IMDOLHIF    PICTURE X.
           02  FILLER REDEFINES IMDOLHIF.
             03 IMDOLHIA    PICTURE X.
           02  IMDOLHII  PIC X(16).
           02  IMSERDSL    COMP  PIC  S9(4).
           02  IMSERDSF    PICTURE X.
           02  FILLER REDEFINES IMSERDSF.
             03 IMSERDSA    PICTURE X.
           02  IMSERDSI  PIC X(6).
           02  IMSERLWL    COMP  PIC  S9(4).
           02  IMSERLWF    PICTURE X.
           02  FILLER REDEFINES IMSERLWF.
             03 IMSERLWA    PICTURE X.
           02  IMSERLWI  PIC X(10).
           02  IMSERTOL    COMP  PIC  S9(4).
           02  IMSERTOF    PICTURE X.
           02  FILLER REDEFINES IMSERTOF.
             03 IMSERTOA    PICTURE X.
           02  IMSERTOI  PIC X(2).
           02  IMSERHIL    COMP  PIC  S9(4).
           02  IMSERHIF    PICTURE X.
           02  FILLER REDEFINES IMSERHIF.
             03 IMSERHIA    PICTURE X.
           02  IMSERHII  PIC X(10).
           02  IMDATDSL    COMP  PIC  S9(4).
           02  IMDATDSF    PICTURE X.
           02  FILLER REDEFINES IMDATDSF.
             03 IMDATDSA    PICTURE X.
           02  IMDATDSI  PIC X(10).
           02  IMDATLWL    COMP  PIC  S9(4).
           02  IMDATLWF    PICTURE X.
           02  FILLER REDEFINES IMDATLWF.
             03 IMDATLWA    PICTURE X.
           02  IMDATLWI  PIC X(4).
           02  IMDATTOL    COMP  PIC  S9(4).
           02  IMDATTOF    PICTURE X.
           02  FILLER REDEFINES IMDATTOF.
             03 IMDATTOA    PICTURE X.
           02  IMDATTOI  PIC X(2).
           02  IMDATHIL    COMP  PIC  S9(4).
           02  IMDATHIF    PICTURE X.
           02  FILLER REDEFINES IMDATHIF.
             03 IMDATHIA    PICTURE X.
           02  IMDATHII  PIC X(4).
           02  IMTRNDSL    COMP  PIC  S9(4).
           02  IMTRNDSF    PICTURE X.
           02  FILLER REDEFINES IMTRNDSF.
             03 IMTRNDSA    PICTURE X.
           02  IMTRNDSI  PIC X(10).
           02  IMTRNLWL    COMP  PIC  S9(4).
           02  IMTRNLWF    PICTURE X.
           02  FILLER REDEFINES IMTRNLWF.
             03 IMTRNLWA    PICTURE X.
           02  IMTRNLWI  PIC X(4).
           02  IMTRNTOL    COMP  PIC  S9(4).
           02  IMTRNTOF    PICTURE X.
           02  FILLER REDEFINES IMTRNTOF.
             03 IMTRNTOA    PICTURE X.
           02  IMTRNTOI  PIC X(2).
           02  IMTRNHIL    COMP  PIC  S9(4).
           02  IMTRNHIF    PICTURE X.
           02  FILLER REDEFINES IMTRNHIF.
             03 IMTRNHIA    PICTURE X.
           02  IMTRNHII  PIC X(4).
           02  IMBTHDSL    COMP  PIC  S9(4).
           02  IMBTHDSF    PICTURE X.
           02  FILLER REDEFINES IMBTHDSF.
             03 IMBTHDSA    PICTURE X.
           02  IMBTHDSI  PIC X(5).
           02  IMBTHLWL    COMP  PIC  S9(4).
           02  IMBTHLWF    PICTURE X.
           02  FILLER REDEFINES IMBTHLWF.
             03 IMBTHLWA    PICTURE X.
           02  IMBTHLWI  PIC X(5).
           02  IMBTHTOL    COMP  PIC  S9(4).
           02  IMBTHTOF    PICTURE X.
           02  FILLER REDEFINES IMBTHTOF.
             03 IMBTHTOA    PICTURE X.
           02  IMBTHTOI  PIC X(2).
           02  IMBTHHIL    COMP  PIC  S9(4).
           02  IMBTHHIF    PICTURE X.
           02  FILLER REDEFINES IMBTHHIF.
             03 IMBTHHIA    PICTURE X.
           02  IMBTHHII  PIC X(5).
           02  IMSEQDSL    COMP  PIC  S9(4).
           02  IMSEQDSF    PICTURE X.
           02  FILLER REDEFINES IMSEQDSF.
             03 IMSEQDSA    PICTURE X.
           02  IMSEQDSI  PIC X(3).
           02  IMSEQLWL    COMP  PIC  S9(4).
           02  IMSEQLWF    PICTURE X.
           02  FILLER REDEFINES IMSEQLWF.
             03 IMSEQLWA    PICTURE X.
           02  IMSEQLWI  PIC X(5).
           02  IMSEQTOL    COMP  PIC  S9(4).
           02  IMSEQTOF    PICTURE X.
           02  FILLER REDEFINES IMSEQTOF.
             03 IMSEQTOA    PICTURE X.
           02  IMSEQTOI  PIC X(2).
           02  IMSEQHIL    COMP  PIC  S9(4).
           02  IMSEQHIF    PICTURE X.
           02  FILLER REDEFINES IMSEQHIF.
             03 IMSEQHIA    PICTURE X.
           02  IMSEQHII  PIC X(5).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIMI1AO REDEFINES FIIMI1AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTITLEO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMCNTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMBANKO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSELDSO  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IMDOLDSO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMDOLLWO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMDOLTOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMDOLHIO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMSERDSO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMSERLWO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMSERTOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSERHIO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDATDSO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDATLWO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATTOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMDATHIO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMTRNDSO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMTRNLWO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMTRNTOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMTRNHIO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMBTHDSO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMBTHLWO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMBTHTOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMBTHHIO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMSEQDSO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMSEQLWO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMSEQTOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSEQHIO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).