       01  FIIMIIAI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IML    COMP  PIC  S9(4).
           02  IMF    PICTURE X.
           02  FILLER REDEFINES IMF.
             03 IMA    PICTURE X.
           02  IMI  PIC X(21).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMPAGEL    COMP  PIC  S9(4).
           02  IMPAGEF    PICTURE X.
           02  FILLER REDEFINES IMPAGEF.
             03 IMPAGEA    PICTURE X.
           02  IMPAGEI  PIC X(2).
           02  IMNAMEL    COMP  PIC  S9(4).
           02  IMNAMEF    PICTURE X.
           02  FILLER REDEFINES IMNAMEF.
             03 IMNAMEA    PICTURE X.
           02  IMNAMEI  PIC X(40).
           02  IMACCTL    COMP  PIC  S9(4).
           02  IMACCTF    PICTURE X.
           02  FILLER REDEFINES IMACCTF.
             03 IMACCTA    PICTURE X.
           02  IMACCTI  PIC X(23).
           02  IMADDRL    COMP  PIC  S9(4).
           02  IMADDRF    PICTURE X.
           02  FILLER REDEFINES IMADDRF.
             03 IMADDRA    PICTURE X.
           02  IMADDRI  PIC X(40).
           02  IMDTLSTL    COMP  PIC  S9(4).
           02  IMDTLSTF    PICTURE X.
           02  FILLER REDEFINES IMDTLSTF.
             03 IMDTLSTA    PICTURE X.
           02  IMDTLSTI  PIC X(8).
           02  IMADDR2L    COMP  PIC  S9(4).
           02  IMADDR2F    PICTURE X.
           02  FILLER REDEFINES IMADDR2F.
             03 IMADDR2A    PICTURE X.
           02  IMADDR2I  PIC X(40).
           02  IMDTHISL    COMP  PIC  S9(4).
           02  IMDTHISF    PICTURE X.
           02  FILLER REDEFINES IMDTHISF.
             03 IMDTHISA    PICTURE X.
           02  IMDTHISI  PIC X(8).
           02  IMTITLEL    COMP  PIC  S9(4).
           02  IMTITLEF    PICTURE X.
           02  FILLER REDEFINES IMTITLEF.
             03 IMTITLEA    PICTURE X.
           02  IMTITLEI  PIC X(26).
           02  IMLSTBLL    COMP  PIC  S9(4).
           02  IMLSTBLF    PICTURE X.
           02  FILLER REDEFINES IMLSTBLF.
             03 IMLSTBLA    PICTURE X.
           02  IMLSTBLI  PIC X(17).
           02  IMNODBL    COMP  PIC  S9(4).
           02  IMNODBF    PICTURE X.
           02  FILLER REDEFINES IMNODBF.
             03 IMNODBA    PICTURE X.
           02  IMNODBI  PIC X(3).
           02  IMAMTDBL    COMP  PIC  S9(4).
           02  IMAMTDBF    PICTURE X.
           02  FILLER REDEFINES IMAMTDBF.
             03 IMAMTDBA    PICTURE X.
           02  IMAMTDBI  PIC X(16).
           02  IMNOCRL    COMP  PIC  S9(4).
           02  IMNOCRF    PICTURE X.
           02  FILLER REDEFINES IMNOCRF.
             03 IMNOCRA    PICTURE X.
           02  IMNOCRI  PIC X(3).
           02  IMAMTCRL    COMP  PIC  S9(4).
           02  IMAMTCRF    PICTURE X.
           02  FILLER REDEFINES IMAMTCRF.
             03 IMAMTCRA    PICTURE X.
           02  IMAMTCRI  PIC X(16).
           02  IMTHSBLL    COMP  PIC  S9(4).
           02  IMTHSBLF    PICTURE X.
           02  FILLER REDEFINES IMTHSBLF.
             03 IMTHSBLA    PICTURE X.
           02  IMTHSBLI  PIC X(17).
           02  IMLINED OCCURS 12 TIMES.
             03  IMLINEL    COMP  PIC  S9(4).
             03  IMLINEF    PICTURE X.
             03  IMLINEI  PIC X(79).
           02  IMPAGEFL    COMP  PIC  S9(4).
           02  IMPAGEFF    PICTURE X.
           02  FILLER REDEFINES IMPAGEFF.
             03 IMPAGEFA    PICTURE X.
           02  IMPAGEFI  PIC X(19).
           02  IMPAGEBL    COMP  PIC  S9(4).
           02  IMPAGEBF    PICTURE X.
           02  FILLER REDEFINES IMPAGEBF.
             03 IMPAGEBA    PICTURE X.
           02  IMPAGEBI  PIC X(19).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIMIIAO REDEFINES FIIMIIAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMO  PIC X(21).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPAGEO PIC Z9.
           02  FILLER PICTURE X(3).
           02  IMNAMEO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMACCTO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  IMADDRO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMDTLSTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMADDR2O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMDTHISO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTITLEO  PIC X(26).
           02  FILLER PICTURE X(3).
           02  IMLSTBLO PIC Z(12)9.99-.
           02  FILLER PICTURE X(3).
           02  IMNODBO PIC ZZ9.
           02  FILLER PICTURE X(3).
           02  IMAMTDBO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  IMNOCRO PIC ZZ9.
           02  FILLER PICTURE X(3).
           02  IMAMTCRO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  IMTHSBLO PIC Z(12)9.99-.
           02  DFHMS1 OCCURS 12 TIMES.
             03  FILLER PICTURE X(2).
             03  IMLINEA    PICTURE X.
             03  IMLINEO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMPAGEFO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMPAGEBO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).