       01  FIIMIEAO.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(2).
           02  IMTRANA    PICTURE X.
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMDATEA    PICTURE X.
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTIMEA    PICTURE X.
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMKEYA    PICTURE X.
           02  IMKEYO  PIC X(23).
           02  FILLER PICTURE X(2).
           02  IMACCTA    PICTURE X.
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(2).
           02  IMNAMEA    PICTURE X.
           02  IMNAMEO  PIC X(13).
           02  FILLER PICTURE X(2).
           02  IMNAPTRA    PICTURE X.
           02  IMNAPTRO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMUSERA    PICTURE X.
           02  IMUSERO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMTXCDA    PICTURE X.
           02  IMTXCDO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMTXPREA    PICTURE X.
           02  IMTXPREO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMTXNUMA    PICTURE X.
           02  IMTXNUMO  PIC X(9).
           02  FILLER PICTURE X(2).
           02  IMTXSUFA    PICTURE X.
           02  IMTXSUFO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMDATE1A    PICTURE X.
           02  IMDATE1O  PIC X(6).
           02  FILLER PICTURE X(2).
           02  IMIODA    PICTURE X.
           02  IMIODO  PIC Z(13).99-.
           02  FILLER PICTURE X(2).
           02  IMSAVA    PICTURE X.
           02  IMSAVO  PIC Z(13).99-.
           02  FILLER PICTURE X(2).
           02  IMINTLA    PICTURE X.
           02  IMINTLO  PIC Z(13).99-.
           02  FILLER PICTURE X(2).
           02  IMTAXIA    PICTURE X.
           02  IMTAXIO  PIC Z(13).99-.
           02  FILLER PICTURE X(2).
           02  IMTAXSA    PICTURE X.
           02  IMTAXSO  PIC Z(13).99-.
           02  FILLER PICTURE X(2).
           02  IMERRORA    PICTURE X.
           02  IMERRORO  PIC X(79).