       01  FIIMSCHI.
           02  FILLER PIC X(12).
           02  SCTRANL    COMP  PIC  S9(4).
           02  SCTRANF    PICTURE X.
           02  FILLER REDEFINES SCTRANF.
             03 SCTRANA    PICTURE X.
           02  SCTRANI  PIC X(4).
           02  SCDATEL    COMP  PIC  S9(4).
           02  SCDATEF    PICTURE X.
           02  FILLER REDEFINES SCDATEF.
             03 SCDATEA    PICTURE X.
           02  SCDATEI  PIC X(8).
           02  SCTIMEL    COMP  PIC  S9(4).
           02  SCTIMEF    PICTURE X.
           02  FILLER REDEFINES SCTIMEF.
             03 SCTIMEA    PICTURE X.
           02  SCTIMEI  PIC X(8).
           02  SCCAT01L    COMP  PIC  S9(4).
           02  SCCAT01F    PICTURE X.
           02  FILLER REDEFINES SCCAT01F.
             03 SCCAT01A    PICTURE X.
           02  SCCAT01I  PIC X(4).
           02  SCTYP01L    COMP  PIC  S9(4).
           02  SCTYP01F    PICTURE X.
           02  FILLER REDEFINES SCTYP01F.
             03 SCTYP01A    PICTURE X.
           02  SCTYP01I  PIC X(4).
           02  SCGRP01L    COMP  PIC  S9(4).
           02  SCGRP01F    PICTURE X.
           02  FILLER REDEFINES SCGRP01F.
             03 SCGRP01A    PICTURE X.
           02  SCGRP01I  PIC X(1).
           02  SCCLC01L    COMP  PIC  S9(4).
           02  SCCLC01F    PICTURE X.
           02  FILLER REDEFINES SCCLC01F.
             03 SCCLC01A    PICTURE X.
           02  SCCLC01I  PIC X(1).
           02  SCCAT02L    COMP  PIC  S9(4).
           02  SCCAT02F    PICTURE X.
           02  FILLER REDEFINES SCCAT02F.
             03 SCCAT02A    PICTURE X.
           02  SCCAT02I  PIC X(4).
           02  SCTYP02L    COMP  PIC  S9(4).
           02  SCTYP02F    PICTURE X.
           02  FILLER REDEFINES SCTYP02F.
             03 SCTYP02A    PICTURE X.
           02  SCTYP02I  PIC X(4).
           02  SCGRP02L    COMP  PIC  S9(4).
           02  SCGRP02F    PICTURE X.
           02  FILLER REDEFINES SCGRP02F.
             03 SCGRP02A    PICTURE X.
           02  SCGRP02I  PIC X(1).
           02  SCCLC02L    COMP  PIC  S9(4).
           02  SCCLC02F    PICTURE X.
           02  FILLER REDEFINES SCCLC02F.
             03 SCCLC02A    PICTURE X.
           02  SCCLC02I  PIC X(1).
           02  SCCAT03L    COMP  PIC  S9(4).
           02  SCCAT03F    PICTURE X.
           02  FILLER REDEFINES SCCAT03F.
             03 SCCAT03A    PICTURE X.
           02  SCCAT03I  PIC X(4).
           02  SCTYP03L    COMP  PIC  S9(4).
           02  SCTYP03F    PICTURE X.
           02  FILLER REDEFINES SCTYP03F.
             03 SCTYP03A    PICTURE X.
           02  SCTYP03I  PIC X(4).
           02  SCGRP03L    COMP  PIC  S9(4).
           02  SCGRP03F    PICTURE X.
           02  FILLER REDEFINES SCGRP03F.
             03 SCGRP03A    PICTURE X.
           02  SCGRP03I  PIC X(1).
           02  SCCLC03L    COMP  PIC  S9(4).
           02  SCCLC03F    PICTURE X.
           02  FILLER REDEFINES SCCLC03F.
             03 SCCLC03A    PICTURE X.
           02  SCCLC03I  PIC X(1).
           02  SCCAT04L    COMP  PIC  S9(4).
           02  SCCAT04F    PICTURE X.
           02  FILLER REDEFINES SCCAT04F.
             03 SCCAT04A    PICTURE X.
           02  SCCAT04I  PIC X(4).
           02  SCTYP04L    COMP  PIC  S9(4).
           02  SCTYP04F    PICTURE X.
           02  FILLER REDEFINES SCTYP04F.
             03 SCTYP04A    PICTURE X.
           02  SCTYP04I  PIC X(4).
           02  SCGRP04L    COMP  PIC  S9(4).
           02  SCGRP04F    PICTURE X.
           02  FILLER REDEFINES SCGRP04F.
             03 SCGRP04A    PICTURE X.
           02  SCGRP04I  PIC X(1).
           02  SCCLC04L    COMP  PIC  S9(4).
           02  SCCLC04F    PICTURE X.
           02  FILLER REDEFINES SCCLC04F.
             03 SCCLC04A    PICTURE X.
           02  SCCLC04I  PIC X(1).
           02  SCCAT05L    COMP  PIC  S9(4).
           02  SCCAT05F    PICTURE X.
           02  FILLER REDEFINES SCCAT05F.
             03 SCCAT05A    PICTURE X.
           02  SCCAT05I  PIC X(4).
           02  SCTYP05L    COMP  PIC  S9(4).
           02  SCTYP05F    PICTURE X.
           02  FILLER REDEFINES SCTYP05F.
             03 SCTYP05A    PICTURE X.
           02  SCTYP05I  PIC X(4).
           02  SCGRP05L    COMP  PIC  S9(4).
           02  SCGRP05F    PICTURE X.
           02  FILLER REDEFINES SCGRP05F.
             03 SCGRP05A    PICTURE X.
           02  SCGRP05I  PIC X(1).
           02  SCCLC05L    COMP  PIC  S9(4).
           02  SCCLC05F    PICTURE X.
           02  FILLER REDEFINES SCCLC05F.
             03 SCCLC05A    PICTURE X.
           02  SCCLC05I  PIC X(1).
           02  SCCAT06L    COMP  PIC  S9(4).
           02  SCCAT06F    PICTURE X.
           02  FILLER REDEFINES SCCAT06F.
             03 SCCAT06A    PICTURE X.
           02  SCCAT06I  PIC X(4).
           02  SCTYP06L    COMP  PIC  S9(4).
           02  SCTYP06F    PICTURE X.
           02  FILLER REDEFINES SCTYP06F.
             03 SCTYP06A    PICTURE X.
           02  SCTYP06I  PIC X(4).
           02  SCGRP06L    COMP  PIC  S9(4).
           02  SCGRP06F    PICTURE X.
           02  FILLER REDEFINES SCGRP06F.
             03 SCGRP06A    PICTURE X.
           02  SCGRP06I  PIC X(1).
           02  SCCLC06L    COMP  PIC  S9(4).
           02  SCCLC06F    PICTURE X.
           02  FILLER REDEFINES SCCLC06F.
             03 SCCLC06A    PICTURE X.
           02  SCCLC06I  PIC X(1).
           02  SCCAT07L    COMP  PIC  S9(4).
           02  SCCAT07F    PICTURE X.
           02  FILLER REDEFINES SCCAT07F.
             03 SCCAT07A    PICTURE X.
           02  SCCAT07I  PIC X(4).
           02  SCTYP07L    COMP  PIC  S9(4).
           02  SCTYP07F    PICTURE X.
           02  FILLER REDEFINES SCTYP07F.
             03 SCTYP07A    PICTURE X.
           02  SCTYP07I  PIC X(4).
           02  SCGRP07L    COMP  PIC  S9(4).
           02  SCGRP07F    PICTURE X.
           02  FILLER REDEFINES SCGRP07F.
             03 SCGRP07A    PICTURE X.
           02  SCGRP07I  PIC X(1).
           02  SCCLC07L    COMP  PIC  S9(4).
           02  SCCLC07F    PICTURE X.
           02  FILLER REDEFINES SCCLC07F.
             03 SCCLC07A    PICTURE X.
           02  SCCLC07I  PIC X(1).
           02  SCCAT08L    COMP  PIC  S9(4).
           02  SCCAT08F    PICTURE X.
           02  FILLER REDEFINES SCCAT08F.
             03 SCCAT08A    PICTURE X.
           02  SCCAT08I  PIC X(4).
           02  SCTYP08L    COMP  PIC  S9(4).
           02  SCTYP08F    PICTURE X.
           02  FILLER REDEFINES SCTYP08F.
             03 SCTYP08A    PICTURE X.
           02  SCTYP08I  PIC X(4).
           02  SCGRP08L    COMP  PIC  S9(4).
           02  SCGRP08F    PICTURE X.
           02  FILLER REDEFINES SCGRP08F.
             03 SCGRP08A    PICTURE X.
           02  SCGRP08I  PIC X(1).
           02  SCCLC08L    COMP  PIC  S9(4).
           02  SCCLC08F    PICTURE X.
           02  FILLER REDEFINES SCCLC08F.
             03 SCCLC08A    PICTURE X.
           02  SCCLC08I  PIC X(1).
           02  SCCAT09L    COMP  PIC  S9(4).
           02  SCCAT09F    PICTURE X.
           02  FILLER REDEFINES SCCAT09F.
             03 SCCAT09A    PICTURE X.
           02  SCCAT09I  PIC X(4).
           02  SCTYP09L    COMP  PIC  S9(4).
           02  SCTYP09F    PICTURE X.
           02  FILLER REDEFINES SCTYP09F.
             03 SCTYP09A    PICTURE X.
           02  SCTYP09I  PIC X(4).
           02  SCGRP09L    COMP  PIC  S9(4).
           02  SCGRP09F    PICTURE X.
           02  FILLER REDEFINES SCGRP09F.
             03 SCGRP09A    PICTURE X.
           02  SCGRP09I  PIC X(1).
           02  SCCLC09L    COMP  PIC  S9(4).
           02  SCCLC09F    PICTURE X.
           02  FILLER REDEFINES SCCLC09F.
             03 SCCLC09A    PICTURE X.
           02  SCCLC09I  PIC X(1).
           02  SCCAT10L    COMP  PIC  S9(4).
           02  SCCAT10F    PICTURE X.
           02  FILLER REDEFINES SCCAT10F.
             03 SCCAT10A    PICTURE X.
           02  SCCAT10I  PIC X(4).
           02  SCTYP10L    COMP  PIC  S9(4).
           02  SCTYP10F    PICTURE X.
           02  FILLER REDEFINES SCTYP10F.
             03 SCTYP10A    PICTURE X.
           02  SCTYP10I  PIC X(4).
           02  SCGRP10L    COMP  PIC  S9(4).
           02  SCGRP10F    PICTURE X.
           02  FILLER REDEFINES SCGRP10F.
             03 SCGRP10A    PICTURE X.
           02  SCGRP10I  PIC X(1).
           02  SCCLC10L    COMP  PIC  S9(4).
           02  SCCLC10F    PICTURE X.
           02  FILLER REDEFINES SCCLC10F.
             03 SCCLC10A    PICTURE X.
           02  SCCLC10I  PIC X(1).
           02  SCCAT11L    COMP  PIC  S9(4).
           02  SCCAT11F    PICTURE X.
           02  FILLER REDEFINES SCCAT11F.
             03 SCCAT11A    PICTURE X.
           02  SCCAT11I  PIC X(4).
           02  SCTYP11L    COMP  PIC  S9(4).
           02  SCTYP11F    PICTURE X.
           02  FILLER REDEFINES SCTYP11F.
             03 SCTYP11A    PICTURE X.
           02  SCTYP11I  PIC X(4).
           02  SCGRP11L    COMP  PIC  S9(4).
           02  SCGRP11F    PICTURE X.
           02  FILLER REDEFINES SCGRP11F.
             03 SCGRP11A    PICTURE X.
           02  SCGRP11I  PIC X(1).
           02  SCCLC11L    COMP  PIC  S9(4).
           02  SCCLC11F    PICTURE X.
           02  FILLER REDEFINES SCCLC11F.
             03 SCCLC11A    PICTURE X.
           02  SCCLC11I  PIC X(1).
           02  SCCAT12L    COMP  PIC  S9(4).
           02  SCCAT12F    PICTURE X.
           02  FILLER REDEFINES SCCAT12F.
             03 SCCAT12A    PICTURE X.
           02  SCCAT12I  PIC X(4).
           02  SCTYP12L    COMP  PIC  S9(4).
           02  SCTYP12F    PICTURE X.
           02  FILLER REDEFINES SCTYP12F.
             03 SCTYP12A    PICTURE X.
           02  SCTYP12I  PIC X(4).
           02  SCGRP12L    COMP  PIC  S9(4).
           02  SCGRP12F    PICTURE X.
           02  FILLER REDEFINES SCGRP12F.
             03 SCGRP12A    PICTURE X.
           02  SCGRP12I  PIC X(1).
           02  SCCLC12L    COMP  PIC  S9(4).
           02  SCCLC12F    PICTURE X.
           02  FILLER REDEFINES SCCLC12F.
             03 SCCLC12A    PICTURE X.
           02  SCCLC12I  PIC X(1).
           02  SCCAT13L    COMP  PIC  S9(4).
           02  SCCAT13F    PICTURE X.
           02  FILLER REDEFINES SCCAT13F.
             03 SCCAT13A    PICTURE X.
           02  SCCAT13I  PIC X(4).
           02  SCTYP13L    COMP  PIC  S9(4).
           02  SCTYP13F    PICTURE X.
           02  FILLER REDEFINES SCTYP13F.
             03 SCTYP13A    PICTURE X.
           02  SCTYP13I  PIC X(4).
           02  SCGRP13L    COMP  PIC  S9(4).
           02  SCGRP13F    PICTURE X.
           02  FILLER REDEFINES SCGRP13F.
             03 SCGRP13A    PICTURE X.
           02  SCGRP13I  PIC X(1).
           02  SCCLC13L    COMP  PIC  S9(4).
           02  SCCLC13F    PICTURE X.
           02  FILLER REDEFINES SCCLC13F.
             03 SCCLC13A    PICTURE X.
           02  SCCLC13I  PIC X(1).
           02  SCCAT14L    COMP  PIC  S9(4).
           02  SCCAT14F    PICTURE X.
           02  FILLER REDEFINES SCCAT14F.
             03 SCCAT14A    PICTURE X.
           02  SCCAT14I  PIC X(4).
           02  SCTYP14L    COMP  PIC  S9(4).
           02  SCTYP14F    PICTURE X.
           02  FILLER REDEFINES SCTYP14F.
             03 SCTYP14A    PICTURE X.
           02  SCTYP14I  PIC X(4).
           02  SCGRP14L    COMP  PIC  S9(4).
           02  SCGRP14F    PICTURE X.
           02  FILLER REDEFINES SCGRP14F.
             03 SCGRP14A    PICTURE X.
           02  SCGRP14I  PIC X(1).
           02  SCCLC14L    COMP  PIC  S9(4).
           02  SCCLC14F    PICTURE X.
           02  FILLER REDEFINES SCCLC14F.
             03 SCCLC14A    PICTURE X.
           02  SCCLC14I  PIC X(1).
           02  SCCAT15L    COMP  PIC  S9(4).
           02  SCCAT15F    PICTURE X.
           02  FILLER REDEFINES SCCAT15F.
             03 SCCAT15A    PICTURE X.
           02  SCCAT15I  PIC X(4).
           02  SCTYP15L    COMP  PIC  S9(4).
           02  SCTYP15F    PICTURE X.
           02  FILLER REDEFINES SCTYP15F.
             03 SCTYP15A    PICTURE X.
           02  SCTYP15I  PIC X(4).
           02  SCGRP15L    COMP  PIC  S9(4).
           02  SCGRP15F    PICTURE X.
           02  FILLER REDEFINES SCGRP15F.
             03 SCGRP15A    PICTURE X.
           02  SCGRP15I  PIC X(1).
           02  SCCLC15L    COMP  PIC  S9(4).
           02  SCCLC15F    PICTURE X.
           02  FILLER REDEFINES SCCLC15F.
             03 SCCLC15A    PICTURE X.
           02  SCCLC15I  PIC X(1).
           02  SCCAT16L    COMP  PIC  S9(4).
           02  SCCAT16F    PICTURE X.
           02  FILLER REDEFINES SCCAT16F.
             03 SCCAT16A    PICTURE X.
           02  SCCAT16I  PIC X(4).
           02  SCTYP16L    COMP  PIC  S9(4).
           02  SCTYP16F    PICTURE X.
           02  FILLER REDEFINES SCTYP16F.
             03 SCTYP16A    PICTURE X.
           02  SCTYP16I  PIC X(4).
           02  SCGRP16L    COMP  PIC  S9(4).
           02  SCGRP16F    PICTURE X.
           02  FILLER REDEFINES SCGRP16F.
             03 SCGRP16A    PICTURE X.
           02  SCGRP16I  PIC X(1).
           02  SCCLC16L    COMP  PIC  S9(4).
           02  SCCLC16F    PICTURE X.
           02  FILLER REDEFINES SCCLC16F.
             03 SCCLC16A    PICTURE X.
           02  SCCLC16I  PIC X(1).
           02  SCCAT17L    COMP  PIC  S9(4).
           02  SCCAT17F    PICTURE X.
           02  FILLER REDEFINES SCCAT17F.
             03 SCCAT17A    PICTURE X.
           02  SCCAT17I  PIC X(4).
           02  SCTYP17L    COMP  PIC  S9(4).
           02  SCTYP17F    PICTURE X.
           02  FILLER REDEFINES SCTYP17F.
             03 SCTYP17A    PICTURE X.
           02  SCTYP17I  PIC X(4).
           02  SCGRP17L    COMP  PIC  S9(4).
           02  SCGRP17F    PICTURE X.
           02  FILLER REDEFINES SCGRP17F.
             03 SCGRP17A    PICTURE X.
           02  SCGRP17I  PIC X(1).
           02  SCCLC17L    COMP  PIC  S9(4).
           02  SCCLC17F    PICTURE X.
           02  FILLER REDEFINES SCCLC17F.
             03 SCCLC17A    PICTURE X.
           02  SCCLC17I  PIC X(1).
           02  SCCAT18L    COMP  PIC  S9(4).
           02  SCCAT18F    PICTURE X.
           02  FILLER REDEFINES SCCAT18F.
             03 SCCAT18A    PICTURE X.
           02  SCCAT18I  PIC X(4).
           02  SCTYP18L    COMP  PIC  S9(4).
           02  SCTYP18F    PICTURE X.
           02  FILLER REDEFINES SCTYP18F.
             03 SCTYP18A    PICTURE X.
           02  SCTYP18I  PIC X(4).
           02  SCGRP18L    COMP  PIC  S9(4).
           02  SCGRP18F    PICTURE X.
           02  FILLER REDEFINES SCGRP18F.
             03 SCGRP18A    PICTURE X.
           02  SCGRP18I  PIC X(1).
           02  SCCLC18L    COMP  PIC  S9(4).
           02  SCCLC18F    PICTURE X.
           02  FILLER REDEFINES SCCLC18F.
             03 SCCLC18A    PICTURE X.
           02  SCCLC18I  PIC X(1).
           02  SCCAT19L    COMP  PIC  S9(4).
           02  SCCAT19F    PICTURE X.
           02  FILLER REDEFINES SCCAT19F.
             03 SCCAT19A    PICTURE X.
           02  SCCAT19I  PIC X(4).
           02  SCTYP19L    COMP  PIC  S9(4).
           02  SCTYP19F    PICTURE X.
           02  FILLER REDEFINES SCTYP19F.
             03 SCTYP19A    PICTURE X.
           02  SCTYP19I  PIC X(4).
           02  SCGRP19L    COMP  PIC  S9(4).
           02  SCGRP19F    PICTURE X.
           02  FILLER REDEFINES SCGRP19F.
             03 SCGRP19A    PICTURE X.
           02  SCGRP19I  PIC X(1).
           02  SCCLC19L    COMP  PIC  S9(4).
           02  SCCLC19F    PICTURE X.
           02  FILLER REDEFINES SCCLC19F.
             03 SCCLC19A    PICTURE X.
           02  SCCLC19I  PIC X(1).
           02  SCCAT20L    COMP  PIC  S9(4).
           02  SCCAT20F    PICTURE X.
           02  FILLER REDEFINES SCCAT20F.
             03 SCCAT20A    PICTURE X.
           02  SCCAT20I  PIC X(4).
           02  SCTYP20L    COMP  PIC  S9(4).
           02  SCTYP20F    PICTURE X.
           02  FILLER REDEFINES SCTYP20F.
             03 SCTYP20A    PICTURE X.
           02  SCTYP20I  PIC X(4).
           02  SCGRP20L    COMP  PIC  S9(4).
           02  SCGRP20F    PICTURE X.
           02  FILLER REDEFINES SCGRP20F.
             03 SCGRP20A    PICTURE X.
           02  SCGRP20I  PIC X(1).
           02  SCCLC20L    COMP  PIC  S9(4).
           02  SCCLC20F    PICTURE X.
           02  FILLER REDEFINES SCCLC20F.
             03 SCCLC20A    PICTURE X.
           02  SCCLC20I  PIC X(1).
           02  SCCAT21L    COMP  PIC  S9(4).
           02  SCCAT21F    PICTURE X.
           02  FILLER REDEFINES SCCAT21F.
             03 SCCAT21A    PICTURE X.
           02  SCCAT21I  PIC X(4).
           02  SCTYP21L    COMP  PIC  S9(4).
           02  SCTYP21F    PICTURE X.
           02  FILLER REDEFINES SCTYP21F.
             03 SCTYP21A    PICTURE X.
           02  SCTYP21I  PIC X(4).
           02  SCGRP21L    COMP  PIC  S9(4).
           02  SCGRP21F    PICTURE X.
           02  FILLER REDEFINES SCGRP21F.
             03 SCGRP21A    PICTURE X.
           02  SCGRP21I  PIC X(1).
           02  SCCLC21L    COMP  PIC  S9(4).
           02  SCCLC21F    PICTURE X.
           02  FILLER REDEFINES SCCLC21F.
             03 SCCLC21A    PICTURE X.
           02  SCCLC21I  PIC X(1).
           02  SCCAT22L    COMP  PIC  S9(4).
           02  SCCAT22F    PICTURE X.
           02  FILLER REDEFINES SCCAT22F.
             03 SCCAT22A    PICTURE X.
           02  SCCAT22I  PIC X(4).
           02  SCTYP22L    COMP  PIC  S9(4).
           02  SCTYP22F    PICTURE X.
           02  FILLER REDEFINES SCTYP22F.
             03 SCTYP22A    PICTURE X.
           02  SCTYP22I  PIC X(4).
           02  SCGRP22L    COMP  PIC  S9(4).
           02  SCGRP22F    PICTURE X.
           02  FILLER REDEFINES SCGRP22F.
             03 SCGRP22A    PICTURE X.
           02  SCGRP22I  PIC X(1).
           02  SCCLC22L    COMP  PIC  S9(4).
           02  SCCLC22F    PICTURE X.
           02  FILLER REDEFINES SCCLC22F.
             03 SCCLC22A    PICTURE X.
           02  SCCLC22I  PIC X(1).
           02  SCCAT23L    COMP  PIC  S9(4).
           02  SCCAT23F    PICTURE X.
           02  FILLER REDEFINES SCCAT23F.
             03 SCCAT23A    PICTURE X.
           02  SCCAT23I  PIC X(4).
           02  SCTYP23L    COMP  PIC  S9(4).
           02  SCTYP23F    PICTURE X.
           02  FILLER REDEFINES SCTYP23F.
             03 SCTYP23A    PICTURE X.
           02  SCTYP23I  PIC X(4).
           02  SCGRP23L    COMP  PIC  S9(4).
           02  SCGRP23F    PICTURE X.
           02  FILLER REDEFINES SCGRP23F.
             03 SCGRP23A    PICTURE X.
           02  SCGRP23I  PIC X(1).
           02  SCCLC23L    COMP  PIC  S9(4).
           02  SCCLC23F    PICTURE X.
           02  FILLER REDEFINES SCCLC23F.
             03 SCCLC23A    PICTURE X.
           02  SCCLC23I  PIC X(1).
           02  SCCAT24L    COMP  PIC  S9(4).
           02  SCCAT24F    PICTURE X.
           02  FILLER REDEFINES SCCAT24F.
             03 SCCAT24A    PICTURE X.
           02  SCCAT24I  PIC X(4).
           02  SCTYP24L    COMP  PIC  S9(4).
           02  SCTYP24F    PICTURE X.
           02  FILLER REDEFINES SCTYP24F.
             03 SCTYP24A    PICTURE X.
           02  SCTYP24I  PIC X(4).
           02  SCGRP24L    COMP  PIC  S9(4).
           02  SCGRP24F    PICTURE X.
           02  FILLER REDEFINES SCGRP24F.
             03 SCGRP24A    PICTURE X.
           02  SCGRP24I  PIC X(1).
           02  SCCLC24L    COMP  PIC  S9(4).
           02  SCCLC24F    PICTURE X.
           02  FILLER REDEFINES SCCLC24F.
             03 SCCLC24A    PICTURE X.
           02  SCCLC24I  PIC X(1).
           02  SCCAT25L    COMP  PIC  S9(4).
           02  SCCAT25F    PICTURE X.
           02  FILLER REDEFINES SCCAT25F.
             03 SCCAT25A    PICTURE X.
           02  SCCAT25I  PIC X(4).
           02  SCTYP25L    COMP  PIC  S9(4).
           02  SCTYP25F    PICTURE X.
           02  FILLER REDEFINES SCTYP25F.
             03 SCTYP25A    PICTURE X.
           02  SCTYP25I  PIC X(4).
           02  SCGRP25L    COMP  PIC  S9(4).
           02  SCGRP25F    PICTURE X.
           02  FILLER REDEFINES SCGRP25F.
             03 SCGRP25A    PICTURE X.
           02  SCGRP25I  PIC X(1).
           02  SCCLC25L    COMP  PIC  S9(4).
           02  SCCLC25F    PICTURE X.
           02  FILLER REDEFINES SCCLC25F.
             03 SCCLC25A    PICTURE X.
           02  SCCLC25I  PIC X(1).
           02  SCCAT26L    COMP  PIC  S9(4).
           02  SCCAT26F    PICTURE X.
           02  FILLER REDEFINES SCCAT26F.
             03 SCCAT26A    PICTURE X.
           02  SCCAT26I  PIC X(4).
           02  SCTYP26L    COMP  PIC  S9(4).
           02  SCTYP26F    PICTURE X.
           02  FILLER REDEFINES SCTYP26F.
             03 SCTYP26A    PICTURE X.
           02  SCTYP26I  PIC X(4).
           02  SCGRP26L    COMP  PIC  S9(4).
           02  SCGRP26F    PICTURE X.
           02  FILLER REDEFINES SCGRP26F.
             03 SCGRP26A    PICTURE X.
           02  SCGRP26I  PIC X(1).
           02  SCCLC26L    COMP  PIC  S9(4).
           02  SCCLC26F    PICTURE X.
           02  FILLER REDEFINES SCCLC26F.
             03 SCCLC26A    PICTURE X.
           02  SCCLC26I  PIC X(1).
           02  SCCAT27L    COMP  PIC  S9(4).
           02  SCCAT27F    PICTURE X.
           02  FILLER REDEFINES SCCAT27F.
             03 SCCAT27A    PICTURE X.
           02  SCCAT27I  PIC X(4).
           02  SCTYP27L    COMP  PIC  S9(4).
           02  SCTYP27F    PICTURE X.
           02  FILLER REDEFINES SCTYP27F.
             03 SCTYP27A    PICTURE X.
           02  SCTYP27I  PIC X(4).
           02  SCGRP27L    COMP  PIC  S9(4).
           02  SCGRP27F    PICTURE X.
           02  FILLER REDEFINES SCGRP27F.
             03 SCGRP27A    PICTURE X.
           02  SCGRP27I  PIC X(1).
           02  SCCLC27L    COMP  PIC  S9(4).
           02  SCCLC27F    PICTURE X.
           02  FILLER REDEFINES SCCLC27F.
             03 SCCLC27A    PICTURE X.
           02  SCCLC27I  PIC X(1).
           02  SCCAT28L    COMP  PIC  S9(4).
           02  SCCAT28F    PICTURE X.
           02  FILLER REDEFINES SCCAT28F.
             03 SCCAT28A    PICTURE X.
           02  SCCAT28I  PIC X(4).
           02  SCTYP28L    COMP  PIC  S9(4).
           02  SCTYP28F    PICTURE X.
           02  FILLER REDEFINES SCTYP28F.
             03 SCTYP28A    PICTURE X.
           02  SCTYP28I  PIC X(4).
           02  SCGRP28L    COMP  PIC  S9(4).
           02  SCGRP28F    PICTURE X.
           02  FILLER REDEFINES SCGRP28F.
             03 SCGRP28A    PICTURE X.
           02  SCGRP28I  PIC X(1).
           02  SCCLC28L    COMP  PIC  S9(4).
           02  SCCLC28F    PICTURE X.
           02  FILLER REDEFINES SCCLC28F.
             03 SCCLC28A    PICTURE X.
           02  SCCLC28I  PIC X(1).
           02  SCCAT29L    COMP  PIC  S9(4).
           02  SCCAT29F    PICTURE X.
           02  FILLER REDEFINES SCCAT29F.
             03 SCCAT29A    PICTURE X.
           02  SCCAT29I  PIC X(4).
           02  SCTYP29L    COMP  PIC  S9(4).
           02  SCTYP29F    PICTURE X.
           02  FILLER REDEFINES SCTYP29F.
             03 SCTYP29A    PICTURE X.
           02  SCTYP29I  PIC X(4).
           02  SCGRP29L    COMP  PIC  S9(4).
           02  SCGRP29F    PICTURE X.
           02  FILLER REDEFINES SCGRP29F.
             03 SCGRP29A    PICTURE X.
           02  SCGRP29I  PIC X(1).
           02  SCCLC29L    COMP  PIC  S9(4).
           02  SCCLC29F    PICTURE X.
           02  FILLER REDEFINES SCCLC29F.
             03 SCCLC29A    PICTURE X.
           02  SCCLC29I  PIC X(1).
           02  SCCAT30L    COMP  PIC  S9(4).
           02  SCCAT30F    PICTURE X.
           02  FILLER REDEFINES SCCAT30F.
             03 SCCAT30A    PICTURE X.
           02  SCCAT30I  PIC X(4).
           02  SCTYP30L    COMP  PIC  S9(4).
           02  SCTYP30F    PICTURE X.
           02  FILLER REDEFINES SCTYP30F.
             03 SCTYP30A    PICTURE X.
           02  SCTYP30I  PIC X(4).
           02  SCGRP30L    COMP  PIC  S9(4).
           02  SCGRP30F    PICTURE X.
           02  FILLER REDEFINES SCGRP30F.
             03 SCGRP30A    PICTURE X.
           02  SCGRP30I  PIC X(1).
           02  SCCLC30L    COMP  PIC  S9(4).
           02  SCCLC30F    PICTURE X.
           02  FILLER REDEFINES SCCLC30F.
             03 SCCLC30A    PICTURE X.
           02  SCCLC30I  PIC X(1).
           02  SCCAT31L    COMP  PIC  S9(4).
           02  SCCAT31F    PICTURE X.
           02  FILLER REDEFINES SCCAT31F.
             03 SCCAT31A    PICTURE X.
           02  SCCAT31I  PIC X(4).
           02  SCTYP31L    COMP  PIC  S9(4).
           02  SCTYP31F    PICTURE X.
           02  FILLER REDEFINES SCTYP31F.
             03 SCTYP31A    PICTURE X.
           02  SCTYP31I  PIC X(4).
           02  SCGRP31L    COMP  PIC  S9(4).
           02  SCGRP31F    PICTURE X.
           02  FILLER REDEFINES SCGRP31F.
             03 SCGRP31A    PICTURE X.
           02  SCGRP31I  PIC X(1).
           02  SCCLC31L    COMP  PIC  S9(4).
           02  SCCLC31F    PICTURE X.
           02  FILLER REDEFINES SCCLC31F.
             03 SCCLC31A    PICTURE X.
           02  SCCLC31I  PIC X(1).
           02  SCCAT32L    COMP  PIC  S9(4).
           02  SCCAT32F    PICTURE X.
           02  FILLER REDEFINES SCCAT32F.
             03 SCCAT32A    PICTURE X.
           02  SCCAT32I  PIC X(4).
           02  SCTYP32L    COMP  PIC  S9(4).
           02  SCTYP32F    PICTURE X.
           02  FILLER REDEFINES SCTYP32F.
             03 SCTYP32A    PICTURE X.
           02  SCTYP32I  PIC X(4).
           02  SCGRP32L    COMP  PIC  S9(4).
           02  SCGRP32F    PICTURE X.
           02  FILLER REDEFINES SCGRP32F.
             03 SCGRP32A    PICTURE X.
           02  SCGRP32I  PIC X(1).
           02  SCCLC32L    COMP  PIC  S9(4).
           02  SCCLC32F    PICTURE X.
           02  FILLER REDEFINES SCCLC32F.
             03 SCCLC32A    PICTURE X.
           02  SCCLC32I  PIC X(1).
           02  SCCAT33L    COMP  PIC  S9(4).
           02  SCCAT33F    PICTURE X.
           02  FILLER REDEFINES SCCAT33F.
             03 SCCAT33A    PICTURE X.
           02  SCCAT33I  PIC X(4).
           02  SCTYP33L    COMP  PIC  S9(4).
           02  SCTYP33F    PICTURE X.
           02  FILLER REDEFINES SCTYP33F.
             03 SCTYP33A    PICTURE X.
           02  SCTYP33I  PIC X(4).
           02  SCGRP33L    COMP  PIC  S9(4).
           02  SCGRP33F    PICTURE X.
           02  FILLER REDEFINES SCGRP33F.
             03 SCGRP33A    PICTURE X.
           02  SCGRP33I  PIC X(1).
           02  SCCLC33L    COMP  PIC  S9(4).
           02  SCCLC33F    PICTURE X.
           02  FILLER REDEFINES SCCLC33F.
             03 SCCLC33A    PICTURE X.
           02  SCCLC33I  PIC X(1).
           02  SCCAT34L    COMP  PIC  S9(4).
           02  SCCAT34F    PICTURE X.
           02  FILLER REDEFINES SCCAT34F.
             03 SCCAT34A    PICTURE X.
           02  SCCAT34I  PIC X(4).
           02  SCTYP34L    COMP  PIC  S9(4).
           02  SCTYP34F    PICTURE X.
           02  FILLER REDEFINES SCTYP34F.
             03 SCTYP34A    PICTURE X.
           02  SCTYP34I  PIC X(4).
           02  SCGRP34L    COMP  PIC  S9(4).
           02  SCGRP34F    PICTURE X.
           02  FILLER REDEFINES SCGRP34F.
             03 SCGRP34A    PICTURE X.
           02  SCGRP34I  PIC X(1).
           02  SCCLC34L    COMP  PIC  S9(4).
           02  SCCLC34F    PICTURE X.
           02  FILLER REDEFINES SCCLC34F.
             03 SCCLC34A    PICTURE X.
           02  SCCLC34I  PIC X(1).
           02  SCCAT35L    COMP  PIC  S9(4).
           02  SCCAT35F    PICTURE X.
           02  FILLER REDEFINES SCCAT35F.
             03 SCCAT35A    PICTURE X.
           02  SCCAT35I  PIC X(4).
           02  SCTYP35L    COMP  PIC  S9(4).
           02  SCTYP35F    PICTURE X.
           02  FILLER REDEFINES SCTYP35F.
             03 SCTYP35A    PICTURE X.
           02  SCTYP35I  PIC X(4).
           02  SCGRP35L    COMP  PIC  S9(4).
           02  SCGRP35F    PICTURE X.
           02  FILLER REDEFINES SCGRP35F.
             03 SCGRP35A    PICTURE X.
           02  SCGRP35I  PIC X(1).
           02  SCCLC35L    COMP  PIC  S9(4).
           02  SCCLC35F    PICTURE X.
           02  FILLER REDEFINES SCCLC35F.
             03 SCCLC35A    PICTURE X.
           02  SCCLC35I  PIC X(1).
           02  SCCAT36L    COMP  PIC  S9(4).
           02  SCCAT36F    PICTURE X.
           02  FILLER REDEFINES SCCAT36F.
             03 SCCAT36A    PICTURE X.
           02  SCCAT36I  PIC X(4).
           02  SCTYP36L    COMP  PIC  S9(4).
           02  SCTYP36F    PICTURE X.
           02  FILLER REDEFINES SCTYP36F.
             03 SCTYP36A    PICTURE X.
           02  SCTYP36I  PIC X(4).
           02  SCGRP36L    COMP  PIC  S9(4).
           02  SCGRP36F    PICTURE X.
           02  FILLER REDEFINES SCGRP36F.
             03 SCGRP36A    PICTURE X.
           02  SCGRP36I  PIC X(1).
           02  SCCLC36L    COMP  PIC  S9(4).
           02  SCCLC36F    PICTURE X.
           02  FILLER REDEFINES SCCLC36F.
             03 SCCLC36A    PICTURE X.
           02  SCCLC36I  PIC X(1).
           02  SCCAT37L    COMP  PIC  S9(4).
           02  SCCAT37F    PICTURE X.
           02  FILLER REDEFINES SCCAT37F.
             03 SCCAT37A    PICTURE X.
           02  SCCAT37I  PIC X(4).
           02  SCTYP37L    COMP  PIC  S9(4).
           02  SCTYP37F    PICTURE X.
           02  FILLER REDEFINES SCTYP37F.
             03 SCTYP37A    PICTURE X.
           02  SCTYP37I  PIC X(4).
           02  SCGRP37L    COMP  PIC  S9(4).
           02  SCGRP37F    PICTURE X.
           02  FILLER REDEFINES SCGRP37F.
             03 SCGRP37A    PICTURE X.
           02  SCGRP37I  PIC X(1).
           02  SCCLC37L    COMP  PIC  S9(4).
           02  SCCLC37F    PICTURE X.
           02  FILLER REDEFINES SCCLC37F.
             03 SCCLC37A    PICTURE X.
           02  SCCLC37I  PIC X(1).
           02  SCCAT38L    COMP  PIC  S9(4).
           02  SCCAT38F    PICTURE X.
           02  FILLER REDEFINES SCCAT38F.
             03 SCCAT38A    PICTURE X.
           02  SCCAT38I  PIC X(4).
           02  SCTYP38L    COMP  PIC  S9(4).
           02  SCTYP38F    PICTURE X.
           02  FILLER REDEFINES SCTYP38F.
             03 SCTYP38A    PICTURE X.
           02  SCTYP38I  PIC X(4).
           02  SCGRP38L    COMP  PIC  S9(4).
           02  SCGRP38F    PICTURE X.
           02  FILLER REDEFINES SCGRP38F.
             03 SCGRP38A    PICTURE X.
           02  SCGRP38I  PIC X(1).
           02  SCCLC38L    COMP  PIC  S9(4).
           02  SCCLC38F    PICTURE X.
           02  FILLER REDEFINES SCCLC38F.
             03 SCCLC38A    PICTURE X.
           02  SCCLC38I  PIC X(1).
           02  SCCAT39L    COMP  PIC  S9(4).
           02  SCCAT39F    PICTURE X.
           02  FILLER REDEFINES SCCAT39F.
             03 SCCAT39A    PICTURE X.
           02  SCCAT39I  PIC X(4).
           02  SCTYP39L    COMP  PIC  S9(4).
           02  SCTYP39F    PICTURE X.
           02  FILLER REDEFINES SCTYP39F.
             03 SCTYP39A    PICTURE X.
           02  SCTYP39I  PIC X(4).
           02  SCGRP39L    COMP  PIC  S9(4).
           02  SCGRP39F    PICTURE X.
           02  FILLER REDEFINES SCGRP39F.
             03 SCGRP39A    PICTURE X.
           02  SCGRP39I  PIC X(1).
           02  SCCLC39L    COMP  PIC  S9(4).
           02  SCCLC39F    PICTURE X.
           02  FILLER REDEFINES SCCLC39F.
             03 SCCLC39A    PICTURE X.
           02  SCCLC39I  PIC X(1).
           02  SCCAT40L    COMP  PIC  S9(4).
           02  SCCAT40F    PICTURE X.
           02  FILLER REDEFINES SCCAT40F.
             03 SCCAT40A    PICTURE X.
           02  SCCAT40I  PIC X(4).
           02  SCTYP40L    COMP  PIC  S9(4).
           02  SCTYP40F    PICTURE X.
           02  FILLER REDEFINES SCTYP40F.
             03 SCTYP40A    PICTURE X.
           02  SCTYP40I  PIC X(4).
           02  SCGRP40L    COMP  PIC  S9(4).
           02  SCGRP40F    PICTURE X.
           02  FILLER REDEFINES SCGRP40F.
             03 SCGRP40A    PICTURE X.
           02  SCGRP40I  PIC X(1).
           02  SCCLC40L    COMP  PIC  S9(4).
           02  SCCLC40F    PICTURE X.
           02  FILLER REDEFINES SCCLC40F.
             03 SCCLC40A    PICTURE X.
           02  SCCLC40I  PIC X(1).
           02  SCCAT41L    COMP  PIC  S9(4).
           02  SCCAT41F    PICTURE X.
           02  FILLER REDEFINES SCCAT41F.
             03 SCCAT41A    PICTURE X.
           02  SCCAT41I  PIC X(4).
           02  SCTYP41L    COMP  PIC  S9(4).
           02  SCTYP41F    PICTURE X.
           02  FILLER REDEFINES SCTYP41F.
             03 SCTYP41A    PICTURE X.
           02  SCTYP41I  PIC X(4).
           02  SCGRP41L    COMP  PIC  S9(4).
           02  SCGRP41F    PICTURE X.
           02  FILLER REDEFINES SCGRP41F.
             03 SCGRP41A    PICTURE X.
           02  SCGRP41I  PIC X(1).
           02  SCCLC41L    COMP  PIC  S9(4).
           02  SCCLC41F    PICTURE X.
           02  FILLER REDEFINES SCCLC41F.
             03 SCCLC41A    PICTURE X.
           02  SCCLC41I  PIC X(1).
           02  SCCAT42L    COMP  PIC  S9(4).
           02  SCCAT42F    PICTURE X.
           02  FILLER REDEFINES SCCAT42F.
             03 SCCAT42A    PICTURE X.
           02  SCCAT42I  PIC X(4).
           02  SCTYP42L    COMP  PIC  S9(4).
           02  SCTYP42F    PICTURE X.
           02  FILLER REDEFINES SCTYP42F.
             03 SCTYP42A    PICTURE X.
           02  SCTYP42I  PIC X(4).
           02  SCGRP42L    COMP  PIC  S9(4).
           02  SCGRP42F    PICTURE X.
           02  FILLER REDEFINES SCGRP42F.
             03 SCGRP42A    PICTURE X.
           02  SCGRP42I  PIC X(1).
           02  SCCLC42L    COMP  PIC  S9(4).
           02  SCCLC42F    PICTURE X.
           02  FILLER REDEFINES SCCLC42F.
             03 SCCLC42A    PICTURE X.
           02  SCCLC42I  PIC X(1).
           02  SCCAT43L    COMP  PIC  S9(4).
           02  SCCAT43F    PICTURE X.
           02  FILLER REDEFINES SCCAT43F.
             03 SCCAT43A    PICTURE X.
           02  SCCAT43I  PIC X(4).
           02  SCTYP43L    COMP  PIC  S9(4).
           02  SCTYP43F    PICTURE X.
           02  FILLER REDEFINES SCTYP43F.
             03 SCTYP43A    PICTURE X.
           02  SCTYP43I  PIC X(4).
           02  SCGRP43L    COMP  PIC  S9(4).
           02  SCGRP43F    PICTURE X.
           02  FILLER REDEFINES SCGRP43F.
             03 SCGRP43A    PICTURE X.
           02  SCGRP43I  PIC X(1).
           02  SCCLC43L    COMP  PIC  S9(4).
           02  SCCLC43F    PICTURE X.
           02  FILLER REDEFINES SCCLC43F.
             03 SCCLC43A    PICTURE X.
           02  SCCLC43I  PIC X(1).
           02  SCCAT44L    COMP  PIC  S9(4).
           02  SCCAT44F    PICTURE X.
           02  FILLER REDEFINES SCCAT44F.
             03 SCCAT44A    PICTURE X.
           02  SCCAT44I  PIC X(4).
           02  SCTYP44L    COMP  PIC  S9(4).
           02  SCTYP44F    PICTURE X.
           02  FILLER REDEFINES SCTYP44F.
             03 SCTYP44A    PICTURE X.
           02  SCTYP44I  PIC X(4).
           02  SCGRP44L    COMP  PIC  S9(4).
           02  SCGRP44F    PICTURE X.
           02  FILLER REDEFINES SCGRP44F.
             03 SCGRP44A    PICTURE X.
           02  SCGRP44I  PIC X(1).
           02  SCCLC44L    COMP  PIC  S9(4).
           02  SCCLC44F    PICTURE X.
           02  FILLER REDEFINES SCCLC44F.
             03 SCCLC44A    PICTURE X.
           02  SCCLC44I  PIC X(1).
           02  SCCAT45L    COMP  PIC  S9(4).
           02  SCCAT45F    PICTURE X.
           02  FILLER REDEFINES SCCAT45F.
             03 SCCAT45A    PICTURE X.
           02  SCCAT45I  PIC X(4).
           02  SCTYP45L    COMP  PIC  S9(4).
           02  SCTYP45F    PICTURE X.
           02  FILLER REDEFINES SCTYP45F.
             03 SCTYP45A    PICTURE X.
           02  SCTYP45I  PIC X(4).
           02  SCGRP45L    COMP  PIC  S9(4).
           02  SCGRP45F    PICTURE X.
           02  FILLER REDEFINES SCGRP45F.
             03 SCGRP45A    PICTURE X.
           02  SCGRP45I  PIC X(1).
           02  SCCLC45L    COMP  PIC  S9(4).
           02  SCCLC45F    PICTURE X.
           02  FILLER REDEFINES SCCLC45F.
             03 SCCLC45A    PICTURE X.
           02  SCCLC45I  PIC X(1).
           02  SCCAT46L    COMP  PIC  S9(4).
           02  SCCAT46F    PICTURE X.
           02  FILLER REDEFINES SCCAT46F.
             03 SCCAT46A    PICTURE X.
           02  SCCAT46I  PIC X(4).
           02  SCTYP46L    COMP  PIC  S9(4).
           02  SCTYP46F    PICTURE X.
           02  FILLER REDEFINES SCTYP46F.
             03 SCTYP46A    PICTURE X.
           02  SCTYP46I  PIC X(4).
           02  SCGRP46L    COMP  PIC  S9(4).
           02  SCGRP46F    PICTURE X.
           02  FILLER REDEFINES SCGRP46F.
             03 SCGRP46A    PICTURE X.
           02  SCGRP46I  PIC X(1).
           02  SCCLC46L    COMP  PIC  S9(4).
           02  SCCLC46F    PICTURE X.
           02  FILLER REDEFINES SCCLC46F.
             03 SCCLC46A    PICTURE X.
           02  SCCLC46I  PIC X(1).
           02  SCCAT47L    COMP  PIC  S9(4).
           02  SCCAT47F    PICTURE X.
           02  FILLER REDEFINES SCCAT47F.
             03 SCCAT47A    PICTURE X.
           02  SCCAT47I  PIC X(4).
           02  SCTYP47L    COMP  PIC  S9(4).
           02  SCTYP47F    PICTURE X.
           02  FILLER REDEFINES SCTYP47F.
             03 SCTYP47A    PICTURE X.
           02  SCTYP47I  PIC X(4).
           02  SCGRP47L    COMP  PIC  S9(4).
           02  SCGRP47F    PICTURE X.
           02  FILLER REDEFINES SCGRP47F.
             03 SCGRP47A    PICTURE X.
           02  SCGRP47I  PIC X(1).
           02  SCCLC47L    COMP  PIC  S9(4).
           02  SCCLC47F    PICTURE X.
           02  FILLER REDEFINES SCCLC47F.
             03 SCCLC47A    PICTURE X.
           02  SCCLC47I  PIC X(1).
           02  SCCAT48L    COMP  PIC  S9(4).
           02  SCCAT48F    PICTURE X.
           02  FILLER REDEFINES SCCAT48F.
             03 SCCAT48A    PICTURE X.
           02  SCCAT48I  PIC X(4).
           02  SCTYP48L    COMP  PIC  S9(4).
           02  SCTYP48F    PICTURE X.
           02  FILLER REDEFINES SCTYP48F.
             03 SCTYP48A    PICTURE X.
           02  SCTYP48I  PIC X(4).
           02  SCGRP48L    COMP  PIC  S9(4).
           02  SCGRP48F    PICTURE X.
           02  FILLER REDEFINES SCGRP48F.
             03 SCGRP48A    PICTURE X.
           02  SCGRP48I  PIC X(1).
           02  SCCLC48L    COMP  PIC  S9(4).
           02  SCCLC48F    PICTURE X.
           02  FILLER REDEFINES SCCLC48F.
             03 SCCLC48A    PICTURE X.
           02  SCCLC48I  PIC X(1).
           02  SCERRL    COMP  PIC  S9(4).
           02  SCERRF    PICTURE X.
           02  FILLER REDEFINES SCERRF.
             03 SCERRA    PICTURE X.
           02  SCERRI  PIC X(79).
       01  FIIMSCHO REDEFINES FIIMSCHI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  SCTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCCAT01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT02O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP02O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT03O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP03O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT04O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP04O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT05O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP05O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT06O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP06O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT07O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP07O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT08O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP08O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT09O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP09O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT10O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP10O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT11O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP11O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT12O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP12O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT13O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP13O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT14O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP14O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP14O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC14O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT15O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP15O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP15O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC15O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT16O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP16O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP16O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC16O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT17O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP17O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP17O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC17O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT18O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP18O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP18O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC18O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT19O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP19O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP19O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC19O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT20O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP20O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP20O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC20O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT21O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP21O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP21O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC21O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT22O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP22O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT23O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP23O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP23O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC23O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT24O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP24O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP24O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC24O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT25O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP25O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP25O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC25O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT26O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP26O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP26O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC26O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT27O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP27O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP27O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC27O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT28O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP28O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP28O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC28O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT29O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP29O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP29O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC29O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT30O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP30O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP30O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC30O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT31O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP31O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP31O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC31O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT32O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP32O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT33O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP33O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP33O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC33O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT34O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP34O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP34O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC34O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT35O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP35O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP35O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC35O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT36O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP36O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP36O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC36O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT37O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP37O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP37O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC37O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT38O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP38O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP38O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC38O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT39O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP39O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP39O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC39O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT40O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP40O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP40O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC40O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT41O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP41O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP41O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC41O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT42O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP42O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP42O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC42O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT43O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP43O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP43O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC43O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT44O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP44O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP44O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC44O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT45O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP45O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP45O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC45O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT46O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP46O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP46O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC46O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT47O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP47O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP47O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC47O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCAT48O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCTYP48O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCGRP48O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCCLC48O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCERRO  PIC X(79).