       01  FIIM07AI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMCNTL2L    COMP  PIC  S9(4).
           02  IMCNTL2F    PICTURE X.
           02  FILLER REDEFINES IMCNTL2F.
             03 IMCNTL2A    PICTURE X.
           02  IMCNTL2I  PIC X(3).
           02  IMCNTL3L    COMP  PIC  S9(4).
           02  IMCNTL3F    PICTURE X.
           02  FILLER REDEFINES IMCNTL3F.
             03 IMCNTL3A    PICTURE X.
           02  IMCNTL3I  PIC X(3).
           02  IMCNTL4L    COMP  PIC  S9(4).
           02  IMCNTL4F    PICTURE X.
           02  FILLER REDEFINES IMCNTL4F.
             03 IMCNTL4A    PICTURE X.
           02  IMCNTL4I  PIC X(4).
           02  IMACCTL    COMP  PIC  S9(4).
           02  IMACCTF    PICTURE X.
           02  FILLER REDEFINES IMACCTF.
             03 IMACCTA    PICTURE X.
           02  IMACCTI  PIC X(10).
           02  IMAPRDTL    COMP  PIC  S9(4).
           02  IMAPRDTF    PICTURE X.
           02  FILLER REDEFINES IMAPRDTF.
             03 IMAPRDTA    PICTURE X.
           02  IMAPRDTI  PIC X(6).
           02  IMCRLAML    COMP  PIC  S9(4).
           02  IMCRLAMF    PICTURE X.
           02  FILLER REDEFINES IMCRLAMF.
             03 IMCRLAMA    PICTURE X.
           02  IMCRLAMI  PIC X(13).
           02  IMCRLCDL    COMP  PIC  S9(4).
           02  IMCRLCDF    PICTURE X.
           02  FILLER REDEFINES IMCRLCDF.
             03 IMCRLCDA    PICTURE X.
           02  IMCRLCDI  PIC X(1).
           02  IMLNINCL    COMP  PIC  S9(4).
           02  IMLNINCF    PICTURE X.
           02  FILLER REDEFINES IMLNINCF.
             03 IMLNINCA    PICTURE X.
           02  IMLNINCI  PIC X(1).
           02  IMINTPTL    COMP  PIC  S9(4).
           02  IMINTPTF    PICTURE X.
           02  FILLER REDEFINES IMINTPTF.
             03 IMINTPTA    PICTURE X.
           02  IMINTPTI  PIC X(1).
           02  IMANRTEL    COMP  PIC  S9(4).
           02  IMANRTEF    PICTURE X.
           02  FILLER REDEFINES IMANRTEF.
             03 IMANRTEA    PICTURE X.
           02  IMANRTEI  PIC X(10).
           02  IMSPRTEL    COMP  PIC  S9(4).
           02  IMSPRTEF    PICTURE X.
           02  FILLER REDEFINES IMSPRTEF.
             03 IMSPRTEA    PICTURE X.
           02  IMSPRTEI  PIC X(1).
           02  IMAUTOPL    COMP  PIC  S9(4).
           02  IMAUTOPF    PICTURE X.
           02  FILLER REDEFINES IMAUTOPF.
             03 IMAUTOPA    PICTURE X.
           02  IMAUTOPI  PIC X(1).
           02  IMFPCODL    COMP  PIC  S9(4).
           02  IMFPCODF    PICTURE X.
           02  FILLER REDEFINES IMFPCODF.
             03 IMFPCODA    PICTURE X.
           02  IMFPCODI  PIC X(1).
           02  IMFPAMTL    COMP  PIC  S9(4).
           02  IMFPAMTF    PICTURE X.
           02  FILLER REDEFINES IMFPAMTF.
             03 IMFPAMTA    PICTURE X.
           02  IMFPAMTI  PIC X(16).
           02  IMPCTYPL    COMP  PIC  S9(4).
           02  IMPCTYPF    PICTURE X.
           02  FILLER REDEFINES IMPCTYPF.
             03 IMPCTYPA    PICTURE X.
           02  IMPCTYPI  PIC X(1).
           02  IMPCCODL    COMP  PIC  S9(4).
           02  IMPCCODF    PICTURE X.
           02  FILLER REDEFINES IMPCCODF.
             03 IMPCCODA    PICTURE X.
           02  IMPCCODI  PIC X(1).
           02  IMPCDAYL    COMP  PIC  S9(4).
           02  IMPCDAYF    PICTURE X.
           02  FILLER REDEFINES IMPCDAYF.
             03 IMPCDAYA    PICTURE X.
           02  IMPCDAYI  PIC X(2).
           02  IMPCPHSL    COMP  PIC  S9(4).
           02  IMPCPHSF    PICTURE X.
           02  FILLER REDEFINES IMPCPHSF.
             03 IMPCPHSA    PICTURE X.
           02  IMPCPHSI  PIC X(1).
           02  IMPDCODL    COMP  PIC  S9(4).
           02  IMPDCODF    PICTURE X.
           02  FILLER REDEFINES IMPDCODF.
             03 IMPDCODA    PICTURE X.
           02  IMPDCODI  PIC X(1).
           02  IMPDDAYL    COMP  PIC  S9(4).
           02  IMPDDAYF    PICTURE X.
           02  FILLER REDEFINES IMPDDAYF.
             03 IMPDDAYA    PICTURE X.
           02  IMPDDAYI  PIC X(2).
           02  IMAOLIML    COMP  PIC  S9(4).
           02  IMAOLIMF    PICTURE X.
           02  FILLER REDEFINES IMAOLIMF.
             03 IMAOLIMA    PICTURE X.
           02  IMAOLIMI  PIC X(1).
           02  IMMAXRTL    COMP  PIC  S9(4).
           02  IMMAXRTF    PICTURE X.
           02  FILLER REDEFINES IMMAXRTF.
             03 IMMAXRTA    PICTURE X.
           02  IMMAXRTI  PIC X(10).
           02  IMCCCODL    COMP  PIC  S9(4).
           02  IMCCCODF    PICTURE X.
           02  FILLER REDEFINES IMCCCODF.
             03 IMCCCODA    PICTURE X.
           02  IMCCCODI  PIC X(4).
           02  IMHOMEQL    COMP  PIC  S9(4).
           02  IMHOMEQF    PICTURE X.
           02  FILLER REDEFINES IMHOMEQF.
             03 IMHOMEQA    PICTURE X.
           02  IMHOMEQI  PIC X(1).
           02  IMOFFICL    COMP  PIC  S9(4).
           02  IMOFFICF    PICTURE X.
           02  FILLER REDEFINES IMOFFICF.
             03 IMOFFICA    PICTURE X.
           02  IMOFFICI  PIC X(5).
           02  IMDTLRTL    COMP  PIC  S9(4).
           02  IMDTLRTF    PICTURE X.
           02  FILLER REDEFINES IMDTLRTF.
             03 IMDTLRTA    PICTURE X.
           02  IMDTLRTI  PIC X(6).
           02  IMCRRTFL    COMP  PIC  S9(4).
           02  IMCRRTFF    PICTURE X.
           02  FILLER REDEFINES IMCRRTFF.
             03 IMCRRTFA    PICTURE X.
           02  IMCRRTFI  PIC X(1).
           02  IMCRATEL    COMP  PIC  S9(4).
           02  IMCRATEF    PICTURE X.
           02  FILLER REDEFINES IMCRATEF.
             03 IMCRATEA    PICTURE X.
           02  IMCRATEI  PIC X(3).
           02  IMATREAL    COMP  PIC  S9(4).
           02  IMATREAF    PICTURE X.
           02  FILLER REDEFINES IMATREAF.
             03 IMATREAA    PICTURE X.
           02  IMATREAI  PIC X(1).
           02  IMPTDAYL    COMP  PIC  S9(4).
           02  IMPTDAYF    PICTURE X.
           02  FILLER REDEFINES IMPTDAYF.
             03 IMPTDAYA    PICTURE X.
           02  IMPTDAYI  PIC X(3).
           02  IMLNTYPL    COMP  PIC  S9(4).
           02  IMLNTYPF    PICTURE X.
           02  FILLER REDEFINES IMLNTYPF.
             03 IMLNTYPA    PICTURE X.
           02  IMLNTYPI  PIC X(2).
           02  IMWVFEEL    COMP  PIC  S9(4).
           02  IMWVFEEF    PICTURE X.
           02  FILLER REDEFINES IMWVFEEF.
             03 IMWVFEEA    PICTURE X.
           02  IMWVFEEI  PIC X(1).
           02  IMPRTPYL    COMP  PIC  S9(4).
           02  IMPRTPYF    PICTURE X.
           02  FILLER REDEFINES IMPRTPYF.
             03 IMPRTPYA    PICTURE X.
           02  IMPRTPYI  PIC X(1).
           02  IMMPPMTL    COMP  PIC  S9(4).
           02  IMMPPMTF    PICTURE X.
           02  FILLER REDEFINES IMMPPMTF.
             03 IMMPPMTA    PICTURE X.
           02  IMMPPMTI  PIC X(11).
           02  IMCAPINL    COMP  PIC  S9(4).
           02  IMCAPINF    PICTURE X.
           02  FILLER REDEFINES IMCAPINF.
             03 IMCAPINA    PICTURE X.
           02  IMCAPINI  PIC X(1).
           02  IMPNLCDL    COMP  PIC  S9(4).
           02  IMPNLCDF    PICTURE X.
           02  FILLER REDEFINES IMPNLCDF.
             03 IMPNLCDA    PICTURE X.
           02  IMPNLCDI  PIC X(1).
           02  IMCMLPRL    COMP  PIC  S9(4).
           02  IMCMLPRF    PICTURE X.
           02  FILLER REDEFINES IMCMLPRF.
             03 IMCMLPRA    PICTURE X.
           02  IMCMLPRI  PIC X(4).
           02  IMPNTAML    COMP  PIC  S9(4).
           02  IMPNTAMF    PICTURE X.
           02  FILLER REDEFINES IMPNTAMF.
             03 IMPNTAMA    PICTURE X.
           02  IMPNTAMI  PIC X(14).
           02  IMPNTYDL    COMP  PIC  S9(4).
           02  IMPNTYDF    PICTURE X.
           02  FILLER REDEFINES IMPNTYDF.
             03 IMPNTYDA    PICTURE X.
           02  IMPNTYDI  PIC X(3).
           02  IMPTPRTL    COMP  PIC  S9(4).
           02  IMPTPRTF    PICTURE X.
           02  FILLER REDEFINES IMPTPRTF.
             03 IMPTPRTA    PICTURE X.
           02  IMPTPRTI  PIC X(2).
           02  IMIN1FLL    COMP  PIC  S9(4).
           02  IMIN1FLF    PICTURE X.
           02  FILLER REDEFINES IMIN1FLF.
             03 IMIN1FLA    PICTURE X.
           02  IMIN1FLI  PIC X(1).
           02  IMIN1RTL    COMP  PIC  S9(4).
           02  IMIN1RTF    PICTURE X.
           02  FILLER REDEFINES IMIN1RTF.
             03 IMIN1RTA    PICTURE X.
           02  IMIN1RTI  PIC X(10).
           02  IMIN1COL    COMP  PIC  S9(4).
           02  IMIN1COF    PICTURE X.
           02  FILLER REDEFINES IMIN1COF.
             03 IMIN1COA    PICTURE X.
           02  IMIN1COI  PIC X(3).
           02  IMIN2FLL    COMP  PIC  S9(4).
           02  IMIN2FLF    PICTURE X.
           02  FILLER REDEFINES IMIN2FLF.
             03 IMIN2FLA    PICTURE X.
           02  IMIN2FLI  PIC X(1).
           02  IMIN2COL    COMP  PIC  S9(4).
           02  IMIN2COF    PICTURE X.
           02  FILLER REDEFINES IMIN2COF.
             03 IMIN2COA    PICTURE X.
           02  IMIN2COI  PIC X(3).
           02  IMIN2RTL    COMP  PIC  S9(4).
           02  IMIN2RTF    PICTURE X.
           02  FILLER REDEFINES IMIN2RTF.
             03 IMIN2RTA    PICTURE X.
           02  IMIN2RTI  PIC X(10).
           02  IMIN1STL    COMP  PIC  S9(4).
           02  IMIN1STF    PICTURE X.
           02  FILLER REDEFINES IMIN1STF.
             03 IMIN1STA    PICTURE X.
           02  IMIN1STI  PIC X(6).
           02  IMIN1SPL    COMP  PIC  S9(4).
           02  IMIN1SPF    PICTURE X.
           02  FILLER REDEFINES IMIN1SPF.
             03 IMIN1SPA    PICTURE X.
           02  IMIN1SPI  PIC X(6).
           02  IMIN2STL    COMP  PIC  S9(4).
           02  IMIN2STF    PICTURE X.
           02  FILLER REDEFINES IMIN2STF.
             03 IMIN2STA    PICTURE X.
           02  IMIN2STI  PIC X(6).
           02  IMIN2SPL    COMP  PIC  S9(4).
           02  IMIN2SPF    PICTURE X.
           02  FILLER REDEFINES IMIN2SPF.
             03 IMIN2SPA    PICTURE X.
           02  IMIN2SPI  PIC X(6).
           02  IMSPRTIL    COMP  PIC  S9(4).
           02  IMSPRTIF    PICTURE X.
           02  FILLER REDEFINES IMSPRTIF.
             03 IMSPRTIA    PICTURE X.
           02  IMSPRTII  PIC X(1).
           02  IMSPLM1L    COMP  PIC  S9(4).
           02  IMSPLM1F    PICTURE X.
           02  FILLER REDEFINES IMSPLM1F.
             03 IMSPLM1A    PICTURE X.
           02  IMSPLM1I  PIC X(13).
           02  IMSPRT1L    COMP  PIC  S9(4).
           02  IMSPRT1F    PICTURE X.
           02  FILLER REDEFINES IMSPRT1F.
             03 IMSPRT1A    PICTURE X.
           02  IMSPRT1I  PIC X(10).
           02  IMSPRT2L    COMP  PIC  S9(4).
           02  IMSPRT2F    PICTURE X.
           02  FILLER REDEFINES IMSPRT2F.
             03 IMSPRT2A    PICTURE X.
           02  IMSPRT2I  PIC X(10).
           02  IMSPLM2L    COMP  PIC  S9(4).
           02  IMSPLM2F    PICTURE X.
           02  FILLER REDEFINES IMSPLM2F.
             03 IMSPLM2A    PICTURE X.
           02  IMSPLM2I  PIC X(13).
           02  IMSPRT3L    COMP  PIC  S9(4).
           02  IMSPRT3F    PICTURE X.
           02  FILLER REDEFINES IMSPRT3F.
             03 IMSPRT3A    PICTURE X.
           02  IMSPRT3I  PIC X(10).
           02  IMPRCHGL    COMP  PIC  S9(4).
           02  IMPRCHGF    PICTURE X.
           02  FILLER REDEFINES IMPRCHGF.
             03 IMPRCHGA    PICTURE X.
           02  IMPRCHGI  PIC X(1).
           02  IMPRAJCL    COMP  PIC  S9(4).
           02  IMPRAJCF    PICTURE X.
           02  FILLER REDEFINES IMPRAJCF.
             03 IMPRAJCA    PICTURE X.
           02  IMPRAJCI  PIC X(1).
           02  IMPRADJL    COMP  PIC  S9(4).
           02  IMPRADJF    PICTURE X.
           02  FILLER REDEFINES IMPRADJF.
             03 IMPRADJA    PICTURE X.
           02  IMPRADJI  PIC X(10).
           02  IMPRRTEL    COMP  PIC  S9(4).
           02  IMPRRTEF    PICTURE X.
           02  FILLER REDEFINES IMPRRTEF.
             03 IMPRRTEA    PICTURE X.
           02  IMPRRTEI  PIC X(10).
           02  IMPBALCL    COMP  PIC  S9(4).
           02  IMPBALCF    PICTURE X.
           02  FILLER REDEFINES IMPBALCF.
             03 IMPBALCA    PICTURE X.
           02  IMPBALCI  PIC X(1).
           02  IMCSTCDL    COMP  PIC  S9(4).
           02  IMCSTCDF    PICTURE X.
           02  FILLER REDEFINES IMCSTCDF.
             03 IMCSTCDA    PICTURE X.
           02  IMCSTCDI  PIC X(1).
           02  IMCSTDYL    COMP  PIC  S9(4).
           02  IMCSTDYF    PICTURE X.
           02  FILLER REDEFINES IMCSTDYF.
             03 IMCSTDYA    PICTURE X.
           02  IMCSTDYI  PIC X(2).
           02  IMCSTRCL    COMP  PIC  S9(4).
           02  IMCSTRCF    PICTURE X.
           02  FILLER REDEFINES IMCSTRCF.
             03 IMCSTRCA    PICTURE X.
           02  IMCSTRCI  PIC X(1).
           02  IMCSTTML    COMP  PIC  S9(4).
           02  IMCSTTMF    PICTURE X.
           02  FILLER REDEFINES IMCSTTMF.
             03 IMCSTTMA    PICTURE X.
           02  IMCSTTMI  PIC X(3).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIM07AO REDEFINES FIIM07AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMCNTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMAPRDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMCRLAMO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMCRLCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMLNINCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMINTPTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMANRTEO PIC 9.99999999.
           02  FILLER PICTURE X(3).
           02  IMSPRTEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAUTOPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFPCODO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFPAMTO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMPCTYPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPCCODO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPCDAYO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMPCPHSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPDCODO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPDDAYO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAOLIMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMAXRTO PIC 9.99999999.
           02  FILLER PICTURE X(3).
           02  IMCCCODO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMHOMEQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOFFICO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMDTLRTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMCRRTFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCRATEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMATREAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPTDAYO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMLNTYPO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMWVFEEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPRTPYO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMPPMTO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  IMCAPINO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPNLCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCMLPRO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMPNTAMO  PIC X(14).
           02  FILLER PICTURE X(3).
           02  IMPNTYDO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMPTPRTO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMIN1FLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMIN1RTO PIC 9.99999999.
           02  FILLER PICTURE X(3).
           02  IMIN1COO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMIN2FLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMIN2COO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMIN2RTO PIC 9.99999999.
           02  FILLER PICTURE X(3).
           02  IMIN1STO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMIN1SPO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMIN2STO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMIN2SPO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMSPRTIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSPLM1O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMSPRT1O PIC 9.99999999.
           02  FILLER PICTURE X(3).
           02  IMSPRT2O PIC 9.99999999.
           02  FILLER PICTURE X(3).
           02  IMSPLM2O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMSPRT3O PIC 9.99999999.
           02  FILLER PICTURE X(3).
           02  IMPRCHGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPRAJCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPRADJO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMPRRTEO PIC 9.99999999.
           02  FILLER PICTURE X(3).
           02  IMPBALCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCSTCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCSTDYO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMCSTRCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCSTTMO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).