       01  FIIMIZOI.
           02  FILLER PIC X(12).
           02  IMTRANOL    COMP  PIC  S9(4).
           02  IMTRANOF    PICTURE X.
           02  FILLER REDEFINES IMTRANOF.
             03 IMTRANOA    PICTURE X.
           02  IMTRANOI  PIC X(4).
           02  IMDATEOL    COMP  PIC  S9(4).
           02  IMDATEOF    PICTURE X.
           02  FILLER REDEFINES IMDATEOF.
             03 IMDATEOA    PICTURE X.
           02  IMDATEOI  PIC X(8).
           02  IMTITLOL    COMP  PIC  S9(4).
           02  IMTITLOF    PICTURE X.
           02  FILLER REDEFINES IMTITLOF.
             03 IMTITLOA    PICTURE X.
           02  IMTITLOI  PIC X(37).
           02  IMTIMEOL    COMP  PIC  S9(4).
           02  IMTIMEOF    PICTURE X.
           02  FILLER REDEFINES IMTIMEOF.
             03 IMTIMEOA    PICTURE X.
           02  IMTIMEOI  PIC X(8).
           02  IMPGNOL    COMP  PIC  S9(4).
           02  IMPGNOF    PICTURE X.
           02  FILLER REDEFINES IMPGNOF.
             03 IMPGNOA    PICTURE X.
           02  IMPGNOI  PIC X(3).
           02  IMKEYOL    COMP  PIC  S9(4).
           02  IMKEYOF    PICTURE X.
           02  FILLER REDEFINES IMKEYOF.
             03 IMKEYOA    PICTURE X.
           02  IMKEYOI  PIC X(26).
           02  IMNAMEOL    COMP  PIC  S9(4).
           02  IMNAMEOF    PICTURE X.
           02  FILLER REDEFINES IMNAMEOF.
             03 IMNAMEOA    PICTURE X.
           02  IMNAMEOI  PIC X(13).
           02  IMDTEOL    COMP  PIC  S9(4).
           02  IMDTEOF    PICTURE X.
           02  FILLER REDEFINES IMDTEOF.
             03 IMDTEOA    PICTURE X.
           02  IMDTEOI  PIC X(8).
           02  IMBALOL    COMP  PIC  S9(4).
           02  IMBALOF    PICTURE X.
           02  FILLER REDEFINES IMBALOF.
             03 IMBALOA    PICTURE X.
           02  IMBALOI  PIC X(18).
           02  IMPRODOL    COMP  PIC  S9(4).
           02  IMPRODOF    PICTURE X.
           02  FILLER REDEFINES IMPRODOF.
             03 IMPRODOA    PICTURE X.
           02  IMPRODOI  PIC X(3).
           02  IMATDYOL    COMP  PIC  S9(4).
           02  IMATDYOF    PICTURE X.
           02  FILLER REDEFINES IMATDYOF.
             03 IMATDYOA    PICTURE X.
           02  IMATDYOI  PIC X(20).
           02  IMCALCOL    COMP  PIC  S9(4).
           02  IMCALCOF    PICTURE X.
           02  FILLER REDEFINES IMCALCOF.
             03 IMCALCOA    PICTURE X.
           02  IMCALCOI  PIC X(1).
           02  IMACTDOL    COMP  PIC  S9(4).
           02  IMACTDOF    PICTURE X.
           02  FILLER REDEFINES IMACTDOF.
             03 IMACTDOA    PICTURE X.
           02  IMACTDOI  PIC X(20).
           02  IMAADJOL    COMP  PIC  S9(4).
           02  IMAADJOF    PICTURE X.
           02  FILLER REDEFINES IMAADJOF.
             03 IMAADJOA    PICTURE X.
           02  IMAADJOI  PIC X(20).
           02  IMPTR1OL    COMP  PIC  S9(4).
           02  IMPTR1OF    PICTURE X.
           02  FILLER REDEFINES IMPTR1OF.
             03 IMPTR1OA    PICTURE X.
           02  IMPTR1OI  PIC X(1).
           02  IMRAT1OL    COMP  PIC  S9(4).
           02  IMRAT1OF    PICTURE X.
           02  FILLER REDEFINES IMRAT1OF.
             03 IMRAT1OA    PICTURE X.
           02  IMRAT1OI  PIC X(19).
           02  IMPAJ1OL    COMP  PIC  S9(4).
           02  IMPAJ1OF    PICTURE X.
           02  FILLER REDEFINES IMPAJ1OF.
             03 IMPAJ1OA    PICTURE X.
           02  IMPAJ1OI  PIC X(11).
           02  IMPFL1OL    COMP  PIC  S9(4).
           02  IMPFL1OF    PICTURE X.
           02  FILLER REDEFINES IMPFL1OF.
             03 IMPFL1OA    PICTURE X.
           02  IMPFL1OI  PIC X(1).
           02  IMLIM1OL    COMP  PIC  S9(4).
           02  IMLIM1OF    PICTURE X.
           02  FILLER REDEFINES IMLIM1OF.
             03 IMLIM1OA    PICTURE X.
           02  IMLIM1OI  PIC X(16).
           02  IMPTR2OL    COMP  PIC  S9(4).
           02  IMPTR2OF    PICTURE X.
           02  FILLER REDEFINES IMPTR2OF.
             03 IMPTR2OA    PICTURE X.
           02  IMPTR2OI  PIC X(1).
           02  IMRAT2OL    COMP  PIC  S9(4).
           02  IMRAT2OF    PICTURE X.
           02  FILLER REDEFINES IMRAT2OF.
             03 IMRAT2OA    PICTURE X.
           02  IMRAT2OI  PIC X(19).
           02  IMPAJ2OL    COMP  PIC  S9(4).
           02  IMPAJ2OF    PICTURE X.
           02  FILLER REDEFINES IMPAJ2OF.
             03 IMPAJ2OA    PICTURE X.
           02  IMPAJ2OI  PIC X(11).
           02  IMPFL2OL    COMP  PIC  S9(4).
           02  IMPFL2OF    PICTURE X.
           02  FILLER REDEFINES IMPFL2OF.
             03 IMPFL2OA    PICTURE X.
           02  IMPFL2OI  PIC X(1).
           02  IMLIM2OL    COMP  PIC  S9(4).
           02  IMLIM2OF    PICTURE X.
           02  FILLER REDEFINES IMLIM2OF.
             03 IMLIM2OA    PICTURE X.
           02  IMLIM2OI  PIC X(16).
           02  IMPTR3OL    COMP  PIC  S9(4).
           02  IMPTR3OF    PICTURE X.
           02  FILLER REDEFINES IMPTR3OF.
             03 IMPTR3OA    PICTURE X.
           02  IMPTR3OI  PIC X(1).
           02  IMRAT3OL    COMP  PIC  S9(4).
           02  IMRAT3OF    PICTURE X.
           02  FILLER REDEFINES IMRAT3OF.
             03 IMRAT3OA    PICTURE X.
           02  IMRAT3OI  PIC X(19).
           02  IMPAJ3OL    COMP  PIC  S9(4).
           02  IMPAJ3OF    PICTURE X.
           02  FILLER REDEFINES IMPAJ3OF.
             03 IMPAJ3OA    PICTURE X.
           02  IMPAJ3OI  PIC X(11).
           02  IMPFL3OL    COMP  PIC  S9(4).
           02  IMPFL3OF    PICTURE X.
           02  FILLER REDEFINES IMPFL3OF.
             03 IMPFL3OA    PICTURE X.
           02  IMPFL3OI  PIC X(1).
           02  IMLIM3OL    COMP  PIC  S9(4).
           02  IMLIM3OF    PICTURE X.
           02  FILLER REDEFINES IMLIM3OF.
             03 IMLIM3OA    PICTURE X.
           02  IMLIM3OI  PIC X(16).
           02  IMPTR4OL    COMP  PIC  S9(4).
           02  IMPTR4OF    PICTURE X.
           02  FILLER REDEFINES IMPTR4OF.
             03 IMPTR4OA    PICTURE X.
           02  IMPTR4OI  PIC X(1).
           02  IMRAT4OL    COMP  PIC  S9(4).
           02  IMRAT4OF    PICTURE X.
           02  FILLER REDEFINES IMRAT4OF.
             03 IMRAT4OA    PICTURE X.
           02  IMRAT4OI  PIC X(19).
           02  IMPAJ4OL    COMP  PIC  S9(4).
           02  IMPAJ4OF    PICTURE X.
           02  FILLER REDEFINES IMPAJ4OF.
             03 IMPAJ4OA    PICTURE X.
           02  IMPAJ4OI  PIC X(11).
           02  IMPFL4OL    COMP  PIC  S9(4).
           02  IMPFL4OF    PICTURE X.
           02  FILLER REDEFINES IMPFL4OF.
             03 IMPFL4OA    PICTURE X.
           02  IMPFL4OI  PIC X(1).
           02  IMLIM4OL    COMP  PIC  S9(4).
           02  IMLIM4OF    PICTURE X.
           02  FILLER REDEFINES IMLIM4OF.
             03 IMLIM4OA    PICTURE X.
           02  IMLIM4OI  PIC X(16).
           02  IMPTR5OL    COMP  PIC  S9(4).
           02  IMPTR5OF    PICTURE X.
           02  FILLER REDEFINES IMPTR5OF.
             03 IMPTR5OA    PICTURE X.
           02  IMPTR5OI  PIC X(1).
           02  IMRAT5OL    COMP  PIC  S9(4).
           02  IMRAT5OF    PICTURE X.
           02  FILLER REDEFINES IMRAT5OF.
             03 IMRAT5OA    PICTURE X.
           02  IMRAT5OI  PIC X(19).
           02  IMPAJ5OL    COMP  PIC  S9(4).
           02  IMPAJ5OF    PICTURE X.
           02  FILLER REDEFINES IMPAJ5OF.
             03 IMPAJ5OA    PICTURE X.
           02  IMPAJ5OI  PIC X(11).
           02  IMPFL5OL    COMP  PIC  S9(4).
           02  IMPFL5OF    PICTURE X.
           02  FILLER REDEFINES IMPFL5OF.
             03 IMPFL5OA    PICTURE X.
           02  IMPFL5OI  PIC X(1).
           02  IMLIM5OL    COMP  PIC  S9(4).
           02  IMLIM5OF    PICTURE X.
           02  FILLER REDEFINES IMLIM5OF.
             03 IMLIM5OA    PICTURE X.
           02  IMLIM5OI  PIC X(16).
           02  IMPTR6OL    COMP  PIC  S9(4).
           02  IMPTR6OF    PICTURE X.
           02  FILLER REDEFINES IMPTR6OF.
             03 IMPTR6OA    PICTURE X.
           02  IMPTR6OI  PIC X(1).
           02  IMRAT6OL    COMP  PIC  S9(4).
           02  IMRAT6OF    PICTURE X.
           02  FILLER REDEFINES IMRAT6OF.
             03 IMRAT6OA    PICTURE X.
           02  IMRAT6OI  PIC X(19).
           02  IMPAJ6OL    COMP  PIC  S9(4).
           02  IMPAJ6OF    PICTURE X.
           02  FILLER REDEFINES IMPAJ6OF.
             03 IMPAJ6OA    PICTURE X.
           02  IMPAJ6OI  PIC X(11).
           02  IMPFL6OL    COMP  PIC  S9(4).
           02  IMPFL6OF    PICTURE X.
           02  FILLER REDEFINES IMPFL6OF.
             03 IMPFL6OA    PICTURE X.
           02  IMPFL6OI  PIC X(1).
           02  IMLIM6OL    COMP  PIC  S9(4).
           02  IMLIM6OF    PICTURE X.
           02  FILLER REDEFINES IMLIM6OF.
             03 IMLIM6OA    PICTURE X.
           02  IMLIM6OI  PIC X(16).
           02  IMPTR7OL    COMP  PIC  S9(4).
           02  IMPTR7OF    PICTURE X.
           02  FILLER REDEFINES IMPTR7OF.
             03 IMPTR7OA    PICTURE X.
           02  IMPTR7OI  PIC X(1).
           02  IMRAT7OL    COMP  PIC  S9(4).
           02  IMRAT7OF    PICTURE X.
           02  FILLER REDEFINES IMRAT7OF.
             03 IMRAT7OA    PICTURE X.
           02  IMRAT7OI  PIC X(19).
           02  IMPAJ7OL    COMP  PIC  S9(4).
           02  IMPAJ7OF    PICTURE X.
           02  FILLER REDEFINES IMPAJ7OF.
             03 IMPAJ7OA    PICTURE X.
           02  IMPAJ7OI  PIC X(11).
           02  IMPFL7OL    COMP  PIC  S9(4).
           02  IMPFL7OF    PICTURE X.
           02  FILLER REDEFINES IMPFL7OF.
             03 IMPFL7OA    PICTURE X.
           02  IMPFL7OI  PIC X(1).
           02  IMLIM7OL    COMP  PIC  S9(4).
           02  IMLIM7OF    PICTURE X.
           02  FILLER REDEFINES IMLIM7OF.
             03 IMLIM7OA    PICTURE X.
           02  IMLIM7OI  PIC X(16).
           02  IMPTR8OL    COMP  PIC  S9(4).
           02  IMPTR8OF    PICTURE X.
           02  FILLER REDEFINES IMPTR8OF.
             03 IMPTR8OA    PICTURE X.
           02  IMPTR8OI  PIC X(1).
           02  IMRAT8OL    COMP  PIC  S9(4).
           02  IMRAT8OF    PICTURE X.
           02  FILLER REDEFINES IMRAT8OF.
             03 IMRAT8OA    PICTURE X.
           02  IMRAT8OI  PIC X(19).
           02  IMPAJ8OL    COMP  PIC  S9(4).
           02  IMPAJ8OF    PICTURE X.
           02  FILLER REDEFINES IMPAJ8OF.
             03 IMPAJ8OA    PICTURE X.
           02  IMPAJ8OI  PIC X(11).
           02  IMPFL8OL    COMP  PIC  S9(4).
           02  IMPFL8OF    PICTURE X.
           02  FILLER REDEFINES IMPFL8OF.
             03 IMPFL8OA    PICTURE X.
           02  IMPFL8OI  PIC X(1).
           02  IMLIM8OL    COMP  PIC  S9(4).
           02  IMLIM8OF    PICTURE X.
           02  FILLER REDEFINES IMLIM8OF.
             03 IMLIM8OA    PICTURE X.
           02  IMLIM8OI  PIC X(16).
           02  IMPTR9OL    COMP  PIC  S9(4).
           02  IMPTR9OF    PICTURE X.
           02  FILLER REDEFINES IMPTR9OF.
             03 IMPTR9OA    PICTURE X.
           02  IMPTR9OI  PIC X(1).
           02  IMRAT9OL    COMP  PIC  S9(4).
           02  IMRAT9OF    PICTURE X.
           02  FILLER REDEFINES IMRAT9OF.
             03 IMRAT9OA    PICTURE X.
           02  IMRAT9OI  PIC X(19).
           02  IMPAJ9OL    COMP  PIC  S9(4).
           02  IMPAJ9OF    PICTURE X.
           02  FILLER REDEFINES IMPAJ9OF.
             03 IMPAJ9OA    PICTURE X.
           02  IMPAJ9OI  PIC X(11).
           02  IMPFL9OL    COMP  PIC  S9(4).
           02  IMPFL9OF    PICTURE X.
           02  FILLER REDEFINES IMPFL9OF.
             03 IMPFL9OA    PICTURE X.
           02  IMPFL9OI  PIC X(1).
           02  IMPAGFOL    COMP  PIC  S9(4).
           02  IMPAGFOF    PICTURE X.
           02  FILLER REDEFINES IMPAGFOF.
             03 IMPAGFOA    PICTURE X.
           02  IMPAGFOI  PIC X(19).
           02  IMPAGBOL    COMP  PIC  S9(4).
           02  IMPAGBOF    PICTURE X.
           02  FILLER REDEFINES IMPAGBOF.
             03 IMPAGBOA    PICTURE X.
           02  IMPAGBOI  PIC X(19).
           02  IMPRMTOL    COMP  PIC  S9(4).
           02  IMPRMTOF    PICTURE X.
           02  FILLER REDEFINES IMPRMTOF.
             03 IMPRMTOA    PICTURE X.
           02  IMPRMTOI  PIC X(22).
           02  IMERROOL    COMP  PIC  S9(4).
           02  IMERROOF    PICTURE X.
           02  FILLER REDEFINES IMERROOF.
             03 IMERROOA    PICTURE X.
           02  IMERROOI  PIC X(79).
       01  FIIMIZOO REDEFINES FIIMIZOI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANOO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEOO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTITLOO  PIC X(37).
           02  FILLER PICTURE X(3).
           02  IMTIMEOO PIC 99B99B99.
           02  FILLER PICTURE X(3).
           02  IMPGNOO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMKEYOO  PIC X(26).
           02  FILLER PICTURE X(3).
           02  IMNAMEOO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMDTEOO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMBALOO PIC Z(7)ZZZ,ZZ9.99-.
           02  FILLER PICTURE X(3).
           02  IMPRODOO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMATDYOO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMCALCOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMACTDOO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMAADJOO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMPTR1OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRAT1OO PIC .9(17)-.
           02  FILLER PICTURE X(3).
           02  IMPAJ1OO PIC 9.9(8)-.
           02  FILLER PICTURE X(3).
           02  IMPFL1OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMLIM1OO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMPTR2OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRAT2OO PIC .9(17)-.
           02  FILLER PICTURE X(3).
           02  IMPAJ2OO PIC 9.9(8)-.
           02  FILLER PICTURE X(3).
           02  IMPFL2OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMLIM2OO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMPTR3OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRAT3OO PIC .9(17)-.
           02  FILLER PICTURE X(3).
           02  IMPAJ3OO PIC 9.9(8)-.
           02  FILLER PICTURE X(3).
           02  IMPFL3OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMLIM3OO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMPTR4OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRAT4OO PIC .9(17)-.
           02  FILLER PICTURE X(3).
           02  IMPAJ4OO PIC 9.9(8)-.
           02  FILLER PICTURE X(3).
           02  IMPFL4OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMLIM4OO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMPTR5OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRAT5OO PIC .9(17)-.
           02  FILLER PICTURE X(3).
           02  IMPAJ5OO PIC 9.9(8)-.
           02  FILLER PICTURE X(3).
           02  IMPFL5OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMLIM5OO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMPTR6OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRAT6OO PIC .9(17)-.
           02  FILLER PICTURE X(3).
           02  IMPAJ6OO PIC 9.9(8)-.
           02  FILLER PICTURE X(3).
           02  IMPFL6OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMLIM6OO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMPTR7OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRAT7OO PIC .9(17)-.
           02  FILLER PICTURE X(3).
           02  IMPAJ7OO PIC 9.9(8)-.
           02  FILLER PICTURE X(3).
           02  IMPFL7OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMLIM7OO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMPTR8OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRAT8OO PIC .9(17)-.
           02  FILLER PICTURE X(3).
           02  IMPAJ8OO PIC 9.9(8)-.
           02  FILLER PICTURE X(3).
           02  IMPFL8OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMLIM8OO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMPTR9OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRAT9OO PIC .9(17)-.
           02  FILLER PICTURE X(3).
           02  IMPAJ9OO PIC 9.9(8)-.
           02  FILLER PICTURE X(3).
           02  IMPFL9OO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPAGFOO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMPAGBOO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMPRMTOO  PIC X(22).
           02  FILLER PICTURE X(3).
           02  IMERROOO  PIC X(79).
       01  FIIMIZMI REDEFINES FIIMIZOI.
           02  FILLER PIC X(12).
           02  IMTRANML    COMP  PIC  S9(4).
           02  IMTRANMF    PICTURE X.
           02  FILLER REDEFINES IMTRANMF.
             03 IMTRANMA    PICTURE X.
           02  IMTRANMI  PIC X(4).
           02  IMDATEML    COMP  PIC  S9(4).
           02  IMDATEMF    PICTURE X.
           02  FILLER REDEFINES IMDATEMF.
             03 IMDATEMA    PICTURE X.
           02  IMDATEMI  PIC X(8).
           02  IMTITLML    COMP  PIC  S9(4).
           02  IMTITLMF    PICTURE X.
           02  FILLER REDEFINES IMTITLMF.
             03 IMTITLMA    PICTURE X.
           02  IMTITLMI  PIC X(39).
           02  IMTIMEML    COMP  PIC  S9(4).
           02  IMTIMEMF    PICTURE X.
           02  FILLER REDEFINES IMTIMEMF.
             03 IMTIMEMA    PICTURE X.
           02  IMTIMEMI  PIC X(8).
           02  IMPGNML    COMP  PIC  S9(4).
           02  IMPGNMF    PICTURE X.
           02  FILLER REDEFINES IMPGNMF.
             03 IMPGNMA    PICTURE X.
           02  IMPGNMI  PIC X(3).
           02  IMKEYML    COMP  PIC  S9(4).
           02  IMKEYMF    PICTURE X.
           02  FILLER REDEFINES IMKEYMF.
             03 IMKEYMA    PICTURE X.
           02  IMKEYMI  PIC X(26).
           02  IMNAMEML    COMP  PIC  S9(4).
           02  IMNAMEMF    PICTURE X.
           02  FILLER REDEFINES IMNAMEMF.
             03 IMNAMEMA    PICTURE X.
           02  IMNAMEMI  PIC X(13).
           02  IMDTEML    COMP  PIC  S9(4).
           02  IMDTEMF    PICTURE X.
           02  FILLER REDEFINES IMDTEMF.
             03 IMDTEMA    PICTURE X.
           02  IMDTEMI  PIC X(8).
           02  IMBALML    COMP  PIC  S9(4).
           02  IMBALMF    PICTURE X.
           02  FILLER REDEFINES IMBALMF.
             03 IMBALMA    PICTURE X.
           02  IMBALMI  PIC X(18).
           02  IMTNBRML    COMP  PIC  S9(4).
           02  IMTNBRMF    PICTURE X.
           02  FILLER REDEFINES IMTNBRMF.
             03 IMTNBRMA    PICTURE X.
           02  IMTNBRMI  PIC X(11).
           02  IMPRODML    COMP  PIC  S9(4).
           02  IMPRODMF    PICTURE X.
           02  FILLER REDEFINES IMPRODMF.
             03 IMPRODMA    PICTURE X.
           02  IMPRODMI  PIC X(3).
           02  IMCHKIML    COMP  PIC  S9(4).
           02  IMCHKIMF    PICTURE X.
           02  FILLER REDEFINES IMCHKIMF.
             03 IMCHKIMA    PICTURE X.
           02  IMCHKIMI  PIC X(11).
           02  IMCTDYML    COMP  PIC  S9(4).
           02  IMCTDYMF    PICTURE X.
           02  FILLER REDEFINES IMCTDYMF.
             03 IMCTDYMA    PICTURE X.
           02  IMCTDYMI  PIC X(1).
           02  IMIRATML    COMP  PIC  S9(4).
           02  IMIRATMF    PICTURE X.
           02  FILLER REDEFINES IMIRATMF.
             03 IMIRATMA    PICTURE X.
           02  IMIRATMI  PIC X(18).
           02  IMCALCML    COMP  PIC  S9(4).
           02  IMCALCMF    PICTURE X.
           02  FILLER REDEFINES IMCALCMF.
             03 IMCALCMA    PICTURE X.
           02  IMCALCMI  PIC X(1).
           02  IMPTRML    COMP  PIC  S9(4).
           02  IMPTRMF    PICTURE X.
           02  FILLER REDEFINES IMPTRMF.
             03 IMPTRMA    PICTURE X.
           02  IMPTRMI  PIC X(1).
           02  IMACRTML    COMP  PIC  S9(4).
           02  IMACRTMF    PICTURE X.
           02  FILLER REDEFINES IMACRTMF.
             03 IMACRTMA    PICTURE X.
           02  IMACRTMI  PIC X(1).
           02  IMATDYML    COMP  PIC  S9(4).
           02  IMATDYMF    PICTURE X.
           02  FILLER REDEFINES IMATDYMF.
             03 IMATDYMA    PICTURE X.
           02  IMATDYMI  PIC X(20).
           02  IMRTUSML    COMP  PIC  S9(4).
           02  IMRTUSMF    PICTURE X.
           02  FILLER REDEFINES IMRTUSMF.
             03 IMRTUSMA    PICTURE X.
           02  IMRTUSMI  PIC X(1).
           02  IMACTDML    COMP  PIC  S9(4).
           02  IMACTDMF    PICTURE X.
           02  FILLER REDEFINES IMACTDMF.
             03 IMACTDMA    PICTURE X.
           02  IMACTDMI  PIC X(20).
           02  IMMMDAML    COMP  PIC  S9(4).
           02  IMMMDAMF    PICTURE X.
           02  FILLER REDEFINES IMMMDAMF.
             03 IMMMDAMA    PICTURE X.
           02  IMMMDAMI  PIC X(1).
           02  IMAADJML    COMP  PIC  S9(4).
           02  IMAADJMF    PICTURE X.
           02  FILLER REDEFINES IMAADJMF.
             03 IMAADJMA    PICTURE X.
           02  IMAADJMI  PIC X(20).
           02  IMLIM1ML    COMP  PIC  S9(4).
           02  IMLIM1MF    PICTURE X.
           02  FILLER REDEFINES IMLIM1MF.
             03 IMLIM1MA    PICTURE X.
           02  IMLIM1MI  PIC X(16).
           02  IMDRT1ML    COMP  PIC  S9(4).
           02  IMDRT1MF    PICTURE X.
           02  FILLER REDEFINES IMDRT1MF.
             03 IMDRT1MA    PICTURE X.
           02  IMDRT1MI  PIC X(18).
           02  IMLIM2ML    COMP  PIC  S9(4).
           02  IMLIM2MF    PICTURE X.
           02  FILLER REDEFINES IMLIM2MF.
             03 IMLIM2MA    PICTURE X.
           02  IMLIM2MI  PIC X(16).
           02  IMDRT2ML    COMP  PIC  S9(4).
           02  IMDRT2MF    PICTURE X.
           02  FILLER REDEFINES IMDRT2MF.
             03 IMDRT2MA    PICTURE X.
           02  IMDRT2MI  PIC X(18).
           02  IMLIM3ML    COMP  PIC  S9(4).
           02  IMLIM3MF    PICTURE X.
           02  FILLER REDEFINES IMLIM3MF.
             03 IMLIM3MA    PICTURE X.
           02  IMLIM3MI  PIC X(16).
           02  IMDRT3ML    COMP  PIC  S9(4).
           02  IMDRT3MF    PICTURE X.
           02  FILLER REDEFINES IMDRT3MF.
             03 IMDRT3MA    PICTURE X.
           02  IMDRT3MI  PIC X(18).
           02  IMLIM4ML    COMP  PIC  S9(4).
           02  IMLIM4MF    PICTURE X.
           02  FILLER REDEFINES IMLIM4MF.
             03 IMLIM4MA    PICTURE X.
           02  IMLIM4MI  PIC X(16).
           02  IMDRT4ML    COMP  PIC  S9(4).
           02  IMDRT4MF    PICTURE X.
           02  FILLER REDEFINES IMDRT4MF.
             03 IMDRT4MA    PICTURE X.
           02  IMDRT4MI  PIC X(18).
           02  IMLIM5ML    COMP  PIC  S9(4).
           02  IMLIM5MF    PICTURE X.
           02  FILLER REDEFINES IMLIM5MF.
             03 IMLIM5MA    PICTURE X.
           02  IMLIM5MI  PIC X(16).
           02  IMDRT5ML    COMP  PIC  S9(4).
           02  IMDRT5MF    PICTURE X.
           02  FILLER REDEFINES IMDRT5MF.
             03 IMDRT5MA    PICTURE X.
           02  IMDRT5MI  PIC X(18).
           02  IMLIM6ML    COMP  PIC  S9(4).
           02  IMLIM6MF    PICTURE X.
           02  FILLER REDEFINES IMLIM6MF.
             03 IMLIM6MA    PICTURE X.
           02  IMLIM6MI  PIC X(16).
           02  IMDRT6ML    COMP  PIC  S9(4).
           02  IMDRT6MF    PICTURE X.
           02  FILLER REDEFINES IMDRT6MF.
             03 IMDRT6MA    PICTURE X.
           02  IMDRT6MI  PIC X(18).
           02  IMLIM7ML    COMP  PIC  S9(4).
           02  IMLIM7MF    PICTURE X.
           02  FILLER REDEFINES IMLIM7MF.
             03 IMLIM7MA    PICTURE X.
           02  IMLIM7MI  PIC X(16).
           02  IMDRT7ML    COMP  PIC  S9(4).
           02  IMDRT7MF    PICTURE X.
           02  FILLER REDEFINES IMDRT7MF.
             03 IMDRT7MA    PICTURE X.
           02  IMDRT7MI  PIC X(18).
           02  IMLIM8ML    COMP  PIC  S9(4).
           02  IMLIM8MF    PICTURE X.
           02  FILLER REDEFINES IMLIM8MF.
             03 IMLIM8MA    PICTURE X.
           02  IMLIM8MI  PIC X(16).
           02  IMDRT8ML    COMP  PIC  S9(4).
           02  IMDRT8MF    PICTURE X.
           02  FILLER REDEFINES IMDRT8MF.
             03 IMDRT8MA    PICTURE X.
           02  IMDRT8MI  PIC X(18).
           02  IMDRT9ML    COMP  PIC  S9(4).
           02  IMDRT9MF    PICTURE X.
           02  FILLER REDEFINES IMDRT9MF.
             03 IMDRT9MA    PICTURE X.
           02  IMDRT9MI  PIC X(18).
           02  IMPAGFML    COMP  PIC  S9(4).
           02  IMPAGFMF    PICTURE X.
           02  FILLER REDEFINES IMPAGFMF.
             03 IMPAGFMA    PICTURE X.
           02  IMPAGFMI  PIC X(19).
           02  IMPAGBML    COMP  PIC  S9(4).
           02  IMPAGBMF    PICTURE X.
           02  FILLER REDEFINES IMPAGBMF.
             03 IMPAGBMA    PICTURE X.
           02  IMPAGBMI  PIC X(19).
           02  IMPRMTML    COMP  PIC  S9(4).
           02  IMPRMTMF    PICTURE X.
           02  FILLER REDEFINES IMPRMTMF.
             03 IMPRMTMA    PICTURE X.
           02  IMPRMTMI  PIC X(22).
           02  IMERROML    COMP  PIC  S9(4).
           02  IMERROMF    PICTURE X.
           02  FILLER REDEFINES IMERROMF.
             03 IMERROMA    PICTURE X.
           02  IMERROMI  PIC X(79).
       01  FIIMIZMO REDEFINES FIIMIZMI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANMO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTITLMO  PIC X(39).
           02  FILLER PICTURE X(3).
           02  IMTIMEMO PIC 99B99B99.
           02  FILLER PICTURE X(3).
           02  IMPGNMO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMKEYMO  PIC X(26).
           02  FILLER PICTURE X(3).
           02  IMNAMEMO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMDTEMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMBALMO PIC Z(7)ZZZ,ZZ9.99-.
           02  FILLER PICTURE X(3).
           02  IMTNBRMO PIC ZZZ,ZZZ,ZZ9.
           02  FILLER PICTURE X(3).
           02  IMPRODMO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCHKIMO PIC ZZZ,ZZZ,ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCTDYMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMIRATMO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMCALCMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPTRMO PIC 9.
           02  FILLER PICTURE X(3).
           02  IMACRTMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMATDYMO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMRTUSMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMACTDMO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMMMDAMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAADJMO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMLIM1MO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMDRT1MO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMLIM2MO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMDRT2MO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMLIM3MO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMDRT3MO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMLIM4MO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMDRT4MO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMLIM5MO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMDRT5MO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMLIM6MO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMDRT6MO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMLIM7MO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMDRT7MO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMLIM8MO PIC Z(7),ZZZ,ZZ9-.
           02  FILLER PICTURE X(3).
           02  IMDRT8MO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMDRT9MO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMPAGFMO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMPAGBMO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMPRMTMO  PIC X(22).
           02  FILLER PICTURE X(3).
           02  IMERROMO  PIC X(79).
       01  FIIMIZPI REDEFINES FIIMIZOI.
           02  FILLER PIC X(12).
           02  IMTRANAL    COMP  PIC  S9(4).
           02  IMTRANAF    PICTURE X.
           02  FILLER REDEFINES IMTRANAF.
             03 IMTRANAA    PICTURE X.
           02  IMTRANAI  PIC X(4).
           02  IMDATEAL    COMP  PIC  S9(4).
           02  IMDATEAF    PICTURE X.
           02  FILLER REDEFINES IMDATEAF.
             03 IMDATEAA    PICTURE X.
           02  IMDATEAI  PIC X(8).
           02  IMTITLAL    COMP  PIC  S9(4).
           02  IMTITLAF    PICTURE X.
           02  FILLER REDEFINES IMTITLAF.
             03 IMTITLAA    PICTURE X.
           02  IMTITLAI  PIC X(37).
           02  IMTIMEAL    COMP  PIC  S9(4).
           02  IMTIMEAF    PICTURE X.
           02  FILLER REDEFINES IMTIMEAF.
             03 IMTIMEAA    PICTURE X.
           02  IMTIMEAI  PIC X(8).
           02  IMCTL2AL    COMP  PIC  S9(4).
           02  IMCTL2AF    PICTURE X.
           02  FILLER REDEFINES IMCTL2AF.
             03 IMCTL2AA    PICTURE X.
           02  IMCTL2AI  PIC X(3).
           02  IMCTL3AL    COMP  PIC  S9(4).
           02  IMCTL3AF    PICTURE X.
           02  FILLER REDEFINES IMCTL3AF.
             03 IMCTL3AA    PICTURE X.
           02  IMCTL3AI  PIC X(3).
           02  IMCTL4AL    COMP  PIC  S9(4).
           02  IMCTL4AF    PICTURE X.
           02  FILLER REDEFINES IMCTL4AF.
             03 IMCTL4AA    PICTURE X.
           02  IMCTL4AI  PIC X(4).
           02  IMACCTAL    COMP  PIC  S9(4).
           02  IMACCTAF    PICTURE X.
           02  FILLER REDEFINES IMACCTAF.
             03 IMACCTAA    PICTURE X.
           02  IMACCTAI  PIC X(10).
           02  IMBANKAL    COMP  PIC  S9(4).
           02  IMBANKAF    PICTURE X.
           02  FILLER REDEFINES IMBANKAF.
             03 IMBANKAA    PICTURE X.
           02  IMBANKAI  PIC X(2).
           02  IMSELCAL    COMP  PIC  S9(4).
           02  IMSELCAF    PICTURE X.
           02  FILLER REDEFINES IMSELCAF.
             03 IMSELCAA    PICTURE X.
           02  IMSELCAI  PIC X(1).
           02  IMERROAL    COMP  PIC  S9(4).
           02  IMERROAF    PICTURE X.
           02  FILLER REDEFINES IMERROAF.
             03 IMERROAA    PICTURE X.
           02  IMERROAI  PIC X(79).
       01  FIIMIZPO REDEFINES FIIMIZPI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTITLAO  PIC X(37).
           02  FILLER PICTURE X(3).
           02  IMTIMEAO PIC 99B99B99.
           02  FILLER PICTURE X(3).
           02  IMCTL2AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4AO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMBANKAO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSELCAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMERROAO  PIC X(79).
       01  FIIMIZII REDEFINES FIIMIZOI.
           02  FILLER PIC X(12).
           02  IMTRANIL    COMP  PIC  S9(4).
           02  IMTRANIF    PICTURE X.
           02  FILLER REDEFINES IMTRANIF.
             03 IMTRANIA    PICTURE X.
           02  IMTRANII  PIC X(4).
           02  IMDATEIL    COMP  PIC  S9(4).
           02  IMDATEIF    PICTURE X.
           02  FILLER REDEFINES IMDATEIF.
             03 IMDATEIA    PICTURE X.
           02  IMDATEII  PIC X(8).
           02  IMTITLIL    COMP  PIC  S9(4).
           02  IMTITLIF    PICTURE X.
           02  FILLER REDEFINES IMTITLIF.
             03 IMTITLIA    PICTURE X.
           02  IMTITLII  PIC X(37).
           02  IMTIMEIL    COMP  PIC  S9(4).
           02  IMTIMEIF    PICTURE X.
           02  FILLER REDEFINES IMTIMEIF.
             03 IMTIMEIA    PICTURE X.
           02  IMTIMEII  PIC X(8).
           02  IMPGNIL    COMP  PIC  S9(4).
           02  IMPGNIF    PICTURE X.
           02  FILLER REDEFINES IMPGNIF.
             03 IMPGNIA    PICTURE X.
           02  IMPGNII  PIC X(3).
           02  IMKEYIL    COMP  PIC  S9(4).
           02  IMKEYIF    PICTURE X.
           02  FILLER REDEFINES IMKEYIF.
             03 IMKEYIA    PICTURE X.
           02  IMKEYII  PIC X(26).
           02  IMNAMEIL    COMP  PIC  S9(4).
           02  IMNAMEIF    PICTURE X.
           02  FILLER REDEFINES IMNAMEIF.
             03 IMNAMEIA    PICTURE X.
           02  IMNAMEII  PIC X(13).
           02  IMDTEIL    COMP  PIC  S9(4).
           02  IMDTEIF    PICTURE X.
           02  FILLER REDEFINES IMDTEIF.
             03 IMDTEIA    PICTURE X.
           02  IMDTEII  PIC X(8).
           02  IMBALIL    COMP  PIC  S9(4).
           02  IMBALIF    PICTURE X.
           02  FILLER REDEFINES IMBALIF.
             03 IMBALIA    PICTURE X.
           02  IMBALII  PIC X(18).
           02  IMTNBRIL    COMP  PIC  S9(4).
           02  IMTNBRIF    PICTURE X.
           02  FILLER REDEFINES IMTNBRIF.
             03 IMTNBRIA    PICTURE X.
           02  IMTNBRII  PIC X(11).
           02  IMPRODIL    COMP  PIC  S9(4).
           02  IMPRODIF    PICTURE X.
           02  FILLER REDEFINES IMPRODIF.
             03 IMPRODIA    PICTURE X.
           02  IMPRODII  PIC X(3).
           02  IMCHKIIL    COMP  PIC  S9(4).
           02  IMCHKIIF    PICTURE X.
           02  FILLER REDEFINES IMCHKIIF.
             03 IMCHKIIA    PICTURE X.
           02  IMCHKIII  PIC X(11).
           02  IMCTDYIL    COMP  PIC  S9(4).
           02  IMCTDYIF    PICTURE X.
           02  FILLER REDEFINES IMCTDYIF.
             03 IMCTDYIA    PICTURE X.
           02  IMCTDYII  PIC X(1).
           02  IMIRATIL    COMP  PIC  S9(4).
           02  IMIRATIF    PICTURE X.
           02  FILLER REDEFINES IMIRATIF.
             03 IMIRATIA    PICTURE X.
           02  IMIRATII  PIC X(18).
           02  IMCALCIL    COMP  PIC  S9(4).
           02  IMCALCIF    PICTURE X.
           02  FILLER REDEFINES IMCALCIF.
             03 IMCALCIA    PICTURE X.
           02  IMCALCII  PIC X(1).
           02  IMPTRIL    COMP  PIC  S9(4).
           02  IMPTRIF    PICTURE X.
           02  FILLER REDEFINES IMPTRIF.
             03 IMPTRIA    PICTURE X.
           02  IMPTRII  PIC X(1).
           02  IMACRTIL    COMP  PIC  S9(4).
           02  IMACRTIF    PICTURE X.
           02  FILLER REDEFINES IMACRTIF.
             03 IMACRTIA    PICTURE X.
           02  IMACRTII  PIC X(1).
           02  IMATDYIL    COMP  PIC  S9(4).
           02  IMATDYIF    PICTURE X.
           02  FILLER REDEFINES IMATDYIF.
             03 IMATDYIA    PICTURE X.
           02  IMATDYII  PIC X(20).
           02  IMRTUSIL    COMP  PIC  S9(4).
           02  IMRTUSIF    PICTURE X.
           02  FILLER REDEFINES IMRTUSIF.
             03 IMRTUSIA    PICTURE X.
           02  IMRTUSII  PIC X(1).
           02  IMACTDIL    COMP  PIC  S9(4).
           02  IMACTDIF    PICTURE X.
           02  FILLER REDEFINES IMACTDIF.
             03 IMACTDIA    PICTURE X.
           02  IMACTDII  PIC X(20).
           02  IMMMDAIL    COMP  PIC  S9(4).
           02  IMMMDAIF    PICTURE X.
           02  FILLER REDEFINES IMMMDAIF.
             03 IMMMDAIA    PICTURE X.
           02  IMMMDAII  PIC X(1).
           02  IMAADJIL    COMP  PIC  S9(4).
           02  IMAADJIF    PICTURE X.
           02  FILLER REDEFINES IMAADJIF.
             03 IMAADJIA    PICTURE X.
           02  IMAADJII  PIC X(20).
           02  IMDRTEIL    COMP  PIC  S9(4).
           02  IMDRTEIF    PICTURE X.
           02  FILLER REDEFINES IMDRTEIF.
             03 IMDRTEIA    PICTURE X.
           02  IMDRTEII  PIC X(18).
           02  IMPAGFIL    COMP  PIC  S9(4).
           02  IMPAGFIF    PICTURE X.
           02  FILLER REDEFINES IMPAGFIF.
             03 IMPAGFIA    PICTURE X.
           02  IMPAGFII  PIC X(19).
           02  IMPAGBIL    COMP  PIC  S9(4).
           02  IMPAGBIF    PICTURE X.
           02  FILLER REDEFINES IMPAGBIF.
             03 IMPAGBIA    PICTURE X.
           02  IMPAGBII  PIC X(19).
           02  IMPRMTIL    COMP  PIC  S9(4).
           02  IMPRMTIF    PICTURE X.
           02  FILLER REDEFINES IMPRMTIF.
             03 IMPRMTIA    PICTURE X.
           02  IMPRMTII  PIC X(22).
           02  IMERROIL    COMP  PIC  S9(4).
           02  IMERROIF    PICTURE X.
           02  FILLER REDEFINES IMERROIF.
             03 IMERROIA    PICTURE X.
           02  IMERROII  PIC X(79).
       01  FIIMIZIO REDEFINES FIIMIZII.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANIO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEIO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTITLIO  PIC X(37).
           02  FILLER PICTURE X(3).
           02  IMTIMEIO PIC 99B99B99.
           02  FILLER PICTURE X(3).
           02  IMPGNIO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMKEYIO  PIC X(26).
           02  FILLER PICTURE X(3).
           02  IMNAMEIO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMDTEIO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMBALIO PIC Z(7)ZZZ,ZZ9.99-.
           02  FILLER PICTURE X(3).
           02  IMTNBRIO PIC ZZZ,ZZZ,ZZ9.
           02  FILLER PICTURE X(3).
           02  IMPRODIO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCHKIIO PIC ZZZ,ZZZ,ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCTDYIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMIRATIO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMCALCIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPTRIO PIC 9.
           02  FILLER PICTURE X(3).
           02  IMACRTIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMATDYIO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMRTUSIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMACTDIO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMMMDAIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAADJIO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMDRTEIO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMPAGFIO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMPAGBIO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMPRMTIO  PIC X(22).
           02  FILLER PICTURE X(3).
           02  IMERROIO  PIC X(79).
       01  FIIMIZSI REDEFINES FIIMIZOI.
           02  FILLER PIC X(12).
           02  IMTRANSL    COMP  PIC  S9(4).
           02  IMTRANSF    PICTURE X.
           02  FILLER REDEFINES IMTRANSF.
             03 IMTRANSA    PICTURE X.
           02  IMTRANSI  PIC X(4).
           02  IMDATESL    COMP  PIC  S9(4).
           02  IMDATESF    PICTURE X.
           02  FILLER REDEFINES IMDATESF.
             03 IMDATESA    PICTURE X.
           02  IMDATESI  PIC X(8).
           02  IMTITLSL    COMP  PIC  S9(4).
           02  IMTITLSF    PICTURE X.
           02  FILLER REDEFINES IMTITLSF.
             03 IMTITLSA    PICTURE X.
           02  IMTITLSI  PIC X(37).
           02  IMTIMESL    COMP  PIC  S9(4).
           02  IMTIMESF    PICTURE X.
           02  FILLER REDEFINES IMTIMESF.
             03 IMTIMESA    PICTURE X.
           02  IMTIMESI  PIC X(8).
           02  IMPGNSL    COMP  PIC  S9(4).
           02  IMPGNSF    PICTURE X.
           02  FILLER REDEFINES IMPGNSF.
             03 IMPGNSA    PICTURE X.
           02  IMPGNSI  PIC X(3).
           02  IMKEYSL    COMP  PIC  S9(4).
           02  IMKEYSF    PICTURE X.
           02  FILLER REDEFINES IMKEYSF.
             03 IMKEYSA    PICTURE X.
           02  IMKEYSI  PIC X(26).
           02  IMNAMESL    COMP  PIC  S9(4).
           02  IMNAMESF    PICTURE X.
           02  FILLER REDEFINES IMNAMESF.
             03 IMNAMESA    PICTURE X.
           02  IMNAMESI  PIC X(13).
           02  IMDTESL    COMP  PIC  S9(4).
           02  IMDTESF    PICTURE X.
           02  FILLER REDEFINES IMDTESF.
             03 IMDTESA    PICTURE X.
           02  IMDTESI  PIC X(8).
           02  IMBALSL    COMP  PIC  S9(4).
           02  IMBALSF    PICTURE X.
           02  FILLER REDEFINES IMBALSF.
             03 IMBALSA    PICTURE X.
           02  IMBALSI  PIC X(18).
           02  IMITRNSL    COMP  PIC  S9(4).
           02  IMITRNSF    PICTURE X.
           02  FILLER REDEFINES IMITRNSF.
             03 IMITRNSA    PICTURE X.
           02  IMITRNSI  PIC X(11).
           02  IMPRODSL    COMP  PIC  S9(4).
           02  IMPRODSF    PICTURE X.
           02  FILLER REDEFINES IMPRODSF.
             03 IMPRODSA    PICTURE X.
           02  IMPRODSI  PIC X(3).
           02  IMINELSL    COMP  PIC  S9(4).
           02  IMINELSF    PICTURE X.
           02  FILLER REDEFINES IMINELSF.
             03 IMINELSA    PICTURE X.
           02  IMINELSI  PIC X(18).
           02  IMPTRSL    COMP  PIC  S9(4).
           02  IMPTRSF    PICTURE X.
           02  FILLER REDEFINES IMPTRSF.
             03 IMPTRSA    PICTURE X.
           02  IMPTRSI  PIC X(1).
           02  IMCTDYSL    COMP  PIC  S9(4).
           02  IMCTDYSF    PICTURE X.
           02  FILLER REDEFINES IMCTDYSF.
             03 IMCTDYSA    PICTURE X.
           02  IMCTDYSI  PIC X(1).
           02  IMATDYSL    COMP  PIC  S9(4).
           02  IMATDYSF    PICTURE X.
           02  FILLER REDEFINES IMATDYSF.
             03 IMATDYSA    PICTURE X.
           02  IMATDYSI  PIC X(20).
           02  IMCALCSL    COMP  PIC  S9(4).
           02  IMCALCSF    PICTURE X.
           02  FILLER REDEFINES IMCALCSF.
             03 IMCALCSA    PICTURE X.
           02  IMCALCSI  PIC X(1).
           02  IMACTDSL    COMP  PIC  S9(4).
           02  IMACTDSF    PICTURE X.
           02  FILLER REDEFINES IMACTDSF.
             03 IMACTDSA    PICTURE X.
           02  IMACTDSI  PIC X(20).
           02  IMCMAUSL    COMP  PIC  S9(4).
           02  IMCMAUSF    PICTURE X.
           02  FILLER REDEFINES IMCMAUSF.
             03 IMCMAUSA    PICTURE X.
           02  IMCMAUSI  PIC X(1).
           02  IMAADJSL    COMP  PIC  S9(4).
           02  IMAADJSF    PICTURE X.
           02  FILLER REDEFINES IMAADJSF.
             03 IMAADJSA    PICTURE X.
           02  IMAADJSI  PIC X(20).
           02  IMDRTESL    COMP  PIC  S9(4).
           02  IMDRTESF    PICTURE X.
           02  FILLER REDEFINES IMDRTESF.
             03 IMDRTESA    PICTURE X.
           02  IMDRTESI  PIC X(18).
           02  IMPAGFSL    COMP  PIC  S9(4).
           02  IMPAGFSF    PICTURE X.
           02  FILLER REDEFINES IMPAGFSF.
             03 IMPAGFSA    PICTURE X.
           02  IMPAGFSI  PIC X(19).
           02  IMPAGBSL    COMP  PIC  S9(4).
           02  IMPAGBSF    PICTURE X.
           02  FILLER REDEFINES IMPAGBSF.
             03 IMPAGBSA    PICTURE X.
           02  IMPAGBSI  PIC X(19).
           02  IMPRMTSL    COMP  PIC  S9(4).
           02  IMPRMTSF    PICTURE X.
           02  FILLER REDEFINES IMPRMTSF.
             03 IMPRMTSA    PICTURE X.
           02  IMPRMTSI  PIC X(22).
           02  IMERROSL    COMP  PIC  S9(4).
           02  IMERROSF    PICTURE X.
           02  FILLER REDEFINES IMERROSF.
             03 IMERROSA    PICTURE X.
           02  IMERROSI  PIC X(79).
       01  FIIMIZSO REDEFINES FIIMIZSI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANSO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATESO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTITLSO  PIC X(37).
           02  FILLER PICTURE X(3).
           02  IMTIMESO PIC 99B99B99.
           02  FILLER PICTURE X(3).
           02  IMPGNSO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMKEYSO  PIC X(26).
           02  FILLER PICTURE X(3).
           02  IMNAMESO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMDTESO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMBALSO PIC Z(7)ZZZ,ZZ9.99-.
           02  FILLER PICTURE X(3).
           02  IMITRNSO PIC ZZZ,ZZZ,ZZ9.
           02  FILLER PICTURE X(3).
           02  IMPRODSO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMINELSO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMPTRSO PIC 9.
           02  FILLER PICTURE X(3).
           02  IMCTDYSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMATDYSO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMCALCSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMACTDSO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMCMAUSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAADJSO PIC Z(8),ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  IMDRTESO PIC .9(17).
           02  FILLER PICTURE X(3).
           02  IMPAGFSO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMPAGBSO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  IMPRMTSO  PIC X(22).
           02  FILLER PICTURE X(3).
           02  IMERROSO  PIC X(79).