       01  FIIMI5AO.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(2).
           02  IMTRANA    PICTURE X.
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMDATEA    PICTURE X.
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTIMEA    PICTURE X.
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMPGNOA    PICTURE X.
           02  IMPGNOO  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMKEYA    PICTURE X.
           02  IMKEYO  PIC X(26).
           02  FILLER PICTURE X(2).
           02  IMSHCT2A    PICTURE X.
           02  IMSHCT2O  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMSHCT3A    PICTURE X.
           02  IMSHCT3O  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMSHCT4A    PICTURE X.
           02  IMSHCT4O  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMSHACTA    PICTURE X.
           02  IMSHACTO  PIC X(10).
           02  IMSHNQ1D OCCURS 16 TIMES.
             03  FILLER PICTURE X(2).
             03  IMSHNQ1A    PICTURE X.
             03  IMSHNQ1O  PIC X(79).
           02  FILLER PICTURE X(2).
           02  IMPAGEFA    PICTURE X.
           02  IMPAGEFO  PIC X(19).
           02  FILLER PICTURE X(2).
           02  IMPAGEBA    PICTURE X.
           02  IMPAGEBO  PIC X(19).
           02  FILLER PICTURE X(2).
           02  IMERRORA    PICTURE X.
           02  IMERRORO  PIC X(79).