       01  FIIMIXAO.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(2).
           02  IMTRANA    PICTURE X.
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMDATEA    PICTURE X.
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTIMEA    PICTURE X.
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMKEYA    PICTURE X.
           02  IMKEYO  PIC X(23).
           02  FILLER PICTURE X(2).
           02  IMNAMEA    PICTURE X.
           02  IMNAMEO  PIC X(13).
           02  FILLER PICTURE X(2).
           02  IMSCF01A    PICTURE X.
           02  IMSCF01O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM01A    PICTURE X.
           02  IMSCM01O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF10A    PICTURE X.
           02  IMSCF10O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM10A    PICTURE X.
           02  IMSCM10O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF18A    PICTURE X.
           02  IMSCF18O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM18A    PICTURE X.
           02  IMSCM18O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF02A    PICTURE X.
           02  IMSCF02O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM02A    PICTURE X.
           02  IMSCM02O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF11A    PICTURE X.
           02  IMSCF11O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM11A    PICTURE X.
           02  IMSCM11O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF19A    PICTURE X.
           02  IMSCF19O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM19A    PICTURE X.
           02  IMSCM19O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF03A    PICTURE X.
           02  IMSCF03O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM03A    PICTURE X.
           02  IMSCM03O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF12A    PICTURE X.
           02  IMSCF12O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM12A    PICTURE X.
           02  IMSCM12O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF20A    PICTURE X.
           02  IMSCF20O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM20A    PICTURE X.
           02  IMSCM20O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF04A    PICTURE X.
           02  IMSCF04O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM04A    PICTURE X.
           02  IMSCM04O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF13A    PICTURE X.
           02  IMSCF13O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM13A    PICTURE X.
           02  IMSCM13O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF21A    PICTURE X.
           02  IMSCF21O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM21A    PICTURE X.
           02  IMSCM21O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF05A    PICTURE X.
           02  IMSCF05O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM05A    PICTURE X.
           02  IMSCM05O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF14A    PICTURE X.
           02  IMSCF14O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM14A    PICTURE X.
           02  IMSCM14O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF22A    PICTURE X.
           02  IMSCF22O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM22A    PICTURE X.
           02  IMSCM22O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF06A    PICTURE X.
           02  IMSCF06O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM06A    PICTURE X.
           02  IMSCM06O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF15A    PICTURE X.
           02  IMSCF15O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM15A    PICTURE X.
           02  IMSCM15O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF23A    PICTURE X.
           02  IMSCF23O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM23A    PICTURE X.
           02  IMSCM23O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF07A    PICTURE X.
           02  IMSCF07O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM07A    PICTURE X.
           02  IMSCM07O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF16A    PICTURE X.
           02  IMSCF16O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM16A    PICTURE X.
           02  IMSCM16O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF24A    PICTURE X.
           02  IMSCF24O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM24A    PICTURE X.
           02  IMSCM24O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF08A    PICTURE X.
           02  IMSCF08O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM08A    PICTURE X.
           02  IMSCM08O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF17A    PICTURE X.
           02  IMSCF17O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM17A    PICTURE X.
           02  IMSCM17O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF25A    PICTURE X.
           02  IMSCF25O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM25A    PICTURE X.
           02  IMSCM25O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCF09A    PICTURE X.
           02  IMSCF09O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSCM09A    PICTURE X.
           02  IMSCM09O  PIC X(18).
           02  FILLER PICTURE X(2).
           02  IMSCCLIA    PICTURE X.
           02  IMSCCLIO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCMLIA    PICTURE X.
           02  IMSCMLIO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCCFIA    PICTURE X.
           02  IMSCCFIO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCMFIA    PICTURE X.
           02  IMSCMFIO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCCLBA    PICTURE X.
           02  IMSCCLBO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCMLBA    PICTURE X.
           02  IMSCMLBO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCCNPA    PICTURE X.
           02  IMSCCNPO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCMNPA    PICTURE X.
           02  IMSCMNPO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCCHSA    PICTURE X.
           02  IMSCCHSO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCMHSA    PICTURE X.
           02  IMSCMHSO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCCLSA    PICTURE X.
           02  IMSCCLSO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCMLSA    PICTURE X.
           02  IMSCMLSO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSCCCDA    PICTURE X.
           02  IMSCCCDO  PIC Z(12)9.
           02  FILLER PICTURE X(2).
           02  IMSCMCDA    PICTURE X.
           02  IMSCMCDO  PIC Z(12)9.
           02  FILLER PICTURE X(2).
           02  IMSCCNAA    PICTURE X.
           02  IMSCCNAO  PIC Z(12)9.
           02  FILLER PICTURE X(2).
           02  IMSCMNAA    PICTURE X.
           02  IMSCMNAO  PIC Z(12)9.
           02  FILLER PICTURE X(2).
           02  IMSCCCEA    PICTURE X.
           02  IMSCCCEO  PIC Z(12)9.
           02  FILLER PICTURE X(2).
           02  IMERRORA    PICTURE X.
           02  IMERRORO  PIC X(79).