       01  FIIM12AI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMCNTL2L    COMP  PIC  S9(4).
           02  IMCNTL2F    PICTURE X.
           02  FILLER REDEFINES IMCNTL2F.
             03 IMCNTL2A    PICTURE X.
           02  IMCNTL2I  PIC X(3).
           02  IMCNTL3L    COMP  PIC  S9(4).
           02  IMCNTL3F    PICTURE X.
           02  FILLER REDEFINES IMCNTL3F.
             03 IMCNTL3A    PICTURE X.
           02  IMCNTL3I  PIC X(3).
           02  IMCNTL4L    COMP  PIC  S9(4).
           02  IMCNTL4F    PICTURE X.
           02  FILLER REDEFINES IMCNTL4F.
             03 IMCNTL4A    PICTURE X.
           02  IMCNTL4I  PIC X(4).
           02  IMACCTL    COMP  PIC  S9(4).
           02  IMACCTF    PICTURE X.
           02  FILLER REDEFINES IMACCTF.
             03 IMACCTA    PICTURE X.
           02  IMACCTI  PIC X(10).
           02  IMAPP01L    COMP  PIC  S9(4).
           02  IMAPP01F    PICTURE X.
           02  FILLER REDEFINES IMAPP01F.
             03 IMAPP01A    PICTURE X.
           02  IMAPP01I  PIC X(2).
           02  IMCTL01L    COMP  PIC  S9(4).
           02  IMCTL01F    PICTURE X.
           02  FILLER REDEFINES IMCTL01F.
             03 IMCTL01A    PICTURE X.
           02  IMCTL01I  PIC X(35).
           02  IMFLG01L    COMP  PIC  S9(4).
           02  IMFLG01F    PICTURE X.
           02  FILLER REDEFINES IMFLG01F.
             03 IMFLG01A    PICTURE X.
           02  IMFLG01I  PIC X(1).
           02  IMCST01L    COMP  PIC  S9(4).
           02  IMCST01F    PICTURE X.
           02  FILLER REDEFINES IMCST01F.
             03 IMCST01A    PICTURE X.
           02  IMCST01I  PIC X(1).
           02  IMAPP02L    COMP  PIC  S9(4).
           02  IMAPP02F    PICTURE X.
           02  FILLER REDEFINES IMAPP02F.
             03 IMAPP02A    PICTURE X.
           02  IMAPP02I  PIC X(2).
           02  IMCTL02L    COMP  PIC  S9(4).
           02  IMCTL02F    PICTURE X.
           02  FILLER REDEFINES IMCTL02F.
             03 IMCTL02A    PICTURE X.
           02  IMCTL02I  PIC X(35).
           02  IMFLG02L    COMP  PIC  S9(4).
           02  IMFLG02F    PICTURE X.
           02  FILLER REDEFINES IMFLG02F.
             03 IMFLG02A    PICTURE X.
           02  IMFLG02I  PIC X(1).
           02  IMCST02L    COMP  PIC  S9(4).
           02  IMCST02F    PICTURE X.
           02  FILLER REDEFINES IMCST02F.
             03 IMCST02A    PICTURE X.
           02  IMCST02I  PIC X(1).
           02  IMAPP03L    COMP  PIC  S9(4).
           02  IMAPP03F    PICTURE X.
           02  FILLER REDEFINES IMAPP03F.
             03 IMAPP03A    PICTURE X.
           02  IMAPP03I  PIC X(2).
           02  IMCTL03L    COMP  PIC  S9(4).
           02  IMCTL03F    PICTURE X.
           02  FILLER REDEFINES IMCTL03F.
             03 IMCTL03A    PICTURE X.
           02  IMCTL03I  PIC X(35).
           02  IMFLG03L    COMP  PIC  S9(4).
           02  IMFLG03F    PICTURE X.
           02  FILLER REDEFINES IMFLG03F.
             03 IMFLG03A    PICTURE X.
           02  IMFLG03I  PIC X(1).
           02  IMCST03L    COMP  PIC  S9(4).
           02  IMCST03F    PICTURE X.
           02  FILLER REDEFINES IMCST03F.
             03 IMCST03A    PICTURE X.
           02  IMCST03I  PIC X(1).
           02  IMAPP04L    COMP  PIC  S9(4).
           02  IMAPP04F    PICTURE X.
           02  FILLER REDEFINES IMAPP04F.
             03 IMAPP04A    PICTURE X.
           02  IMAPP04I  PIC X(2).
           02  IMCTL04L    COMP  PIC  S9(4).
           02  IMCTL04F    PICTURE X.
           02  FILLER REDEFINES IMCTL04F.
             03 IMCTL04A    PICTURE X.
           02  IMCTL04I  PIC X(35).
           02  IMFLG04L    COMP  PIC  S9(4).
           02  IMFLG04F    PICTURE X.
           02  FILLER REDEFINES IMFLG04F.
             03 IMFLG04A    PICTURE X.
           02  IMFLG04I  PIC X(1).
           02  IMCST04L    COMP  PIC  S9(4).
           02  IMCST04F    PICTURE X.
           02  FILLER REDEFINES IMCST04F.
             03 IMCST04A    PICTURE X.
           02  IMCST04I  PIC X(1).
           02  IMAPP05L    COMP  PIC  S9(4).
           02  IMAPP05F    PICTURE X.
           02  FILLER REDEFINES IMAPP05F.
             03 IMAPP05A    PICTURE X.
           02  IMAPP05I  PIC X(2).
           02  IMCTL05L    COMP  PIC  S9(4).
           02  IMCTL05F    PICTURE X.
           02  FILLER REDEFINES IMCTL05F.
             03 IMCTL05A    PICTURE X.
           02  IMCTL05I  PIC X(35).
           02  IMFLG05L    COMP  PIC  S9(4).
           02  IMFLG05F    PICTURE X.
           02  FILLER REDEFINES IMFLG05F.
             03 IMFLG05A    PICTURE X.
           02  IMFLG05I  PIC X(1).
           02  IMCST05L    COMP  PIC  S9(4).
           02  IMCST05F    PICTURE X.
           02  FILLER REDEFINES IMCST05F.
             03 IMCST05A    PICTURE X.
           02  IMCST05I  PIC X(1).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIM12AO REDEFINES FIIM12AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMCNTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMAPP01O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMCTL01O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMFLG01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCST01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAPP02O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMCTL02O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMFLG02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCST02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAPP03O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMCTL03O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMFLG03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCST03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAPP04O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMCTL04O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMFLG04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCST04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAPP05O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMCTL05O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMFLG05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCST05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).