       01  FIIM51AI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMCNTL2L    COMP  PIC  S9(4).
           02  IMCNTL2F    PICTURE X.
           02  FILLER REDEFINES IMCNTL2F.
             03 IMCNTL2A    PICTURE X.
           02  IMCNTL2I  PIC X(3).
           02  IMCNTL3L    COMP  PIC  S9(4).
           02  IMCNTL3F    PICTURE X.
           02  FILLER REDEFINES IMCNTL3F.
             03 IMCNTL3A    PICTURE X.
           02  IMCNTL3I  PIC X(3).
           02  IMCNTL4L    COMP  PIC  S9(4).
           02  IMCNTL4F    PICTURE X.
           02  FILLER REDEFINES IMCNTL4F.
             03 IMCNTL4A    PICTURE X.
           02  IMCNTL4I  PIC X(4).
           02  IMACCTL    COMP  PIC  S9(4).
           02  IMACCTF    PICTURE X.
           02  FILLER REDEFINES IMACCTF.
             03 IMACCTA    PICTURE X.
           02  IMACCTI  PIC X(10).
           02  IMECODEL    COMP  PIC  S9(4).
           02  IMECODEF    PICTURE X.
           02  FILLER REDEFINES IMECODEF.
             03 IMECODEA    PICTURE X.
           02  IMECODEI  PIC X(2).
           02  IMEBATCL    COMP  PIC  S9(4).
           02  IMEBATCF    PICTURE X.
           02  FILLER REDEFINES IMEBATCF.
             03 IMEBATCA    PICTURE X.
           02  IMEBATCI  PIC X(4).
           02  IMTRCE1L    COMP  PIC  S9(4).
           02  IMTRCE1F    PICTURE X.
           02  FILLER REDEFINES IMTRCE1F.
             03 IMTRCE1A    PICTURE X.
           02  IMTRCE1I  PIC X(7).
           02  IMDAY1L    COMP  PIC  S9(4).
           02  IMDAY1F    PICTURE X.
           02  FILLER REDEFINES IMDAY1F.
             03 IMDAY1A    PICTURE X.
           02  IMDAY1I  PIC X(2).
           02  IMAMT1L    COMP  PIC  S9(4).
           02  IMAMT1F    PICTURE X.
           02  FILLER REDEFINES IMAMT1F.
             03 IMAMT1A    PICTURE X.
           02  IMAMT1I  PIC X(16).
           02  IMRSNL    COMP  PIC  S9(4).
           02  IMRSNF    PICTURE X.
           02  FILLER REDEFINES IMRSNF.
             03 IMRSNA    PICTURE X.
           02  IMRSNI  PIC X(1).
           02  IMDAY2L    COMP  PIC  S9(4).
           02  IMDAY2F    PICTURE X.
           02  FILLER REDEFINES IMDAY2F.
             03 IMDAY2A    PICTURE X.
           02  IMDAY2I  PIC X(2).
           02  IMAMT2L    COMP  PIC  S9(4).
           02  IMAMT2F    PICTURE X.
           02  FILLER REDEFINES IMAMT2F.
             03 IMAMT2A    PICTURE X.
           02  IMAMT2I  PIC X(16).
           02  IMDAY3L    COMP  PIC  S9(4).
           02  IMDAY3F    PICTURE X.
           02  FILLER REDEFINES IMDAY3F.
             03 IMDAY3A    PICTURE X.
           02  IMDAY3I  PIC X(2).
           02  IMAMT3L    COMP  PIC  S9(4).
           02  IMAMT3F    PICTURE X.
           02  FILLER REDEFINES IMAMT3F.
             03 IMAMT3A    PICTURE X.
           02  IMAMT3I  PIC X(16).
           02  IMACODEL    COMP  PIC  S9(4).
           02  IMACODEF    PICTURE X.
           02  FILLER REDEFINES IMACODEF.
             03 IMACODEA    PICTURE X.
           02  IMACODEI  PIC X(2).
           02  IMATYPEL    COMP  PIC  S9(4).
           02  IMATYPEF    PICTURE X.
           02  FILLER REDEFINES IMATYPEF.
             03 IMATYPEA    PICTURE X.
           02  IMATYPEI  PIC X(1).
           02  IMADAYSL    COMP  PIC  S9(4).
           02  IMADAYSF    PICTURE X.
           02  FILLER REDEFINES IMADAYSF.
             03 IMADAYSA    PICTURE X.
           02  IMADAYSI  PIC X(2).
           02  IMAAMTL    COMP  PIC  S9(4).
           02  IMAAMTF    PICTURE X.
           02  FILLER REDEFINES IMAAMTF.
             03 IMAAMTA    PICTURE X.
           02  IMAAMTI  PIC X(16).
           02  IMADATEL    COMP  PIC  S9(4).
           02  IMADATEF    PICTURE X.
           02  FILLER REDEFINES IMADATEF.
             03 IMADATEA    PICTURE X.
           02  IMADATEI  PIC X(6).
           02  IMADWKL    COMP  PIC  S9(4).
           02  IMADWKF    PICTURE X.
           02  FILLER REDEFINES IMADWKF.
             03 IMADWKA    PICTURE X.
           02  IMADWKI  PIC X(1).
           02  IMAHLDYL    COMP  PIC  S9(4).
           02  IMAHLDYF    PICTURE X.
           02  FILLER REDEFINES IMAHLDYF.
             03 IMAHLDYA    PICTURE X.
           02  IMAHLDYI  PIC X(1).
           02  IMABATCL    COMP  PIC  S9(4).
           02  IMABATCF    PICTURE X.
           02  FILLER REDEFINES IMABATCF.
             03 IMABATCA    PICTURE X.
           02  IMABATCI  PIC X(4).
           02  IMTRCE2L    COMP  PIC  S9(4).
           02  IMTRCE2F    PICTURE X.
           02  FILLER REDEFINES IMTRCE2F.
             03 IMTRCE2A    PICTURE X.
           02  IMTRCE2I  PIC X(7).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIM51AO REDEFINES FIIM51AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMCNTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMECODEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEBATCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMTRCE1O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMDAY1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAMT1O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMRSNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMDAY2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAMT2O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMDAY3O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAMT3O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMACODEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMATYPEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMADAYSO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAAMTO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMADATEO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMADWKO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAHLDYO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMABATCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMTRCE2O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).