       01  FIIMIJAO.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(2).
           02  IMTRANA    PICTURE X.
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMDATEA    PICTURE X.
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTIMEA    PICTURE X.
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMKEYA    PICTURE X.
           02  IMKEYO  PIC X(23).
           02  FILLER PICTURE X(2).
           02  IMACCTA    PICTURE X.
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(2).
           02  IMNAMEA    PICTURE X.
           02  IMNAMEO  PIC X(13).
           02  FILLER PICTURE X(2).
           02  IMLBALAA    PICTURE X.
           02  IMLBALAO  PIC Z(12)9.
           02  FILLER PICTURE X(2).
           02  IMCALCFA    PICTURE X.
           02  IMCALCFO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMOD1DTA    PICTURE X.
           02  IMOD1DTO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMOD1TPA    PICTURE X.
           02  IMOD1TPO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMCOLLFA    PICTURE X.
           02  IMCOLLFO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMOD2DTA    PICTURE X.
           02  IMOD2DTO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMOD2TPA    PICTURE X.
           02  IMOD2TPO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMASTATA    PICTURE X.
           02  IMASTATO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMOD3DTA    PICTURE X.
           02  IMOD3DTO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMOD3TPA    PICTURE X.
           02  IMOD3TPO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMNACCAA    PICTURE X.
           02  IMNACCAO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMOD4DTA    PICTURE X.
           02  IMOD4DTO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMOD4TPA    PICTURE X.
           02  IMOD4TPO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMNACDTA    PICTURE X.
           02  IMNACDTO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMOD5DTA    PICTURE X.
           02  IMOD5DTO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMOD5TPA    PICTURE X.
           02  IMOD5TPO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMNUMODA    PICTURE X.
           02  IMNUMODO  PIC ZZ9.
           02  FILLER PICTURE X(2).
           02  IMOD6DTA    PICTURE X.
           02  IMOD6DTO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMOD6TPA    PICTURE X.
           02  IMOD6TPO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMODALLA    PICTURE X.
           02  IMODALLO  PIC Z(12)9.
           02  FILLER PICTURE X(2).
           02  IMODEXPA    PICTURE X.
           02  IMODEXPO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMNPR1A    PICTURE X.
           02  IMNPR1O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMNAM1A    PICTURE X.
           02  IMNAM1O  PIC Z(12)9.
           02  FILLER PICTURE X(2).
           02  IMACP1A    PICTURE X.
           02  IMACP1O  PIC 9.99.
           02  FILLER PICTURE X(2).
           02  IMSPR1A    PICTURE X.
           02  IMSPR1O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSAM1A    PICTURE X.
           02  IMSAM1O  PIC Z(12)9.
           02  FILLER PICTURE X(2).
           02  IMERRORA    PICTURE X.
           02  IMERRORO  PIC X(79).