       01  FIIM03AI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMCNTL2L    COMP  PIC  S9(4).
           02  IMCNTL2F    PICTURE X.
           02  FILLER REDEFINES IMCNTL2F.
             03 IMCNTL2A    PICTURE X.
           02  IMCNTL2I  PIC X(3).
           02  IMCNTL3L    COMP  PIC  S9(4).
           02  IMCNTL3F    PICTURE X.
           02  FILLER REDEFINES IMCNTL3F.
             03 IMCNTL3A    PICTURE X.
           02  IMCNTL3I  PIC X(3).
           02  IMCNTL4L    COMP  PIC  S9(4).
           02  IMCNTL4F    PICTURE X.
           02  FILLER REDEFINES IMCNTL4F.
             03 IMCNTL4A    PICTURE X.
           02  IMCNTL4I  PIC X(4).
           02  IMACCTL    COMP  PIC  S9(4).
           02  IMACCTF    PICTURE X.
           02  FILLER REDEFINES IMACCTF.
             03 IMACCTA    PICTURE X.
           02  IMACCTI  PIC X(10).
           02  IMNAMEL    COMP  PIC  S9(4).
           02  IMNAMEF    PICTURE X.
           02  FILLER REDEFINES IMNAMEF.
             03 IMNAMEA    PICTURE X.
           02  IMNAMEI  PIC X(40).
           02  IMCRQNML    COMP  PIC  S9(4).
           02  IMCRQNMF    PICTURE X.
           02  FILLER REDEFINES IMCRQNMF.
             03 IMCRQNMA    PICTURE X.
           02  IMCRQNMI  PIC X(1).
           02  IMADDRL    COMP  PIC  S9(4).
           02  IMADDRF    PICTURE X.
           02  FILLER REDEFINES IMADDRF.
             03 IMADDRA    PICTURE X.
           02  IMADDRI  PIC X(40).
           02  IMCRQADL    COMP  PIC  S9(4).
           02  IMCRQADF    PICTURE X.
           02  FILLER REDEFINES IMCRQADF.
             03 IMCRQADA    PICTURE X.
           02  IMCRQADI  PIC X(1).
           02  IMCTYSTL    COMP  PIC  S9(4).
           02  IMCTYSTF    PICTURE X.
           02  FILLER REDEFINES IMCTYSTF.
             03 IMCTYSTA    PICTURE X.
           02  IMCTYSTI  PIC X(30).
           02  IMZIPL    COMP  PIC  S9(4).
           02  IMZIPF    PICTURE X.
           02  FILLER REDEFINES IMZIPF.
             03 IMZIPA    PICTURE X.
           02  IMZIPI  PIC X(10).
           02  IMCRQCSL    COMP  PIC  S9(4).
           02  IMCRQCSF    PICTURE X.
           02  FILLER REDEFINES IMCRQCSF.
             03 IMCRQCSA    PICTURE X.
           02  IMCRQCSI  PIC X(1).
           02  IMFORADL    COMP  PIC  S9(4).
           02  IMFORADF    PICTURE X.
           02  FILLER REDEFINES IMFORADF.
             03 IMFORADA    PICTURE X.
           02  IMFORADI  PIC X(1).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIM03AO REDEFINES FIIM03AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMCNTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMNAMEO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMCRQNMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMADDRO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMCRQADO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCTYSTO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  IMZIPO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMCRQCSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFORADO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).