       01  FIIM18AI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMCNTL2L    COMP  PIC  S9(4).
           02  IMCNTL2F    PICTURE X.
           02  FILLER REDEFINES IMCNTL2F.
             03 IMCNTL2A    PICTURE X.
           02  IMCNTL2I  PIC X(3).
           02  IMCNTL3L    COMP  PIC  S9(4).
           02  IMCNTL3F    PICTURE X.
           02  FILLER REDEFINES IMCNTL3F.
             03 IMCNTL3A    PICTURE X.
           02  IMCNTL3I  PIC X(3).
           02  IMCNTL4L    COMP  PIC  S9(4).
           02  IMCNTL4F    PICTURE X.
           02  FILLER REDEFINES IMCNTL4F.
             03 IMCNTL4A    PICTURE X.
           02  IMCNTL4I  PIC X(4).
           02  IMACCTL    COMP  PIC  S9(4).
           02  IMACCTF    PICTURE X.
           02  FILLER REDEFINES IMACCTF.
             03 IMACCTA    PICTURE X.
           02  IMACCTI  PIC X(10).
           02  IMFLD01L    COMP  PIC  S9(4).
           02  IMFLD01F    PICTURE X.
           02  FILLER REDEFINES IMFLD01F.
             03 IMFLD01A    PICTURE X.
           02  IMFLD01I  PIC X(1).
           02  IMFLD02L    COMP  PIC  S9(4).
           02  IMFLD02F    PICTURE X.
           02  FILLER REDEFINES IMFLD02F.
             03 IMFLD02A    PICTURE X.
           02  IMFLD02I  PIC X(1).
           02  IMFLD03L    COMP  PIC  S9(4).
           02  IMFLD03F    PICTURE X.
           02  FILLER REDEFINES IMFLD03F.
             03 IMFLD03A    PICTURE X.
           02  IMFLD03I  PIC X(1).
           02  IMFLD04L    COMP  PIC  S9(4).
           02  IMFLD04F    PICTURE X.
           02  FILLER REDEFINES IMFLD04F.
             03 IMFLD04A    PICTURE X.
           02  IMFLD04I  PIC X(1).
           02  IMFLD05L    COMP  PIC  S9(4).
           02  IMFLD05F    PICTURE X.
           02  FILLER REDEFINES IMFLD05F.
             03 IMFLD05A    PICTURE X.
           02  IMFLD05I  PIC X(1).
           02  IMFLD06L    COMP  PIC  S9(4).
           02  IMFLD06F    PICTURE X.
           02  FILLER REDEFINES IMFLD06F.
             03 IMFLD06A    PICTURE X.
           02  IMFLD06I  PIC X(1).
           02  IMFLD07L    COMP  PIC  S9(4).
           02  IMFLD07F    PICTURE X.
           02  FILLER REDEFINES IMFLD07F.
             03 IMFLD07A    PICTURE X.
           02  IMFLD07I  PIC X(1).
           02  IMFLD08L    COMP  PIC  S9(4).
           02  IMFLD08F    PICTURE X.
           02  FILLER REDEFINES IMFLD08F.
             03 IMFLD08A    PICTURE X.
           02  IMFLD08I  PIC X(1).
           02  IMFLD09L    COMP  PIC  S9(4).
           02  IMFLD09F    PICTURE X.
           02  FILLER REDEFINES IMFLD09F.
             03 IMFLD09A    PICTURE X.
           02  IMFLD09I  PIC X(1).
           02  IMFLD10L    COMP  PIC  S9(4).
           02  IMFLD10F    PICTURE X.
           02  FILLER REDEFINES IMFLD10F.
             03 IMFLD10A    PICTURE X.
           02  IMFLD10I  PIC X(1).
           02  IMFLD11L    COMP  PIC  S9(4).
           02  IMFLD11F    PICTURE X.
           02  FILLER REDEFINES IMFLD11F.
             03 IMFLD11A    PICTURE X.
           02  IMFLD11I  PIC X(1).
           02  IMFLD12L    COMP  PIC  S9(4).
           02  IMFLD12F    PICTURE X.
           02  FILLER REDEFINES IMFLD12F.
             03 IMFLD12A    PICTURE X.
           02  IMFLD12I  PIC X(1).
           02  IMFLD13L    COMP  PIC  S9(4).
           02  IMFLD13F    PICTURE X.
           02  FILLER REDEFINES IMFLD13F.
             03 IMFLD13A    PICTURE X.
           02  IMFLD13I  PIC X(1).
           02  IMFLD14L    COMP  PIC  S9(4).
           02  IMFLD14F    PICTURE X.
           02  FILLER REDEFINES IMFLD14F.
             03 IMFLD14A    PICTURE X.
           02  IMFLD14I  PIC X(1).
           02  IMFLD15L    COMP  PIC  S9(4).
           02  IMFLD15F    PICTURE X.
           02  FILLER REDEFINES IMFLD15F.
             03 IMFLD15A    PICTURE X.
           02  IMFLD15I  PIC X(1).
           02  IMFLD16L    COMP  PIC  S9(4).
           02  IMFLD16F    PICTURE X.
           02  FILLER REDEFINES IMFLD16F.
             03 IMFLD16A    PICTURE X.
           02  IMFLD16I  PIC X(1).
           02  IMFLD17L    COMP  PIC  S9(4).
           02  IMFLD17F    PICTURE X.
           02  FILLER REDEFINES IMFLD17F.
             03 IMFLD17A    PICTURE X.
           02  IMFLD17I  PIC X(1).
           02  IMFLD18L    COMP  PIC  S9(4).
           02  IMFLD18F    PICTURE X.
           02  FILLER REDEFINES IMFLD18F.
             03 IMFLD18A    PICTURE X.
           02  IMFLD18I  PIC X(1).
           02  IMFLD19L    COMP  PIC  S9(4).
           02  IMFLD19F    PICTURE X.
           02  FILLER REDEFINES IMFLD19F.
             03 IMFLD19A    PICTURE X.
           02  IMFLD19I  PIC X(1).
           02  IMFLD20L    COMP  PIC  S9(4).
           02  IMFLD20F    PICTURE X.
           02  FILLER REDEFINES IMFLD20F.
             03 IMFLD20A    PICTURE X.
           02  IMFLD20I  PIC X(1).
           02  IMFLD21L    COMP  PIC  S9(4).
           02  IMFLD21F    PICTURE X.
           02  FILLER REDEFINES IMFLD21F.
             03 IMFLD21A    PICTURE X.
           02  IMFLD21I  PIC X(1).
           02  IMFLD22L    COMP  PIC  S9(4).
           02  IMFLD22F    PICTURE X.
           02  FILLER REDEFINES IMFLD22F.
             03 IMFLD22A    PICTURE X.
           02  IMFLD22I  PIC X(1).
           02  IMFLD23L    COMP  PIC  S9(4).
           02  IMFLD23F    PICTURE X.
           02  FILLER REDEFINES IMFLD23F.
             03 IMFLD23A    PICTURE X.
           02  IMFLD23I  PIC X(1).
           02  IMFLD24L    COMP  PIC  S9(4).
           02  IMFLD24F    PICTURE X.
           02  FILLER REDEFINES IMFLD24F.
             03 IMFLD24A    PICTURE X.
           02  IMFLD24I  PIC X(1).
           02  IMFLD25L    COMP  PIC  S9(4).
           02  IMFLD25F    PICTURE X.
           02  FILLER REDEFINES IMFLD25F.
             03 IMFLD25A    PICTURE X.
           02  IMFLD25I  PIC X(1).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIM18AO REDEFINES FIIM18AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMCNTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMFLD01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD14O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD15O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD16O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD17O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD18O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD19O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD20O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD21O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD23O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD24O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD25O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).