       01  FIPSEPAI.
           02  FILLER PIC X(12).
           02  PSTRANL    COMP  PIC  S9(4).
           02  PSTRANF    PICTURE X.
           02  FILLER REDEFINES PSTRANF.
             03 PSTRANA    PICTURE X.
           02  PSTRANI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSCTL1L    COMP  PIC  S9(4).
           02  PSCTL1F    PICTURE X.
           02  FILLER REDEFINES PSCTL1F.
             03 PSCTL1A    PICTURE X.
           02  PSCTL1I  PIC X(2).
           02  PSCTL2L    COMP  PIC  S9(4).
           02  PSCTL2F    PICTURE X.
           02  FILLER REDEFINES PSCTL2F.
             03 PSCTL2A    PICTURE X.
           02  PSCTL2I  PIC X(3).
           02  PSCTL3L    COMP  PIC  S9(4).
           02  PSCTL3F    PICTURE X.
           02  FILLER REDEFINES PSCTL3F.
             03 PSCTL3A    PICTURE X.
           02  PSCTL3I  PIC X(3).
           02  PSCTL4L    COMP  PIC  S9(4).
           02  PSCTL4F    PICTURE X.
           02  FILLER REDEFINES PSCTL4F.
             03 PSCTL4A    PICTURE X.
           02  PSCTL4I  PIC X(4).
           02  PSPRODL    COMP  PIC  S9(4).
           02  PSPRODF    PICTURE X.
           02  FILLER REDEFINES PSPRODF.
             03 PSPRODA    PICTURE X.
           02  PSPRODI  PIC X(3).
           02  PSACTL    COMP  PIC  S9(4).
           02  PSACTF    PICTURE X.
           02  FILLER REDEFINES PSACTF.
             03 PSACTA    PICTURE X.
           02  PSACTI  PIC X(1).
           02  PSDESCL    COMP  PIC  S9(4).
           02  PSDESCF    PICTURE X.
           02  FILLER REDEFINES PSDESCF.
             03 PSDESCA    PICTURE X.
           02  PSDESCI  PIC X(6).
           02  PSSOURL    COMP  PIC  S9(4).
           02  PSSOURF    PICTURE X.
           02  FILLER REDEFINES PSSOURF.
             03 PSSOURA    PICTURE X.
           02  PSSOURI  PIC X(2).
           02  PSSOURVL    COMP  PIC  S9(4).
           02  PSSOURVF    PICTURE X.
           02  FILLER REDEFINES PSSOURVF.
             03 PSSOURVA    PICTURE X.
           02  PSSOURVI  PIC X(24).
           02  PSCATL    COMP  PIC  S9(4).
           02  PSCATF    PICTURE X.
           02  FILLER REDEFINES PSCATF.
             03 PSCATA    PICTURE X.
           02  PSCATI  PIC X(1).
           02  PSCATVL    COMP  PIC  S9(4).
           02  PSCATVF    PICTURE X.
           02  FILLER REDEFINES PSCATVF.
             03 PSCATVA    PICTURE X.
           02  PSCATVI  PIC X(24).
           02  PSDECDL    COMP  PIC  S9(4).
           02  PSDECDF    PICTURE X.
           02  FILLER REDEFINES PSDECDF.
             03 PSDECDA    PICTURE X.
           02  PSDECDI  PIC X(1).
           02  PSDECDVL    COMP  PIC  S9(4).
           02  PSDECDVF    PICTURE X.
           02  FILLER REDEFINES PSDECDVF.
             03 PSDECDVA    PICTURE X.
           02  PSDECDVI  PIC X(24).
           02  PSDECLL    COMP  PIC  S9(4).
           02  PSDECLF    PICTURE X.
           02  FILLER REDEFINES PSDECLF.
             03 PSDECLA    PICTURE X.
           02  PSDECLI  PIC X(1).
           02  PSDECLVL    COMP  PIC  S9(4).
           02  PSDECLVF    PICTURE X.
           02  FILLER REDEFINES PSDECLVF.
             03 PSDECLVA    PICTURE X.
           02  PSDECLVI  PIC X(24).
           02  PSTIML    COMP  PIC  S9(4).
           02  PSTIMF    PICTURE X.
           02  FILLER REDEFINES PSTIMF.
             03 PSTIMA    PICTURE X.
           02  PSTIMI  PIC X(1).
           02  PSTIMVL    COMP  PIC  S9(4).
           02  PSTIMVF    PICTURE X.
           02  FILLER REDEFINES PSTIMVF.
             03 PSTIMVA    PICTURE X.
           02  PSTIMVI  PIC X(24).
           02  PSLOANL    COMP  PIC  S9(4).
           02  PSLOANF    PICTURE X.
           02  FILLER REDEFINES PSLOANF.
             03 PSLOANA    PICTURE X.
           02  PSLOANI  PIC X(1).
           02  PSLOANVL    COMP  PIC  S9(4).
           02  PSLOANVF    PICTURE X.
           02  FILLER REDEFINES PSLOANVF.
             03 PSLOANVA    PICTURE X.
           02  PSLOANVI  PIC X(24).
           02  PSRERTL    COMP  PIC  S9(4).
           02  PSRERTF    PICTURE X.
           02  FILLER REDEFINES PSRERTF.
             03 PSRERTA    PICTURE X.
           02  PSRERTI  PIC X(2).
           02  PSRERTVL    COMP  PIC  S9(4).
           02  PSRERTVF    PICTURE X.
           02  FILLER REDEFINES PSRERTVF.
             03 PSRERTVA    PICTURE X.
           02  PSRERTVI  PIC X(10).
           02  PSEXRTL    COMP  PIC  S9(4).
           02  PSEXRTF    PICTURE X.
           02  FILLER REDEFINES PSEXRTF.
             03 PSEXRTA    PICTURE X.
           02  PSEXRTI  PIC X(2).
           02  PSEXRTVL    COMP  PIC  S9(4).
           02  PSEXRTVF    PICTURE X.
           02  FILLER REDEFINES PSEXRTVF.
             03 PSEXRTVA    PICTURE X.
           02  PSEXRTVI  PIC X(10).
           02  PSCORTL    COMP  PIC  S9(4).
           02  PSCORTF    PICTURE X.
           02  FILLER REDEFINES PSCORTF.
             03 PSCORTA    PICTURE X.
           02  PSCORTI  PIC X(1).
           02  PSCORTVL    COMP  PIC  S9(4).
           02  PSCORTVF    PICTURE X.
           02  FILLER REDEFINES PSCORTVF.
             03 PSCORTVA    PICTURE X.
           02  PSCORTVI  PIC X(10).
           02  PSCOML    COMP  PIC  S9(4).
           02  PSCOMF    PICTURE X.
           02  FILLER REDEFINES PSCOMF.
             03 PSCOMA    PICTURE X.
           02  PSCOMI  PIC X(1).
           02  PSCOMVL    COMP  PIC  S9(4).
           02  PSCOMVF    PICTURE X.
           02  FILLER REDEFINES PSCOMVF.
             03 PSCOMVA    PICTURE X.
           02  PSCOMVI  PIC X(10).
           02  PSLOSSL    COMP  PIC  S9(4).
           02  PSLOSSF    PICTURE X.
           02  FILLER REDEFINES PSLOSSF.
             03 PSLOSSA    PICTURE X.
           02  PSLOSSI  PIC X(1).
           02  PSLOSSVL    COMP  PIC  S9(4).
           02  PSLOSSVF    PICTURE X.
           02  FILLER REDEFINES PSLOSSVF.
             03 PSLOSSVA    PICTURE X.
           02  PSLOSSVI  PIC X(10).
           02  PSALLOL    COMP  PIC  S9(4).
           02  PSALLOF    PICTURE X.
           02  FILLER REDEFINES PSALLOF.
             03 PSALLOA    PICTURE X.
           02  PSALLOI  PIC X(1).
           02  PSALLOVL    COMP  PIC  S9(4).
           02  PSALLOVF    PICTURE X.
           02  FILLER REDEFINES PSALLOVF.
             03 PSALLOVA    PICTURE X.
           02  PSALLOVI  PIC X(10).
           02  PSFDCSL    COMP  PIC  S9(4).
           02  PSFDCSF    PICTURE X.
           02  FILLER REDEFINES PSFDCSF.
             03 PSFDCSA    PICTURE X.
           02  PSFDCSI  PIC X(10).
           02  PSTPPHL    COMP  PIC  S9(4).
           02  PSTPPHF    PICTURE X.
           02  FILLER REDEFINES PSTPPHF.
             03 PSTPPHA    PICTURE X.
           02  PSTPPHI  PIC X(8).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPSEPAO REDEFINES FIPSEPAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSPRODO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDESCO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSSOURO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSSOURVO  PIC X(24).
           02  FILLER PICTURE X(3).
           02  PSCATO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSCATVO  PIC X(24).
           02  FILLER PICTURE X(3).
           02  PSDECDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDECDVO  PIC X(24).
           02  FILLER PICTURE X(3).
           02  PSDECLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDECLVO  PIC X(24).
           02  FILLER PICTURE X(3).
           02  PSTIMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSTIMVO  PIC X(24).
           02  FILLER PICTURE X(3).
           02  PSLOANO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSLOANVO  PIC X(24).
           02  FILLER PICTURE X(3).
           02  PSRERTO PIC Z9.
           02  FILLER PICTURE X(3).
           02  PSRERTVO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSEXRTO PIC Z9.
           02  FILLER PICTURE X(3).
           02  PSEXRTVO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCORTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSCORTVO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCOMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSCOMVO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSLOSSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSLOSSVO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSALLOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSALLOVO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSFDCSO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSTPPHO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).