       01  FIPSI6AI.
           02  FILLER PIC X(12).
           02  PSTRIDL    COMP  PIC  S9(4).
           02  PSTRIDF    PICTURE X.
           02  FILLER REDEFINES PSTRIDF.
             03 PSTRIDA    PICTURE X.
           02  PSTRIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSPRFTL    COMP  PIC  S9(4).
           02  PSPRFTF    PICTURE X.
           02  FILLER REDEFINES PSPRFTF.
             03 PSPRFTA    PICTURE X.
           02  PSPRFTI  PIC X(10).
           02  PSHSDTL    COMP  PIC  S9(4).
           02  PSHSDTF    PICTURE X.
           02  FILLER REDEFINES PSHSDTF.
             03 PSHSDTA    PICTURE X.
           02  PSHSDTI  PIC X(5).
           02  PSNAMEL    COMP  PIC  S9(4).
           02  PSNAMEF    PICTURE X.
           02  FILLER REDEFINES PSNAMEF.
             03 PSNAMEA    PICTURE X.
           02  PSNAMEI  PIC X(25).
           02  PSKEYL    COMP  PIC  S9(4).
           02  PSKEYF    PICTURE X.
           02  FILLER REDEFINES PSKEYF.
             03 PSKEYA    PICTURE X.
           02  PSKEYI  PIC X(23).
           02  PSDAT01L    COMP  PIC  S9(4).
           02  PSDAT01F    PICTURE X.
           02  FILLER REDEFINES PSDAT01F.
             03 PSDAT01A    PICTURE X.
           02  PSDAT01I  PIC X(5).
           02  PSAM101L    COMP  PIC  S9(4).
           02  PSAM101F    PICTURE X.
           02  FILLER REDEFINES PSAM101F.
             03 PSAM101A    PICTURE X.
           02  PSAM101I  PIC X(10).
           02  PSAM201L    COMP  PIC  S9(4).
           02  PSAM201F    PICTURE X.
           02  FILLER REDEFINES PSAM201F.
             03 PSAM201A    PICTURE X.
           02  PSAM201I  PIC X(14).
           02  PSAM301L    COMP  PIC  S9(4).
           02  PSAM301F    PICTURE X.
           02  FILLER REDEFINES PSAM301F.
             03 PSAM301A    PICTURE X.
           02  PSAM301I  PIC X(14).
           02  PSAM401L    COMP  PIC  S9(4).
           02  PSAM401F    PICTURE X.
           02  FILLER REDEFINES PSAM401F.
             03 PSAM401A    PICTURE X.
           02  PSAM401I  PIC X(14).
           02  PSAM601L    COMP  PIC  S9(4).
           02  PSAM601F    PICTURE X.
           02  FILLER REDEFINES PSAM601F.
             03 PSAM601A    PICTURE X.
           02  PSAM601I  PIC X(14).
           02  PSDAT02L    COMP  PIC  S9(4).
           02  PSDAT02F    PICTURE X.
           02  FILLER REDEFINES PSDAT02F.
             03 PSDAT02A    PICTURE X.
           02  PSDAT02I  PIC X(5).
           02  PSAM102L    COMP  PIC  S9(4).
           02  PSAM102F    PICTURE X.
           02  FILLER REDEFINES PSAM102F.
             03 PSAM102A    PICTURE X.
           02  PSAM102I  PIC X(10).
           02  PSAM202L    COMP  PIC  S9(4).
           02  PSAM202F    PICTURE X.
           02  FILLER REDEFINES PSAM202F.
             03 PSAM202A    PICTURE X.
           02  PSAM202I  PIC X(14).
           02  PSAM302L    COMP  PIC  S9(4).
           02  PSAM302F    PICTURE X.
           02  FILLER REDEFINES PSAM302F.
             03 PSAM302A    PICTURE X.
           02  PSAM302I  PIC X(14).
           02  PSAM402L    COMP  PIC  S9(4).
           02  PSAM402F    PICTURE X.
           02  FILLER REDEFINES PSAM402F.
             03 PSAM402A    PICTURE X.
           02  PSAM402I  PIC X(14).
           02  PSAM602L    COMP  PIC  S9(4).
           02  PSAM602F    PICTURE X.
           02  FILLER REDEFINES PSAM602F.
             03 PSAM602A    PICTURE X.
           02  PSAM602I  PIC X(14).
           02  PSDAT03L    COMP  PIC  S9(4).
           02  PSDAT03F    PICTURE X.
           02  FILLER REDEFINES PSDAT03F.
             03 PSDAT03A    PICTURE X.
           02  PSDAT03I  PIC X(5).
           02  PSAM103L    COMP  PIC  S9(4).
           02  PSAM103F    PICTURE X.
           02  FILLER REDEFINES PSAM103F.
             03 PSAM103A    PICTURE X.
           02  PSAM103I  PIC X(10).
           02  PSAM203L    COMP  PIC  S9(4).
           02  PSAM203F    PICTURE X.
           02  FILLER REDEFINES PSAM203F.
             03 PSAM203A    PICTURE X.
           02  PSAM203I  PIC X(14).
           02  PSAM303L    COMP  PIC  S9(4).
           02  PSAM303F    PICTURE X.
           02  FILLER REDEFINES PSAM303F.
             03 PSAM303A    PICTURE X.
           02  PSAM303I  PIC X(14).
           02  PSAM403L    COMP  PIC  S9(4).
           02  PSAM403F    PICTURE X.
           02  FILLER REDEFINES PSAM403F.
             03 PSAM403A    PICTURE X.
           02  PSAM403I  PIC X(14).
           02  PSAM603L    COMP  PIC  S9(4).
           02  PSAM603F    PICTURE X.
           02  FILLER REDEFINES PSAM603F.
             03 PSAM603A    PICTURE X.
           02  PSAM603I  PIC X(14).
           02  PSDAT04L    COMP  PIC  S9(4).
           02  PSDAT04F    PICTURE X.
           02  FILLER REDEFINES PSDAT04F.
             03 PSDAT04A    PICTURE X.
           02  PSDAT04I  PIC X(5).
           02  PSAM104L    COMP  PIC  S9(4).
           02  PSAM104F    PICTURE X.
           02  FILLER REDEFINES PSAM104F.
             03 PSAM104A    PICTURE X.
           02  PSAM104I  PIC X(10).
           02  PSAM204L    COMP  PIC  S9(4).
           02  PSAM204F    PICTURE X.
           02  FILLER REDEFINES PSAM204F.
             03 PSAM204A    PICTURE X.
           02  PSAM204I  PIC X(14).
           02  PSAM304L    COMP  PIC  S9(4).
           02  PSAM304F    PICTURE X.
           02  FILLER REDEFINES PSAM304F.
             03 PSAM304A    PICTURE X.
           02  PSAM304I  PIC X(14).
           02  PSAM404L    COMP  PIC  S9(4).
           02  PSAM404F    PICTURE X.
           02  FILLER REDEFINES PSAM404F.
             03 PSAM404A    PICTURE X.
           02  PSAM404I  PIC X(14).
           02  PSAM604L    COMP  PIC  S9(4).
           02  PSAM604F    PICTURE X.
           02  FILLER REDEFINES PSAM604F.
             03 PSAM604A    PICTURE X.
           02  PSAM604I  PIC X(14).
           02  PSDAT05L    COMP  PIC  S9(4).
           02  PSDAT05F    PICTURE X.
           02  FILLER REDEFINES PSDAT05F.
             03 PSDAT05A    PICTURE X.
           02  PSDAT05I  PIC X(5).
           02  PSAM105L    COMP  PIC  S9(4).
           02  PSAM105F    PICTURE X.
           02  FILLER REDEFINES PSAM105F.
             03 PSAM105A    PICTURE X.
           02  PSAM105I  PIC X(10).
           02  PSAM205L    COMP  PIC  S9(4).
           02  PSAM205F    PICTURE X.
           02  FILLER REDEFINES PSAM205F.
             03 PSAM205A    PICTURE X.
           02  PSAM205I  PIC X(14).
           02  PSAM305L    COMP  PIC  S9(4).
           02  PSAM305F    PICTURE X.
           02  FILLER REDEFINES PSAM305F.
             03 PSAM305A    PICTURE X.
           02  PSAM305I  PIC X(14).
           02  PSAM405L    COMP  PIC  S9(4).
           02  PSAM405F    PICTURE X.
           02  FILLER REDEFINES PSAM405F.
             03 PSAM405A    PICTURE X.
           02  PSAM405I  PIC X(14).
           02  PSAM605L    COMP  PIC  S9(4).
           02  PSAM605F    PICTURE X.
           02  FILLER REDEFINES PSAM605F.
             03 PSAM605A    PICTURE X.
           02  PSAM605I  PIC X(14).
           02  PSDAT06L    COMP  PIC  S9(4).
           02  PSDAT06F    PICTURE X.
           02  FILLER REDEFINES PSDAT06F.
             03 PSDAT06A    PICTURE X.
           02  PSDAT06I  PIC X(5).
           02  PSAM106L    COMP  PIC  S9(4).
           02  PSAM106F    PICTURE X.
           02  FILLER REDEFINES PSAM106F.
             03 PSAM106A    PICTURE X.
           02  PSAM106I  PIC X(10).
           02  PSAM206L    COMP  PIC  S9(4).
           02  PSAM206F    PICTURE X.
           02  FILLER REDEFINES PSAM206F.
             03 PSAM206A    PICTURE X.
           02  PSAM206I  PIC X(14).
           02  PSAM306L    COMP  PIC  S9(4).
           02  PSAM306F    PICTURE X.
           02  FILLER REDEFINES PSAM306F.
             03 PSAM306A    PICTURE X.
           02  PSAM306I  PIC X(14).
           02  PSAM406L    COMP  PIC  S9(4).
           02  PSAM406F    PICTURE X.
           02  FILLER REDEFINES PSAM406F.
             03 PSAM406A    PICTURE X.
           02  PSAM406I  PIC X(14).
           02  PSAM606L    COMP  PIC  S9(4).
           02  PSAM606F    PICTURE X.
           02  FILLER REDEFINES PSAM606F.
             03 PSAM606A    PICTURE X.
           02  PSAM606I  PIC X(14).
           02  PSDAT07L    COMP  PIC  S9(4).
           02  PSDAT07F    PICTURE X.
           02  FILLER REDEFINES PSDAT07F.
             03 PSDAT07A    PICTURE X.
           02  PSDAT07I  PIC X(5).
           02  PSAM107L    COMP  PIC  S9(4).
           02  PSAM107F    PICTURE X.
           02  FILLER REDEFINES PSAM107F.
             03 PSAM107A    PICTURE X.
           02  PSAM107I  PIC X(10).
           02  PSAM207L    COMP  PIC  S9(4).
           02  PSAM207F    PICTURE X.
           02  FILLER REDEFINES PSAM207F.
             03 PSAM207A    PICTURE X.
           02  PSAM207I  PIC X(14).
           02  PSAM307L    COMP  PIC  S9(4).
           02  PSAM307F    PICTURE X.
           02  FILLER REDEFINES PSAM307F.
             03 PSAM307A    PICTURE X.
           02  PSAM307I  PIC X(14).
           02  PSAM407L    COMP  PIC  S9(4).
           02  PSAM407F    PICTURE X.
           02  FILLER REDEFINES PSAM407F.
             03 PSAM407A    PICTURE X.
           02  PSAM407I  PIC X(14).
           02  PSAM607L    COMP  PIC  S9(4).
           02  PSAM607F    PICTURE X.
           02  FILLER REDEFINES PSAM607F.
             03 PSAM607A    PICTURE X.
           02  PSAM607I  PIC X(14).
           02  PSDAT08L    COMP  PIC  S9(4).
           02  PSDAT08F    PICTURE X.
           02  FILLER REDEFINES PSDAT08F.
             03 PSDAT08A    PICTURE X.
           02  PSDAT08I  PIC X(5).
           02  PSAM108L    COMP  PIC  S9(4).
           02  PSAM108F    PICTURE X.
           02  FILLER REDEFINES PSAM108F.
             03 PSAM108A    PICTURE X.
           02  PSAM108I  PIC X(10).
           02  PSAM208L    COMP  PIC  S9(4).
           02  PSAM208F    PICTURE X.
           02  FILLER REDEFINES PSAM208F.
             03 PSAM208A    PICTURE X.
           02  PSAM208I  PIC X(14).
           02  PSAM308L    COMP  PIC  S9(4).
           02  PSAM308F    PICTURE X.
           02  FILLER REDEFINES PSAM308F.
             03 PSAM308A    PICTURE X.
           02  PSAM308I  PIC X(14).
           02  PSAM408L    COMP  PIC  S9(4).
           02  PSAM408F    PICTURE X.
           02  FILLER REDEFINES PSAM408F.
             03 PSAM408A    PICTURE X.
           02  PSAM408I  PIC X(14).
           02  PSAM608L    COMP  PIC  S9(4).
           02  PSAM608F    PICTURE X.
           02  FILLER REDEFINES PSAM608F.
             03 PSAM608A    PICTURE X.
           02  PSAM608I  PIC X(14).
           02  PSDAT09L    COMP  PIC  S9(4).
           02  PSDAT09F    PICTURE X.
           02  FILLER REDEFINES PSDAT09F.
             03 PSDAT09A    PICTURE X.
           02  PSDAT09I  PIC X(5).
           02  PSAM109L    COMP  PIC  S9(4).
           02  PSAM109F    PICTURE X.
           02  FILLER REDEFINES PSAM109F.
             03 PSAM109A    PICTURE X.
           02  PSAM109I  PIC X(10).
           02  PSAM209L    COMP  PIC  S9(4).
           02  PSAM209F    PICTURE X.
           02  FILLER REDEFINES PSAM209F.
             03 PSAM209A    PICTURE X.
           02  PSAM209I  PIC X(14).
           02  PSAM309L    COMP  PIC  S9(4).
           02  PSAM309F    PICTURE X.
           02  FILLER REDEFINES PSAM309F.
             03 PSAM309A    PICTURE X.
           02  PSAM309I  PIC X(14).
           02  PSAM409L    COMP  PIC  S9(4).
           02  PSAM409F    PICTURE X.
           02  FILLER REDEFINES PSAM409F.
             03 PSAM409A    PICTURE X.
           02  PSAM409I  PIC X(14).
           02  PSAM609L    COMP  PIC  S9(4).
           02  PSAM609F    PICTURE X.
           02  FILLER REDEFINES PSAM609F.
             03 PSAM609A    PICTURE X.
           02  PSAM609I  PIC X(14).
           02  PSDAT10L    COMP  PIC  S9(4).
           02  PSDAT10F    PICTURE X.
           02  FILLER REDEFINES PSDAT10F.
             03 PSDAT10A    PICTURE X.
           02  PSDAT10I  PIC X(5).
           02  PSAM110L    COMP  PIC  S9(4).
           02  PSAM110F    PICTURE X.
           02  FILLER REDEFINES PSAM110F.
             03 PSAM110A    PICTURE X.
           02  PSAM110I  PIC X(10).
           02  PSAM210L    COMP  PIC  S9(4).
           02  PSAM210F    PICTURE X.
           02  FILLER REDEFINES PSAM210F.
             03 PSAM210A    PICTURE X.
           02  PSAM210I  PIC X(14).
           02  PSAM310L    COMP  PIC  S9(4).
           02  PSAM310F    PICTURE X.
           02  FILLER REDEFINES PSAM310F.
             03 PSAM310A    PICTURE X.
           02  PSAM310I  PIC X(14).
           02  PSAM410L    COMP  PIC  S9(4).
           02  PSAM410F    PICTURE X.
           02  FILLER REDEFINES PSAM410F.
             03 PSAM410A    PICTURE X.
           02  PSAM410I  PIC X(14).
           02  PSAM610L    COMP  PIC  S9(4).
           02  PSAM610F    PICTURE X.
           02  FILLER REDEFINES PSAM610F.
             03 PSAM610A    PICTURE X.
           02  PSAM610I  PIC X(14).
           02  PSDAT11L    COMP  PIC  S9(4).
           02  PSDAT11F    PICTURE X.
           02  FILLER REDEFINES PSDAT11F.
             03 PSDAT11A    PICTURE X.
           02  PSDAT11I  PIC X(5).
           02  PSAM111L    COMP  PIC  S9(4).
           02  PSAM111F    PICTURE X.
           02  FILLER REDEFINES PSAM111F.
             03 PSAM111A    PICTURE X.
           02  PSAM111I  PIC X(10).
           02  PSAM211L    COMP  PIC  S9(4).
           02  PSAM211F    PICTURE X.
           02  FILLER REDEFINES PSAM211F.
             03 PSAM211A    PICTURE X.
           02  PSAM211I  PIC X(14).
           02  PSAM311L    COMP  PIC  S9(4).
           02  PSAM311F    PICTURE X.
           02  FILLER REDEFINES PSAM311F.
             03 PSAM311A    PICTURE X.
           02  PSAM311I  PIC X(14).
           02  PSAM411L    COMP  PIC  S9(4).
           02  PSAM411F    PICTURE X.
           02  FILLER REDEFINES PSAM411F.
             03 PSAM411A    PICTURE X.
           02  PSAM411I  PIC X(14).
           02  PSAM611L    COMP  PIC  S9(4).
           02  PSAM611F    PICTURE X.
           02  FILLER REDEFINES PSAM611F.
             03 PSAM611A    PICTURE X.
           02  PSAM611I  PIC X(14).
           02  PSDAT12L    COMP  PIC  S9(4).
           02  PSDAT12F    PICTURE X.
           02  FILLER REDEFINES PSDAT12F.
             03 PSDAT12A    PICTURE X.
           02  PSDAT12I  PIC X(5).
           02  PSAM112L    COMP  PIC  S9(4).
           02  PSAM112F    PICTURE X.
           02  FILLER REDEFINES PSAM112F.
             03 PSAM112A    PICTURE X.
           02  PSAM112I  PIC X(10).
           02  PSAM212L    COMP  PIC  S9(4).
           02  PSAM212F    PICTURE X.
           02  FILLER REDEFINES PSAM212F.
             03 PSAM212A    PICTURE X.
           02  PSAM212I  PIC X(14).
           02  PSAM312L    COMP  PIC  S9(4).
           02  PSAM312F    PICTURE X.
           02  FILLER REDEFINES PSAM312F.
             03 PSAM312A    PICTURE X.
           02  PSAM312I  PIC X(14).
           02  PSAM412L    COMP  PIC  S9(4).
           02  PSAM412F    PICTURE X.
           02  FILLER REDEFINES PSAM412F.
             03 PSAM412A    PICTURE X.
           02  PSAM412I  PIC X(14).
           02  PSAM612L    COMP  PIC  S9(4).
           02  PSAM612F    PICTURE X.
           02  FILLER REDEFINES PSAM612F.
             03 PSAM612A    PICTURE X.
           02  PSAM612I  PIC X(14).
           02  PSAVG1L    COMP  PIC  S9(4).
           02  PSAVG1F    PICTURE X.
           02  FILLER REDEFINES PSAVG1F.
             03 PSAVG1A    PICTURE X.
           02  PSAVG1I  PIC X(10).
           02  PSAVG2L    COMP  PIC  S9(4).
           02  PSAVG2F    PICTURE X.
           02  FILLER REDEFINES PSAVG2F.
             03 PSAVG2A    PICTURE X.
           02  PSAVG2I  PIC X(14).
           02  PSAVG3L    COMP  PIC  S9(4).
           02  PSAVG3F    PICTURE X.
           02  FILLER REDEFINES PSAVG3F.
             03 PSAVG3A    PICTURE X.
           02  PSAVG3I  PIC X(14).
           02  PSAVG4L    COMP  PIC  S9(4).
           02  PSAVG4F    PICTURE X.
           02  FILLER REDEFINES PSAVG4F.
             03 PSAVG4A    PICTURE X.
           02  PSAVG4I  PIC X(14).
           02  PSAVG6L    COMP  PIC  S9(4).
           02  PSAVG6F    PICTURE X.
           02  FILLER REDEFINES PSAVG6F.
             03 PSAVG6A    PICTURE X.
           02  PSAVG6I  PIC X(14).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPSI6AO REDEFINES FIPSI6AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSPRFTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSHSDTO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSNAMEO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  PSKEYO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  PSDAT01O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM101O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM201O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM301O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM401O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM601O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT02O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM102O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM202O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM302O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM402O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM602O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT03O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM103O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM203O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM303O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM403O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM603O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT04O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM104O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM204O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM304O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM404O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM604O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT05O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM105O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM205O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM305O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM405O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM605O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT06O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM106O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM206O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM306O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM406O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM606O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT07O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM107O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM207O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM307O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM407O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM607O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT08O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM108O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM208O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM308O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM408O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM608O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT09O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM109O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM209O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM309O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM409O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM609O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT10O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM110O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM210O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM310O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM410O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM610O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT11O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM111O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM211O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM311O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM411O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM611O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSDAT12O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSAM112O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAM212O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM312O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM412O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAM612O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAVG1O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAVG2O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAVG3O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAVG4O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSAVG6O PIC Z(10).99-.
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).