       01  FIPS35AI.
           02  FILLER PIC X(12).
           02  PSTRIDL    COMP  PIC  S9(4).
           02  PSTRIDF    PICTURE X.
           02  FILLER REDEFINES PSTRIDF.
             03 PSTRIDA    PICTURE X.
           02  PSTRIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSCTL1L    COMP  PIC  S9(4).
           02  PSCTL1F    PICTURE X.
           02  FILLER REDEFINES PSCTL1F.
             03 PSCTL1A    PICTURE X.
           02  PSCTL1I  PIC X(2).
           02  PSCTL2L    COMP  PIC  S9(4).
           02  PSCTL2F    PICTURE X.
           02  FILLER REDEFINES PSCTL2F.
             03 PSCTL2A    PICTURE X.
           02  PSCTL2I  PIC X(3).
           02  PSCTL3L    COMP  PIC  S9(4).
           02  PSCTL3F    PICTURE X.
           02  FILLER REDEFINES PSCTL3F.
             03 PSCTL3A    PICTURE X.
           02  PSCTL3I  PIC X(3).
           02  PSCTL4L    COMP  PIC  S9(4).
           02  PSCTL4F    PICTURE X.
           02  FILLER REDEFINES PSCTL4F.
             03 PSCTL4A    PICTURE X.
           02  PSCTL4I  PIC X(4).
           02  PSPRFTL    COMP  PIC  S9(4).
           02  PSPRFTF    PICTURE X.
           02  FILLER REDEFINES PSPRFTF.
             03 PSPRFTA    PICTURE X.
           02  PSPRFTI  PIC X(10).
           02  PSAPPL1L    COMP  PIC  S9(4).
           02  PSAPPL1F    PICTURE X.
           02  FILLER REDEFINES PSAPPL1F.
             03 PSAPPL1A    PICTURE X.
           02  PSAPPL1I  PIC X(10).
           02  PSSRVC1L    COMP  PIC  S9(4).
           02  PSSRVC1F    PICTURE X.
           02  FILLER REDEFINES PSSRVC1F.
             03 PSSRVC1A    PICTURE X.
           02  PSSRVC1I  PIC X(3).
           02  PSAAMT1L    COMP  PIC  S9(4).
           02  PSAAMT1F    PICTURE X.
           02  FILLER REDEFINES PSAAMT1F.
             03 PSAAMT1A    PICTURE X.
           02  PSAAMT1I  PIC X(16).
           02  PSBAMT1L    COMP  PIC  S9(4).
           02  PSBAMT1F    PICTURE X.
           02  FILLER REDEFINES PSBAMT1F.
             03 PSBAMT1A    PICTURE X.
           02  PSBAMT1I  PIC X(16).
           02  PSUNIT1L    COMP  PIC  S9(4).
           02  PSUNIT1F    PICTURE X.
           02  FILLER REDEFINES PSUNIT1F.
             03 PSUNIT1A    PICTURE X.
           02  PSUNIT1I  PIC X(7).
           02  PSSDTE1L    COMP  PIC  S9(4).
           02  PSSDTE1F    PICTURE X.
           02  FILLER REDEFINES PSSDTE1F.
             03 PSSDTE1A    PICTURE X.
           02  PSSDTE1I  PIC X(6).
           02  PSFEE1L    COMP  PIC  S9(4).
           02  PSFEE1F    PICTURE X.
           02  FILLER REDEFINES PSFEE1F.
             03 PSFEE1A    PICTURE X.
           02  PSFEE1I  PIC X(1).
           02  PSDTS1L    COMP  PIC  S9(4).
           02  PSDTS1F    PICTURE X.
           02  FILLER REDEFINES PSDTS1F.
             03 PSDTS1A    PICTURE X.
           02  PSDTS1I  PIC X(6).
           02  PSAPPL2L    COMP  PIC  S9(4).
           02  PSAPPL2F    PICTURE X.
           02  FILLER REDEFINES PSAPPL2F.
             03 PSAPPL2A    PICTURE X.
           02  PSAPPL2I  PIC X(10).
           02  PSSRVC2L    COMP  PIC  S9(4).
           02  PSSRVC2F    PICTURE X.
           02  FILLER REDEFINES PSSRVC2F.
             03 PSSRVC2A    PICTURE X.
           02  PSSRVC2I  PIC X(3).
           02  PSAAMT2L    COMP  PIC  S9(4).
           02  PSAAMT2F    PICTURE X.
           02  FILLER REDEFINES PSAAMT2F.
             03 PSAAMT2A    PICTURE X.
           02  PSAAMT2I  PIC X(16).
           02  PSBAMT2L    COMP  PIC  S9(4).
           02  PSBAMT2F    PICTURE X.
           02  FILLER REDEFINES PSBAMT2F.
             03 PSBAMT2A    PICTURE X.
           02  PSBAMT2I  PIC X(16).
           02  PSUNIT2L    COMP  PIC  S9(4).
           02  PSUNIT2F    PICTURE X.
           02  FILLER REDEFINES PSUNIT2F.
             03 PSUNIT2A    PICTURE X.
           02  PSUNIT2I  PIC X(7).
           02  PSSDTE2L    COMP  PIC  S9(4).
           02  PSSDTE2F    PICTURE X.
           02  FILLER REDEFINES PSSDTE2F.
             03 PSSDTE2A    PICTURE X.
           02  PSSDTE2I  PIC X(6).
           02  PSFEE2L    COMP  PIC  S9(4).
           02  PSFEE2F    PICTURE X.
           02  FILLER REDEFINES PSFEE2F.
             03 PSFEE2A    PICTURE X.
           02  PSFEE2I  PIC X(1).
           02  PSDTS2L    COMP  PIC  S9(4).
           02  PSDTS2F    PICTURE X.
           02  FILLER REDEFINES PSDTS2F.
             03 PSDTS2A    PICTURE X.
           02  PSDTS2I  PIC X(6).
           02  PSAPPL3L    COMP  PIC  S9(4).
           02  PSAPPL3F    PICTURE X.
           02  FILLER REDEFINES PSAPPL3F.
             03 PSAPPL3A    PICTURE X.
           02  PSAPPL3I  PIC X(10).
           02  PSSRVC3L    COMP  PIC  S9(4).
           02  PSSRVC3F    PICTURE X.
           02  FILLER REDEFINES PSSRVC3F.
             03 PSSRVC3A    PICTURE X.
           02  PSSRVC3I  PIC X(3).
           02  PSAAMT3L    COMP  PIC  S9(4).
           02  PSAAMT3F    PICTURE X.
           02  FILLER REDEFINES PSAAMT3F.
             03 PSAAMT3A    PICTURE X.
           02  PSAAMT3I  PIC X(16).
           02  PSBAMT3L    COMP  PIC  S9(4).
           02  PSBAMT3F    PICTURE X.
           02  FILLER REDEFINES PSBAMT3F.
             03 PSBAMT3A    PICTURE X.
           02  PSBAMT3I  PIC X(16).
           02  PSUNIT3L    COMP  PIC  S9(4).
           02  PSUNIT3F    PICTURE X.
           02  FILLER REDEFINES PSUNIT3F.
             03 PSUNIT3A    PICTURE X.
           02  PSUNIT3I  PIC X(7).
           02  PSSDTE3L    COMP  PIC  S9(4).
           02  PSSDTE3F    PICTURE X.
           02  FILLER REDEFINES PSSDTE3F.
             03 PSSDTE3A    PICTURE X.
           02  PSSDTE3I  PIC X(6).
           02  PSFEE3L    COMP  PIC  S9(4).
           02  PSFEE3F    PICTURE X.
           02  FILLER REDEFINES PSFEE3F.
             03 PSFEE3A    PICTURE X.
           02  PSFEE3I  PIC X(1).
           02  PSDTS3L    COMP  PIC  S9(4).
           02  PSDTS3F    PICTURE X.
           02  FILLER REDEFINES PSDTS3F.
             03 PSDTS3A    PICTURE X.
           02  PSDTS3I  PIC X(6).
           02  PSAPPL4L    COMP  PIC  S9(4).
           02  PSAPPL4F    PICTURE X.
           02  FILLER REDEFINES PSAPPL4F.
             03 PSAPPL4A    PICTURE X.
           02  PSAPPL4I  PIC X(10).
           02  PSSRVC4L    COMP  PIC  S9(4).
           02  PSSRVC4F    PICTURE X.
           02  FILLER REDEFINES PSSRVC4F.
             03 PSSRVC4A    PICTURE X.
           02  PSSRVC4I  PIC X(3).
           02  PSAAMT4L    COMP  PIC  S9(4).
           02  PSAAMT4F    PICTURE X.
           02  FILLER REDEFINES PSAAMT4F.
             03 PSAAMT4A    PICTURE X.
           02  PSAAMT4I  PIC X(16).
           02  PSBAMT4L    COMP  PIC  S9(4).
           02  PSBAMT4F    PICTURE X.
           02  FILLER REDEFINES PSBAMT4F.
             03 PSBAMT4A    PICTURE X.
           02  PSBAMT4I  PIC X(16).
           02  PSUNIT4L    COMP  PIC  S9(4).
           02  PSUNIT4F    PICTURE X.
           02  FILLER REDEFINES PSUNIT4F.
             03 PSUNIT4A    PICTURE X.
           02  PSUNIT4I  PIC X(7).
           02  PSSDTE4L    COMP  PIC  S9(4).
           02  PSSDTE4F    PICTURE X.
           02  FILLER REDEFINES PSSDTE4F.
             03 PSSDTE4A    PICTURE X.
           02  PSSDTE4I  PIC X(6).
           02  PSFEE4L    COMP  PIC  S9(4).
           02  PSFEE4F    PICTURE X.
           02  FILLER REDEFINES PSFEE4F.
             03 PSFEE4A    PICTURE X.
           02  PSFEE4I  PIC X(1).
           02  PSDTS4L    COMP  PIC  S9(4).
           02  PSDTS4F    PICTURE X.
           02  FILLER REDEFINES PSDTS4F.
             03 PSDTS4A    PICTURE X.
           02  PSDTS4I  PIC X(6).
           02  PSAPPL5L    COMP  PIC  S9(4).
           02  PSAPPL5F    PICTURE X.
           02  FILLER REDEFINES PSAPPL5F.
             03 PSAPPL5A    PICTURE X.
           02  PSAPPL5I  PIC X(10).
           02  PSSRVC5L    COMP  PIC  S9(4).
           02  PSSRVC5F    PICTURE X.
           02  FILLER REDEFINES PSSRVC5F.
             03 PSSRVC5A    PICTURE X.
           02  PSSRVC5I  PIC X(3).
           02  PSAAMT5L    COMP  PIC  S9(4).
           02  PSAAMT5F    PICTURE X.
           02  FILLER REDEFINES PSAAMT5F.
             03 PSAAMT5A    PICTURE X.
           02  PSAAMT5I  PIC X(16).
           02  PSBAMT5L    COMP  PIC  S9(4).
           02  PSBAMT5F    PICTURE X.
           02  FILLER REDEFINES PSBAMT5F.
             03 PSBAMT5A    PICTURE X.
           02  PSBAMT5I  PIC X(16).
           02  PSUNIT5L    COMP  PIC  S9(4).
           02  PSUNIT5F    PICTURE X.
           02  FILLER REDEFINES PSUNIT5F.
             03 PSUNIT5A    PICTURE X.
           02  PSUNIT5I  PIC X(7).
           02  PSSDTE5L    COMP  PIC  S9(4).
           02  PSSDTE5F    PICTURE X.
           02  FILLER REDEFINES PSSDTE5F.
             03 PSSDTE5A    PICTURE X.
           02  PSSDTE5I  PIC X(6).
           02  PSFEE5L    COMP  PIC  S9(4).
           02  PSFEE5F    PICTURE X.
           02  FILLER REDEFINES PSFEE5F.
             03 PSFEE5A    PICTURE X.
           02  PSFEE5I  PIC X(1).
           02  PSDTS5L    COMP  PIC  S9(4).
           02  PSDTS5F    PICTURE X.
           02  FILLER REDEFINES PSDTS5F.
             03 PSDTS5A    PICTURE X.
           02  PSDTS5I  PIC X(6).
           02  PSAPPL6L    COMP  PIC  S9(4).
           02  PSAPPL6F    PICTURE X.
           02  FILLER REDEFINES PSAPPL6F.
             03 PSAPPL6A    PICTURE X.
           02  PSAPPL6I  PIC X(10).
           02  PSSRVC6L    COMP  PIC  S9(4).
           02  PSSRVC6F    PICTURE X.
           02  FILLER REDEFINES PSSRVC6F.
             03 PSSRVC6A    PICTURE X.
           02  PSSRVC6I  PIC X(3).
           02  PSAAMT6L    COMP  PIC  S9(4).
           02  PSAAMT6F    PICTURE X.
           02  FILLER REDEFINES PSAAMT6F.
             03 PSAAMT6A    PICTURE X.
           02  PSAAMT6I  PIC X(16).
           02  PSBAMT6L    COMP  PIC  S9(4).
           02  PSBAMT6F    PICTURE X.
           02  FILLER REDEFINES PSBAMT6F.
             03 PSBAMT6A    PICTURE X.
           02  PSBAMT6I  PIC X(16).
           02  PSUNIT6L    COMP  PIC  S9(4).
           02  PSUNIT6F    PICTURE X.
           02  FILLER REDEFINES PSUNIT6F.
             03 PSUNIT6A    PICTURE X.
           02  PSUNIT6I  PIC X(7).
           02  PSSDTE6L    COMP  PIC  S9(4).
           02  PSSDTE6F    PICTURE X.
           02  FILLER REDEFINES PSSDTE6F.
             03 PSSDTE6A    PICTURE X.
           02  PSSDTE6I  PIC X(6).
           02  PSFEE6L    COMP  PIC  S9(4).
           02  PSFEE6F    PICTURE X.
           02  FILLER REDEFINES PSFEE6F.
             03 PSFEE6A    PICTURE X.
           02  PSFEE6I  PIC X(1).
           02  PSDTS6L    COMP  PIC  S9(4).
           02  PSDTS6F    PICTURE X.
           02  FILLER REDEFINES PSDTS6F.
             03 PSDTS6A    PICTURE X.
           02  PSDTS6I  PIC X(6).
           02  PSAPPL7L    COMP  PIC  S9(4).
           02  PSAPPL7F    PICTURE X.
           02  FILLER REDEFINES PSAPPL7F.
             03 PSAPPL7A    PICTURE X.
           02  PSAPPL7I  PIC X(10).
           02  PSSRVC7L    COMP  PIC  S9(4).
           02  PSSRVC7F    PICTURE X.
           02  FILLER REDEFINES PSSRVC7F.
             03 PSSRVC7A    PICTURE X.
           02  PSSRVC7I  PIC X(3).
           02  PSAAMT7L    COMP  PIC  S9(4).
           02  PSAAMT7F    PICTURE X.
           02  FILLER REDEFINES PSAAMT7F.
             03 PSAAMT7A    PICTURE X.
           02  PSAAMT7I  PIC X(16).
           02  PSBAMT7L    COMP  PIC  S9(4).
           02  PSBAMT7F    PICTURE X.
           02  FILLER REDEFINES PSBAMT7F.
             03 PSBAMT7A    PICTURE X.
           02  PSBAMT7I  PIC X(16).
           02  PSUNIT7L    COMP  PIC  S9(4).
           02  PSUNIT7F    PICTURE X.
           02  FILLER REDEFINES PSUNIT7F.
             03 PSUNIT7A    PICTURE X.
           02  PSUNIT7I  PIC X(7).
           02  PSSDTE7L    COMP  PIC  S9(4).
           02  PSSDTE7F    PICTURE X.
           02  FILLER REDEFINES PSSDTE7F.
             03 PSSDTE7A    PICTURE X.
           02  PSSDTE7I  PIC X(6).
           02  PSFEE7L    COMP  PIC  S9(4).
           02  PSFEE7F    PICTURE X.
           02  FILLER REDEFINES PSFEE7F.
             03 PSFEE7A    PICTURE X.
           02  PSFEE7I  PIC X(1).
           02  PSDTS7L    COMP  PIC  S9(4).
           02  PSDTS7F    PICTURE X.
           02  FILLER REDEFINES PSDTS7F.
             03 PSDTS7A    PICTURE X.
           02  PSDTS7I  PIC X(6).
           02  PSAPPL8L    COMP  PIC  S9(4).
           02  PSAPPL8F    PICTURE X.
           02  FILLER REDEFINES PSAPPL8F.
             03 PSAPPL8A    PICTURE X.
           02  PSAPPL8I  PIC X(10).
           02  PSSRVC8L    COMP  PIC  S9(4).
           02  PSSRVC8F    PICTURE X.
           02  FILLER REDEFINES PSSRVC8F.
             03 PSSRVC8A    PICTURE X.
           02  PSSRVC8I  PIC X(3).
           02  PSAAMT8L    COMP  PIC  S9(4).
           02  PSAAMT8F    PICTURE X.
           02  FILLER REDEFINES PSAAMT8F.
             03 PSAAMT8A    PICTURE X.
           02  PSAAMT8I  PIC X(16).
           02  PSBAMT8L    COMP  PIC  S9(4).
           02  PSBAMT8F    PICTURE X.
           02  FILLER REDEFINES PSBAMT8F.
             03 PSBAMT8A    PICTURE X.
           02  PSBAMT8I  PIC X(16).
           02  PSUNIT8L    COMP  PIC  S9(4).
           02  PSUNIT8F    PICTURE X.
           02  FILLER REDEFINES PSUNIT8F.
             03 PSUNIT8A    PICTURE X.
           02  PSUNIT8I  PIC X(7).
           02  PSSDTE8L    COMP  PIC  S9(4).
           02  PSSDTE8F    PICTURE X.
           02  FILLER REDEFINES PSSDTE8F.
             03 PSSDTE8A    PICTURE X.
           02  PSSDTE8I  PIC X(6).
           02  PSFEE8L    COMP  PIC  S9(4).
           02  PSFEE8F    PICTURE X.
           02  FILLER REDEFINES PSFEE8F.
             03 PSFEE8A    PICTURE X.
           02  PSFEE8I  PIC X(1).
           02  PSDTS8L    COMP  PIC  S9(4).
           02  PSDTS8F    PICTURE X.
           02  FILLER REDEFINES PSDTS8F.
             03 PSDTS8A    PICTURE X.
           02  PSDTS8I  PIC X(6).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPS35AO REDEFINES FIPS35AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSPRFTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSAPPL1O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSSRVC1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSAAMT1O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSBAMT1O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSUNIT1O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  PSSDTE1O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSFEE1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDTS1O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSAPPL2O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSSRVC2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSAAMT2O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSBAMT2O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSUNIT2O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  PSSDTE2O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSFEE2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDTS2O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSAPPL3O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSSRVC3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSAAMT3O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSBAMT3O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSUNIT3O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  PSSDTE3O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSFEE3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDTS3O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSAPPL4O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSSRVC4O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSAAMT4O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSBAMT4O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSUNIT4O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  PSSDTE4O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSFEE4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDTS4O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSAPPL5O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSSRVC5O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSAAMT5O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSBAMT5O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSUNIT5O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  PSSDTE5O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSFEE5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDTS5O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSAPPL6O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSSRVC6O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSAAMT6O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSBAMT6O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSUNIT6O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  PSSDTE6O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSFEE6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDTS6O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSAPPL7O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSSRVC7O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSAAMT7O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSBAMT7O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSUNIT7O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  PSSDTE7O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSFEE7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDTS7O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSAPPL8O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSSRVC8O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSAAMT8O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSBAMT8O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  PSUNIT8O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  PSSDTE8O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSFEE8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSDTS8O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).