       01  FIPSRBAI.
           02  FILLER PIC X(12).
           02  FITRANL    COMP  PIC  S9(4).
           02  FITRANF    PICTURE X.
           02  FILLER REDEFINES FITRANF.
             03 FITRANA    PICTURE X.
           02  FITRANI  PIC X(4).
           02  FIDATEL    COMP  PIC  S9(4).
           02  FIDATEF    PICTURE X.
           02  FILLER REDEFINES FIDATEF.
             03 FIDATEA    PICTURE X.
           02  FIDATEI  PIC X(8).
           02  FITIMEL    COMP  PIC  S9(4).
           02  FITIMEF    PICTURE X.
           02  FILLER REDEFINES FITIMEF.
             03 FITIMEA    PICTURE X.
           02  FITIMEI  PIC X(8).
           02  FIPAGEL    COMP  PIC  S9(4).
           02  FIPAGEF    PICTURE X.
           02  FILLER REDEFINES FIPAGEF.
             03 FIPAGEA    PICTURE X.
           02  FIPAGEI  PIC X(4).
           02  FIPAGNL    COMP  PIC  S9(4).
           02  FIPAGNF    PICTURE X.
           02  FILLER REDEFINES FIPAGNF.
             03 FIPAGNA    PICTURE X.
           02  FIPAGNI  PIC X(3).
           02  FICTL1L    COMP  PIC  S9(4).
           02  FICTL1F    PICTURE X.
           02  FILLER REDEFINES FICTL1F.
             03 FICTL1A    PICTURE X.
           02  FICTL1I  PIC X(2).
           02  FICTL2L    COMP  PIC  S9(4).
           02  FICTL2F    PICTURE X.
           02  FILLER REDEFINES FICTL2F.
             03 FICTL2A    PICTURE X.
           02  FICTL2I  PIC X(3).
           02  FICTL3L    COMP  PIC  S9(4).
           02  FICTL3F    PICTURE X.
           02  FILLER REDEFINES FICTL3F.
             03 FICTL3A    PICTURE X.
           02  FICTL3I  PIC X(3).
           02  FICTL4L    COMP  PIC  S9(4).
           02  FICTL4F    PICTURE X.
           02  FILLER REDEFINES FICTL4F.
             03 FICTL4A    PICTURE X.
           02  FICTL4I  PIC X(4).
           02  FIFILEL    COMP  PIC  S9(4).
           02  FIFILEF    PICTURE X.
           02  FILLER REDEFINES FIFILEF.
             03 FIFILEA    PICTURE X.
           02  FIFILEI  PIC X(1).
           02  FITITLEL    COMP  PIC  S9(4).
           02  FITITLEF    PICTURE X.
           02  FILLER REDEFINES FITITLEF.
             03 FITITLEA    PICTURE X.
           02  FITITLEI  PIC X(79).
           02  FITRNAL    COMP  PIC  S9(4).
           02  FITRNAF    PICTURE X.
           02  FILLER REDEFINES FITRNAF.
             03 FITRNAA    PICTURE X.
           02  FITRNAI  PIC X(79).
           02  FITRNBL    COMP  PIC  S9(4).
           02  FITRNBF    PICTURE X.
           02  FILLER REDEFINES FITRNBF.
             03 FITRNBA    PICTURE X.
           02  FITRNBI  PIC X(79).
           02  FITRNCL    COMP  PIC  S9(4).
           02  FITRNCF    PICTURE X.
           02  FILLER REDEFINES FITRNCF.
             03 FITRNCA    PICTURE X.
           02  FITRNCI  PIC X(79).
           02  FITRNDL    COMP  PIC  S9(4).
           02  FITRNDF    PICTURE X.
           02  FILLER REDEFINES FITRNDF.
             03 FITRNDA    PICTURE X.
           02  FITRNDI  PIC X(79).
           02  FITRNEL    COMP  PIC  S9(4).
           02  FITRNEF    PICTURE X.
           02  FILLER REDEFINES FITRNEF.
             03 FITRNEA    PICTURE X.
           02  FITRNEI  PIC X(79).
           02  FITRNFL    COMP  PIC  S9(4).
           02  FITRNFF    PICTURE X.
           02  FILLER REDEFINES FITRNFF.
             03 FITRNFA    PICTURE X.
           02  FITRNFI  PIC X(79).
           02  FITRNGL    COMP  PIC  S9(4).
           02  FITRNGF    PICTURE X.
           02  FILLER REDEFINES FITRNGF.
             03 FITRNGA    PICTURE X.
           02  FITRNGI  PIC X(79).
           02  FITRNHL    COMP  PIC  S9(4).
           02  FITRNHF    PICTURE X.
           02  FILLER REDEFINES FITRNHF.
             03 FITRNHA    PICTURE X.
           02  FITRNHI  PIC X(79).
           02  FITRNIL    COMP  PIC  S9(4).
           02  FITRNIF    PICTURE X.
           02  FILLER REDEFINES FITRNIF.
             03 FITRNIA    PICTURE X.
           02  FITRNII  PIC X(79).
           02  FITRNJL    COMP  PIC  S9(4).
           02  FITRNJF    PICTURE X.
           02  FILLER REDEFINES FITRNJF.
             03 FITRNJA    PICTURE X.
           02  FITRNJI  PIC X(79).
           02  FITRNKL    COMP  PIC  S9(4).
           02  FITRNKF    PICTURE X.
           02  FILLER REDEFINES FITRNKF.
             03 FITRNKA    PICTURE X.
           02  FITRNKI  PIC X(79).
           02  FITRNLL    COMP  PIC  S9(4).
           02  FITRNLF    PICTURE X.
           02  FILLER REDEFINES FITRNLF.
             03 FITRNLA    PICTURE X.
           02  FITRNLI  PIC X(79).
           02  FITRNML    COMP  PIC  S9(4).
           02  FITRNMF    PICTURE X.
           02  FILLER REDEFINES FITRNMF.
             03 FITRNMA    PICTURE X.
           02  FITRNMI  PIC X(79).
           02  FITRNNL    COMP  PIC  S9(4).
           02  FITRNNF    PICTURE X.
           02  FILLER REDEFINES FITRNNF.
             03 FITRNNA    PICTURE X.
           02  FITRNNI  PIC X(79).
           02  FITRNOL    COMP  PIC  S9(4).
           02  FITRNOF    PICTURE X.
           02  FILLER REDEFINES FITRNOF.
             03 FITRNOA    PICTURE X.
           02  FITRNOI  PIC X(79).
           02  FITRNPL    COMP  PIC  S9(4).
           02  FITRNPF    PICTURE X.
           02  FILLER REDEFINES FITRNPF.
             03 FITRNPA    PICTURE X.
           02  FITRNPI  PIC X(79).
           02  FITRNQL    COMP  PIC  S9(4).
           02  FITRNQF    PICTURE X.
           02  FILLER REDEFINES FITRNQF.
             03 FITRNQA    PICTURE X.
           02  FITRNQI  PIC X(79).
           02  FIPF1L    COMP  PIC  S9(4).
           02  FIPF1F    PICTURE X.
           02  FILLER REDEFINES FIPF1F.
             03 FIPF1A    PICTURE X.
           02  FIPF1I  PIC X(18).
           02  FIPF2L    COMP  PIC  S9(4).
           02  FIPF2F    PICTURE X.
           02  FILLER REDEFINES FIPF2F.
             03 FIPF2A    PICTURE X.
           02  FIPF2I  PIC X(19).
           02  FIPF3L    COMP  PIC  S9(4).
           02  FIPF3F    PICTURE X.
           02  FILLER REDEFINES FIPF3F.
             03 FIPF3A    PICTURE X.
           02  FIPF3I  PIC X(18).
           02  FIERRL    COMP  PIC  S9(4).
           02  FIERRF    PICTURE X.
           02  FILLER REDEFINES FIERRF.
             03 FIERRA    PICTURE X.
           02  FIERRI  PIC X(79).
       01  FIPSRBAO REDEFINES FIPSRBAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FITRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FIDATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  FITIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FIPAGEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FIPAGNO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FICTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FICTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FICTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FICTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FIFILEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FITITLEO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNAO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNBO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNCO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNDO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNEO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNFO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNGO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNHO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNIO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNJO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNKO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNLO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNMO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNNO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNOO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNPO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FITRNQO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FIPF1O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FIPF2O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FIPF3O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  FIERRO  PIC X(79).