       01  FIPSI3AI.
           02  FILLER PIC X(12).
           02  PSTRIDL    COMP  PIC  S9(4).
           02  PSTRIDF    PICTURE X.
           02  FILLER REDEFINES PSTRIDF.
             03 PSTRIDA    PICTURE X.
           02  PSTRIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSPRFTL    COMP  PIC  S9(4).
           02  PSPRFTF    PICTURE X.
           02  FILLER REDEFINES PSPRFTF.
             03 PSPRFTA    PICTURE X.
           02  PSPRFTI  PIC X(10).
           02  PSHSDTL    COMP  PIC  S9(4).
           02  PSHSDTF    PICTURE X.
           02  FILLER REDEFINES PSHSDTF.
             03 PSHSDTA    PICTURE X.
           02  PSHSDTI  PIC X(5).
           02  PSNAMEL    COMP  PIC  S9(4).
           02  PSNAMEF    PICTURE X.
           02  FILLER REDEFINES PSNAMEF.
             03 PSNAMEA    PICTURE X.
           02  PSNAMEI  PIC X(25).
           02  PSKEYL    COMP  PIC  S9(4).
           02  PSKEYF    PICTURE X.
           02  FILLER REDEFINES PSKEYF.
             03 PSKEYA    PICTURE X.
           02  PSKEYI  PIC X(23).
           02  PSYO01L    COMP  PIC  S9(4).
           02  PSYO01F    PICTURE X.
           02  FILLER REDEFINES PSYO01F.
             03 PSYO01A    PICTURE X.
           02  PSYO01I  PIC X(4).
           02  PSFU01L    COMP  PIC  S9(4).
           02  PSFU01F    PICTURE X.
           02  FILLER REDEFINES PSFU01F.
             03 PSFU01A    PICTURE X.
           02  PSFU01I  PIC X(14).
           02  PSFS01L    COMP  PIC  S9(4).
           02  PSFS01F    PICTURE X.
           02  FILLER REDEFINES PSFS01F.
             03 PSFS01A    PICTURE X.
           02  PSFS01I  PIC X(14).
           02  PSFA01L    COMP  PIC  S9(4).
           02  PSFA01F    PICTURE X.
           02  FILLER REDEFINES PSFA01F.
             03 PSFA01A    PICTURE X.
           02  PSFA01I  PIC X(14).
           02  PSUS01L    COMP  PIC  S9(4).
           02  PSUS01F    PICTURE X.
           02  FILLER REDEFINES PSUS01F.
             03 PSUS01A    PICTURE X.
           02  PSUS01I  PIC X(14).
           02  PSEL01L    COMP  PIC  S9(4).
           02  PSEL01F    PICTURE X.
           02  FILLER REDEFINES PSEL01F.
             03 PSEL01A    PICTURE X.
           02  PSEL01I  PIC X(10).
           02  PSYO02L    COMP  PIC  S9(4).
           02  PSYO02F    PICTURE X.
           02  FILLER REDEFINES PSYO02F.
             03 PSYO02A    PICTURE X.
           02  PSYO02I  PIC X(4).
           02  PSFU02L    COMP  PIC  S9(4).
           02  PSFU02F    PICTURE X.
           02  FILLER REDEFINES PSFU02F.
             03 PSFU02A    PICTURE X.
           02  PSFU02I  PIC X(14).
           02  PSFS02L    COMP  PIC  S9(4).
           02  PSFS02F    PICTURE X.
           02  FILLER REDEFINES PSFS02F.
             03 PSFS02A    PICTURE X.
           02  PSFS02I  PIC X(14).
           02  PSFA02L    COMP  PIC  S9(4).
           02  PSFA02F    PICTURE X.
           02  FILLER REDEFINES PSFA02F.
             03 PSFA02A    PICTURE X.
           02  PSFA02I  PIC X(14).
           02  PSUS02L    COMP  PIC  S9(4).
           02  PSUS02F    PICTURE X.
           02  FILLER REDEFINES PSUS02F.
             03 PSUS02A    PICTURE X.
           02  PSUS02I  PIC X(14).
           02  PSEL02L    COMP  PIC  S9(4).
           02  PSEL02F    PICTURE X.
           02  FILLER REDEFINES PSEL02F.
             03 PSEL02A    PICTURE X.
           02  PSEL02I  PIC X(10).
           02  PSFU03L    COMP  PIC  S9(4).
           02  PSFU03F    PICTURE X.
           02  FILLER REDEFINES PSFU03F.
             03 PSFU03A    PICTURE X.
           02  PSFU03I  PIC X(14).
           02  PSFS03L    COMP  PIC  S9(4).
           02  PSFS03F    PICTURE X.
           02  FILLER REDEFINES PSFS03F.
             03 PSFS03A    PICTURE X.
           02  PSFS03I  PIC X(14).
           02  PSFA03L    COMP  PIC  S9(4).
           02  PSFA03F    PICTURE X.
           02  FILLER REDEFINES PSFA03F.
             03 PSFA03A    PICTURE X.
           02  PSFA03I  PIC X(14).
           02  PSUS03L    COMP  PIC  S9(4).
           02  PSUS03F    PICTURE X.
           02  FILLER REDEFINES PSUS03F.
             03 PSUS03A    PICTURE X.
           02  PSUS03I  PIC X(14).
           02  PSEL03L    COMP  PIC  S9(4).
           02  PSEL03F    PICTURE X.
           02  FILLER REDEFINES PSEL03F.
             03 PSEL03A    PICTURE X.
           02  PSEL03I  PIC X(10).
           02  PSYY01L    COMP  PIC  S9(4).
           02  PSYY01F    PICTURE X.
           02  FILLER REDEFINES PSYY01F.
             03 PSYY01A    PICTURE X.
           02  PSYY01I  PIC X(4).
           02  PSYL01L    COMP  PIC  S9(4).
           02  PSYL01F    PICTURE X.
           02  FILLER REDEFINES PSYL01F.
             03 PSYL01A    PICTURE X.
           02  PSYL01I  PIC X(11).
           02  PSES01L    COMP  PIC  S9(4).
           02  PSES01F    PICTURE X.
           02  FILLER REDEFINES PSES01F.
             03 PSES01A    PICTURE X.
           02  PSES01I  PIC X(12).
           02  PSED01L    COMP  PIC  S9(4).
           02  PSED01F    PICTURE X.
           02  FILLER REDEFINES PSED01F.
             03 PSED01A    PICTURE X.
           02  PSED01I  PIC X(12).
           02  PSNP01L    COMP  PIC  S9(4).
           02  PSNP01F    PICTURE X.
           02  FILLER REDEFINES PSNP01F.
             03 PSNP01A    PICTURE X.
           02  PSNP01I  PIC X(12).
           02  PSYR01L    COMP  PIC  S9(4).
           02  PSYR01F    PICTURE X.
           02  FILLER REDEFINES PSYR01F.
             03 PSYR01A    PICTURE X.
           02  PSYR01I  PIC X(11).
           02  PSPI01L    COMP  PIC  S9(4).
           02  PSPI01F    PICTURE X.
           02  FILLER REDEFINES PSPI01F.
             03 PSPI01A    PICTURE X.
           02  PSPI01I  PIC X(6).
           02  PSYY02L    COMP  PIC  S9(4).
           02  PSYY02F    PICTURE X.
           02  FILLER REDEFINES PSYY02F.
             03 PSYY02A    PICTURE X.
           02  PSYY02I  PIC X(4).
           02  PSYL02L    COMP  PIC  S9(4).
           02  PSYL02F    PICTURE X.
           02  FILLER REDEFINES PSYL02F.
             03 PSYL02A    PICTURE X.
           02  PSYL02I  PIC X(11).
           02  PSES02L    COMP  PIC  S9(4).
           02  PSES02F    PICTURE X.
           02  FILLER REDEFINES PSES02F.
             03 PSES02A    PICTURE X.
           02  PSES02I  PIC X(12).
           02  PSED02L    COMP  PIC  S9(4).
           02  PSED02F    PICTURE X.
           02  FILLER REDEFINES PSED02F.
             03 PSED02A    PICTURE X.
           02  PSED02I  PIC X(12).
           02  PSNP02L    COMP  PIC  S9(4).
           02  PSNP02F    PICTURE X.
           02  FILLER REDEFINES PSNP02F.
             03 PSNP02A    PICTURE X.
           02  PSNP02I  PIC X(12).
           02  PSYR02L    COMP  PIC  S9(4).
           02  PSYR02F    PICTURE X.
           02  FILLER REDEFINES PSYR02F.
             03 PSYR02A    PICTURE X.
           02  PSYR02I  PIC X(11).
           02  PSPI02L    COMP  PIC  S9(4).
           02  PSPI02F    PICTURE X.
           02  FILLER REDEFINES PSPI02F.
             03 PSPI02A    PICTURE X.
           02  PSPI02I  PIC X(6).
           02  PSYL03L    COMP  PIC  S9(4).
           02  PSYL03F    PICTURE X.
           02  FILLER REDEFINES PSYL03F.
             03 PSYL03A    PICTURE X.
           02  PSYL03I  PIC X(11).
           02  PSES03L    COMP  PIC  S9(4).
           02  PSES03F    PICTURE X.
           02  FILLER REDEFINES PSES03F.
             03 PSES03A    PICTURE X.
           02  PSES03I  PIC X(12).
           02  PSED03L    COMP  PIC  S9(4).
           02  PSED03F    PICTURE X.
           02  FILLER REDEFINES PSED03F.
             03 PSED03A    PICTURE X.
           02  PSED03I  PIC X(12).
           02  PSNP03L    COMP  PIC  S9(4).
           02  PSNP03F    PICTURE X.
           02  FILLER REDEFINES PSNP03F.
             03 PSNP03A    PICTURE X.
           02  PSNP03I  PIC X(12).
           02  PSYR03L    COMP  PIC  S9(4).
           02  PSYR03F    PICTURE X.
           02  FILLER REDEFINES PSYR03F.
             03 PSYR03A    PICTURE X.
           02  PSYR03I  PIC X(11).
           02  PSPI03L    COMP  PIC  S9(4).
           02  PSPI03F    PICTURE X.
           02  FILLER REDEFINES PSPI03F.
             03 PSPI03A    PICTURE X.
           02  PSPI03I  PIC X(6).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPSI3AO REDEFINES FIPSI3AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSPRFTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSHSDTO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSNAMEO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  PSKEYO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  PSYO01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSFU01O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS01O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA01O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS01O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL01O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSYO02O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSFU02O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS02O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA02O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS02O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL02O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSFU03O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS03O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA03O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS03O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL03O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSYY01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSYL01O PIC ZZZ.999999-.
           02  FILLER PICTURE X(3).
           02  PSES01O PIC Z(10)9-.
           02  FILLER PICTURE X(3).
           02  PSED01O PIC Z(10)9-.
           02  FILLER PICTURE X(3).
           02  PSNP01O PIC Z(10)9-.
           02  FILLER PICTURE X(3).
           02  PSYR01O PIC ZZZ.999999-.
           02  FILLER PICTURE X(3).
           02  PSPI01O PIC ZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSYY02O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSYL02O PIC ZZZ.999999-.
           02  FILLER PICTURE X(3).
           02  PSES02O PIC Z(10)9-.
           02  FILLER PICTURE X(3).
           02  PSED02O PIC Z(10)9-.
           02  FILLER PICTURE X(3).
           02  PSNP02O PIC Z(10)9-.
           02  FILLER PICTURE X(3).
           02  PSYR02O PIC ZZZ.999999-.
           02  FILLER PICTURE X(3).
           02  PSPI02O PIC ZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSYL03O PIC ZZZ.999999-.
           02  FILLER PICTURE X(3).
           02  PSES03O PIC Z(10)9-.
           02  FILLER PICTURE X(3).
           02  PSED03O PIC Z(10)9-.
           02  FILLER PICTURE X(3).
           02  PSNP03O PIC Z(10)9-.
           02  FILLER PICTURE X(3).
           02  PSYR03O PIC ZZZ.999999-.
           02  FILLER PICTURE X(3).
           02  PSPI03O PIC ZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).