       01  FIPSBLAI.
           02  FILLER PIC X(12).
           02  PSTRIDL    COMP  PIC  S9(4).
           02  PSTRIDF    PICTURE X.
           02  FILLER REDEFINES PSTRIDF.
             03 PSTRIDA    PICTURE X.
           02  PSTRIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSCTL1L    COMP  PIC  S9(4).
           02  PSCTL1F    PICTURE X.
           02  FILLER REDEFINES PSCTL1F.
             03 PSCTL1A    PICTURE X.
           02  PSCTL1I  PIC X(2).
           02  PSCTL2L    COMP  PIC  S9(4).
           02  PSCTL2F    PICTURE X.
           02  FILLER REDEFINES PSCTL2F.
             03 PSCTL2A    PICTURE X.
           02  PSCTL2I  PIC X(3).
           02  PSCTL3L    COMP  PIC  S9(4).
           02  PSCTL3F    PICTURE X.
           02  FILLER REDEFINES PSCTL3F.
             03 PSCTL3A    PICTURE X.
           02  PSCTL3I  PIC X(3).
           02  PSCTL4L    COMP  PIC  S9(4).
           02  PSCTL4F    PICTURE X.
           02  FILLER REDEFINES PSCTL4F.
             03 PSCTL4A    PICTURE X.
           02  PSCTL4I  PIC X(4).
           02  PSBLFTL    COMP  PIC  S9(4).
           02  PSBLFTF    PICTURE X.
           02  FILLER REDEFINES PSBLFTF.
             03 PSBLFTA    PICTURE X.
           02  PSBLFTI  PIC X(10).
           02  PSBEGRCL    COMP  PIC  S9(4).
           02  PSBEGRCF    PICTURE X.
           02  FILLER REDEFINES PSBEGRCF.
             03 PSBEGRCA    PICTURE X.
           02  PSBEGRCI  PIC X(16).
           02  PSENDRCL    COMP  PIC  S9(4).
           02  PSENDRCF    PICTURE X.
           02  FILLER REDEFINES PSENDRCF.
             03 PSENDRCA    PICTURE X.
           02  PSENDRCI  PIC X(16).
           02  PSCURBDL    COMP  PIC  S9(4).
           02  PSCURBDF    PICTURE X.
           02  FILLER REDEFINES PSCURBDF.
             03 PSCURBDA    PICTURE X.
           02  PSCURBDI  PIC X(16).
           02  PSYTDBDL    COMP  PIC  S9(4).
           02  PSYTDBDF    PICTURE X.
           02  FILLER REDEFINES PSYTDBDF.
             03 PSYTDBDA    PICTURE X.
           02  PSYTDBDI  PIC X(16).
           02  PSAGE0ML    COMP  PIC  S9(4).
           02  PSAGE0MF    PICTURE X.
           02  FILLER REDEFINES PSAGE0MF.
             03 PSAGE0MA    PICTURE X.
           02  PSAGE0MI  PIC X(16).
           02  PSCURPDL    COMP  PIC  S9(4).
           02  PSCURPDF    PICTURE X.
           02  FILLER REDEFINES PSCURPDF.
             03 PSCURPDA    PICTURE X.
           02  PSCURPDI  PIC X(16).
           02  PSYTDPDL    COMP  PIC  S9(4).
           02  PSYTDPDF    PICTURE X.
           02  FILLER REDEFINES PSYTDPDF.
             03 PSYTDPDA    PICTURE X.
           02  PSYTDPDI  PIC X(16).
           02  PSAGE1ML    COMP  PIC  S9(4).
           02  PSAGE1MF    PICTURE X.
           02  FILLER REDEFINES PSAGE1MF.
             03 PSAGE1MA    PICTURE X.
           02  PSAGE1MI  PIC X(16).
           02  PSCURWDL    COMP  PIC  S9(4).
           02  PSCURWDF    PICTURE X.
           02  FILLER REDEFINES PSCURWDF.
             03 PSCURWDA    PICTURE X.
           02  PSCURWDI  PIC X(16).
           02  PSYTDWDL    COMP  PIC  S9(4).
           02  PSYTDWDF    PICTURE X.
           02  FILLER REDEFINES PSYTDWDF.
             03 PSYTDWDA    PICTURE X.
           02  PSYTDWDI  PIC X(16).
           02  PSAGE2ML    COMP  PIC  S9(4).
           02  PSAGE2MF    PICTURE X.
           02  FILLER REDEFINES PSAGE2MF.
             03 PSAGE2MA    PICTURE X.
           02  PSAGE2MI  PIC X(16).
           02  PSAGE3ML    COMP  PIC  S9(4).
           02  PSAGE3MF    PICTURE X.
           02  FILLER REDEFINES PSAGE3MF.
             03 PSAGE3MA    PICTURE X.
           02  PSAGE3MI  PIC X(16).
           02  PSOVR3ML    COMP  PIC  S9(4).
           02  PSOVR3MF    PICTURE X.
           02  FILLER REDEFINES PSOVR3MF.
             03 PSOVR3MA    PICTURE X.
           02  PSOVR3MI  PIC X(16).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPSBLAO REDEFINES FIPSBLAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSBLFTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSBEGRCO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSENDRCO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSCURBDO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSYTDBDO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSAGE0MO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSCURPDO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSYTDPDO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSAGE1MO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSCURWDO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSYTDWDO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSAGE2MO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSAGE3MO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSOVR3MO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).