       01  FIPSETAI.
           02  FILLER PIC X(12).
           02  PSTRANL    COMP  PIC  S9(4).
           02  PSTRANF    PICTURE X.
           02  FILLER REDEFINES PSTRANF.
             03 PSTRANA    PICTURE X.
           02  PSTRANI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSCTL1L    COMP  PIC  S9(4).
           02  PSCTL1F    PICTURE X.
           02  FILLER REDEFINES PSCTL1F.
             03 PSCTL1A    PICTURE X.
           02  PSCTL1I  PIC X(2).
           02  PSCTL2L    COMP  PIC  S9(4).
           02  PSCTL2F    PICTURE X.
           02  FILLER REDEFINES PSCTL2F.
             03 PSCTL2A    PICTURE X.
           02  PSCTL2I  PIC X(3).
           02  PSCTL3L    COMP  PIC  S9(4).
           02  PSCTL3F    PICTURE X.
           02  FILLER REDEFINES PSCTL3F.
             03 PSCTL3A    PICTURE X.
           02  PSCTL3I  PIC X(3).
           02  PSCTL4L    COMP  PIC  S9(4).
           02  PSCTL4F    PICTURE X.
           02  FILLER REDEFINES PSCTL4F.
             03 PSCTL4A    PICTURE X.
           02  PSCTL4I  PIC X(4).
           02  PSSOURCL    COMP  PIC  S9(4).
           02  PSSOURCF    PICTURE X.
           02  FILLER REDEFINES PSSOURCF.
             03 PSSOURCA    PICTURE X.
           02  PSSOURCI  PIC X(2).
           02  PSARGUML    COMP  PIC  S9(4).
           02  PSARGUMF    PICTURE X.
           02  FILLER REDEFINES PSARGUMF.
             03 PSARGUMA    PICTURE X.
           02  PSARGUMI  PIC X(6).
           02  PSACT01L    COMP  PIC  S9(4).
           02  PSACT01F    PICTURE X.
           02  FILLER REDEFINES PSACT01F.
             03 PSACT01A    PICTURE X.
           02  PSACT01I  PIC X(1).
           02  PSSRC01L    COMP  PIC  S9(4).
           02  PSSRC01F    PICTURE X.
           02  FILLER REDEFINES PSSRC01F.
             03 PSSRC01A    PICTURE X.
           02  PSSRC01I  PIC X(2).
           02  PSARG01L    COMP  PIC  S9(4).
           02  PSARG01F    PICTURE X.
           02  FILLER REDEFINES PSARG01F.
             03 PSARG01A    PICTURE X.
           02  PSARG01I  PIC X(6).
           02  PSPRD01L    COMP  PIC  S9(4).
           02  PSPRD01F    PICTURE X.
           02  FILLER REDEFINES PSPRD01F.
             03 PSPRD01A    PICTURE X.
           02  PSPRD01I  PIC X(3).
           02  PSACT02L    COMP  PIC  S9(4).
           02  PSACT02F    PICTURE X.
           02  FILLER REDEFINES PSACT02F.
             03 PSACT02A    PICTURE X.
           02  PSACT02I  PIC X(1).
           02  PSSRC02L    COMP  PIC  S9(4).
           02  PSSRC02F    PICTURE X.
           02  FILLER REDEFINES PSSRC02F.
             03 PSSRC02A    PICTURE X.
           02  PSSRC02I  PIC X(2).
           02  PSARG02L    COMP  PIC  S9(4).
           02  PSARG02F    PICTURE X.
           02  FILLER REDEFINES PSARG02F.
             03 PSARG02A    PICTURE X.
           02  PSARG02I  PIC X(6).
           02  PSPRD02L    COMP  PIC  S9(4).
           02  PSPRD02F    PICTURE X.
           02  FILLER REDEFINES PSPRD02F.
             03 PSPRD02A    PICTURE X.
           02  PSPRD02I  PIC X(3).
           02  PSACT03L    COMP  PIC  S9(4).
           02  PSACT03F    PICTURE X.
           02  FILLER REDEFINES PSACT03F.
             03 PSACT03A    PICTURE X.
           02  PSACT03I  PIC X(1).
           02  PSSRC03L    COMP  PIC  S9(4).
           02  PSSRC03F    PICTURE X.
           02  FILLER REDEFINES PSSRC03F.
             03 PSSRC03A    PICTURE X.
           02  PSSRC03I  PIC X(2).
           02  PSARG03L    COMP  PIC  S9(4).
           02  PSARG03F    PICTURE X.
           02  FILLER REDEFINES PSARG03F.
             03 PSARG03A    PICTURE X.
           02  PSARG03I  PIC X(6).
           02  PSPRD03L    COMP  PIC  S9(4).
           02  PSPRD03F    PICTURE X.
           02  FILLER REDEFINES PSPRD03F.
             03 PSPRD03A    PICTURE X.
           02  PSPRD03I  PIC X(3).
           02  PSACT04L    COMP  PIC  S9(4).
           02  PSACT04F    PICTURE X.
           02  FILLER REDEFINES PSACT04F.
             03 PSACT04A    PICTURE X.
           02  PSACT04I  PIC X(1).
           02  PSSRC04L    COMP  PIC  S9(4).
           02  PSSRC04F    PICTURE X.
           02  FILLER REDEFINES PSSRC04F.
             03 PSSRC04A    PICTURE X.
           02  PSSRC04I  PIC X(2).
           02  PSARG04L    COMP  PIC  S9(4).
           02  PSARG04F    PICTURE X.
           02  FILLER REDEFINES PSARG04F.
             03 PSARG04A    PICTURE X.
           02  PSARG04I  PIC X(6).
           02  PSPRD04L    COMP  PIC  S9(4).
           02  PSPRD04F    PICTURE X.
           02  FILLER REDEFINES PSPRD04F.
             03 PSPRD04A    PICTURE X.
           02  PSPRD04I  PIC X(3).
           02  PSACT05L    COMP  PIC  S9(4).
           02  PSACT05F    PICTURE X.
           02  FILLER REDEFINES PSACT05F.
             03 PSACT05A    PICTURE X.
           02  PSACT05I  PIC X(1).
           02  PSSRC05L    COMP  PIC  S9(4).
           02  PSSRC05F    PICTURE X.
           02  FILLER REDEFINES PSSRC05F.
             03 PSSRC05A    PICTURE X.
           02  PSSRC05I  PIC X(2).
           02  PSARG05L    COMP  PIC  S9(4).
           02  PSARG05F    PICTURE X.
           02  FILLER REDEFINES PSARG05F.
             03 PSARG05A    PICTURE X.
           02  PSARG05I  PIC X(6).
           02  PSPRD05L    COMP  PIC  S9(4).
           02  PSPRD05F    PICTURE X.
           02  FILLER REDEFINES PSPRD05F.
             03 PSPRD05A    PICTURE X.
           02  PSPRD05I  PIC X(3).
           02  PSACT06L    COMP  PIC  S9(4).
           02  PSACT06F    PICTURE X.
           02  FILLER REDEFINES PSACT06F.
             03 PSACT06A    PICTURE X.
           02  PSACT06I  PIC X(1).
           02  PSSRC06L    COMP  PIC  S9(4).
           02  PSSRC06F    PICTURE X.
           02  FILLER REDEFINES PSSRC06F.
             03 PSSRC06A    PICTURE X.
           02  PSSRC06I  PIC X(2).
           02  PSARG06L    COMP  PIC  S9(4).
           02  PSARG06F    PICTURE X.
           02  FILLER REDEFINES PSARG06F.
             03 PSARG06A    PICTURE X.
           02  PSARG06I  PIC X(6).
           02  PSPRD06L    COMP  PIC  S9(4).
           02  PSPRD06F    PICTURE X.
           02  FILLER REDEFINES PSPRD06F.
             03 PSPRD06A    PICTURE X.
           02  PSPRD06I  PIC X(3).
           02  PSACT07L    COMP  PIC  S9(4).
           02  PSACT07F    PICTURE X.
           02  FILLER REDEFINES PSACT07F.
             03 PSACT07A    PICTURE X.
           02  PSACT07I  PIC X(1).
           02  PSSRC07L    COMP  PIC  S9(4).
           02  PSSRC07F    PICTURE X.
           02  FILLER REDEFINES PSSRC07F.
             03 PSSRC07A    PICTURE X.
           02  PSSRC07I  PIC X(2).
           02  PSARG07L    COMP  PIC  S9(4).
           02  PSARG07F    PICTURE X.
           02  FILLER REDEFINES PSARG07F.
             03 PSARG07A    PICTURE X.
           02  PSARG07I  PIC X(6).
           02  PSPRD07L    COMP  PIC  S9(4).
           02  PSPRD07F    PICTURE X.
           02  FILLER REDEFINES PSPRD07F.
             03 PSPRD07A    PICTURE X.
           02  PSPRD07I  PIC X(3).
           02  PSACT08L    COMP  PIC  S9(4).
           02  PSACT08F    PICTURE X.
           02  FILLER REDEFINES PSACT08F.
             03 PSACT08A    PICTURE X.
           02  PSACT08I  PIC X(1).
           02  PSSRC08L    COMP  PIC  S9(4).
           02  PSSRC08F    PICTURE X.
           02  FILLER REDEFINES PSSRC08F.
             03 PSSRC08A    PICTURE X.
           02  PSSRC08I  PIC X(2).
           02  PSARG08L    COMP  PIC  S9(4).
           02  PSARG08F    PICTURE X.
           02  FILLER REDEFINES PSARG08F.
             03 PSARG08A    PICTURE X.
           02  PSARG08I  PIC X(6).
           02  PSPRD08L    COMP  PIC  S9(4).
           02  PSPRD08F    PICTURE X.
           02  FILLER REDEFINES PSPRD08F.
             03 PSPRD08A    PICTURE X.
           02  PSPRD08I  PIC X(3).
           02  PSACT09L    COMP  PIC  S9(4).
           02  PSACT09F    PICTURE X.
           02  FILLER REDEFINES PSACT09F.
             03 PSACT09A    PICTURE X.
           02  PSACT09I  PIC X(1).
           02  PSSRC09L    COMP  PIC  S9(4).
           02  PSSRC09F    PICTURE X.
           02  FILLER REDEFINES PSSRC09F.
             03 PSSRC09A    PICTURE X.
           02  PSSRC09I  PIC X(2).
           02  PSARG09L    COMP  PIC  S9(4).
           02  PSARG09F    PICTURE X.
           02  FILLER REDEFINES PSARG09F.
             03 PSARG09A    PICTURE X.
           02  PSARG09I  PIC X(6).
           02  PSPRD09L    COMP  PIC  S9(4).
           02  PSPRD09F    PICTURE X.
           02  FILLER REDEFINES PSPRD09F.
             03 PSPRD09A    PICTURE X.
           02  PSPRD09I  PIC X(3).
           02  PSACT10L    COMP  PIC  S9(4).
           02  PSACT10F    PICTURE X.
           02  FILLER REDEFINES PSACT10F.
             03 PSACT10A    PICTURE X.
           02  PSACT10I  PIC X(1).
           02  PSSRC10L    COMP  PIC  S9(4).
           02  PSSRC10F    PICTURE X.
           02  FILLER REDEFINES PSSRC10F.
             03 PSSRC10A    PICTURE X.
           02  PSSRC10I  PIC X(2).
           02  PSARG10L    COMP  PIC  S9(4).
           02  PSARG10F    PICTURE X.
           02  FILLER REDEFINES PSARG10F.
             03 PSARG10A    PICTURE X.
           02  PSARG10I  PIC X(6).
           02  PSPRD10L    COMP  PIC  S9(4).
           02  PSPRD10F    PICTURE X.
           02  FILLER REDEFINES PSPRD10F.
             03 PSPRD10A    PICTURE X.
           02  PSPRD10I  PIC X(3).
           02  PSPF1L    COMP  PIC  S9(4).
           02  PSPF1F    PICTURE X.
           02  FILLER REDEFINES PSPF1F.
             03 PSPF1A    PICTURE X.
           02  PSPF1I  PIC X(18).
           02  PSPF2L    COMP  PIC  S9(4).
           02  PSPF2F    PICTURE X.
           02  FILLER REDEFINES PSPF2F.
             03 PSPF2A    PICTURE X.
           02  PSPF2I  PIC X(19).
           02  PSPA1L    COMP  PIC  S9(4).
           02  PSPA1F    PICTURE X.
           02  FILLER REDEFINES PSPA1F.
             03 PSPA1A    PICTURE X.
           02  PSPA1I  PIC X(13).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPSETAO REDEFINES FIPSETAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSSOURCO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARGUMO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSACT01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC01O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG01O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD01O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACT02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC02O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG02O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD02O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACT03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC03O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG03O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD03O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACT04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC04O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG04O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD04O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACT05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC05O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG05O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD05O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACT06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC06O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG06O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD06O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACT07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC07O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG07O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD07O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACT08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC08O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG08O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD08O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACT09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC09O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG09O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD09O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSACT10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSSRC10O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSARG10O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  PSPRD10O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSPF1O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  PSPF2O  PIC X(19).
           02  FILLER PICTURE X(3).
           02  PSPA1O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).