       01  FIPSSCBI.
           02  FILLER PIC X(12).
           02  SCTRANL    COMP  PIC  S9(4).
           02  SCTRANF    PICTURE X.
           02  FILLER REDEFINES SCTRANF.
             03 SCTRANA    PICTURE X.
           02  SCTRANI  PIC X(4).
           02  SCDATEL    COMP  PIC  S9(4).
           02  SCDATEF    PICTURE X.
           02  FILLER REDEFINES SCDATEF.
             03 SCDATEA    PICTURE X.
           02  SCDATEI  PIC X(8).
           02  SCTIMEL    COMP  PIC  S9(4).
           02  SCTIMEF    PICTURE X.
           02  FILLER REDEFINES SCTIMEF.
             03 SCTIMEA    PICTURE X.
           02  SCTIMEI  PIC X(8).
           02  SCTYPEL    COMP  PIC  S9(4).
           02  SCTYPEF    PICTURE X.
           02  FILLER REDEFINES SCTYPEF.
             03 SCTYPEA    PICTURE X.
           02  SCTYPEI  PIC X(4).
           02  SCDESCL    COMP  PIC  S9(4).
           02  SCDESCF    PICTURE X.
           02  FILLER REDEFINES SCDESCF.
             03 SCDESCA    PICTURE X.
           02  SCDESCI  PIC X(20).
           02  SCDLML    COMP  PIC  S9(4).
           02  SCDLMF    PICTURE X.
           02  FILLER REDEFINES SCDLMF.
             03 SCDLMA    PICTURE X.
           02  SCDLMI  PIC X(8).
           02  SCO1MBTL    COMP  PIC  S9(4).
           02  SCO1MBTF    PICTURE X.
           02  FILLER REDEFINES SCO1MBTF.
             03 SCO1MBTA    PICTURE X.
           02  SCO1MBTI  PIC X(1).
           02  SCO1MB1L    COMP  PIC  S9(4).
           02  SCO1MB1F    PICTURE X.
           02  FILLER REDEFINES SCO1MB1F.
             03 SCO1MB1A    PICTURE X.
           02  SCO1MB1I  PIC X(13).
           02  SCO1MF1L    COMP  PIC  S9(4).
           02  SCO1MF1F    PICTURE X.
           02  FILLER REDEFINES SCO1MF1F.
             03 SCO1MF1A    PICTURE X.
           02  SCO1MF1I  PIC X(8).
           02  SCO1MB2L    COMP  PIC  S9(4).
           02  SCO1MB2F    PICTURE X.
           02  FILLER REDEFINES SCO1MB2F.
             03 SCO1MB2A    PICTURE X.
           02  SCO1MB2I  PIC X(13).
           02  SCO1MF2L    COMP  PIC  S9(4).
           02  SCO1MF2F    PICTURE X.
           02  FILLER REDEFINES SCO1MF2F.
             03 SCO1MF2A    PICTURE X.
           02  SCO1MF2I  PIC X(8).
           02  SCO1MB3L    COMP  PIC  S9(4).
           02  SCO1MB3F    PICTURE X.
           02  FILLER REDEFINES SCO1MB3F.
             03 SCO1MB3A    PICTURE X.
           02  SCO1MB3I  PIC X(13).
           02  SCO1MF3L    COMP  PIC  S9(4).
           02  SCO1MF3F    PICTURE X.
           02  FILLER REDEFINES SCO1MF3F.
             03 SCO1MF3A    PICTURE X.
           02  SCO1MF3I  PIC X(8).
           02  SCO1MF4L    COMP  PIC  S9(4).
           02  SCO1MF4F    PICTURE X.
           02  FILLER REDEFINES SCO1MF4F.
             03 SCO1MF4A    PICTURE X.
           02  SCO1MF4I  PIC X(8).
           02  SCO1FCRL    COMP  PIC  S9(4).
           02  SCO1FCRF    PICTURE X.
           02  FILLER REDEFINES SCO1FCRF.
             03 SCO1FCRA    PICTURE X.
           02  SCO1FCRI  PIC X(10).
           02  SCO1CRTL    COMP  PIC  S9(4).
           02  SCO1CRTF    PICTURE X.
           02  FILLER REDEFINES SCO1CRTF.
             03 SCO1CRTA    PICTURE X.
           02  SCO1CRTI  PIC X(1).
           02  SCO1WBZL    COMP  PIC  S9(4).
           02  SCO1WBZF    PICTURE X.
           02  FILLER REDEFINES SCO1WBZF.
             03 SCO1WBZA    PICTURE X.
           02  SCO1WBZI  PIC X(1).
           02  SCO1FCSL    COMP  PIC  S9(4).
           02  SCO1FCSF    PICTURE X.
           02  FILLER REDEFINES SCO1FCSF.
             03 SCO1FCSA    PICTURE X.
           02  SCO1FCSI  PIC X(10).
           02  SCO1CSTL    COMP  PIC  S9(4).
           02  SCO1CSTF    PICTURE X.
           02  FILLER REDEFINES SCO1CSTF.
             03 SCO1CSTA    PICTURE X.
           02  SCO1CSTI  PIC X(1).
           02  SCO1WNAL    COMP  PIC  S9(4).
           02  SCO1WNAF    PICTURE X.
           02  FILLER REDEFINES SCO1WNAF.
             03 SCO1WNAA    PICTURE X.
           02  SCO1WNAI  PIC X(1).
           02  SCO1WTTL    COMP  PIC  S9(4).
           02  SCO1WTTF    PICTURE X.
           02  FILLER REDEFINES SCO1WTTF.
             03 SCO1WTTA    PICTURE X.
           02  SCO1WTTI  PIC X(1).
           02  SCO1WANL    COMP  PIC  S9(4).
           02  SCO1WANF    PICTURE X.
           02  FILLER REDEFINES SCO1WANF.
             03 SCO1WANA    PICTURE X.
           02  SCO1WANI  PIC X(1).
           02  SCO1FFOL    COMP  PIC  S9(4).
           02  SCO1FFOF    PICTURE X.
           02  FILLER REDEFINES SCO1FFOF.
             03 SCO1FFOA    PICTURE X.
           02  SCO1FFOI  PIC X(1).
           02  SCO1ECTL    COMP  PIC  S9(4).
           02  SCO1ECTF    PICTURE X.
           02  FILLER REDEFINES SCO1ECTF.
             03 SCO1ECTA    PICTURE X.
           02  SCO1ECTI  PIC X(1).
           02  SCO1FBTL    COMP  PIC  S9(4).
           02  SCO1FBTF    PICTURE X.
           02  FILLER REDEFINES SCO1FBTF.
             03 SCO1FBTA    PICTURE X.
           02  SCO1FBTI  PIC X(1).
           02  SCO1EPFL    COMP  PIC  S9(4).
           02  SCO1EPFF    PICTURE X.
           02  FILLER REDEFINES SCO1EPFF.
             03 SCO1EPFA    PICTURE X.
           02  SCO1EPFI  PIC X(10).
           02  SCO1FF1L    COMP  PIC  S9(4).
           02  SCO1FF1F    PICTURE X.
           02  FILLER REDEFINES SCO1FF1F.
             03 SCO1FF1A    PICTURE X.
           02  SCO1FF1I  PIC X(10).
           02  SCO1ENFL    COMP  PIC  S9(4).
           02  SCO1ENFF    PICTURE X.
           02  FILLER REDEFINES SCO1ENFF.
             03 SCO1ENFA    PICTURE X.
           02  SCO1ENFI  PIC X(10).
           02  SCO1FF2L    COMP  PIC  S9(4).
           02  SCO1FF2F    PICTURE X.
           02  FILLER REDEFINES SCO1FF2F.
             03 SCO1FF2A    PICTURE X.
           02  SCO1FF2I  PIC X(10).
           02  SCERRL    COMP  PIC  S9(4).
           02  SCERRF    PICTURE X.
           02  FILLER REDEFINES SCERRF.
             03 SCERRA    PICTURE X.
           02  SCERRI  PIC X(79).
       01  FIPSSCBO REDEFINES FIPSSCBI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  SCTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCTYPEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCDESCO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  SCDLMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCO1MBTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1MB1O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  SCO1MF1O PIC ZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  SCO1MB2O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  SCO1MF2O PIC ZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  SCO1MB3O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  SCO1MF3O PIC ZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  SCO1MF4O PIC ZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  SCO1FCRO PIC Z.99999999.
           02  FILLER PICTURE X(3).
           02  SCO1CRTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WBZO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1FCSO PIC Z.99999999.
           02  FILLER PICTURE X(3).
           02  SCO1CSTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WNAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WTTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WANO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1FFOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1ECTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1FBTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1EPFO PIC Z.99999999.
           02  FILLER PICTURE X(3).
           02  SCO1FF1O PIC .999999999.
           02  FILLER PICTURE X(3).
           02  SCO1ENFO PIC Z.99999999.
           02  FILLER PICTURE X(3).
           02  SCO1FF2O PIC 9.99999999.
           02  FILLER PICTURE X(3).
           02  SCERRO  PIC X(79).