       01  FIPSIAAI.
           02  FILLER PIC X(12).
           02  PSTRIDL    COMP  PIC  S9(4).
           02  PSTRIDF    PICTURE X.
           02  FILLER REDEFINES PSTRIDF.
             03 PSTRIDA    PICTURE X.
           02  PSTRIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSPRFTL    COMP  PIC  S9(4).
           02  PSPRFTF    PICTURE X.
           02  FILLER REDEFINES PSPRFTF.
             03 PSPRFTA    PICTURE X.
           02  PSPRFTI  PIC X(10).
           02  PSNAMEL    COMP  PIC  S9(4).
           02  PSNAMEF    PICTURE X.
           02  FILLER REDEFINES PSNAMEF.
             03 PSNAMEA    PICTURE X.
           02  PSNAMEI  PIC X(25).
           02  PSKEYL    COMP  PIC  S9(4).
           02  PSKEYF    PICTURE X.
           02  FILLER REDEFINES PSKEYF.
             03 PSKEYA    PICTURE X.
           02  PSKEYI  PIC X(23).
           02  PSLN1L    COMP  PIC  S9(4).
           02  PSLN1F    PICTURE X.
           02  FILLER REDEFINES PSLN1F.
             03 PSLN1A    PICTURE X.
           02  PSLN1I  PIC X(71).
           02  PSLN2L    COMP  PIC  S9(4).
           02  PSLN2F    PICTURE X.
           02  FILLER REDEFINES PSLN2F.
             03 PSLN2A    PICTURE X.
           02  PSLN2I  PIC X(71).
           02  PSLN3L    COMP  PIC  S9(4).
           02  PSLN3F    PICTURE X.
           02  FILLER REDEFINES PSLN3F.
             03 PSLN3A    PICTURE X.
           02  PSLN3I  PIC X(71).
           02  PSLN4L    COMP  PIC  S9(4).
           02  PSLN4F    PICTURE X.
           02  FILLER REDEFINES PSLN4F.
             03 PSLN4A    PICTURE X.
           02  PSLN4I  PIC X(71).
           02  PSLN5L    COMP  PIC  S9(4).
           02  PSLN5F    PICTURE X.
           02  FILLER REDEFINES PSLN5F.
             03 PSLN5A    PICTURE X.
           02  PSLN5I  PIC X(71).
           02  PSLN6L    COMP  PIC  S9(4).
           02  PSLN6F    PICTURE X.
           02  FILLER REDEFINES PSLN6F.
             03 PSLN6A    PICTURE X.
           02  PSLN6I  PIC X(71).
           02  PSLN7L    COMP  PIC  S9(4).
           02  PSLN7F    PICTURE X.
           02  FILLER REDEFINES PSLN7F.
             03 PSLN7A    PICTURE X.
           02  PSLN7I  PIC X(71).
           02  PSLN8L    COMP  PIC  S9(4).
           02  PSLN8F    PICTURE X.
           02  FILLER REDEFINES PSLN8F.
             03 PSLN8A    PICTURE X.
           02  PSLN8I  PIC X(71).
           02  PSLN9L    COMP  PIC  S9(4).
           02  PSLN9F    PICTURE X.
           02  FILLER REDEFINES PSLN9F.
             03 PSLN9A    PICTURE X.
           02  PSLN9I  PIC X(71).
           02  PSLN10L    COMP  PIC  S9(4).
           02  PSLN10F    PICTURE X.
           02  FILLER REDEFINES PSLN10F.
             03 PSLN10A    PICTURE X.
           02  PSLN10I  PIC X(71).
           02  PSLN11L    COMP  PIC  S9(4).
           02  PSLN11F    PICTURE X.
           02  FILLER REDEFINES PSLN11F.
             03 PSLN11A    PICTURE X.
           02  PSLN11I  PIC X(71).
           02  PSLN12L    COMP  PIC  S9(4).
           02  PSLN12F    PICTURE X.
           02  FILLER REDEFINES PSLN12F.
             03 PSLN12A    PICTURE X.
           02  PSLN12I  PIC X(71).
           02  PSLN13L    COMP  PIC  S9(4).
           02  PSLN13F    PICTURE X.
           02  FILLER REDEFINES PSLN13F.
             03 PSLN13A    PICTURE X.
           02  PSLN13I  PIC X(71).
           02  PSLN14L    COMP  PIC  S9(4).
           02  PSLN14F    PICTURE X.
           02  FILLER REDEFINES PSLN14F.
             03 PSLN14A    PICTURE X.
           02  PSLN14I  PIC X(71).
           02  PSPF1L    COMP  PIC  S9(4).
           02  PSPF1F    PICTURE X.
           02  FILLER REDEFINES PSPF1F.
             03 PSPF1A    PICTURE X.
           02  PSPF1I  PIC X(50).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(75).
       01  FIPSIAAO REDEFINES FIPSIAAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSPRFTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSNAMEO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  PSKEYO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  PSLN1O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN2O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN3O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN4O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN5O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN6O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN7O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN8O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN9O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN10O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN11O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN12O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN13O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSLN14O  PIC X(71).
           02  FILLER PICTURE X(3).
           02  PSPF1O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(75).