       01  FIPSI1AI.
           02  FILLER PIC X(12).
           02  PSTRIDL    COMP  PIC  S9(4).
           02  PSTRIDF    PICTURE X.
           02  FILLER REDEFINES PSTRIDF.
             03 PSTRIDA    PICTURE X.
           02  PSTRIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSPRFTL    COMP  PIC  S9(4).
           02  PSPRFTF    PICTURE X.
           02  FILLER REDEFINES PSPRFTF.
             03 PSPRFTA    PICTURE X.
           02  PSPRFTI  PIC X(10).
           02  PSHSDTL    COMP  PIC  S9(4).
           02  PSHSDTF    PICTURE X.
           02  FILLER REDEFINES PSHSDTF.
             03 PSHSDTA    PICTURE X.
           02  PSHSDTI  PIC X(5).
           02  PSNAMEL    COMP  PIC  S9(4).
           02  PSNAMEF    PICTURE X.
           02  FILLER REDEFINES PSNAMEF.
             03 PSNAMEA    PICTURE X.
           02  PSNAMEI  PIC X(25).
           02  PSKEYL    COMP  PIC  S9(4).
           02  PSKEYF    PICTURE X.
           02  FILLER REDEFINES PSKEYF.
             03 PSKEYA    PICTURE X.
           02  PSKEYI  PIC X(23).
           02  PSMT01L    COMP  PIC  S9(4).
           02  PSMT01F    PICTURE X.
           02  FILLER REDEFINES PSMT01F.
             03 PSMT01A    PICTURE X.
           02  PSMT01I  PIC X(5).
           02  PSFU01L    COMP  PIC  S9(4).
           02  PSFU01F    PICTURE X.
           02  FILLER REDEFINES PSFU01F.
             03 PSFU01A    PICTURE X.
           02  PSFU01I  PIC X(14).
           02  PSFS01L    COMP  PIC  S9(4).
           02  PSFS01F    PICTURE X.
           02  FILLER REDEFINES PSFS01F.
             03 PSFS01A    PICTURE X.
           02  PSFS01I  PIC X(14).
           02  PSFA01L    COMP  PIC  S9(4).
           02  PSFA01F    PICTURE X.
           02  FILLER REDEFINES PSFA01F.
             03 PSFA01A    PICTURE X.
           02  PSFA01I  PIC X(14).
           02  PSUS01L    COMP  PIC  S9(4).
           02  PSUS01F    PICTURE X.
           02  FILLER REDEFINES PSUS01F.
             03 PSUS01A    PICTURE X.
           02  PSUS01I  PIC X(14).
           02  PSEL01L    COMP  PIC  S9(4).
           02  PSEL01F    PICTURE X.
           02  FILLER REDEFINES PSEL01F.
             03 PSEL01A    PICTURE X.
           02  PSEL01I  PIC X(10).
           02  PSMT02L    COMP  PIC  S9(4).
           02  PSMT02F    PICTURE X.
           02  FILLER REDEFINES PSMT02F.
             03 PSMT02A    PICTURE X.
           02  PSMT02I  PIC X(5).
           02  PSFU02L    COMP  PIC  S9(4).
           02  PSFU02F    PICTURE X.
           02  FILLER REDEFINES PSFU02F.
             03 PSFU02A    PICTURE X.
           02  PSFU02I  PIC X(14).
           02  PSFS02L    COMP  PIC  S9(4).
           02  PSFS02F    PICTURE X.
           02  FILLER REDEFINES PSFS02F.
             03 PSFS02A    PICTURE X.
           02  PSFS02I  PIC X(14).
           02  PSFA02L    COMP  PIC  S9(4).
           02  PSFA02F    PICTURE X.
           02  FILLER REDEFINES PSFA02F.
             03 PSFA02A    PICTURE X.
           02  PSFA02I  PIC X(14).
           02  PSUS02L    COMP  PIC  S9(4).
           02  PSUS02F    PICTURE X.
           02  FILLER REDEFINES PSUS02F.
             03 PSUS02A    PICTURE X.
           02  PSUS02I  PIC X(14).
           02  PSEL02L    COMP  PIC  S9(4).
           02  PSEL02F    PICTURE X.
           02  FILLER REDEFINES PSEL02F.
             03 PSEL02A    PICTURE X.
           02  PSEL02I  PIC X(10).
           02  PSMT03L    COMP  PIC  S9(4).
           02  PSMT03F    PICTURE X.
           02  FILLER REDEFINES PSMT03F.
             03 PSMT03A    PICTURE X.
           02  PSMT03I  PIC X(5).
           02  PSFU03L    COMP  PIC  S9(4).
           02  PSFU03F    PICTURE X.
           02  FILLER REDEFINES PSFU03F.
             03 PSFU03A    PICTURE X.
           02  PSFU03I  PIC X(14).
           02  PSFS03L    COMP  PIC  S9(4).
           02  PSFS03F    PICTURE X.
           02  FILLER REDEFINES PSFS03F.
             03 PSFS03A    PICTURE X.
           02  PSFS03I  PIC X(14).
           02  PSFA03L    COMP  PIC  S9(4).
           02  PSFA03F    PICTURE X.
           02  FILLER REDEFINES PSFA03F.
             03 PSFA03A    PICTURE X.
           02  PSFA03I  PIC X(14).
           02  PSUS03L    COMP  PIC  S9(4).
           02  PSUS03F    PICTURE X.
           02  FILLER REDEFINES PSUS03F.
             03 PSUS03A    PICTURE X.
           02  PSUS03I  PIC X(14).
           02  PSEL03L    COMP  PIC  S9(4).
           02  PSEL03F    PICTURE X.
           02  FILLER REDEFINES PSEL03F.
             03 PSEL03A    PICTURE X.
           02  PSEL03I  PIC X(10).
           02  PSMT04L    COMP  PIC  S9(4).
           02  PSMT04F    PICTURE X.
           02  FILLER REDEFINES PSMT04F.
             03 PSMT04A    PICTURE X.
           02  PSMT04I  PIC X(5).
           02  PSFU04L    COMP  PIC  S9(4).
           02  PSFU04F    PICTURE X.
           02  FILLER REDEFINES PSFU04F.
             03 PSFU04A    PICTURE X.
           02  PSFU04I  PIC X(14).
           02  PSFS04L    COMP  PIC  S9(4).
           02  PSFS04F    PICTURE X.
           02  FILLER REDEFINES PSFS04F.
             03 PSFS04A    PICTURE X.
           02  PSFS04I  PIC X(14).
           02  PSFA04L    COMP  PIC  S9(4).
           02  PSFA04F    PICTURE X.
           02  FILLER REDEFINES PSFA04F.
             03 PSFA04A    PICTURE X.
           02  PSFA04I  PIC X(14).
           02  PSUS04L    COMP  PIC  S9(4).
           02  PSUS04F    PICTURE X.
           02  FILLER REDEFINES PSUS04F.
             03 PSUS04A    PICTURE X.
           02  PSUS04I  PIC X(14).
           02  PSEL04L    COMP  PIC  S9(4).
           02  PSEL04F    PICTURE X.
           02  FILLER REDEFINES PSEL04F.
             03 PSEL04A    PICTURE X.
           02  PSEL04I  PIC X(10).
           02  PSMT05L    COMP  PIC  S9(4).
           02  PSMT05F    PICTURE X.
           02  FILLER REDEFINES PSMT05F.
             03 PSMT05A    PICTURE X.
           02  PSMT05I  PIC X(5).
           02  PSFU05L    COMP  PIC  S9(4).
           02  PSFU05F    PICTURE X.
           02  FILLER REDEFINES PSFU05F.
             03 PSFU05A    PICTURE X.
           02  PSFU05I  PIC X(14).
           02  PSFS05L    COMP  PIC  S9(4).
           02  PSFS05F    PICTURE X.
           02  FILLER REDEFINES PSFS05F.
             03 PSFS05A    PICTURE X.
           02  PSFS05I  PIC X(14).
           02  PSFA05L    COMP  PIC  S9(4).
           02  PSFA05F    PICTURE X.
           02  FILLER REDEFINES PSFA05F.
             03 PSFA05A    PICTURE X.
           02  PSFA05I  PIC X(14).
           02  PSUS05L    COMP  PIC  S9(4).
           02  PSUS05F    PICTURE X.
           02  FILLER REDEFINES PSUS05F.
             03 PSUS05A    PICTURE X.
           02  PSUS05I  PIC X(14).
           02  PSEL05L    COMP  PIC  S9(4).
           02  PSEL05F    PICTURE X.
           02  FILLER REDEFINES PSEL05F.
             03 PSEL05A    PICTURE X.
           02  PSEL05I  PIC X(10).
           02  PSMT06L    COMP  PIC  S9(4).
           02  PSMT06F    PICTURE X.
           02  FILLER REDEFINES PSMT06F.
             03 PSMT06A    PICTURE X.
           02  PSMT06I  PIC X(5).
           02  PSFU06L    COMP  PIC  S9(4).
           02  PSFU06F    PICTURE X.
           02  FILLER REDEFINES PSFU06F.
             03 PSFU06A    PICTURE X.
           02  PSFU06I  PIC X(14).
           02  PSFS06L    COMP  PIC  S9(4).
           02  PSFS06F    PICTURE X.
           02  FILLER REDEFINES PSFS06F.
             03 PSFS06A    PICTURE X.
           02  PSFS06I  PIC X(14).
           02  PSFA06L    COMP  PIC  S9(4).
           02  PSFA06F    PICTURE X.
           02  FILLER REDEFINES PSFA06F.
             03 PSFA06A    PICTURE X.
           02  PSFA06I  PIC X(14).
           02  PSUS06L    COMP  PIC  S9(4).
           02  PSUS06F    PICTURE X.
           02  FILLER REDEFINES PSUS06F.
             03 PSUS06A    PICTURE X.
           02  PSUS06I  PIC X(14).
           02  PSEL06L    COMP  PIC  S9(4).
           02  PSEL06F    PICTURE X.
           02  FILLER REDEFINES PSEL06F.
             03 PSEL06A    PICTURE X.
           02  PSEL06I  PIC X(10).
           02  PSMT07L    COMP  PIC  S9(4).
           02  PSMT07F    PICTURE X.
           02  FILLER REDEFINES PSMT07F.
             03 PSMT07A    PICTURE X.
           02  PSMT07I  PIC X(5).
           02  PSFU07L    COMP  PIC  S9(4).
           02  PSFU07F    PICTURE X.
           02  FILLER REDEFINES PSFU07F.
             03 PSFU07A    PICTURE X.
           02  PSFU07I  PIC X(14).
           02  PSFS07L    COMP  PIC  S9(4).
           02  PSFS07F    PICTURE X.
           02  FILLER REDEFINES PSFS07F.
             03 PSFS07A    PICTURE X.
           02  PSFS07I  PIC X(14).
           02  PSFA07L    COMP  PIC  S9(4).
           02  PSFA07F    PICTURE X.
           02  FILLER REDEFINES PSFA07F.
             03 PSFA07A    PICTURE X.
           02  PSFA07I  PIC X(14).
           02  PSUS07L    COMP  PIC  S9(4).
           02  PSUS07F    PICTURE X.
           02  FILLER REDEFINES PSUS07F.
             03 PSUS07A    PICTURE X.
           02  PSUS07I  PIC X(14).
           02  PSEL07L    COMP  PIC  S9(4).
           02  PSEL07F    PICTURE X.
           02  FILLER REDEFINES PSEL07F.
             03 PSEL07A    PICTURE X.
           02  PSEL07I  PIC X(10).
           02  PSMT08L    COMP  PIC  S9(4).
           02  PSMT08F    PICTURE X.
           02  FILLER REDEFINES PSMT08F.
             03 PSMT08A    PICTURE X.
           02  PSMT08I  PIC X(5).
           02  PSFU08L    COMP  PIC  S9(4).
           02  PSFU08F    PICTURE X.
           02  FILLER REDEFINES PSFU08F.
             03 PSFU08A    PICTURE X.
           02  PSFU08I  PIC X(14).
           02  PSFS08L    COMP  PIC  S9(4).
           02  PSFS08F    PICTURE X.
           02  FILLER REDEFINES PSFS08F.
             03 PSFS08A    PICTURE X.
           02  PSFS08I  PIC X(14).
           02  PSFA08L    COMP  PIC  S9(4).
           02  PSFA08F    PICTURE X.
           02  FILLER REDEFINES PSFA08F.
             03 PSFA08A    PICTURE X.
           02  PSFA08I  PIC X(14).
           02  PSUS08L    COMP  PIC  S9(4).
           02  PSUS08F    PICTURE X.
           02  FILLER REDEFINES PSUS08F.
             03 PSUS08A    PICTURE X.
           02  PSUS08I  PIC X(14).
           02  PSEL08L    COMP  PIC  S9(4).
           02  PSEL08F    PICTURE X.
           02  FILLER REDEFINES PSEL08F.
             03 PSEL08A    PICTURE X.
           02  PSEL08I  PIC X(10).
           02  PSMT09L    COMP  PIC  S9(4).
           02  PSMT09F    PICTURE X.
           02  FILLER REDEFINES PSMT09F.
             03 PSMT09A    PICTURE X.
           02  PSMT09I  PIC X(5).
           02  PSFU09L    COMP  PIC  S9(4).
           02  PSFU09F    PICTURE X.
           02  FILLER REDEFINES PSFU09F.
             03 PSFU09A    PICTURE X.
           02  PSFU09I  PIC X(14).
           02  PSFS09L    COMP  PIC  S9(4).
           02  PSFS09F    PICTURE X.
           02  FILLER REDEFINES PSFS09F.
             03 PSFS09A    PICTURE X.
           02  PSFS09I  PIC X(14).
           02  PSFA09L    COMP  PIC  S9(4).
           02  PSFA09F    PICTURE X.
           02  FILLER REDEFINES PSFA09F.
             03 PSFA09A    PICTURE X.
           02  PSFA09I  PIC X(14).
           02  PSUS09L    COMP  PIC  S9(4).
           02  PSUS09F    PICTURE X.
           02  FILLER REDEFINES PSUS09F.
             03 PSUS09A    PICTURE X.
           02  PSUS09I  PIC X(14).
           02  PSEL09L    COMP  PIC  S9(4).
           02  PSEL09F    PICTURE X.
           02  FILLER REDEFINES PSEL09F.
             03 PSEL09A    PICTURE X.
           02  PSEL09I  PIC X(10).
           02  PSMT10L    COMP  PIC  S9(4).
           02  PSMT10F    PICTURE X.
           02  FILLER REDEFINES PSMT10F.
             03 PSMT10A    PICTURE X.
           02  PSMT10I  PIC X(5).
           02  PSFU10L    COMP  PIC  S9(4).
           02  PSFU10F    PICTURE X.
           02  FILLER REDEFINES PSFU10F.
             03 PSFU10A    PICTURE X.
           02  PSFU10I  PIC X(14).
           02  PSFS10L    COMP  PIC  S9(4).
           02  PSFS10F    PICTURE X.
           02  FILLER REDEFINES PSFS10F.
             03 PSFS10A    PICTURE X.
           02  PSFS10I  PIC X(14).
           02  PSFA10L    COMP  PIC  S9(4).
           02  PSFA10F    PICTURE X.
           02  FILLER REDEFINES PSFA10F.
             03 PSFA10A    PICTURE X.
           02  PSFA10I  PIC X(14).
           02  PSUS10L    COMP  PIC  S9(4).
           02  PSUS10F    PICTURE X.
           02  FILLER REDEFINES PSUS10F.
             03 PSUS10A    PICTURE X.
           02  PSUS10I  PIC X(14).
           02  PSEL10L    COMP  PIC  S9(4).
           02  PSEL10F    PICTURE X.
           02  FILLER REDEFINES PSEL10F.
             03 PSEL10A    PICTURE X.
           02  PSEL10I  PIC X(10).
           02  PSMT11L    COMP  PIC  S9(4).
           02  PSMT11F    PICTURE X.
           02  FILLER REDEFINES PSMT11F.
             03 PSMT11A    PICTURE X.
           02  PSMT11I  PIC X(5).
           02  PSFU11L    COMP  PIC  S9(4).
           02  PSFU11F    PICTURE X.
           02  FILLER REDEFINES PSFU11F.
             03 PSFU11A    PICTURE X.
           02  PSFU11I  PIC X(14).
           02  PSFS11L    COMP  PIC  S9(4).
           02  PSFS11F    PICTURE X.
           02  FILLER REDEFINES PSFS11F.
             03 PSFS11A    PICTURE X.
           02  PSFS11I  PIC X(14).
           02  PSFA11L    COMP  PIC  S9(4).
           02  PSFA11F    PICTURE X.
           02  FILLER REDEFINES PSFA11F.
             03 PSFA11A    PICTURE X.
           02  PSFA11I  PIC X(14).
           02  PSUS11L    COMP  PIC  S9(4).
           02  PSUS11F    PICTURE X.
           02  FILLER REDEFINES PSUS11F.
             03 PSUS11A    PICTURE X.
           02  PSUS11I  PIC X(14).
           02  PSEL11L    COMP  PIC  S9(4).
           02  PSEL11F    PICTURE X.
           02  FILLER REDEFINES PSEL11F.
             03 PSEL11A    PICTURE X.
           02  PSEL11I  PIC X(10).
           02  PSMT12L    COMP  PIC  S9(4).
           02  PSMT12F    PICTURE X.
           02  FILLER REDEFINES PSMT12F.
             03 PSMT12A    PICTURE X.
           02  PSMT12I  PIC X(5).
           02  PSFU12L    COMP  PIC  S9(4).
           02  PSFU12F    PICTURE X.
           02  FILLER REDEFINES PSFU12F.
             03 PSFU12A    PICTURE X.
           02  PSFU12I  PIC X(14).
           02  PSFS12L    COMP  PIC  S9(4).
           02  PSFS12F    PICTURE X.
           02  FILLER REDEFINES PSFS12F.
             03 PSFS12A    PICTURE X.
           02  PSFS12I  PIC X(14).
           02  PSFA12L    COMP  PIC  S9(4).
           02  PSFA12F    PICTURE X.
           02  FILLER REDEFINES PSFA12F.
             03 PSFA12A    PICTURE X.
           02  PSFA12I  PIC X(14).
           02  PSUS12L    COMP  PIC  S9(4).
           02  PSUS12F    PICTURE X.
           02  FILLER REDEFINES PSUS12F.
             03 PSUS12A    PICTURE X.
           02  PSUS12I  PIC X(14).
           02  PSEL12L    COMP  PIC  S9(4).
           02  PSEL12F    PICTURE X.
           02  FILLER REDEFINES PSEL12F.
             03 PSEL12A    PICTURE X.
           02  PSEL12I  PIC X(10).
           02  PSAVFUL    COMP  PIC  S9(4).
           02  PSAVFUF    PICTURE X.
           02  FILLER REDEFINES PSAVFUF.
             03 PSAVFUA    PICTURE X.
           02  PSAVFUI  PIC X(14).
           02  PSAVFSL    COMP  PIC  S9(4).
           02  PSAVFSF    PICTURE X.
           02  FILLER REDEFINES PSAVFSF.
             03 PSAVFSA    PICTURE X.
           02  PSAVFSI  PIC X(14).
           02  PSAVFAL    COMP  PIC  S9(4).
           02  PSAVFAF    PICTURE X.
           02  FILLER REDEFINES PSAVFAF.
             03 PSAVFAA    PICTURE X.
           02  PSAVFAI  PIC X(14).
           02  PSAVUSL    COMP  PIC  S9(4).
           02  PSAVUSF    PICTURE X.
           02  FILLER REDEFINES PSAVUSF.
             03 PSAVUSA    PICTURE X.
           02  PSAVUSI  PIC X(14).
           02  PSAVELL    COMP  PIC  S9(4).
           02  PSAVELF    PICTURE X.
           02  FILLER REDEFINES PSAVELF.
             03 PSAVELA    PICTURE X.
           02  PSAVELI  PIC X(10).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPSI1AO REDEFINES FIPSI1AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSPRFTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSHSDTO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSNAMEO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  PSKEYO  PIC X(23).
           02  FILLER PICTURE X(3).
           02  PSMT01O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU01O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS01O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA01O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS01O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL01O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT02O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU02O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS02O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA02O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS02O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL02O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT03O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU03O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS03O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA03O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS03O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL03O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT04O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU04O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS04O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA04O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS04O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL04O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT05O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU05O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS05O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA05O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS05O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL05O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT06O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU06O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS06O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA06O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS06O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL06O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT07O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU07O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS07O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA07O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS07O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL07O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT08O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU08O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS08O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA08O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS08O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL08O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT09O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU09O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS09O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA09O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS09O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL09O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT10O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU10O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS10O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA10O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS10O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL10O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT11O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU11O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS11O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA11O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS11O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL11O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSMT12O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PSFU12O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFS12O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFA12O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUS12O PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSEL12O PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSAVFUO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSAVFSO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSAVFAO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSAVUSO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSAVELO PIC ZZZZZZZZ9-.
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).