       01  FIPS4RBI.
           02  FILLER PIC X(12).
           02  PSTRIDL    COMP  PIC  S9(4).
           02  PSTRIDF    PICTURE X.
           02  FILLER REDEFINES PSTRIDF.
             03 PSTRIDA    PICTURE X.
           02  PSTRIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSPAGEDL    COMP  PIC  S9(4).
           02  PSPAGEDF    PICTURE X.
           02  FILLER REDEFINES PSPAGEDF.
             03 PSPAGEDA    PICTURE X.
           02  PSPAGEDI  PIC X(4).
           02  PSPAGEL    COMP  PIC  S9(4).
           02  PSPAGEF    PICTURE X.
           02  FILLER REDEFINES PSPAGEF.
             03 PSPAGEA    PICTURE X.
           02  PSPAGEI  PIC X(3).
           02  PSCUSTL    COMP  PIC  S9(4).
           02  PSCUSTF    PICTURE X.
           02  FILLER REDEFINES PSCUSTF.
             03 PSCUSTA    PICTURE X.
           02  PSCUSTI  PIC X(10).
           02  PSNAMEL    COMP  PIC  S9(4).
           02  PSNAMEF    PICTURE X.
           02  FILLER REDEFINES PSNAMEF.
             03 PSNAMEA    PICTURE X.
           02  PSNAMEI  PIC X(40).
           02  PSFC01L    COMP  PIC  S9(4).
           02  PSFC01F    PICTURE X.
           02  FILLER REDEFINES PSFC01F.
             03 PSFC01A    PICTURE X.
           02  PSFC01I  PIC X(1).
           02  PSIN01L    COMP  PIC  S9(4).
           02  PSIN01F    PICTURE X.
           02  FILLER REDEFINES PSIN01F.
             03 PSIN01A    PICTURE X.
           02  PSIN01I  PIC X(75).
           02  PSFC02L    COMP  PIC  S9(4).
           02  PSFC02F    PICTURE X.
           02  FILLER REDEFINES PSFC02F.
             03 PSFC02A    PICTURE X.
           02  PSFC02I  PIC X(1).
           02  PSIN02L    COMP  PIC  S9(4).
           02  PSIN02F    PICTURE X.
           02  FILLER REDEFINES PSIN02F.
             03 PSIN02A    PICTURE X.
           02  PSIN02I  PIC X(75).
           02  PSFC03L    COMP  PIC  S9(4).
           02  PSFC03F    PICTURE X.
           02  FILLER REDEFINES PSFC03F.
             03 PSFC03A    PICTURE X.
           02  PSFC03I  PIC X(1).
           02  PSIN03L    COMP  PIC  S9(4).
           02  PSIN03F    PICTURE X.
           02  FILLER REDEFINES PSIN03F.
             03 PSIN03A    PICTURE X.
           02  PSIN03I  PIC X(75).
           02  PSFC04L    COMP  PIC  S9(4).
           02  PSFC04F    PICTURE X.
           02  FILLER REDEFINES PSFC04F.
             03 PSFC04A    PICTURE X.
           02  PSFC04I  PIC X(1).
           02  PSIN04L    COMP  PIC  S9(4).
           02  PSIN04F    PICTURE X.
           02  FILLER REDEFINES PSIN04F.
             03 PSIN04A    PICTURE X.
           02  PSIN04I  PIC X(75).
           02  PSFC05L    COMP  PIC  S9(4).
           02  PSFC05F    PICTURE X.
           02  FILLER REDEFINES PSFC05F.
             03 PSFC05A    PICTURE X.
           02  PSFC05I  PIC X(1).
           02  PSIN05L    COMP  PIC  S9(4).
           02  PSIN05F    PICTURE X.
           02  FILLER REDEFINES PSIN05F.
             03 PSIN05A    PICTURE X.
           02  PSIN05I  PIC X(75).
           02  PSFC06L    COMP  PIC  S9(4).
           02  PSFC06F    PICTURE X.
           02  FILLER REDEFINES PSFC06F.
             03 PSFC06A    PICTURE X.
           02  PSFC06I  PIC X(1).
           02  PSIN06L    COMP  PIC  S9(4).
           02  PSIN06F    PICTURE X.
           02  FILLER REDEFINES PSIN06F.
             03 PSIN06A    PICTURE X.
           02  PSIN06I  PIC X(75).
           02  PSFC07L    COMP  PIC  S9(4).
           02  PSFC07F    PICTURE X.
           02  FILLER REDEFINES PSFC07F.
             03 PSFC07A    PICTURE X.
           02  PSFC07I  PIC X(1).
           02  PSIN07L    COMP  PIC  S9(4).
           02  PSIN07F    PICTURE X.
           02  FILLER REDEFINES PSIN07F.
             03 PSIN07A    PICTURE X.
           02  PSIN07I  PIC X(75).
           02  PSFC08L    COMP  PIC  S9(4).
           02  PSFC08F    PICTURE X.
           02  FILLER REDEFINES PSFC08F.
             03 PSFC08A    PICTURE X.
           02  PSFC08I  PIC X(1).
           02  PSIN08L    COMP  PIC  S9(4).
           02  PSIN08F    PICTURE X.
           02  FILLER REDEFINES PSIN08F.
             03 PSIN08A    PICTURE X.
           02  PSIN08I  PIC X(75).
           02  PSFC09L    COMP  PIC  S9(4).
           02  PSFC09F    PICTURE X.
           02  FILLER REDEFINES PSFC09F.
             03 PSFC09A    PICTURE X.
           02  PSFC09I  PIC X(1).
           02  PSIN09L    COMP  PIC  S9(4).
           02  PSIN09F    PICTURE X.
           02  FILLER REDEFINES PSIN09F.
             03 PSIN09A    PICTURE X.
           02  PSIN09I  PIC X(75).
           02  PSFC10L    COMP  PIC  S9(4).
           02  PSFC10F    PICTURE X.
           02  FILLER REDEFINES PSFC10F.
             03 PSFC10A    PICTURE X.
           02  PSFC10I  PIC X(1).
           02  PSIN10L    COMP  PIC  S9(4).
           02  PSIN10F    PICTURE X.
           02  FILLER REDEFINES PSIN10F.
             03 PSIN10A    PICTURE X.
           02  PSIN10I  PIC X(75).
           02  PSFC11L    COMP  PIC  S9(4).
           02  PSFC11F    PICTURE X.
           02  FILLER REDEFINES PSFC11F.
             03 PSFC11A    PICTURE X.
           02  PSFC11I  PIC X(1).
           02  PSIN11L    COMP  PIC  S9(4).
           02  PSIN11F    PICTURE X.
           02  FILLER REDEFINES PSIN11F.
             03 PSIN11A    PICTURE X.
           02  PSIN11I  PIC X(75).
           02  PSFC12L    COMP  PIC  S9(4).
           02  PSFC12F    PICTURE X.
           02  FILLER REDEFINES PSFC12F.
             03 PSFC12A    PICTURE X.
           02  PSFC12I  PIC X(1).
           02  PSIN12L    COMP  PIC  S9(4).
           02  PSIN12F    PICTURE X.
           02  FILLER REDEFINES PSIN12F.
             03 PSIN12A    PICTURE X.
           02  PSIN12I  PIC X(75).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPS4RBO REDEFINES FIPS4RBI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSPAGEDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSPAGEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCUSTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSNAMEO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  PSFC01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN01O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN02O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN03O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN04O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN05O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN06O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN07O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN08O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN09O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN10O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN11O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSFC12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSIN12O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).