       01  FIPS20AI.
           02  FILLER PIC X(12).
           02  PSTRIDL    COMP  PIC  S9(4).
           02  PSTRIDF    PICTURE X.
           02  FILLER REDEFINES PSTRIDF.
             03 PSTRIDA    PICTURE X.
           02  PSTRIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSCTL1L    COMP  PIC  S9(4).
           02  PSCTL1F    PICTURE X.
           02  FILLER REDEFINES PSCTL1F.
             03 PSCTL1A    PICTURE X.
           02  PSCTL1I  PIC X(2).
           02  PSCTL2L    COMP  PIC  S9(4).
           02  PSCTL2F    PICTURE X.
           02  FILLER REDEFINES PSCTL2F.
             03 PSCTL2A    PICTURE X.
           02  PSCTL2I  PIC X(3).
           02  PSCTL3L    COMP  PIC  S9(4).
           02  PSCTL3F    PICTURE X.
           02  FILLER REDEFINES PSCTL3F.
             03 PSCTL3A    PICTURE X.
           02  PSCTL3I  PIC X(3).
           02  PSCTL4L    COMP  PIC  S9(4).
           02  PSCTL4F    PICTURE X.
           02  FILLER REDEFINES PSCTL4F.
             03 PSCTL4A    PICTURE X.
           02  PSCTL4I  PIC X(4).
           02  PSPRFTL    COMP  PIC  S9(4).
           02  PSPRFTF    PICTURE X.
           02  FILLER REDEFINES PSPRFTF.
             03 PSPRFTA    PICTURE X.
           02  PSPRFTI  PIC X(10).
           02  PSAFTPL    COMP  PIC  S9(4).
           02  PSAFTPF    PICTURE X.
           02  FILLER REDEFINES PSAFTPF.
             03 PSAFTPA    PICTURE X.
           02  PSAFTPI  PIC X(1).
           02  PSACTL    COMP  PIC  S9(4).
           02  PSACTF    PICTURE X.
           02  FILLER REDEFINES PSACTF.
             03 PSACTA    PICTURE X.
           02  PSACTI  PIC X(1).
           02  PSMMYYL    COMP  PIC  S9(4).
           02  PSMMYYF    PICTURE X.
           02  FILLER REDEFINES PSMMYYF.
             03 PSMMYYA    PICTURE X.
           02  PSMMYYI  PIC X(4).
           02  PSFLDL    COMP  PIC  S9(4).
           02  PSFLDF    PICTURE X.
           02  FILLER REDEFINES PSFLDF.
             03 PSFLDA    PICTURE X.
           02  PSFLDI  PIC X(3).
           02  PSDATL    COMP  PIC  S9(4).
           02  PSDATF    PICTURE X.
           02  FILLER REDEFINES PSDATF.
             03 PSDATA    PICTURE X.
           02  PSDATI  PIC X(35).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPS20AO REDEFINES FIPS20AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSPRFTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSAFTPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSACTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSMMYYO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSFLDO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSDATO  PIC X(35).
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).