       01  FIPSIEAI.
           02  FILLER PIC X(12).
           02  PSTRIDL    COMP  PIC  S9(4).
           02  PSTRIDF    PICTURE X.
           02  FILLER REDEFINES PSTRIDF.
             03 PSTRIDA    PICTURE X.
           02  PSTRIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSPGNOL    COMP  PIC  S9(4).
           02  PSPGNOF    PICTURE X.
           02  FILLER REDEFINES PSPGNOF.
             03 PSPGNOA    PICTURE X.
           02  PSPGNOI  PIC X(2).
           02  PSPRFTL    COMP  PIC  S9(4).
           02  PSPRFTF    PICTURE X.
           02  FILLER REDEFINES PSPRFTF.
             03 PSPRFTA    PICTURE X.
           02  PSPRFTI  PIC X(10).
           02  PSNAMEL    COMP  PIC  S9(4).
           02  PSNAMEF    PICTURE X.
           02  FILLER REDEFINES PSNAMEF.
             03 PSNAMEA    PICTURE X.
           02  PSNAMEI  PIC X(25).
           02  PSKEYL    COMP  PIC  S9(4).
           02  PSKEYF    PICTURE X.
           02  FILLER REDEFINES PSKEYF.
             03 PSKEYA    PICTURE X.
           02  PSKEYI  PIC X(23).
           02  PSLINED OCCURS 16 TIMES.
             03  PSLINEL    COMP  PIC  S9(4).
             03  PSLINEF    PICTURE X.
             03  PSLINEI  PIC X(79).
           02  PSPAGEFL    COMP  PIC  S9(4).
           02  PSPAGEFF    PICTURE X.
           02  FILLER REDEFINES PSPAGEFF.
             03 PSPAGEFA    PICTURE X.
           02  PSPAGEFI  PIC X(19).
           02  PSPAGEBL    COMP  PIC  S9(4).
           02  PSPAGEBF    PICTURE X.
           02  FILLER REDEFINES PSPAGEBF.
             03 PSPAGEBA    PICTURE X.
           02  PSPAGEBI  PIC X(19).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPSIEAO REDEFINES FIPSIEAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSPGNOO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSPRFTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSNAMEO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  PSKEYO  PIC X(23).
           02  DFHMS1 OCCURS 16 TIMES.
             03  FILLER PICTURE X(2).
             03  PSLINEA    PICTURE X.
             03  PSLINEO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  PSPAGEFO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  PSPAGEBO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).