       01  FIPS4PAI.
           02  FILLER PIC X(12).
           02  PSTRNIDL    COMP  PIC  S9(4).
           02  PSTRNIDF    PICTURE X.
           02  FILLER REDEFINES PSTRNIDF.
             03 PSTRNIDA    PICTURE X.
           02  PSTRNIDI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSNAMEL    COMP  PIC  S9(4).
           02  PSNAMEF    PICTURE X.
           02  FILLER REDEFINES PSNAMEF.
             03 PSNAMEA    PICTURE X.
           02  PSNAMEI  PIC X(40).
           02  PSCUSTL    COMP  PIC  S9(4).
           02  PSCUSTF    PICTURE X.
           02  FILLER REDEFINES PSCUSTF.
             03 PSCUSTA    PICTURE X.
           02  PSCUSTI  PIC X(10).
           02  PSCOMRTL    COMP  PIC  S9(4).
           02  PSCOMRTF    PICTURE X.
           02  FILLER REDEFINES PSCOMRTF.
             03 PSCOMRTA    PICTURE X.
           02  PSCOMRTI  PIC X(11).
           02  PSCOMBLL    COMP  PIC  S9(4).
           02  PSCOMBLF    PICTURE X.
           02  FILLER REDEFINES PSCOMBLF.
             03 PSCOMBLA    PICTURE X.
           02  PSCOMBLI  PIC X(14).
           02  PSNINBLL    COMP  PIC  S9(4).
           02  PSNINBLF    PICTURE X.
           02  FILLER REDEFINES PSNINBLF.
             03 PSNINBLA    PICTURE X.
           02  PSNINBLI  PIC X(14).
           02  PSOTLRTL    COMP  PIC  S9(4).
           02  PSOTLRTF    PICTURE X.
           02  FILLER REDEFINES PSOTLRTF.
             03 PSOTLRTA    PICTURE X.
           02  PSOTLRTI  PIC X(11).
           02  PSOTLBLL    COMP  PIC  S9(4).
           02  PSOTLBLF    PICTURE X.
           02  FILLER REDEFINES PSOTLBLF.
             03 PSOTLBLA    PICTURE X.
           02  PSOTLBLI  PIC X(14).
           02  PSINTRTL    COMP  PIC  S9(4).
           02  PSINTRTF    PICTURE X.
           02  FILLER REDEFINES PSINTRTF.
             03 PSINTRTA    PICTURE X.
           02  PSINTRTI  PIC X(11).
           02  PSINTBLL    COMP  PIC  S9(4).
           02  PSINTBLF    PICTURE X.
           02  FILLER REDEFINES PSINTBLF.
             03 PSINTBLA    PICTURE X.
           02  PSINTBLI  PIC X(14).
           02  PSUSDBLL    COMP  PIC  S9(4).
           02  PSUSDBLF    PICTURE X.
           02  FILLER REDEFINES PSUSDBLF.
             03 PSUSDBLA    PICTURE X.
           02  PSUSDBLI  PIC X(16).
           02  PSSUPBLL    COMP  PIC  S9(4).
           02  PSSUPBLF    PICTURE X.
           02  FILLER REDEFINES PSSUPBLF.
             03 PSSUPBLA    PICTURE X.
           02  PSSUPBLI  PIC X(16).
           02  PSALLCPL    COMP  PIC  S9(4).
           02  PSALLCPF    PICTURE X.
           02  FILLER REDEFINES PSALLCPF.
             03 PSALLCPA    PICTURE X.
           02  PSALLCPI  PIC X(14).
           02  PSUSSUPL    COMP  PIC  S9(4).
           02  PSUSSUPF    PICTURE X.
           02  FILLER REDEFINES PSUSSUPF.
             03 PSUSSUPA    PICTURE X.
           02  PSUSSUPI  PIC X(16).
           02  PSSVINCL    COMP  PIC  S9(4).
           02  PSSVINCF    PICTURE X.
           02  FILLER REDEFINES PSSVINCF.
             03 PSSVINCA    PICTURE X.
           02  PSSVINCI  PIC X(14).
           02  PSSVEXPL    COMP  PIC  S9(4).
           02  PSSVEXPF    PICTURE X.
           02  FILLER REDEFINES PSSVEXPF.
             03 PSSVEXPA    PICTURE X.
           02  PSSVEXPI  PIC X(14).
           02  PSLIINCL    COMP  PIC  S9(4).
           02  PSLIINCF    PICTURE X.
           02  FILLER REDEFINES PSLIINCF.
             03 PSLIINCA    PICTURE X.
           02  PSLIINCI  PIC X(14).
           02  PSDIEXPL    COMP  PIC  S9(4).
           02  PSDIEXPF    PICTURE X.
           02  FILLER REDEFINES PSDIEXPF.
             03 PSDIEXPA    PICTURE X.
           02  PSDIEXPI  PIC X(14).
           02  PSFNCRL    COMP  PIC  S9(4).
           02  PSFNCRF    PICTURE X.
           02  FILLER REDEFINES PSFNCRF.
             03 PSFNCRA    PICTURE X.
           02  PSFNCRI  PIC X(10).
           02  PSFNINCL    COMP  PIC  S9(4).
           02  PSFNINCF    PICTURE X.
           02  FILLER REDEFINES PSFNINCF.
             03 PSFNINCA    PICTURE X.
           02  PSFNINCI  PIC X(14).
           02  PSFNCSTL    COMP  PIC  S9(4).
           02  PSFNCSTF    PICTURE X.
           02  FILLER REDEFINES PSFNCSTF.
             03 PSFNCSTA    PICTURE X.
           02  PSFNCSTI  PIC X(10).
           02  PSFNEXPL    COMP  PIC  S9(4).
           02  PSFNEXPF    PICTURE X.
           02  FILLER REDEFINES PSFNEXPF.
             03 PSFNEXPA    PICTURE X.
           02  PSFNEXPI  PIC X(14).
           02  PSOTINCL    COMP  PIC  S9(4).
           02  PSOTINCF    PICTURE X.
           02  FILLER REDEFINES PSOTINCF.
             03 PSOTINCA    PICTURE X.
           02  PSOTINCI  PIC X(14).
           02  PSOLEXPL    COMP  PIC  S9(4).
           02  PSOLEXPF    PICTURE X.
           02  FILLER REDEFINES PSOLEXPF.
             03 PSOLEXPA    PICTURE X.
           02  PSOLEXPI  PIC X(14).
           02  PSCFINCL    COMP  PIC  S9(4).
           02  PSCFINCF    PICTURE X.
           02  FILLER REDEFINES PSCFINCF.
             03 PSCFINCA    PICTURE X.
           02  PSCFINCI  PIC X(14).
           02  PSODEXPL    COMP  PIC  S9(4).
           02  PSODEXPF    PICTURE X.
           02  FILLER REDEFINES PSODEXPF.
             03 PSODEXPA    PICTURE X.
           02  PSODEXPI  PIC X(14).
           02  PSTOINCL    COMP  PIC  S9(4).
           02  PSTOINCF    PICTURE X.
           02  FILLER REDEFINES PSTOINCF.
             03 PSTOINCA    PICTURE X.
           02  PSTOINCI  PIC X(16).
           02  PSTOEXPL    COMP  PIC  S9(4).
           02  PSTOEXPF    PICTURE X.
           02  FILLER REDEFINES PSTOEXPF.
             03 PSTOEXPA    PICTURE X.
           02  PSTOEXPI  PIC X(16).
           02  PSCLREQL    COMP  PIC  S9(4).
           02  PSCLREQF    PICTURE X.
           02  FILLER REDEFINES PSCLREQF.
             03 PSCLREQA    PICTURE X.
           02  PSCLREQI  PIC X(10).
           02  PSPROFL    COMP  PIC  S9(4).
           02  PSPROFF    PICTURE X.
           02  FILLER REDEFINES PSPROFF.
             03 PSPROFA    PICTURE X.
           02  PSPROFI  PIC X(10).
           02  PSNPROFL    COMP  PIC  S9(4).
           02  PSNPROFF    PICTURE X.
           02  FILLER REDEFINES PSNPROFF.
             03 PSNPROFA    PICTURE X.
           02  PSNPROFI  PIC X(16).
           02  PSDDREQL    COMP  PIC  S9(4).
           02  PSDDREQF    PICTURE X.
           02  FILLER REDEFINES PSDDREQF.
             03 PSDDREQA    PICTURE X.
           02  PSDDREQI  PIC X(16).
           02  PSMTHODL    COMP  PIC  S9(4).
           02  PSMTHODF    PICTURE X.
           02  FILLER REDEFINES PSMTHODF.
             03 PSMTHODA    PICTURE X.
           02  PSMTHODI  PIC X(22).
           02  PSROCPTL    COMP  PIC  S9(4).
           02  PSROCPTF    PICTURE X.
           02  FILLER REDEFINES PSROCPTF.
             03 PSROCPTA    PICTURE X.
           02  PSROCPTI  PIC X(11).
           02  PSFEREQL    COMP  PIC  S9(4).
           02  PSFEREQF    PICTURE X.
           02  FILLER REDEFINES PSFEREQF.
             03 PSFEREQA    PICTURE X.
           02  PSFEREQI  PIC X(16).
           02  PSPFINXL    COMP  PIC  S9(4).
           02  PSPFINXF    PICTURE X.
           02  FILLER REDEFINES PSPFINXF.
             03 PSPFINXA    PICTURE X.
           02  PSPFINXI  PIC X(4).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPS4PAO REDEFINES FIPS4PAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRNIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSNAMEO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  PSCUSTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSCOMRTO PIC ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  PSCOMBLO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSNINBLO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSOTLRTO PIC ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  PSOTLBLO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSINTRTO PIC ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  PSINTBLO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUSDBLO PIC Z(14)9-.
           02  FILLER PICTURE X(3).
           02  PSSUPBLO PIC Z(14)9-.
           02  FILLER PICTURE X(3).
           02  PSALLCPO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSUSSUPO PIC Z(14)9-.
           02  FILLER PICTURE X(3).
           02  PSSVINCO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSSVEXPO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSLIINCO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSDIEXPO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFNCRO PIC ZZ9.9(6).
           02  FILLER PICTURE X(3).
           02  PSFNINCO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSFNCSTO PIC ZZ9.9(6).
           02  FILLER PICTURE X(3).
           02  PSFNEXPO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSOTINCO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSOLEXPO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSCFINCO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSODEXPO PIC Z(12)9-.
           02  FILLER PICTURE X(3).
           02  PSTOINCO PIC Z(14)9-.
           02  FILLER PICTURE X(3).
           02  PSTOEXPO PIC Z(14)9-.
           02  FILLER PICTURE X(3).
           02  PSCLREQO PIC ZZ9.9(6).
           02  FILLER PICTURE X(3).
           02  PSPROFO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PSNPROFO PIC Z(14)9-.
           02  FILLER PICTURE X(3).
           02  PSDDREQO PIC Z(12),ZZ9.
           02  FILLER PICTURE X(3).
           02  PSMTHODO  PIC X(22).
           02  FILLER PICTURE X(3).
           02  PSROCPTO PIC ZZ9.9(6)-.
           02  FILLER PICTURE X(3).
           02  PSFEREQO PIC Z(12),ZZ9.
           02  FILLER PICTURE X(3).
           02  PSPFINXO PIC ZZ9-.
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).