       01  FIPSFABI.
           02  FILLER PIC X(12).
           02  PSTRANBL    COMP  PIC  S9(4).
           02  PSTRANBF    PICTURE X.
           02  FILLER REDEFINES PSTRANBF.
             03 PSTRANBA    PICTURE X.
           02  PSTRANBI  PIC X(4).
           02  PSDATEBL    COMP  PIC  S9(4).
           02  PSDATEBF    PICTURE X.
           02  FILLER REDEFINES PSDATEBF.
             03 PSDATEBA    PICTURE X.
           02  PSDATEBI  PIC X(8).
           02  PSTIMEBL    COMP  PIC  S9(4).
           02  PSTIMEBF    PICTURE X.
           02  FILLER REDEFINES PSTIMEBF.
             03 PSTIMEBA    PICTURE X.
           02  PSTIMEBI  PIC X(8).
           02  PSCTL1BL    COMP  PIC  S9(4).
           02  PSCTL1BF    PICTURE X.
           02  FILLER REDEFINES PSCTL1BF.
             03 PSCTL1BA    PICTURE X.
           02  PSCTL1BI  PIC X(2).
           02  PSCTL2BL    COMP  PIC  S9(4).
           02  PSCTL2BF    PICTURE X.
           02  FILLER REDEFINES PSCTL2BF.
             03 PSCTL2BA    PICTURE X.
           02  PSCTL2BI  PIC X(3).
           02  PSCTL3BL    COMP  PIC  S9(4).
           02  PSCTL3BF    PICTURE X.
           02  FILLER REDEFINES PSCTL3BF.
             03 PSCTL3BA    PICTURE X.
           02  PSCTL3BI  PIC X(3).
           02  PSCTL4BL    COMP  PIC  S9(4).
           02  PSCTL4BF    PICTURE X.
           02  FILLER REDEFINES PSCTL4BF.
             03 PSCTL4BA    PICTURE X.
           02  PSCTL4BI  PIC X(4).
           02  PSCO01BL    COMP  PIC  S9(4).
           02  PSCO01BF    PICTURE X.
           02  FILLER REDEFINES PSCO01BF.
             03 PSCO01BA    PICTURE X.
           02  PSCO01BI  PIC X(10).
           02  PSCO02BL    COMP  PIC  S9(4).
           02  PSCO02BF    PICTURE X.
           02  FILLER REDEFINES PSCO02BF.
             03 PSCO02BA    PICTURE X.
           02  PSCO02BI  PIC X(10).
           02  PSCO03BL    COMP  PIC  S9(4).
           02  PSCO03BF    PICTURE X.
           02  FILLER REDEFINES PSCO03BF.
             03 PSCO03BA    PICTURE X.
           02  PSCO03BI  PIC X(10).
           02  PSCR01BL    COMP  PIC  S9(4).
           02  PSCR01BF    PICTURE X.
           02  FILLER REDEFINES PSCR01BF.
             03 PSCR01BA    PICTURE X.
           02  PSCR01BI  PIC X(10).
           02  PSCR02BL    COMP  PIC  S9(4).
           02  PSCR02BF    PICTURE X.
           02  FILLER REDEFINES PSCR02BF.
             03 PSCR02BA    PICTURE X.
           02  PSCR02BI  PIC X(10).
           02  PSCR03BL    COMP  PIC  S9(4).
           02  PSCR03BF    PICTURE X.
           02  FILLER REDEFINES PSCR03BF.
             03 PSCR03BA    PICTURE X.
           02  PSCR03BI  PIC X(10).
           02  PSEA01BL    COMP  PIC  S9(4).
           02  PSEA01BF    PICTURE X.
           02  FILLER REDEFINES PSEA01BF.
             03 PSEA01BA    PICTURE X.
           02  PSEA01BI  PIC X(10).
           02  PSEX01BL    COMP  PIC  S9(4).
           02  PSEX01BF    PICTURE X.
           02  FILLER REDEFINES PSEX01BF.
             03 PSEX01BA    PICTURE X.
           02  PSEX01BI  PIC X(10).
           02  PSCL01BL    COMP  PIC  S9(4).
           02  PSCL01BF    PICTURE X.
           02  FILLER REDEFINES PSCL01BF.
             03 PSCL01BA    PICTURE X.
           02  PSCL01BI  PIC X(10).
           02  PSCL02BL    COMP  PIC  S9(4).
           02  PSCL02BF    PICTURE X.
           02  FILLER REDEFINES PSCL02BF.
             03 PSCL02BA    PICTURE X.
           02  PSCL02BI  PIC X(10).
           02  PSCL03BL    COMP  PIC  S9(4).
           02  PSCL03BF    PICTURE X.
           02  FILLER REDEFINES PSCL03BF.
             03 PSCL03BA    PICTURE X.
           02  PSCL03BI  PIC X(10).
           02  PSCL04BL    COMP  PIC  S9(4).
           02  PSCL04BF    PICTURE X.
           02  FILLER REDEFINES PSCL04BF.
             03 PSCL04BA    PICTURE X.
           02  PSCL04BI  PIC X(10).
           02  PSRE01BL    COMP  PIC  S9(4).
           02  PSRE01BF    PICTURE X.
           02  FILLER REDEFINES PSRE01BF.
             03 PSRE01BA    PICTURE X.
           02  PSRE01BI  PIC X(10).
           02  PSIC01BL    COMP  PIC  S9(4).
           02  PSIC01BF    PICTURE X.
           02  FILLER REDEFINES PSIC01BF.
             03 PSIC01BA    PICTURE X.
           02  PSIC01BI  PIC X(10).
           02  PSDD01BL    COMP  PIC  S9(4).
           02  PSDD01BF    PICTURE X.
           02  FILLER REDEFINES PSDD01BF.
             03 PSDD01BA    PICTURE X.
           02  PSDD01BI  PIC X(10).
           02  PSCC01BL    COMP  PIC  S9(4).
           02  PSCC01BF    PICTURE X.
           02  FILLER REDEFINES PSCC01BF.
             03 PSCC01BA    PICTURE X.
           02  PSCC01BI  PIC X(10).
           02  PSOD01BL    COMP  PIC  S9(4).
           02  PSOD01BF    PICTURE X.
           02  FILLER REDEFINES PSOD01BF.
             03 PSOD01BA    PICTURE X.
           02  PSOD01BI  PIC X(10).
           02  PSOT01BL    COMP  PIC  S9(4).
           02  PSOT01BF    PICTURE X.
           02  FILLER REDEFINES PSOT01BF.
             03 PSOT01BA    PICTURE X.
           02  PSOT01BI  PIC X(10).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPSFABO REDEFINES FIPSFABI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRANBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSCTL1BO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSCTL2BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL3BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL4BO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSCO01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCO02BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCO03BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCR01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCR02BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCR03BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSEA01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSEX01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCL01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCL02BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCL03BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCL04BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSRE01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSIC01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSDD01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSCC01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSOD01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSOT01BO PIC Z.9(8).
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).