       01  FIPSFAAI.
           02  FILLER PIC X(12).
           02  PSTRANAL    COMP  PIC  S9(4).
           02  PSTRANAF    PICTURE X.
           02  FILLER REDEFINES PSTRANAF.
             03 PSTRANAA    PICTURE X.
           02  PSTRANAI  PIC X(4).
           02  PSDATEAL    COMP  PIC  S9(4).
           02  PSDATEAF    PICTURE X.
           02  FILLER REDEFINES PSDATEAF.
             03 PSDATEAA    PICTURE X.
           02  PSDATEAI  PIC X(8).
           02  PSTIMEAL    COMP  PIC  S9(4).
           02  PSTIMEAF    PICTURE X.
           02  FILLER REDEFINES PSTIMEAF.
             03 PSTIMEAA    PICTURE X.
           02  PSTIMEAI  PIC X(8).
           02  PSCTL1AL    COMP  PIC  S9(4).
           02  PSCTL1AF    PICTURE X.
           02  FILLER REDEFINES PSCTL1AF.
             03 PSCTL1AA    PICTURE X.
           02  PSCTL1AI  PIC X(2).
           02  PSCTL2AL    COMP  PIC  S9(4).
           02  PSCTL2AF    PICTURE X.
           02  FILLER REDEFINES PSCTL2AF.
             03 PSCTL2AA    PICTURE X.
           02  PSCTL2AI  PIC X(3).
           02  PSCTL3AL    COMP  PIC  S9(4).
           02  PSCTL3AF    PICTURE X.
           02  FILLER REDEFINES PSCTL3AF.
             03 PSCTL3AA    PICTURE X.
           02  PSCTL3AI  PIC X(3).
           02  PSCTL4AL    COMP  PIC  S9(4).
           02  PSCTL4AF    PICTURE X.
           02  FILLER REDEFINES PSCTL4AF.
             03 PSCTL4AA    PICTURE X.
           02  PSCTL4AI  PIC X(4).
           02  PSACT1AL    COMP  PIC  S9(4).
           02  PSACT1AF    PICTURE X.
           02  FILLER REDEFINES PSACT1AF.
             03 PSACT1AA    PICTURE X.
           02  PSACT1AI  PIC X(1).
           02  PSACT2AL    COMP  PIC  S9(4).
           02  PSACT2AF    PICTURE X.
           02  FILLER REDEFINES PSACT2AF.
             03 PSACT2AA    PICTURE X.
           02  PSACT2AI  PIC X(1).
           02  PSACT3AL    COMP  PIC  S9(4).
           02  PSACT3AF    PICTURE X.
           02  FILLER REDEFINES PSACT3AF.
             03 PSACT3AA    PICTURE X.
           02  PSACT3AI  PIC X(1).
           02  PSERRAL    COMP  PIC  S9(4).
           02  PSERRAF    PICTURE X.
           02  FILLER REDEFINES PSERRAF.
             03 PSERRAA    PICTURE X.
           02  PSERRAI  PIC X(79).
       01  FIPSFAAO REDEFINES FIPSFAAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRANAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSCTL1AO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSCTL2AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL3AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL4AO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSACT1AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSACT2AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSACT3AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSERRAO  PIC X(79).