       01  FIPSEMAI.
           02  FILLER PIC X(12).
           02  PSTRANL    COMP  PIC  S9(4).
           02  PSTRANF    PICTURE X.
           02  FILLER REDEFINES PSTRANF.
             03 PSTRANA    PICTURE X.
           02  PSTRANI  PIC X(4).
           02  PSDATEL    COMP  PIC  S9(4).
           02  PSDATEF    PICTURE X.
           02  FILLER REDEFINES PSDATEF.
             03 PSDATEA    PICTURE X.
           02  PSDATEI  PIC X(8).
           02  PSTIMEL    COMP  PIC  S9(4).
           02  PSTIMEF    PICTURE X.
           02  FILLER REDEFINES PSTIMEF.
             03 PSTIMEA    PICTURE X.
           02  PSTIMEI  PIC X(8).
           02  PSCTL1L    COMP  PIC  S9(4).
           02  PSCTL1F    PICTURE X.
           02  FILLER REDEFINES PSCTL1F.
             03 PSCTL1A    PICTURE X.
           02  PSCTL1I  PIC X(2).
           02  PSCTL2L    COMP  PIC  S9(4).
           02  PSCTL2F    PICTURE X.
           02  FILLER REDEFINES PSCTL2F.
             03 PSCTL2A    PICTURE X.
           02  PSCTL2I  PIC X(3).
           02  PSCTL3L    COMP  PIC  S9(4).
           02  PSCTL3F    PICTURE X.
           02  FILLER REDEFINES PSCTL3F.
             03 PSCTL3A    PICTURE X.
           02  PSCTL3I  PIC X(3).
           02  PSCTL4L    COMP  PIC  S9(4).
           02  PSCTL4F    PICTURE X.
           02  FILLER REDEFINES PSCTL4F.
             03 PSCTL4A    PICTURE X.
           02  PSCTL4I  PIC X(4).
           02  PSTPPHL    COMP  PIC  S9(4).
           02  PSTPPHF    PICTURE X.
           02  FILLER REDEFINES PSTPPHF.
             03 PSTPPHA    PICTURE X.
           02  PSTPPHI  PIC X(7).
           02  PSACTL    COMP  PIC  S9(4).
           02  PSACTF    PICTURE X.
           02  FILLER REDEFINES PSACTF.
             03 PSACTA    PICTURE X.
           02  PSACTI  PIC X(1).
           02  PSORDTL    COMP  PIC  S9(4).
           02  PSORDTF    PICTURE X.
           02  FILLER REDEFINES PSORDTF.
             03 PSORDTA    PICTURE X.
           02  PSORDTI  PIC X(4).
           02  PSMO1L    COMP  PIC  S9(4).
           02  PSMO1F    PICTURE X.
           02  FILLER REDEFINES PSMO1F.
             03 PSMO1A    PICTURE X.
           02  PSMO1I  PIC X(3).
           02  PSRT1L    COMP  PIC  S9(4).
           02  PSRT1F    PICTURE X.
           02  FILLER REDEFINES PSRT1F.
             03 PSRT1A    PICTURE X.
           02  PSRT1I  PIC X(6).
           02  PSMO2L    COMP  PIC  S9(4).
           02  PSMO2F    PICTURE X.
           02  FILLER REDEFINES PSMO2F.
             03 PSMO2A    PICTURE X.
           02  PSMO2I  PIC X(3).
           02  PSRT2L    COMP  PIC  S9(4).
           02  PSRT2F    PICTURE X.
           02  FILLER REDEFINES PSRT2F.
             03 PSRT2A    PICTURE X.
           02  PSRT2I  PIC X(6).
           02  PSMO3L    COMP  PIC  S9(4).
           02  PSMO3F    PICTURE X.
           02  FILLER REDEFINES PSMO3F.
             03 PSMO3A    PICTURE X.
           02  PSMO3I  PIC X(3).
           02  PSRT3L    COMP  PIC  S9(4).
           02  PSRT3F    PICTURE X.
           02  FILLER REDEFINES PSRT3F.
             03 PSRT3A    PICTURE X.
           02  PSRT3I  PIC X(6).
           02  PSMO4L    COMP  PIC  S9(4).
           02  PSMO4F    PICTURE X.
           02  FILLER REDEFINES PSMO4F.
             03 PSMO4A    PICTURE X.
           02  PSMO4I  PIC X(3).
           02  PSRT4L    COMP  PIC  S9(4).
           02  PSRT4F    PICTURE X.
           02  FILLER REDEFINES PSRT4F.
             03 PSRT4A    PICTURE X.
           02  PSRT4I  PIC X(6).
           02  PSMO5L    COMP  PIC  S9(4).
           02  PSMO5F    PICTURE X.
           02  FILLER REDEFINES PSMO5F.
             03 PSMO5A    PICTURE X.
           02  PSMO5I  PIC X(3).
           02  PSRT5L    COMP  PIC  S9(4).
           02  PSRT5F    PICTURE X.
           02  FILLER REDEFINES PSRT5F.
             03 PSRT5A    PICTURE X.
           02  PSRT5I  PIC X(6).
           02  PSMO6L    COMP  PIC  S9(4).
           02  PSMO6F    PICTURE X.
           02  FILLER REDEFINES PSMO6F.
             03 PSMO6A    PICTURE X.
           02  PSMO6I  PIC X(3).
           02  PSRT6L    COMP  PIC  S9(4).
           02  PSRT6F    PICTURE X.
           02  FILLER REDEFINES PSRT6F.
             03 PSRT6A    PICTURE X.
           02  PSRT6I  PIC X(6).
           02  PSMO7L    COMP  PIC  S9(4).
           02  PSMO7F    PICTURE X.
           02  FILLER REDEFINES PSMO7F.
             03 PSMO7A    PICTURE X.
           02  PSMO7I  PIC X(3).
           02  PSRT7L    COMP  PIC  S9(4).
           02  PSRT7F    PICTURE X.
           02  FILLER REDEFINES PSRT7F.
             03 PSRT7A    PICTURE X.
           02  PSRT7I  PIC X(6).
           02  PSMO8L    COMP  PIC  S9(4).
           02  PSMO8F    PICTURE X.
           02  FILLER REDEFINES PSMO8F.
             03 PSMO8A    PICTURE X.
           02  PSMO8I  PIC X(3).
           02  PSRT8L    COMP  PIC  S9(4).
           02  PSRT8F    PICTURE X.
           02  FILLER REDEFINES PSRT8F.
             03 PSRT8A    PICTURE X.
           02  PSRT8I  PIC X(6).
           02  PSMO9L    COMP  PIC  S9(4).
           02  PSMO9F    PICTURE X.
           02  FILLER REDEFINES PSMO9F.
             03 PSMO9A    PICTURE X.
           02  PSMO9I  PIC X(3).
           02  PSRT9L    COMP  PIC  S9(4).
           02  PSRT9F    PICTURE X.
           02  FILLER REDEFINES PSRT9F.
             03 PSRT9A    PICTURE X.
           02  PSRT9I  PIC X(6).
           02  PSMO10L    COMP  PIC  S9(4).
           02  PSMO10F    PICTURE X.
           02  FILLER REDEFINES PSMO10F.
             03 PSMO10A    PICTURE X.
           02  PSMO10I  PIC X(3).
           02  PSRT10L    COMP  PIC  S9(4).
           02  PSRT10F    PICTURE X.
           02  FILLER REDEFINES PSRT10F.
             03 PSRT10A    PICTURE X.
           02  PSRT10I  PIC X(6).
           02  PSMO11L    COMP  PIC  S9(4).
           02  PSMO11F    PICTURE X.
           02  FILLER REDEFINES PSMO11F.
             03 PSMO11A    PICTURE X.
           02  PSMO11I  PIC X(3).
           02  PSRT11L    COMP  PIC  S9(4).
           02  PSRT11F    PICTURE X.
           02  FILLER REDEFINES PSRT11F.
             03 PSRT11A    PICTURE X.
           02  PSRT11I  PIC X(6).
           02  PSMO12L    COMP  PIC  S9(4).
           02  PSMO12F    PICTURE X.
           02  FILLER REDEFINES PSMO12F.
             03 PSMO12A    PICTURE X.
           02  PSMO12I  PIC X(3).
           02  PSRT12L    COMP  PIC  S9(4).
           02  PSRT12F    PICTURE X.
           02  FILLER REDEFINES PSRT12F.
             03 PSRT12A    PICTURE X.
           02  PSRT12I  PIC X(6).
           02  PSMO13L    COMP  PIC  S9(4).
           02  PSMO13F    PICTURE X.
           02  FILLER REDEFINES PSMO13F.
             03 PSMO13A    PICTURE X.
           02  PSMO13I  PIC X(3).
           02  PSRT13L    COMP  PIC  S9(4).
           02  PSRT13F    PICTURE X.
           02  FILLER REDEFINES PSRT13F.
             03 PSRT13A    PICTURE X.
           02  PSRT13I  PIC X(6).
           02  PSMO14L    COMP  PIC  S9(4).
           02  PSMO14F    PICTURE X.
           02  FILLER REDEFINES PSMO14F.
             03 PSMO14A    PICTURE X.
           02  PSMO14I  PIC X(3).
           02  PSRT14L    COMP  PIC  S9(4).
           02  PSRT14F    PICTURE X.
           02  FILLER REDEFINES PSRT14F.
             03 PSRT14A    PICTURE X.
           02  PSRT14I  PIC X(6).
           02  PSMO15L    COMP  PIC  S9(4).
           02  PSMO15F    PICTURE X.
           02  FILLER REDEFINES PSMO15F.
             03 PSMO15A    PICTURE X.
           02  PSMO15I  PIC X(3).
           02  PSRT15L    COMP  PIC  S9(4).
           02  PSRT15F    PICTURE X.
           02  FILLER REDEFINES PSRT15F.
             03 PSRT15A    PICTURE X.
           02  PSRT15I  PIC X(6).
           02  PSERRORL    COMP  PIC  S9(4).
           02  PSERRORF    PICTURE X.
           02  FILLER REDEFINES PSERRORF.
             03 PSERRORA    PICTURE X.
           02  PSERRORI  PIC X(79).
       01  FIPSEMAO REDEFINES FIPSEMAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  PSTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PSCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSCTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSTPPHO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  PSACTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PSORDTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  PSMO1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT1O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT2O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT3O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO4O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT4O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO5O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT5O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO6O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT6O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO7O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT7O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO8O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT8O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO9O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT9O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO10O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT10O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO11O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT11O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO12O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT12O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO13O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT13O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO14O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT14O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSMO15O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  PSRT15O PIC .9(5).
           02  FILLER PICTURE X(3).
           02  PSERRORO  PIC X(79).