      *---------------------------------------------------------------*
      * SISTEMA : FINANCIAL MANAGEMENT SYSTEM (FMS)                   * 00000530
      * COPY    : FM01FMT4                                            * 00000530
      * ARCHIVO : FILE DE DEB/CRE Y SALDOS DE UN MES DE FMS PARA PC   * 00000530
      * LONGITUD: 150 BYTES                                           * 00000530
      *---------------------------------------------------------------*
       01  REG-FM01FMT.                                                 00000530
           02 DAT-REG-FM01FMT.                                          00000540
      *---------------------------------------------------------------*
      *   --  CODIGO DE CUENTA CONTABLE- (  1 - 10 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-CTA.                                                00000590
                06 FMT-CTA2  PIC X(02).                                   000005
                06 FMT-CTA3  PIC X(01).                                   000005
                06 FMT-CTA7  PIC X(07).                                   000005
             04 FMT-RC    PIC X(10).                                      000005
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 1 ---------- ( 11 - 11 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-COM1     PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  SIGNO DE SALDO  ---------- ( 12 - 12 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-SG1-MES  PIC X VALUE ' '.                             000006
      *---------------------------------------------------------------*
      *   --  SALDO  DEL MES             ( 13 - 31 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-SDO-MES  PIC 9(16).99.
      *---------------------------------------------------------------*
      *   --  SIGNO DE SALDO  ---------- ( 32 - 32 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-SG2-MES  PIC X VALUE ' '.                             000006
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 2 ---------- ( 32 - 32 ) --             * *
      *---------------------------------------------------------------*
      *      04 FMT-COM2     PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  TOTAL DE DEBITOS           ( 33 - 51 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-DEBITOS  PIC 9(16).99.
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 3 ---------- ( 51 - 51 ) --             * *
      *---------------------------------------------------------------*
      *      04 FMT-COM3     PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  TOTAL DE CREDITOS          ( 52 - 70 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-CREDITOS PIC 9(16).99.
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 4 ---------- ( 70 - 70 ) --             * *
      *---------------------------------------------------------------*
      *      04 FMT-COM4     PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  TIPO DE FLAG DE CTA.D/C -- ( 71 - 71 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-DB-CR    PIC X VALUE ' '.                           00000590
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 5 ---------- ( 72 - 72 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-COM5     PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  MES Y AñO BAJADO---------- ( 73 - 76 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-MM       PIC 99.                                    00000590
             04 FMT-AA       PIC 99.                                    00000590
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 6 ---------- ( 77 - 77 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-COM6     PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  COD.COMPAñIA    ---------- ( 78 - 81 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-CIA      PIC X(4).                                  00000590
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 7 ---------- ( 82 - 82 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-COM7     PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  FECHA PROCESO   ---------- ( 83 - 88 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-PROC.                                               00000590
                06 FMT-DD-PROC  PIC 99.                                 00000590
                06 FMT-MM-PROC  PIC 99.                                 00000590
                06 FMT-AA-PROC  PIC 99.                                 00000590
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 8 ---------- ( 89 - 89 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-COM8     PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  HORA  PROCESO   ---------- ( 90 - 95 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-TIME.                                               00000590
                06 FMT-HH-PROC  PIC 99.                                 00000590
                06 FMT-MI-PROC  PIC 99.                                 00000590
                06 FMT-SS-PROC  PIC 99.                                 00000590
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 9 ---------- ( 96 - 96 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-COM9     PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  ULTIMO MES CERRADO ------- ( 97 - 99 ) --             * *
      *---------------------------------------------------------------*
             04 FMT-MO-CLO      PIC 999.                                00000590
      *---------------------------------------------------------------*
      *   --  DELIMITITADOR 10---------- (100 - 100) --             * *
      *---------------------------------------------------------------*
             04 FMT-COM10    PIC X VALUE ','.                           00000590
      *---------------------------------------------------------------*
      *   --  DESCRIPCION DE CUENTA ---- (101 - 140) --             * *
      *---------------------------------------------------------------*
             04 FMT-DESC        PIC X(40).                              00000590