       01  FMC0M01I.
           02  FILLER PIC X(12).
           02  FMTRANAL    COMP  PIC  S9(4).
           02  FMTRANAF    PICTURE X.
           02  FILLER REDEFINES FMTRANAF.
             03 FMTRANAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANAI  PIC X(4).
           02  FMDATEAL    COMP  PIC  S9(4).
           02  FMDATEAF    PICTURE X.
           02  FILLER REDEFINES FMDATEAF.
             03 FMDATEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEAI  PIC X(8).
           02  FMTIMEAL    COMP  PIC  S9(4).
           02  FMTIMEAF    PICTURE X.
           02  FILLER REDEFINES FMTIMEAF.
             03 FMTIMEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEAI  PIC X(8).
           02  FMC0PPDL    COMP  PIC  S9(4).
           02  FMC0PPDF    PICTURE X.
           02  FILLER REDEFINES FMC0PPDF.
             03 FMC0PPDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0PPDI  PIC X(6).
           02  FMC0RDTL    COMP  PIC  S9(4).
           02  FMC0RDTF    PICTURE X.
           02  FILLER REDEFINES FMC0RDTF.
             03 FMC0RDTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0RDTI  PIC X(6).
           02  FMC0NPDL    COMP  PIC  S9(4).
           02  FMC0NPDF    PICTURE X.
           02  FILLER REDEFINES FMC0NPDF.
             03 FMC0NPDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0NPDI  PIC X(6).
           02  FMC0DPPL    COMP  PIC  S9(4).
           02  FMC0DPPF    PICTURE X.
           02  FILLER REDEFINES FMC0DPPF.
             03 FMC0DPPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0DPPI  PIC X(3).
           02  FMC0DRNL    COMP  PIC  S9(4).
           02  FMC0DRNF    PICTURE X.
           02  FILLER REDEFINES FMC0DRNF.
             03 FMC0DRNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0DRNI  PIC X(3).
           02  FMC0DNPL    COMP  PIC  S9(4).
           02  FMC0DNPF    PICTURE X.
           02  FILLER REDEFINES FMC0DNPF.
             03 FMC0DNPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0DNPI  PIC X(3).
           02  FMC0H01L    COMP  PIC  S9(4).
           02  FMC0H01F    PICTURE X.
           02  FILLER REDEFINES FMC0H01F.
             03 FMC0H01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H01I  PIC X(6).
           02  FMC0H02L    COMP  PIC  S9(4).
           02  FMC0H02F    PICTURE X.
           02  FILLER REDEFINES FMC0H02F.
             03 FMC0H02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H02I  PIC X(6).
           02  FMC0H03L    COMP  PIC  S9(4).
           02  FMC0H03F    PICTURE X.
           02  FILLER REDEFINES FMC0H03F.
             03 FMC0H03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H03I  PIC X(6).
           02  FMC0H04L    COMP  PIC  S9(4).
           02  FMC0H04F    PICTURE X.
           02  FILLER REDEFINES FMC0H04F.
             03 FMC0H04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H04I  PIC X(6).
           02  FMC0H05L    COMP  PIC  S9(4).
           02  FMC0H05F    PICTURE X.
           02  FILLER REDEFINES FMC0H05F.
             03 FMC0H05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H05I  PIC X(6).
           02  FMC0H06L    COMP  PIC  S9(4).
           02  FMC0H06F    PICTURE X.
           02  FILLER REDEFINES FMC0H06F.
             03 FMC0H06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H06I  PIC X(6).
           02  FMC0H07L    COMP  PIC  S9(4).
           02  FMC0H07F    PICTURE X.
           02  FILLER REDEFINES FMC0H07F.
             03 FMC0H07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H07I  PIC X(6).
           02  FMC0H08L    COMP  PIC  S9(4).
           02  FMC0H08F    PICTURE X.
           02  FILLER REDEFINES FMC0H08F.
             03 FMC0H08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H08I  PIC X(6).
           02  FMC0H09L    COMP  PIC  S9(4).
           02  FMC0H09F    PICTURE X.
           02  FILLER REDEFINES FMC0H09F.
             03 FMC0H09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H09I  PIC X(6).
           02  FMC0H10L    COMP  PIC  S9(4).
           02  FMC0H10F    PICTURE X.
           02  FILLER REDEFINES FMC0H10F.
             03 FMC0H10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H10I  PIC X(6).
           02  FMC0H11L    COMP  PIC  S9(4).
           02  FMC0H11F    PICTURE X.
           02  FILLER REDEFINES FMC0H11F.
             03 FMC0H11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H11I  PIC X(6).
           02  FMC0H12L    COMP  PIC  S9(4).
           02  FMC0H12F    PICTURE X.
           02  FILLER REDEFINES FMC0H12F.
             03 FMC0H12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H12I  PIC X(6).
           02  FMC0H13L    COMP  PIC  S9(4).
           02  FMC0H13F    PICTURE X.
           02  FILLER REDEFINES FMC0H13F.
             03 FMC0H13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H13I  PIC X(6).
           02  FMC0H14L    COMP  PIC  S9(4).
           02  FMC0H14F    PICTURE X.
           02  FILLER REDEFINES FMC0H14F.
             03 FMC0H14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H14I  PIC X(6).
           02  FMC0H15L    COMP  PIC  S9(4).
           02  FMC0H15F    PICTURE X.
           02  FILLER REDEFINES FMC0H15F.
             03 FMC0H15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0H15I  PIC X(6).
           02  FMC0B07L    COMP  PIC  S9(4).
           02  FMC0B07F    PICTURE X.
           02  FILLER REDEFINES FMC0B07F.
             03 FMC0B07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0B07I  PIC X(1).
           02  FMC0B01L    COMP  PIC  S9(4).
           02  FMC0B01F    PICTURE X.
           02  FILLER REDEFINES FMC0B01F.
             03 FMC0B01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0B01I  PIC X(1).
           02  FMC0B02L    COMP  PIC  S9(4).
           02  FMC0B02F    PICTURE X.
           02  FILLER REDEFINES FMC0B02F.
             03 FMC0B02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0B02I  PIC X(1).
           02  FMC0B03L    COMP  PIC  S9(4).
           02  FMC0B03F    PICTURE X.
           02  FILLER REDEFINES FMC0B03F.
             03 FMC0B03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0B03I  PIC X(1).
           02  FMC0B04L    COMP  PIC  S9(4).
           02  FMC0B04F    PICTURE X.
           02  FILLER REDEFINES FMC0B04F.
             03 FMC0B04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0B04I  PIC X(1).
           02  FMC0B05L    COMP  PIC  S9(4).
           02  FMC0B05F    PICTURE X.
           02  FILLER REDEFINES FMC0B05F.
             03 FMC0B05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0B05I  PIC X(1).
           02  FMC0B06L    COMP  PIC  S9(4).
           02  FMC0B06F    PICTURE X.
           02  FILLER REDEFINES FMC0B06F.
             03 FMC0B06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0B06I  PIC X(1).
           02  FMC0SDTL    COMP  PIC  S9(4).
           02  FMC0SDTF    PICTURE X.
           02  FILLER REDEFINES FMC0SDTF.
             03 FMC0SDTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0SDTI  PIC X(8).
           02  FMC0STML    COMP  PIC  S9(4).
           02  FMC0STMF    PICTURE X.
           02  FILLER REDEFINES FMC0STMF.
             03 FMC0STMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0STMI  PIC X(8).
           02  FMC0026L    COMP  PIC  S9(4).
           02  FMC0026F    PICTURE X.
           02  FILLER REDEFINES FMC0026F.
             03 FMC0026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0026I  PIC X(1).
           02  FMC0027L    COMP  PIC  S9(4).
           02  FMC0027F    PICTURE X.
           02  FILLER REDEFINES FMC0027F.
             03 FMC0027A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0027I  PIC X(1).
           02  FMC0028L    COMP  PIC  S9(4).
           02  FMC0028F    PICTURE X.
           02  FILLER REDEFINES FMC0028F.
             03 FMC0028A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0028I  PIC X(3).
           02  FMC0029L    COMP  PIC  S9(4).
           02  FMC0029F    PICTURE X.
           02  FILLER REDEFINES FMC0029F.
             03 FMC0029A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0029I  PIC X(3).
           02  FMC0030L    COMP  PIC  S9(4).
           02  FMC0030F    PICTURE X.
           02  FILLER REDEFINES FMC0030F.
             03 FMC0030A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0030I  PIC X(3).
           02  FMC0NDBL    COMP  PIC  S9(4).
           02  FMC0NDBF    PICTURE X.
           02  FILLER REDEFINES FMC0NDBF.
             03 FMC0NDBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC0NDBI  PIC X(3).
           02  FMPFS01L    COMP  PIC  S9(4).
           02  FMPFS01F    PICTURE X.
           02  FILLER REDEFINES FMPFS01F.
             03 FMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS01I  PIC X(79).
           02  FMERR01L    COMP  PIC  S9(4).
           02  FMERR01F    PICTURE X.
           02  FILLER REDEFINES FMERR01F.
             03 FMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR01I  PIC X(79).
       01  FMC0M01O REDEFINES FMC0M01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANAC    PICTURE X.
           02  FMTRANAP    PICTURE X.
           02  FMTRANAH    PICTURE X.
           02  FMTRANAV    PICTURE X.
           02  FMTRANAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEAC    PICTURE X.
           02  FMDATEAP    PICTURE X.
           02  FMDATEAH    PICTURE X.
           02  FMDATEAV    PICTURE X.
           02  FMDATEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEAC    PICTURE X.
           02  FMTIMEAP    PICTURE X.
           02  FMTIMEAH    PICTURE X.
           02  FMTIMEAV    PICTURE X.
           02  FMTIMEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMC0PPDC    PICTURE X.
           02  FMC0PPDP    PICTURE X.
           02  FMC0PPDH    PICTURE X.
           02  FMC0PPDV    PICTURE X.
           02  FMC0PPDO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0RDTC    PICTURE X.
           02  FMC0RDTP    PICTURE X.
           02  FMC0RDTH    PICTURE X.
           02  FMC0RDTV    PICTURE X.
           02  FMC0RDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0NPDC    PICTURE X.
           02  FMC0NPDP    PICTURE X.
           02  FMC0NPDH    PICTURE X.
           02  FMC0NPDV    PICTURE X.
           02  FMC0NPDO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0DPPC    PICTURE X.
           02  FMC0DPPP    PICTURE X.
           02  FMC0DPPH    PICTURE X.
           02  FMC0DPPV    PICTURE X.
           02  FMC0DPPO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMC0DRNC    PICTURE X.
           02  FMC0DRNP    PICTURE X.
           02  FMC0DRNH    PICTURE X.
           02  FMC0DRNV    PICTURE X.
           02  FMC0DRNO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMC0DNPC    PICTURE X.
           02  FMC0DNPP    PICTURE X.
           02  FMC0DNPH    PICTURE X.
           02  FMC0DNPV    PICTURE X.
           02  FMC0DNPO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMC0H01C    PICTURE X.
           02  FMC0H01P    PICTURE X.
           02  FMC0H01H    PICTURE X.
           02  FMC0H01V    PICTURE X.
           02  FMC0H01O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H02C    PICTURE X.
           02  FMC0H02P    PICTURE X.
           02  FMC0H02H    PICTURE X.
           02  FMC0H02V    PICTURE X.
           02  FMC0H02O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H03C    PICTURE X.
           02  FMC0H03P    PICTURE X.
           02  FMC0H03H    PICTURE X.
           02  FMC0H03V    PICTURE X.
           02  FMC0H03O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H04C    PICTURE X.
           02  FMC0H04P    PICTURE X.
           02  FMC0H04H    PICTURE X.
           02  FMC0H04V    PICTURE X.
           02  FMC0H04O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H05C    PICTURE X.
           02  FMC0H05P    PICTURE X.
           02  FMC0H05H    PICTURE X.
           02  FMC0H05V    PICTURE X.
           02  FMC0H05O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H06C    PICTURE X.
           02  FMC0H06P    PICTURE X.
           02  FMC0H06H    PICTURE X.
           02  FMC0H06V    PICTURE X.
           02  FMC0H06O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H07C    PICTURE X.
           02  FMC0H07P    PICTURE X.
           02  FMC0H07H    PICTURE X.
           02  FMC0H07V    PICTURE X.
           02  FMC0H07O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H08C    PICTURE X.
           02  FMC0H08P    PICTURE X.
           02  FMC0H08H    PICTURE X.
           02  FMC0H08V    PICTURE X.
           02  FMC0H08O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H09C    PICTURE X.
           02  FMC0H09P    PICTURE X.
           02  FMC0H09H    PICTURE X.
           02  FMC0H09V    PICTURE X.
           02  FMC0H09O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H10C    PICTURE X.
           02  FMC0H10P    PICTURE X.
           02  FMC0H10H    PICTURE X.
           02  FMC0H10V    PICTURE X.
           02  FMC0H10O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H11C    PICTURE X.
           02  FMC0H11P    PICTURE X.
           02  FMC0H11H    PICTURE X.
           02  FMC0H11V    PICTURE X.
           02  FMC0H11O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H12C    PICTURE X.
           02  FMC0H12P    PICTURE X.
           02  FMC0H12H    PICTURE X.
           02  FMC0H12V    PICTURE X.
           02  FMC0H12O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H13C    PICTURE X.
           02  FMC0H13P    PICTURE X.
           02  FMC0H13H    PICTURE X.
           02  FMC0H13V    PICTURE X.
           02  FMC0H13O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H14C    PICTURE X.
           02  FMC0H14P    PICTURE X.
           02  FMC0H14H    PICTURE X.
           02  FMC0H14V    PICTURE X.
           02  FMC0H14O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0H15C    PICTURE X.
           02  FMC0H15P    PICTURE X.
           02  FMC0H15H    PICTURE X.
           02  FMC0H15V    PICTURE X.
           02  FMC0H15O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMC0B07C    PICTURE X.
           02  FMC0B07P    PICTURE X.
           02  FMC0B07H    PICTURE X.
           02  FMC0B07V    PICTURE X.
           02  FMC0B07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC0B01C    PICTURE X.
           02  FMC0B01P    PICTURE X.
           02  FMC0B01H    PICTURE X.
           02  FMC0B01V    PICTURE X.
           02  FMC0B01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC0B02C    PICTURE X.
           02  FMC0B02P    PICTURE X.
           02  FMC0B02H    PICTURE X.
           02  FMC0B02V    PICTURE X.
           02  FMC0B02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC0B03C    PICTURE X.
           02  FMC0B03P    PICTURE X.
           02  FMC0B03H    PICTURE X.
           02  FMC0B03V    PICTURE X.
           02  FMC0B03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC0B04C    PICTURE X.
           02  FMC0B04P    PICTURE X.
           02  FMC0B04H    PICTURE X.
           02  FMC0B04V    PICTURE X.
           02  FMC0B04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC0B05C    PICTURE X.
           02  FMC0B05P    PICTURE X.
           02  FMC0B05H    PICTURE X.
           02  FMC0B05V    PICTURE X.
           02  FMC0B05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC0B06C    PICTURE X.
           02  FMC0B06P    PICTURE X.
           02  FMC0B06H    PICTURE X.
           02  FMC0B06V    PICTURE X.
           02  FMC0B06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC0SDTC    PICTURE X.
           02  FMC0SDTP    PICTURE X.
           02  FMC0SDTH    PICTURE X.
           02  FMC0SDTV    PICTURE X.
           02  FMC0SDTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMC0STMC    PICTURE X.
           02  FMC0STMP    PICTURE X.
           02  FMC0STMH    PICTURE X.
           02  FMC0STMV    PICTURE X.
           02  FMC0STMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMC0026C    PICTURE X.
           02  FMC0026P    PICTURE X.
           02  FMC0026H    PICTURE X.
           02  FMC0026V    PICTURE X.
           02  FMC0026O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC0027C    PICTURE X.
           02  FMC0027P    PICTURE X.
           02  FMC0027H    PICTURE X.
           02  FMC0027V    PICTURE X.
           02  FMC0027O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC0028C    PICTURE X.
           02  FMC0028P    PICTURE X.
           02  FMC0028H    PICTURE X.
           02  FMC0028V    PICTURE X.
           02  FMC0028O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMC0029C    PICTURE X.
           02  FMC0029P    PICTURE X.
           02  FMC0029H    PICTURE X.
           02  FMC0029V    PICTURE X.
           02  FMC0029O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMC0030C    PICTURE X.
           02  FMC0030P    PICTURE X.
           02  FMC0030H    PICTURE X.
           02  FMC0030V    PICTURE X.
           02  FMC0030O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMC0NDBC    PICTURE X.
           02  FMC0NDBP    PICTURE X.
           02  FMC0NDBH    PICTURE X.
           02  FMC0NDBV    PICTURE X.
           02  FMC0NDBO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMPFS01C    PICTURE X.
           02  FMPFS01P    PICTURE X.
           02  FMPFS01H    PICTURE X.
           02  FMPFS01V    PICTURE X.
           02  FMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR01C    PICTURE X.
           02  FMERR01P    PICTURE X.
           02  FMERR01H    PICTURE X.
           02  FMERR01V    PICTURE X.
           02  FMERR01O  PIC X(79).