       01  FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANLL    COMP  PIC  S9(4).
           02  FMTRANLF    PICTURE X.
           02  FILLER REDEFINES FMTRANLF.
             03 FMTRANLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANLI  PIC X(4).
           02  FMDATELL    COMP  PIC  S9(4).
           02  FMDATELF    PICTURE X.
           02  FILLER REDEFINES FMDATELF.
             03 FMDATELA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATELI  PIC X(8).
           02  FMTIMELL    COMP  PIC  S9(4).
           02  FMTIMELF    PICTURE X.
           02  FILLER REDEFINES FMTIMELF.
             03 FMTIMELA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMELI  PIC X(8).
           02  FMPAG11L    COMP  PIC  S9(4).
           02  FMPAG11F    PICTURE X.
           02  FILLER REDEFINES FMPAG11F.
             03 FMPAG11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG11I  PIC X(2).
           02  FMTPG11L    COMP  PIC  S9(4).
           02  FMTPG11F    PICTURE X.
           02  FILLER REDEFINES FMTPG11F.
             03 FMTPG11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG11I  PIC X(2).
           02  FMCOMPLL    COMP  PIC  S9(4).
           02  FMCOMPLF    PICTURE X.
           02  FILLER REDEFINES FMCOMPLF.
             03 FMCOMPLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPLI  PIC X(4).
           02  FMCC266L    COMP  PIC  S9(4).
           02  FMCC266F    PICTURE X.
           02  FILLER REDEFINES FMCC266F.
             03 FMCC266A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC266I  PIC X(1).
           02  FMCC214L    COMP  PIC  S9(4).
           02  FMCC214F    PICTURE X.
           02  FILLER REDEFINES FMCC214F.
             03 FMCC214A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC214I  PIC X(1).
           02  FMSPL11L    COMP  PIC  S9(4).
           02  FMSPL11F    PICTURE X.
           02  FILLER REDEFINES FMSPL11F.
             03 FMSPL11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL11I  PIC X(20).
           02  FMCC267L    COMP  PIC  S9(4).
           02  FMCC267F    PICTURE X.
           02  FILLER REDEFINES FMCC267F.
             03 FMCC267A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC267I  PIC X(1).
           02  FMCC215L    COMP  PIC  S9(4).
           02  FMCC215F    PICTURE X.
           02  FILLER REDEFINES FMCC215F.
             03 FMCC215A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC215I  PIC X(1).
           02  FMSPL12L    COMP  PIC  S9(4).
           02  FMSPL12F    PICTURE X.
           02  FILLER REDEFINES FMSPL12F.
             03 FMSPL12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL12I  PIC X(20).
           02  FMCC268L    COMP  PIC  S9(4).
           02  FMCC268F    PICTURE X.
           02  FILLER REDEFINES FMCC268F.
             03 FMCC268A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC268I  PIC X(1).
           02  FMCC216L    COMP  PIC  S9(4).
           02  FMCC216F    PICTURE X.
           02  FILLER REDEFINES FMCC216F.
             03 FMCC216A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC216I  PIC X(1).
           02  FMSPL13L    COMP  PIC  S9(4).
           02  FMSPL13F    PICTURE X.
           02  FILLER REDEFINES FMSPL13F.
             03 FMSPL13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL13I  PIC X(20).
           02  FMCC269L    COMP  PIC  S9(4).
           02  FMCC269F    PICTURE X.
           02  FILLER REDEFINES FMCC269F.
             03 FMCC269A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC269I  PIC X(1).
           02  FMCC217L    COMP  PIC  S9(4).
           02  FMCC217F    PICTURE X.
           02  FILLER REDEFINES FMCC217F.
             03 FMCC217A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC217I  PIC X(1).
           02  FMSPL14L    COMP  PIC  S9(4).
           02  FMSPL14F    PICTURE X.
           02  FILLER REDEFINES FMSPL14F.
             03 FMSPL14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL14I  PIC X(20).
           02  FMCC270L    COMP  PIC  S9(4).
           02  FMCC270F    PICTURE X.
           02  FILLER REDEFINES FMCC270F.
             03 FMCC270A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC270I  PIC X(1).
           02  FMCC218L    COMP  PIC  S9(4).
           02  FMCC218F    PICTURE X.
           02  FILLER REDEFINES FMCC218F.
             03 FMCC218A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC218I  PIC X(1).
           02  FMSPL15L    COMP  PIC  S9(4).
           02  FMSPL15F    PICTURE X.
           02  FILLER REDEFINES FMSPL15F.
             03 FMSPL15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL15I  PIC X(20).
           02  FMCC271L    COMP  PIC  S9(4).
           02  FMCC271F    PICTURE X.
           02  FILLER REDEFINES FMCC271F.
             03 FMCC271A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC271I  PIC X(1).
           02  FMCC219L    COMP  PIC  S9(4).
           02  FMCC219F    PICTURE X.
           02  FILLER REDEFINES FMCC219F.
             03 FMCC219A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC219I  PIC X(1).
           02  FMSPL16L    COMP  PIC  S9(4).
           02  FMSPL16F    PICTURE X.
           02  FILLER REDEFINES FMSPL16F.
             03 FMSPL16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL16I  PIC X(20).
           02  FMCC272L    COMP  PIC  S9(4).
           02  FMCC272F    PICTURE X.
           02  FILLER REDEFINES FMCC272F.
             03 FMCC272A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC272I  PIC X(1).
           02  FMCC220L    COMP  PIC  S9(4).
           02  FMCC220F    PICTURE X.
           02  FILLER REDEFINES FMCC220F.
             03 FMCC220A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC220I  PIC X(1).
           02  FMSPL17L    COMP  PIC  S9(4).
           02  FMSPL17F    PICTURE X.
           02  FILLER REDEFINES FMSPL17F.
             03 FMSPL17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL17I  PIC X(20).
           02  FMCC273L    COMP  PIC  S9(4).
           02  FMCC273F    PICTURE X.
           02  FILLER REDEFINES FMCC273F.
             03 FMCC273A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC273I  PIC X(1).
           02  FMCC221L    COMP  PIC  S9(4).
           02  FMCC221F    PICTURE X.
           02  FILLER REDEFINES FMCC221F.
             03 FMCC221A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC221I  PIC X(1).
           02  FMSPL18L    COMP  PIC  S9(4).
           02  FMSPL18F    PICTURE X.
           02  FILLER REDEFINES FMSPL18F.
             03 FMSPL18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL18I  PIC X(20).
           02  FMCC274L    COMP  PIC  S9(4).
           02  FMCC274F    PICTURE X.
           02  FILLER REDEFINES FMCC274F.
             03 FMCC274A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC274I  PIC X(1).
           02  FMCC222L    COMP  PIC  S9(4).
           02  FMCC222F    PICTURE X.
           02  FILLER REDEFINES FMCC222F.
             03 FMCC222A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC222I  PIC X(1).
           02  FMSPL19L    COMP  PIC  S9(4).
           02  FMSPL19F    PICTURE X.
           02  FILLER REDEFINES FMSPL19F.
             03 FMSPL19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL19I  PIC X(20).
           02  FMCC275L    COMP  PIC  S9(4).
           02  FMCC275F    PICTURE X.
           02  FILLER REDEFINES FMCC275F.
             03 FMCC275A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC275I  PIC X(1).
           02  FMCC223L    COMP  PIC  S9(4).
           02  FMCC223F    PICTURE X.
           02  FILLER REDEFINES FMCC223F.
             03 FMCC223A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC223I  PIC X(1).
           02  FMSPL20L    COMP  PIC  S9(4).
           02  FMSPL20F    PICTURE X.
           02  FILLER REDEFINES FMSPL20F.
             03 FMSPL20A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL20I  PIC X(20).
           02  FMCC276L    COMP  PIC  S9(4).
           02  FMCC276F    PICTURE X.
           02  FILLER REDEFINES FMCC276F.
             03 FMCC276A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC276I  PIC X(1).
           02  FMCC224L    COMP  PIC  S9(4).
           02  FMCC224F    PICTURE X.
           02  FILLER REDEFINES FMCC224F.
             03 FMCC224A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC224I  PIC X(1).
           02  FMSPL21L    COMP  PIC  S9(4).
           02  FMSPL21F    PICTURE X.
           02  FILLER REDEFINES FMSPL21F.
             03 FMSPL21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL21I  PIC X(20).
           02  FMCC277L    COMP  PIC  S9(4).
           02  FMCC277F    PICTURE X.
           02  FILLER REDEFINES FMCC277F.
             03 FMCC277A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC277I  PIC X(1).
           02  FMCC225L    COMP  PIC  S9(4).
           02  FMCC225F    PICTURE X.
           02  FILLER REDEFINES FMCC225F.
             03 FMCC225A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC225I  PIC X(1).
           02  FMSPL22L    COMP  PIC  S9(4).
           02  FMSPL22F    PICTURE X.
           02  FILLER REDEFINES FMSPL22F.
             03 FMSPL22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL22I  PIC X(20).
           02  FMCCFPTL    COMP  PIC  S9(4).
           02  FMCCFPTF    PICTURE X.
           02  FILLER REDEFINES FMCCFPTF.
             03 FMCCFPTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCFPTI  PIC X(1).
           02  FMCCSPTL    COMP  PIC  S9(4).
           02  FMCCSPTF    PICTURE X.
           02  FILLER REDEFINES FMCCSPTF.
             03 FMCCSPTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCSPTI  PIC X(1).
           02  FMSPL2AL    COMP  PIC  S9(4).
           02  FMSPL2AF    PICTURE X.
           02  FILLER REDEFINES FMSPL2AF.
             03 FMSPL2AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL2AI  PIC X(20).
           02  FMCC278L    COMP  PIC  S9(4).
           02  FMCC278F    PICTURE X.
           02  FILLER REDEFINES FMCC278F.
             03 FMCC278A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC278I  PIC X(1).
           02  FMCC226L    COMP  PIC  S9(4).
           02  FMCC226F    PICTURE X.
           02  FILLER REDEFINES FMCC226F.
             03 FMCC226A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC226I  PIC X(1).
           02  FMSPL23L    COMP  PIC  S9(4).
           02  FMSPL23F    PICTURE X.
           02  FILLER REDEFINES FMSPL23F.
             03 FMSPL23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL23I  PIC X(20).
           02  FMPFS12L    COMP  PIC  S9(4).
           02  FMPFS12F    PICTURE X.
           02  FILLER REDEFINES FMPFS12F.
             03 FMPFS12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS12I  PIC X(79).
           02  FMERR12L    COMP  PIC  S9(4).
           02  FMERR12F    PICTURE X.
           02  FILLER REDEFINES FMERR12F.
             03 FMERR12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR12I  PIC X(79).
       01  FMC1M12O REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANLC    PICTURE X.
           02  FMTRANLP    PICTURE X.
           02  FMTRANLH    PICTURE X.
           02  FMTRANLV    PICTURE X.
           02  FMTRANLO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATELC    PICTURE X.
           02  FMDATELP    PICTURE X.
           02  FMDATELH    PICTURE X.
           02  FMDATELV    PICTURE X.
           02  FMDATELO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMELC    PICTURE X.
           02  FMTIMELP    PICTURE X.
           02  FMTIMELH    PICTURE X.
           02  FMTIMELV    PICTURE X.
           02  FMTIMELO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG11C    PICTURE X.
           02  FMPAG11P    PICTURE X.
           02  FMPAG11H    PICTURE X.
           02  FMPAG11V    PICTURE X.
           02  FMPAG11O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG11C    PICTURE X.
           02  FMTPG11P    PICTURE X.
           02  FMTPG11H    PICTURE X.
           02  FMTPG11V    PICTURE X.
           02  FMTPG11O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPLC    PICTURE X.
           02  FMCOMPLP    PICTURE X.
           02  FMCOMPLH    PICTURE X.
           02  FMCOMPLV    PICTURE X.
           02  FMCOMPLO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC266C    PICTURE X.
           02  FMCC266P    PICTURE X.
           02  FMCC266H    PICTURE X.
           02  FMCC266V    PICTURE X.
           02  FMCC266O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC214C    PICTURE X.
           02  FMCC214P    PICTURE X.
           02  FMCC214H    PICTURE X.
           02  FMCC214V    PICTURE X.
           02  FMCC214O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL11C    PICTURE X.
           02  FMSPL11P    PICTURE X.
           02  FMSPL11H    PICTURE X.
           02  FMSPL11V    PICTURE X.
           02  FMSPL11O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC267C    PICTURE X.
           02  FMCC267P    PICTURE X.
           02  FMCC267H    PICTURE X.
           02  FMCC267V    PICTURE X.
           02  FMCC267O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC215C    PICTURE X.
           02  FMCC215P    PICTURE X.
           02  FMCC215H    PICTURE X.
           02  FMCC215V    PICTURE X.
           02  FMCC215O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL12C    PICTURE X.
           02  FMSPL12P    PICTURE X.
           02  FMSPL12H    PICTURE X.
           02  FMSPL12V    PICTURE X.
           02  FMSPL12O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC268C    PICTURE X.
           02  FMCC268P    PICTURE X.
           02  FMCC268H    PICTURE X.
           02  FMCC268V    PICTURE X.
           02  FMCC268O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC216C    PICTURE X.
           02  FMCC216P    PICTURE X.
           02  FMCC216H    PICTURE X.
           02  FMCC216V    PICTURE X.
           02  FMCC216O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL13C    PICTURE X.
           02  FMSPL13P    PICTURE X.
           02  FMSPL13H    PICTURE X.
           02  FMSPL13V    PICTURE X.
           02  FMSPL13O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC269C    PICTURE X.
           02  FMCC269P    PICTURE X.
           02  FMCC269H    PICTURE X.
           02  FMCC269V    PICTURE X.
           02  FMCC269O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC217C    PICTURE X.
           02  FMCC217P    PICTURE X.
           02  FMCC217H    PICTURE X.
           02  FMCC217V    PICTURE X.
           02  FMCC217O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL14C    PICTURE X.
           02  FMSPL14P    PICTURE X.
           02  FMSPL14H    PICTURE X.
           02  FMSPL14V    PICTURE X.
           02  FMSPL14O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC270C    PICTURE X.
           02  FMCC270P    PICTURE X.
           02  FMCC270H    PICTURE X.
           02  FMCC270V    PICTURE X.
           02  FMCC270O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC218C    PICTURE X.
           02  FMCC218P    PICTURE X.
           02  FMCC218H    PICTURE X.
           02  FMCC218V    PICTURE X.
           02  FMCC218O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL15C    PICTURE X.
           02  FMSPL15P    PICTURE X.
           02  FMSPL15H    PICTURE X.
           02  FMSPL15V    PICTURE X.
           02  FMSPL15O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC271C    PICTURE X.
           02  FMCC271P    PICTURE X.
           02  FMCC271H    PICTURE X.
           02  FMCC271V    PICTURE X.
           02  FMCC271O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC219C    PICTURE X.
           02  FMCC219P    PICTURE X.
           02  FMCC219H    PICTURE X.
           02  FMCC219V    PICTURE X.
           02  FMCC219O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL16C    PICTURE X.
           02  FMSPL16P    PICTURE X.
           02  FMSPL16H    PICTURE X.
           02  FMSPL16V    PICTURE X.
           02  FMSPL16O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC272C    PICTURE X.
           02  FMCC272P    PICTURE X.
           02  FMCC272H    PICTURE X.
           02  FMCC272V    PICTURE X.
           02  FMCC272O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC220C    PICTURE X.
           02  FMCC220P    PICTURE X.
           02  FMCC220H    PICTURE X.
           02  FMCC220V    PICTURE X.
           02  FMCC220O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL17C    PICTURE X.
           02  FMSPL17P    PICTURE X.
           02  FMSPL17H    PICTURE X.
           02  FMSPL17V    PICTURE X.
           02  FMSPL17O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC273C    PICTURE X.
           02  FMCC273P    PICTURE X.
           02  FMCC273H    PICTURE X.
           02  FMCC273V    PICTURE X.
           02  FMCC273O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC221C    PICTURE X.
           02  FMCC221P    PICTURE X.
           02  FMCC221H    PICTURE X.
           02  FMCC221V    PICTURE X.
           02  FMCC221O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL18C    PICTURE X.
           02  FMSPL18P    PICTURE X.
           02  FMSPL18H    PICTURE X.
           02  FMSPL18V    PICTURE X.
           02  FMSPL18O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC274C    PICTURE X.
           02  FMCC274P    PICTURE X.
           02  FMCC274H    PICTURE X.
           02  FMCC274V    PICTURE X.
           02  FMCC274O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC222C    PICTURE X.
           02  FMCC222P    PICTURE X.
           02  FMCC222H    PICTURE X.
           02  FMCC222V    PICTURE X.
           02  FMCC222O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL19C    PICTURE X.
           02  FMSPL19P    PICTURE X.
           02  FMSPL19H    PICTURE X.
           02  FMSPL19V    PICTURE X.
           02  FMSPL19O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC275C    PICTURE X.
           02  FMCC275P    PICTURE X.
           02  FMCC275H    PICTURE X.
           02  FMCC275V    PICTURE X.
           02  FMCC275O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC223C    PICTURE X.
           02  FMCC223P    PICTURE X.
           02  FMCC223H    PICTURE X.
           02  FMCC223V    PICTURE X.
           02  FMCC223O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL20C    PICTURE X.
           02  FMSPL20P    PICTURE X.
           02  FMSPL20H    PICTURE X.
           02  FMSPL20V    PICTURE X.
           02  FMSPL20O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC276C    PICTURE X.
           02  FMCC276P    PICTURE X.
           02  FMCC276H    PICTURE X.
           02  FMCC276V    PICTURE X.
           02  FMCC276O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC224C    PICTURE X.
           02  FMCC224P    PICTURE X.
           02  FMCC224H    PICTURE X.
           02  FMCC224V    PICTURE X.
           02  FMCC224O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL21C    PICTURE X.
           02  FMSPL21P    PICTURE X.
           02  FMSPL21H    PICTURE X.
           02  FMSPL21V    PICTURE X.
           02  FMSPL21O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC277C    PICTURE X.
           02  FMCC277P    PICTURE X.
           02  FMCC277H    PICTURE X.
           02  FMCC277V    PICTURE X.
           02  FMCC277O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC225C    PICTURE X.
           02  FMCC225P    PICTURE X.
           02  FMCC225H    PICTURE X.
           02  FMCC225V    PICTURE X.
           02  FMCC225O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL22C    PICTURE X.
           02  FMSPL22P    PICTURE X.
           02  FMSPL22H    PICTURE X.
           02  FMSPL22V    PICTURE X.
           02  FMSPL22O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCFPTC    PICTURE X.
           02  FMCCFPTP    PICTURE X.
           02  FMCCFPTH    PICTURE X.
           02  FMCCFPTV    PICTURE X.
           02  FMCCFPTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCSPTC    PICTURE X.
           02  FMCCSPTP    PICTURE X.
           02  FMCCSPTH    PICTURE X.
           02  FMCCSPTV    PICTURE X.
           02  FMCCSPTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL2AC    PICTURE X.
           02  FMSPL2AP    PICTURE X.
           02  FMSPL2AH    PICTURE X.
           02  FMSPL2AV    PICTURE X.
           02  FMSPL2AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC278C    PICTURE X.
           02  FMCC278P    PICTURE X.
           02  FMCC278H    PICTURE X.
           02  FMCC278V    PICTURE X.
           02  FMCC278O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC226C    PICTURE X.
           02  FMCC226P    PICTURE X.
           02  FMCC226H    PICTURE X.
           02  FMCC226V    PICTURE X.
           02  FMCC226O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL23C    PICTURE X.
           02  FMSPL23P    PICTURE X.
           02  FMSPL23H    PICTURE X.
           02  FMSPL23V    PICTURE X.
           02  FMSPL23O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMPFS12C    PICTURE X.
           02  FMPFS12P    PICTURE X.
           02  FMPFS12H    PICTURE X.
           02  FMPFS12V    PICTURE X.
           02  FMPFS12O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR12C    PICTURE X.
           02  FMERR12P    PICTURE X.
           02  FMERR12H    PICTURE X.
           02  FMERR12V    PICTURE X.
           02  FMERR12O  PIC X(79).
       01  FMC1M01I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANAL    COMP  PIC  S9(4).
           02  FMTRANAF    PICTURE X.
           02  FILLER REDEFINES FMTRANAF.
             03 FMTRANAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANAI  PIC X(4).
           02  FMDATEAL    COMP  PIC  S9(4).
           02  FMDATEAF    PICTURE X.
           02  FILLER REDEFINES FMDATEAF.
             03 FMDATEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEAI  PIC X(8).
           02  FMTIMEAL    COMP  PIC  S9(4).
           02  FMTIMEAF    PICTURE X.
           02  FILLER REDEFINES FMTIMEAF.
             03 FMTIMEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEAI  PIC X(8).
           02  FMCOMPAL    COMP  PIC  S9(4).
           02  FMCOMPAF    PICTURE X.
           02  FILLER REDEFINES FMCOMPAF.
             03 FMCOMPAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPAI  PIC X(4).
           02  FMC1HC1L    COMP  PIC  S9(4).
           02  FMC1HC1F    PICTURE X.
           02  FILLER REDEFINES FMC1HC1F.
             03 FMC1HC1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC1HC1I  PIC X(1).
           02  FMC1ACTL    COMP  PIC  S9(4).
           02  FMC1ACTF    PICTURE X.
           02  FILLER REDEFINES FMC1ACTF.
             03 FMC1ACTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMC1ACTI  PIC X(1).
           02  FMCPYCOL    COMP  PIC  S9(4).
           02  FMCPYCOF    PICTURE X.
           02  FILLER REDEFINES FMCPYCOF.
             03 FMCPYCOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCPYCOI  PIC X(4).
           02  FMDELTML    COMP  PIC  S9(4).
           02  FMDELTMF    PICTURE X.
           02  FILLER REDEFINES FMDELTMF.
             03 FMDELTMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDELTMI  PIC X(21).
           02  FMDELCDL    COMP  PIC  S9(4).
           02  FMDELCDF    PICTURE X.
           02  FILLER REDEFINES FMDELCDF.
             03 FMDELCDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDELCDI  PIC X(1).
           02  FMDELCEL    COMP  PIC  S9(4).
           02  FMDELCEF    PICTURE X.
           02  FILLER REDEFINES FMDELCEF.
             03 FMDELCEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDELCEI  PIC X(3).
           02  FMAOPTOL    COMP  PIC  S9(4).
           02  FMAOPTOF    PICTURE X.
           02  FILLER REDEFINES FMAOPTOF.
             03 FMAOPTOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMAOPTOI  PIC X(1).
           02  FMAOPTPL    COMP  PIC  S9(4).
           02  FMAOPTPF    PICTURE X.
           02  FILLER REDEFINES FMAOPTPF.
             03 FMAOPTPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMAOPTPI  PIC X(1).
           02  FMBUDGTL    COMP  PIC  S9(4).
           02  FMBUDGTF    PICTURE X.
           02  FILLER REDEFINES FMBUDGTF.
             03 FMBUDGTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMBUDGTI  PIC X(1).
           02  FMDTCTRL    COMP  PIC  S9(4).
           02  FMDTCTRF    PICTURE X.
           02  FILLER REDEFINES FMDTCTRF.
             03 FMDTCTRA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDTCTRI  PIC X(1).
           02  FMHOLDYL    COMP  PIC  S9(4).
           02  FMHOLDYF    PICTURE X.
           02  FILLER REDEFINES FMHOLDYF.
             03 FMHOLDYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMHOLDYI  PIC X(1).
           02  FMIINFOL    COMP  PIC  S9(4).
           02  FMIINFOF    PICTURE X.
           02  FILLER REDEFINES FMIINFOF.
             03 FMIINFOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMIINFOI  PIC X(1).
           02  FMMISCIL    COMP  PIC  S9(4).
           02  FMMISCIF    PICTURE X.
           02  FILLER REDEFINES FMMISCIF.
             03 FMMISCIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMMISCII  PIC X(1).
           02  FMPGMNML    COMP  PIC  S9(4).
           02  FMPGMNMF    PICTURE X.
           02  FILLER REDEFINES FMPGMNMF.
             03 FMPGMNMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPGMNMI  PIC X(1).
           02  FMPRODYL    COMP  PIC  S9(4).
           02  FMPRODYF    PICTURE X.
           02  FILLER REDEFINES FMPRODYF.
             03 FMPRODYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPRODYI  PIC X(1).
           02  FMRPSPLL    COMP  PIC  S9(4).
           02  FMRPSPLF    PICTURE X.
           02  FILLER REDEFINES FMRPSPLF.
             03 FMRPSPLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRPSPLI  PIC X(1).
           02  FMRPTBNL    COMP  PIC  S9(4).
           02  FMRPTBNF    PICTURE X.
           02  FILLER REDEFINES FMRPTBNF.
             03 FMRPTBNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRPTBNI  PIC X(1).
           02  FMTOTCTL    COMP  PIC  S9(4).
           02  FMTOTCTF    PICTURE X.
           02  FILLER REDEFINES FMTOTCTF.
             03 FMTOTCTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTOTCTI  PIC X(1).
           02  FMPFS01L    COMP  PIC  S9(4).
           02  FMPFS01F    PICTURE X.
           02  FILLER REDEFINES FMPFS01F.
             03 FMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS01I  PIC X(79).
           02  FMERR01L    COMP  PIC  S9(4).
           02  FMERR01F    PICTURE X.
           02  FILLER REDEFINES FMERR01F.
             03 FMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR01I  PIC X(79).
       01  FMC1M01O REDEFINES FMC1M01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANAC    PICTURE X.
           02  FMTRANAP    PICTURE X.
           02  FMTRANAH    PICTURE X.
           02  FMTRANAV    PICTURE X.
           02  FMTRANAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEAC    PICTURE X.
           02  FMDATEAP    PICTURE X.
           02  FMDATEAH    PICTURE X.
           02  FMDATEAV    PICTURE X.
           02  FMDATEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEAC    PICTURE X.
           02  FMTIMEAP    PICTURE X.
           02  FMTIMEAH    PICTURE X.
           02  FMTIMEAV    PICTURE X.
           02  FMTIMEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCOMPAC    PICTURE X.
           02  FMCOMPAP    PICTURE X.
           02  FMCOMPAH    PICTURE X.
           02  FMCOMPAV    PICTURE X.
           02  FMCOMPAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMC1HC1C    PICTURE X.
           02  FMC1HC1P    PICTURE X.
           02  FMC1HC1H    PICTURE X.
           02  FMC1HC1V    PICTURE X.
           02  FMC1HC1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMC1ACTC    PICTURE X.
           02  FMC1ACTP    PICTURE X.
           02  FMC1ACTH    PICTURE X.
           02  FMC1ACTV    PICTURE X.
           02  FMC1ACTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCPYCOC    PICTURE X.
           02  FMCPYCOP    PICTURE X.
           02  FMCPYCOH    PICTURE X.
           02  FMCPYCOV    PICTURE X.
           02  FMCPYCOO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDELTMC    PICTURE X.
           02  FMDELTMP    PICTURE X.
           02  FMDELTMH    PICTURE X.
           02  FMDELTMV    PICTURE X.
           02  FMDELTMO  PIC X(21).
           02  FILLER PICTURE X(3).
           02  FMDELCDC    PICTURE X.
           02  FMDELCDP    PICTURE X.
           02  FMDELCDH    PICTURE X.
           02  FMDELCDV    PICTURE X.
           02  FMDELCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDELCEC    PICTURE X.
           02  FMDELCEP    PICTURE X.
           02  FMDELCEH    PICTURE X.
           02  FMDELCEV    PICTURE X.
           02  FMDELCEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMAOPTOC    PICTURE X.
           02  FMAOPTOP    PICTURE X.
           02  FMAOPTOH    PICTURE X.
           02  FMAOPTOV    PICTURE X.
           02  FMAOPTOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMAOPTPC    PICTURE X.
           02  FMAOPTPP    PICTURE X.
           02  FMAOPTPH    PICTURE X.
           02  FMAOPTPV    PICTURE X.
           02  FMAOPTPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMBUDGTC    PICTURE X.
           02  FMBUDGTP    PICTURE X.
           02  FMBUDGTH    PICTURE X.
           02  FMBUDGTV    PICTURE X.
           02  FMBUDGTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDTCTRC    PICTURE X.
           02  FMDTCTRP    PICTURE X.
           02  FMDTCTRH    PICTURE X.
           02  FMDTCTRV    PICTURE X.
           02  FMDTCTRO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMHOLDYC    PICTURE X.
           02  FMHOLDYP    PICTURE X.
           02  FMHOLDYH    PICTURE X.
           02  FMHOLDYV    PICTURE X.
           02  FMHOLDYO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMIINFOC    PICTURE X.
           02  FMIINFOP    PICTURE X.
           02  FMIINFOH    PICTURE X.
           02  FMIINFOV    PICTURE X.
           02  FMIINFOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMMISCIC    PICTURE X.
           02  FMMISCIP    PICTURE X.
           02  FMMISCIH    PICTURE X.
           02  FMMISCIV    PICTURE X.
           02  FMMISCIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPGMNMC    PICTURE X.
           02  FMPGMNMP    PICTURE X.
           02  FMPGMNMH    PICTURE X.
           02  FMPGMNMV    PICTURE X.
           02  FMPGMNMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPRODYC    PICTURE X.
           02  FMPRODYP    PICTURE X.
           02  FMPRODYH    PICTURE X.
           02  FMPRODYV    PICTURE X.
           02  FMPRODYO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRPSPLC    PICTURE X.
           02  FMRPSPLP    PICTURE X.
           02  FMRPSPLH    PICTURE X.
           02  FMRPSPLV    PICTURE X.
           02  FMRPSPLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRPTBNC    PICTURE X.
           02  FMRPTBNP    PICTURE X.
           02  FMRPTBNH    PICTURE X.
           02  FMRPTBNV    PICTURE X.
           02  FMRPTBNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTOTCTC    PICTURE X.
           02  FMTOTCTP    PICTURE X.
           02  FMTOTCTH    PICTURE X.
           02  FMTOTCTV    PICTURE X.
           02  FMTOTCTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPFS01C    PICTURE X.
           02  FMPFS01P    PICTURE X.
           02  FMPFS01H    PICTURE X.
           02  FMPFS01V    PICTURE X.
           02  FMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR01C    PICTURE X.
           02  FMERR01P    PICTURE X.
           02  FMERR01H    PICTURE X.
           02  FMERR01V    PICTURE X.
           02  FMERR01O  PIC X(79).
       01  FMC1M02I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANBL    COMP  PIC  S9(4).
           02  FMTRANBF    PICTURE X.
           02  FILLER REDEFINES FMTRANBF.
             03 FMTRANBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANBI  PIC X(4).
           02  FMDATEBL    COMP  PIC  S9(4).
           02  FMDATEBF    PICTURE X.
           02  FILLER REDEFINES FMDATEBF.
             03 FMDATEBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEBI  PIC X(8).
           02  FMTIMEBL    COMP  PIC  S9(4).
           02  FMTIMEBF    PICTURE X.
           02  FILLER REDEFINES FMTIMEBF.
             03 FMTIMEBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEBI  PIC X(8).
           02  FMPAG01L    COMP  PIC  S9(4).
           02  FMPAG01F    PICTURE X.
           02  FILLER REDEFINES FMPAG01F.
             03 FMPAG01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG01I  PIC X(2).
           02  FMTPG01L    COMP  PIC  S9(4).
           02  FMTPG01F    PICTURE X.
           02  FILLER REDEFINES FMTPG01F.
             03 FMTPG01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG01I  PIC X(2).
           02  FMCOMPBL    COMP  PIC  S9(4).
           02  FMCOMPBF    PICTURE X.
           02  FILLER REDEFINES FMCOMPBF.
             03 FMCOMPBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPBI  PIC X(4).
           02  FMCCHCTL    COMP  PIC  S9(4).
           02  FMCCHCTF    PICTURE X.
           02  FILLER REDEFINES FMCCHCTF.
             03 FMCCHCTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCHCTI  PIC X(19).
           02  FMCC003L    COMP  PIC  S9(4).
           02  FMCC003F    PICTURE X.
           02  FILLER REDEFINES FMCC003F.
             03 FMCC003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC003I  PIC X(40).
           02  ADDRESSL    COMP  PIC  S9(4).
           02  ADDRESSF    PICTURE X.
           02  FILLER REDEFINES ADDRESSF.
             03 ADDRESSA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ADDRESSI  PIC X(7).
           02  FMCC004L    COMP  PIC  S9(4).
           02  FMCC004F    PICTURE X.
           02  FILLER REDEFINES FMCC004F.
             03 FMCC004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC004I  PIC X(40).
           02  FMCC005L    COMP  PIC  S9(4).
           02  FMCC005F    PICTURE X.
           02  FILLER REDEFINES FMCC005F.
             03 FMCC005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC005I  PIC X(30).
           02  FMCCZIPL    COMP  PIC  S9(4).
           02  FMCCZIPF    PICTURE X.
           02  FILLER REDEFINES FMCCZIPF.
             03 FMCCZIPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCZIPI  PIC X(10).
           02  FMCCRDTL    COMP  PIC  S9(4).
           02  FMCCRDTF    PICTURE X.
           02  FILLER REDEFINES FMCCRDTF.
             03 FMCCRDTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRDTI  PIC X(6).
           02  FMCCFSDL    COMP  PIC  S9(4).
           02  FMCCFSDF    PICTURE X.
           02  FILLER REDEFINES FMCCFSDF.
             03 FMCCFSDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCFSDI  PIC X(6).
           02  FMCCFEDL    COMP  PIC  S9(4).
           02  FMCCFEDF    PICTURE X.
           02  FILLER REDEFINES FMCCFEDF.
             03 FMCCFEDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCFEDI  PIC X(6).
           02  FMCC087L    COMP  PIC  S9(4).
           02  FMCC087F    PICTURE X.
           02  FILLER REDEFINES FMCC087F.
             03 FMCC087A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC087I  PIC X(1).
           02  FMCC126L    COMP  PIC  S9(4).
           02  FMCC126F    PICTURE X.
           02  FILLER REDEFINES FMCC126F.
             03 FMCC126A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC126I  PIC X(1).
           02  FMCC112L    COMP  PIC  S9(4).
           02  FMCC112F    PICTURE X.
           02  FILLER REDEFINES FMCC112F.
             03 FMCC112A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC112I  PIC X(1).
           02  FMCC151L    COMP  PIC  S9(4).
           02  FMCC151F    PICTURE X.
           02  FILLER REDEFINES FMCC151F.
             03 FMCC151A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC151I  PIC X(1).
           02  FMCC138L    COMP  PIC  S9(4).
           02  FMCC138F    PICTURE X.
           02  FILLER REDEFINES FMCC138F.
             03 FMCC138A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC138I  PIC X(2).
           02  FMCC117L    COMP  PIC  S9(4).
           02  FMCC117F    PICTURE X.
           02  FILLER REDEFINES FMCC117F.
             03 FMCC117A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC117I  PIC X(1).
           02  FMCC089L    COMP  PIC  S9(4).
           02  FMCC089F    PICTURE X.
           02  FILLER REDEFINES FMCC089F.
             03 FMCC089A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC089I  PIC X(1).
           02  FMCC002L    COMP  PIC  S9(4).
           02  FMCC002F    PICTURE X.
           02  FILLER REDEFINES FMCC002F.
             03 FMCC002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC002I  PIC X(8).
           02  FMCCMC6L    COMP  PIC  S9(4).
           02  FMCCMC6F    PICTURE X.
           02  FILLER REDEFINES FMCCMC6F.
             03 FMCCMC6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC6I  PIC X(3).
           02  FMCC136L    COMP  PIC  S9(4).
           02  FMCC136F    PICTURE X.
           02  FILLER REDEFINES FMCC136F.
             03 FMCC136A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC136I  PIC X(10).
           02  FMCC183L    COMP  PIC  S9(4).
           02  FMCC183F    PICTURE X.
           02  FILLER REDEFINES FMCC183F.
             03 FMCC183A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC183I  PIC X(10).
           02  FMCC184L    COMP  PIC  S9(4).
           02  FMCC184F    PICTURE X.
           02  FILLER REDEFINES FMCC184F.
             03 FMCC184A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC184I  PIC X(10).
           02  FMCC165L    COMP  PIC  S9(4).
           02  FMCC165F    PICTURE X.
           02  FILLER REDEFINES FMCC165F.
             03 FMCC165A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC165I  PIC X(10).
           02  FMCC164L    COMP  PIC  S9(4).
           02  FMCC164F    PICTURE X.
           02  FILLER REDEFINES FMCC164F.
             03 FMCC164A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC164I  PIC X(10).
           02  FMCCB07L    COMP  PIC  S9(4).
           02  FMCCB07F    PICTURE X.
           02  FILLER REDEFINES FMCCB07F.
             03 FMCCB07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCB07I  PIC X(1).
           02  FMCCB01L    COMP  PIC  S9(4).
           02  FMCCB01F    PICTURE X.
           02  FILLER REDEFINES FMCCB01F.
             03 FMCCB01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCB01I  PIC X(1).
           02  FMCCB02L    COMP  PIC  S9(4).
           02  FMCCB02F    PICTURE X.
           02  FILLER REDEFINES FMCCB02F.
             03 FMCCB02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCB02I  PIC X(1).
           02  FMCCB03L    COMP  PIC  S9(4).
           02  FMCCB03F    PICTURE X.
           02  FILLER REDEFINES FMCCB03F.
             03 FMCCB03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCB03I  PIC X(1).
           02  FMCCB04L    COMP  PIC  S9(4).
           02  FMCCB04F    PICTURE X.
           02  FILLER REDEFINES FMCCB04F.
             03 FMCCB04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCB04I  PIC X(1).
           02  FMCCB05L    COMP  PIC  S9(4).
           02  FMCCB05F    PICTURE X.
           02  FILLER REDEFINES FMCCB05F.
             03 FMCCB05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCB05I  PIC X(1).
           02  FMCCB06L    COMP  PIC  S9(4).
           02  FMCCB06F    PICTURE X.
           02  FILLER REDEFINES FMCCB06F.
             03 FMCCB06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCB06I  PIC X(1).
           02  FMPFS02L    COMP  PIC  S9(4).
           02  FMPFS02F    PICTURE X.
           02  FILLER REDEFINES FMPFS02F.
             03 FMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS02I  PIC X(79).
           02  FMERR02L    COMP  PIC  S9(4).
           02  FMERR02F    PICTURE X.
           02  FILLER REDEFINES FMERR02F.
             03 FMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR02I  PIC X(79).
       01  FMC1M02O REDEFINES FMC1M02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANBC    PICTURE X.
           02  FMTRANBP    PICTURE X.
           02  FMTRANBH    PICTURE X.
           02  FMTRANBV    PICTURE X.
           02  FMTRANBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEBC    PICTURE X.
           02  FMDATEBP    PICTURE X.
           02  FMDATEBH    PICTURE X.
           02  FMDATEBV    PICTURE X.
           02  FMDATEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEBC    PICTURE X.
           02  FMTIMEBP    PICTURE X.
           02  FMTIMEBH    PICTURE X.
           02  FMTIMEBV    PICTURE X.
           02  FMTIMEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG01C    PICTURE X.
           02  FMPAG01P    PICTURE X.
           02  FMPAG01H    PICTURE X.
           02  FMPAG01V    PICTURE X.
           02  FMPAG01O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG01C    PICTURE X.
           02  FMTPG01P    PICTURE X.
           02  FMTPG01H    PICTURE X.
           02  FMTPG01V    PICTURE X.
           02  FMTPG01O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPBC    PICTURE X.
           02  FMCOMPBP    PICTURE X.
           02  FMCOMPBH    PICTURE X.
           02  FMCOMPBV    PICTURE X.
           02  FMCOMPBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCCHCTC    PICTURE X.
           02  FMCCHCTP    PICTURE X.
           02  FMCCHCTH    PICTURE X.
           02  FMCCHCTV    PICTURE X.
           02  FMCCHCTO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  FMCC003C    PICTURE X.
           02  FMCC003P    PICTURE X.
           02  FMCC003H    PICTURE X.
           02  FMCC003V    PICTURE X.
           02  FMCC003O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  ADDRESSC    PICTURE X.
           02  ADDRESSP    PICTURE X.
           02  ADDRESSH    PICTURE X.
           02  ADDRESSV    PICTURE X.
           02  ADDRESSO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMCC004C    PICTURE X.
           02  FMCC004P    PICTURE X.
           02  FMCC004H    PICTURE X.
           02  FMCC004V    PICTURE X.
           02  FMCC004O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  FMCC005C    PICTURE X.
           02  FMCC005P    PICTURE X.
           02  FMCC005H    PICTURE X.
           02  FMCC005V    PICTURE X.
           02  FMCC005O  PIC X(30).
           02  FILLER PICTURE X(3).
           02  FMCCZIPC    PICTURE X.
           02  FMCCZIPP    PICTURE X.
           02  FMCCZIPH    PICTURE X.
           02  FMCCZIPV    PICTURE X.
           02  FMCCZIPO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCCRDTC    PICTURE X.
           02  FMCCRDTP    PICTURE X.
           02  FMCCRDTH    PICTURE X.
           02  FMCCRDTV    PICTURE X.
           02  FMCCRDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCFSDC    PICTURE X.
           02  FMCCFSDP    PICTURE X.
           02  FMCCFSDH    PICTURE X.
           02  FMCCFSDV    PICTURE X.
           02  FMCCFSDO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCFEDC    PICTURE X.
           02  FMCCFEDP    PICTURE X.
           02  FMCCFEDH    PICTURE X.
           02  FMCCFEDV    PICTURE X.
           02  FMCCFEDO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCC087C    PICTURE X.
           02  FMCC087P    PICTURE X.
           02  FMCC087H    PICTURE X.
           02  FMCC087V    PICTURE X.
           02  FMCC087O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC126C    PICTURE X.
           02  FMCC126P    PICTURE X.
           02  FMCC126H    PICTURE X.
           02  FMCC126V    PICTURE X.
           02  FMCC126O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC112C    PICTURE X.
           02  FMCC112P    PICTURE X.
           02  FMCC112H    PICTURE X.
           02  FMCC112V    PICTURE X.
           02  FMCC112O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC151C    PICTURE X.
           02  FMCC151P    PICTURE X.
           02  FMCC151H    PICTURE X.
           02  FMCC151V    PICTURE X.
           02  FMCC151O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC138C    PICTURE X.
           02  FMCC138P    PICTURE X.
           02  FMCC138H    PICTURE X.
           02  FMCC138V    PICTURE X.
           02  FMCC138O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCC117C    PICTURE X.
           02  FMCC117P    PICTURE X.
           02  FMCC117H    PICTURE X.
           02  FMCC117V    PICTURE X.
           02  FMCC117O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC089C    PICTURE X.
           02  FMCC089P    PICTURE X.
           02  FMCC089H    PICTURE X.
           02  FMCC089V    PICTURE X.
           02  FMCC089O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC002C    PICTURE X.
           02  FMCC002P    PICTURE X.
           02  FMCC002H    PICTURE X.
           02  FMCC002V    PICTURE X.
           02  FMCC002O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCMC6C    PICTURE X.
           02  FMCCMC6P    PICTURE X.
           02  FMCCMC6H    PICTURE X.
           02  FMCCMC6V    PICTURE X.
           02  FMCCMC6O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMCC136C    PICTURE X.
           02  FMCC136P    PICTURE X.
           02  FMCC136H    PICTURE X.
           02  FMCC136V    PICTURE X.
           02  FMCC136O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCC183C    PICTURE X.
           02  FMCC183P    PICTURE X.
           02  FMCC183H    PICTURE X.
           02  FMCC183V    PICTURE X.
           02  FMCC183O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCC184C    PICTURE X.
           02  FMCC184P    PICTURE X.
           02  FMCC184H    PICTURE X.
           02  FMCC184V    PICTURE X.
           02  FMCC184O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCC165C    PICTURE X.
           02  FMCC165P    PICTURE X.
           02  FMCC165H    PICTURE X.
           02  FMCC165V    PICTURE X.
           02  FMCC165O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCC164C    PICTURE X.
           02  FMCC164P    PICTURE X.
           02  FMCC164H    PICTURE X.
           02  FMCC164V    PICTURE X.
           02  FMCC164O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCCB07C    PICTURE X.
           02  FMCCB07P    PICTURE X.
           02  FMCCB07H    PICTURE X.
           02  FMCCB07V    PICTURE X.
           02  FMCCB07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCB01C    PICTURE X.
           02  FMCCB01P    PICTURE X.
           02  FMCCB01H    PICTURE X.
           02  FMCCB01V    PICTURE X.
           02  FMCCB01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCB02C    PICTURE X.
           02  FMCCB02P    PICTURE X.
           02  FMCCB02H    PICTURE X.
           02  FMCCB02V    PICTURE X.
           02  FMCCB02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCB03C    PICTURE X.
           02  FMCCB03P    PICTURE X.
           02  FMCCB03H    PICTURE X.
           02  FMCCB03V    PICTURE X.
           02  FMCCB03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCB04C    PICTURE X.
           02  FMCCB04P    PICTURE X.
           02  FMCCB04H    PICTURE X.
           02  FMCCB04V    PICTURE X.
           02  FMCCB04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCB05C    PICTURE X.
           02  FMCCB05P    PICTURE X.
           02  FMCCB05H    PICTURE X.
           02  FMCCB05V    PICTURE X.
           02  FMCCB05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCB06C    PICTURE X.
           02  FMCCB06P    PICTURE X.
           02  FMCCB06H    PICTURE X.
           02  FMCCB06V    PICTURE X.
           02  FMCCB06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPFS02C    PICTURE X.
           02  FMPFS02P    PICTURE X.
           02  FMPFS02H    PICTURE X.
           02  FMPFS02V    PICTURE X.
           02  FMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR02C    PICTURE X.
           02  FMERR02P    PICTURE X.
           02  FMERR02H    PICTURE X.
           02  FMERR02V    PICTURE X.
           02  FMERR02O  PIC X(79).
       01  FMC1M03I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANCL    COMP  PIC  S9(4).
           02  FMTRANCF    PICTURE X.
           02  FILLER REDEFINES FMTRANCF.
             03 FMTRANCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANCI  PIC X(4).
           02  FMDATECL    COMP  PIC  S9(4).
           02  FMDATECF    PICTURE X.
           02  FILLER REDEFINES FMDATECF.
             03 FMDATECA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATECI  PIC X(8).
           02  FMTIMECL    COMP  PIC  S9(4).
           02  FMTIMECF    PICTURE X.
           02  FILLER REDEFINES FMTIMECF.
             03 FMTIMECA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMECI  PIC X(8).
           02  FMPAG02L    COMP  PIC  S9(4).
           02  FMPAG02F    PICTURE X.
           02  FILLER REDEFINES FMPAG02F.
             03 FMPAG02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG02I  PIC X(2).
           02  FMTPG02L    COMP  PIC  S9(4).
           02  FMTPG02F    PICTURE X.
           02  FILLER REDEFINES FMTPG02F.
             03 FMTPG02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG02I  PIC X(2).
           02  FMCOMPCL    COMP  PIC  S9(4).
           02  FMCOMPCF    PICTURE X.
           02  FILLER REDEFINES FMCOMPCF.
             03 FMCOMPCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPCI  PIC X(4).
           02  FMCCH01L    COMP  PIC  S9(4).
           02  FMCCH01F    PICTURE X.
           02  FILLER REDEFINES FMCCH01F.
             03 FMCCH01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH01I  PIC X(6).
           02  FMCCH02L    COMP  PIC  S9(4).
           02  FMCCH02F    PICTURE X.
           02  FILLER REDEFINES FMCCH02F.
             03 FMCCH02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH02I  PIC X(6).
           02  FMCCH03L    COMP  PIC  S9(4).
           02  FMCCH03F    PICTURE X.
           02  FILLER REDEFINES FMCCH03F.
             03 FMCCH03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH03I  PIC X(6).
           02  FMCCH04L    COMP  PIC  S9(4).
           02  FMCCH04F    PICTURE X.
           02  FILLER REDEFINES FMCCH04F.
             03 FMCCH04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH04I  PIC X(6).
           02  FMCCH05L    COMP  PIC  S9(4).
           02  FMCCH05F    PICTURE X.
           02  FILLER REDEFINES FMCCH05F.
             03 FMCCH05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH05I  PIC X(6).
           02  FMCCH06L    COMP  PIC  S9(4).
           02  FMCCH06F    PICTURE X.
           02  FILLER REDEFINES FMCCH06F.
             03 FMCCH06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH06I  PIC X(6).
           02  FMCCH07L    COMP  PIC  S9(4).
           02  FMCCH07F    PICTURE X.
           02  FILLER REDEFINES FMCCH07F.
             03 FMCCH07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH07I  PIC X(6).
           02  FMCCH08L    COMP  PIC  S9(4).
           02  FMCCH08F    PICTURE X.
           02  FILLER REDEFINES FMCCH08F.
             03 FMCCH08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH08I  PIC X(6).
           02  FMCCH09L    COMP  PIC  S9(4).
           02  FMCCH09F    PICTURE X.
           02  FILLER REDEFINES FMCCH09F.
             03 FMCCH09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH09I  PIC X(6).
           02  FMCCH10L    COMP  PIC  S9(4).
           02  FMCCH10F    PICTURE X.
           02  FILLER REDEFINES FMCCH10F.
             03 FMCCH10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH10I  PIC X(6).
           02  FMCCH11L    COMP  PIC  S9(4).
           02  FMCCH11F    PICTURE X.
           02  FILLER REDEFINES FMCCH11F.
             03 FMCCH11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH11I  PIC X(6).
           02  FMCCH12L    COMP  PIC  S9(4).
           02  FMCCH12F    PICTURE X.
           02  FILLER REDEFINES FMCCH12F.
             03 FMCCH12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH12I  PIC X(6).
           02  FMCCH13L    COMP  PIC  S9(4).
           02  FMCCH13F    PICTURE X.
           02  FILLER REDEFINES FMCCH13F.
             03 FMCCH13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH13I  PIC X(6).
           02  FMCCH14L    COMP  PIC  S9(4).
           02  FMCCH14F    PICTURE X.
           02  FILLER REDEFINES FMCCH14F.
             03 FMCCH14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH14I  PIC X(6).
           02  FMCCH15L    COMP  PIC  S9(4).
           02  FMCCH15F    PICTURE X.
           02  FILLER REDEFINES FMCCH15F.
             03 FMCCH15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH15I  PIC X(6).
           02  FMPFS03L    COMP  PIC  S9(4).
           02  FMPFS03F    PICTURE X.
           02  FILLER REDEFINES FMPFS03F.
             03 FMPFS03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS03I  PIC X(79).
           02  FMERR03L    COMP  PIC  S9(4).
           02  FMERR03F    PICTURE X.
           02  FILLER REDEFINES FMERR03F.
             03 FMERR03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR03I  PIC X(79).
       01  FMC1M03O REDEFINES FMC1M03I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANCC    PICTURE X.
           02  FMTRANCP    PICTURE X.
           02  FMTRANCH    PICTURE X.
           02  FMTRANCV    PICTURE X.
           02  FMTRANCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATECC    PICTURE X.
           02  FMDATECP    PICTURE X.
           02  FMDATECH    PICTURE X.
           02  FMDATECV    PICTURE X.
           02  FMDATECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMECC    PICTURE X.
           02  FMTIMECP    PICTURE X.
           02  FMTIMECH    PICTURE X.
           02  FMTIMECV    PICTURE X.
           02  FMTIMECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG02C    PICTURE X.
           02  FMPAG02P    PICTURE X.
           02  FMPAG02H    PICTURE X.
           02  FMPAG02V    PICTURE X.
           02  FMPAG02O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG02C    PICTURE X.
           02  FMTPG02P    PICTURE X.
           02  FMTPG02H    PICTURE X.
           02  FMTPG02V    PICTURE X.
           02  FMTPG02O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPCC    PICTURE X.
           02  FMCOMPCP    PICTURE X.
           02  FMCOMPCH    PICTURE X.
           02  FMCOMPCV    PICTURE X.
           02  FMCOMPCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCCH01C    PICTURE X.
           02  FMCCH01P    PICTURE X.
           02  FMCCH01H    PICTURE X.
           02  FMCCH01V    PICTURE X.
           02  FMCCH01O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH02C    PICTURE X.
           02  FMCCH02P    PICTURE X.
           02  FMCCH02H    PICTURE X.
           02  FMCCH02V    PICTURE X.
           02  FMCCH02O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH03C    PICTURE X.
           02  FMCCH03P    PICTURE X.
           02  FMCCH03H    PICTURE X.
           02  FMCCH03V    PICTURE X.
           02  FMCCH03O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH04C    PICTURE X.
           02  FMCCH04P    PICTURE X.
           02  FMCCH04H    PICTURE X.
           02  FMCCH04V    PICTURE X.
           02  FMCCH04O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH05C    PICTURE X.
           02  FMCCH05P    PICTURE X.
           02  FMCCH05H    PICTURE X.
           02  FMCCH05V    PICTURE X.
           02  FMCCH05O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH06C    PICTURE X.
           02  FMCCH06P    PICTURE X.
           02  FMCCH06H    PICTURE X.
           02  FMCCH06V    PICTURE X.
           02  FMCCH06O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH07C    PICTURE X.
           02  FMCCH07P    PICTURE X.
           02  FMCCH07H    PICTURE X.
           02  FMCCH07V    PICTURE X.
           02  FMCCH07O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH08C    PICTURE X.
           02  FMCCH08P    PICTURE X.
           02  FMCCH08H    PICTURE X.
           02  FMCCH08V    PICTURE X.
           02  FMCCH08O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH09C    PICTURE X.
           02  FMCCH09P    PICTURE X.
           02  FMCCH09H    PICTURE X.
           02  FMCCH09V    PICTURE X.
           02  FMCCH09O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH10C    PICTURE X.
           02  FMCCH10P    PICTURE X.
           02  FMCCH10H    PICTURE X.
           02  FMCCH10V    PICTURE X.
           02  FMCCH10O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH11C    PICTURE X.
           02  FMCCH11P    PICTURE X.
           02  FMCCH11H    PICTURE X.
           02  FMCCH11V    PICTURE X.
           02  FMCCH11O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH12C    PICTURE X.
           02  FMCCH12P    PICTURE X.
           02  FMCCH12H    PICTURE X.
           02  FMCCH12V    PICTURE X.
           02  FMCCH12O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH13C    PICTURE X.
           02  FMCCH13P    PICTURE X.
           02  FMCCH13H    PICTURE X.
           02  FMCCH13V    PICTURE X.
           02  FMCCH13O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH14C    PICTURE X.
           02  FMCCH14P    PICTURE X.
           02  FMCCH14H    PICTURE X.
           02  FMCCH14V    PICTURE X.
           02  FMCCH14O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCCH15C    PICTURE X.
           02  FMCCH15P    PICTURE X.
           02  FMCCH15H    PICTURE X.
           02  FMCCH15V    PICTURE X.
           02  FMCCH15O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMPFS03C    PICTURE X.
           02  FMPFS03P    PICTURE X.
           02  FMPFS03H    PICTURE X.
           02  FMPFS03V    PICTURE X.
           02  FMPFS03O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR03C    PICTURE X.
           02  FMERR03P    PICTURE X.
           02  FMERR03H    PICTURE X.
           02  FMERR03V    PICTURE X.
           02  FMERR03O  PIC X(79).
       01  FMC1M04I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANDL    COMP  PIC  S9(4).
           02  FMTRANDF    PICTURE X.
           02  FILLER REDEFINES FMTRANDF.
             03 FMTRANDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANDI  PIC X(4).
           02  FMDATEDL    COMP  PIC  S9(4).
           02  FMDATEDF    PICTURE X.
           02  FILLER REDEFINES FMDATEDF.
             03 FMDATEDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEDI  PIC X(8).
           02  FMTIMEDL    COMP  PIC  S9(4).
           02  FMTIMEDF    PICTURE X.
           02  FILLER REDEFINES FMTIMEDF.
             03 FMTIMEDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEDI  PIC X(8).
           02  FMPAG03L    COMP  PIC  S9(4).
           02  FMPAG03F    PICTURE X.
           02  FILLER REDEFINES FMPAG03F.
             03 FMPAG03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG03I  PIC X(2).
           02  FMTPG03L    COMP  PIC  S9(4).
           02  FMTPG03F    PICTURE X.
           02  FILLER REDEFINES FMTPG03F.
             03 FMTPG03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG03I  PIC X(2).
           02  FMCOMPDL    COMP  PIC  S9(4).
           02  FMCOMPDF    PICTURE X.
           02  FILLER REDEFINES FMCOMPDF.
             03 FMCOMPDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPDI  PIC X(4).
           02  FMCC132L    COMP  PIC  S9(4).
           02  FMCC132F    PICTURE X.
           02  FILLER REDEFINES FMCC132F.
             03 FMCC132A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC132I  PIC X(1).
           02  FMCC131L    COMP  PIC  S9(4).
           02  FMCC131F    PICTURE X.
           02  FILLER REDEFINES FMCC131F.
             03 FMCC131A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC131I  PIC X(1).
           02  FMCC133L    COMP  PIC  S9(4).
           02  FMCC133F    PICTURE X.
           02  FILLER REDEFINES FMCC133F.
             03 FMCC133A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC133I  PIC X(1).
           02  FMCC130L    COMP  PIC  S9(4).
           02  FMCC130F    PICTURE X.
           02  FILLER REDEFINES FMCC130F.
             03 FMCC130A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC130I  PIC X(2).
           02  FMCC134L    COMP  PIC  S9(4).
           02  FMCC134F    PICTURE X.
           02  FILLER REDEFINES FMCC134F.
             03 FMCC134A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC134I  PIC X(1).
           02  FMCCOSDL    COMP  PIC  S9(4).
           02  FMCCOSDF    PICTURE X.
           02  FILLER REDEFINES FMCCOSDF.
             03 FMCCOSDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCOSDI  PIC X(1).
           02  FMPFS04L    COMP  PIC  S9(4).
           02  FMPFS04F    PICTURE X.
           02  FILLER REDEFINES FMPFS04F.
             03 FMPFS04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS04I  PIC X(79).
           02  FMERR04L    COMP  PIC  S9(4).
           02  FMERR04F    PICTURE X.
           02  FILLER REDEFINES FMERR04F.
             03 FMERR04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR04I  PIC X(79).
       01  FMC1M04O REDEFINES FMC1M04I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANDC    PICTURE X.
           02  FMTRANDP    PICTURE X.
           02  FMTRANDH    PICTURE X.
           02  FMTRANDV    PICTURE X.
           02  FMTRANDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEDC    PICTURE X.
           02  FMDATEDP    PICTURE X.
           02  FMDATEDH    PICTURE X.
           02  FMDATEDV    PICTURE X.
           02  FMDATEDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEDC    PICTURE X.
           02  FMTIMEDP    PICTURE X.
           02  FMTIMEDH    PICTURE X.
           02  FMTIMEDV    PICTURE X.
           02  FMTIMEDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG03C    PICTURE X.
           02  FMPAG03P    PICTURE X.
           02  FMPAG03H    PICTURE X.
           02  FMPAG03V    PICTURE X.
           02  FMPAG03O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG03C    PICTURE X.
           02  FMTPG03P    PICTURE X.
           02  FMTPG03H    PICTURE X.
           02  FMTPG03V    PICTURE X.
           02  FMTPG03O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPDC    PICTURE X.
           02  FMCOMPDP    PICTURE X.
           02  FMCOMPDH    PICTURE X.
           02  FMCOMPDV    PICTURE X.
           02  FMCOMPDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC132C    PICTURE X.
           02  FMCC132P    PICTURE X.
           02  FMCC132H    PICTURE X.
           02  FMCC132V    PICTURE X.
           02  FMCC132O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC131C    PICTURE X.
           02  FMCC131P    PICTURE X.
           02  FMCC131H    PICTURE X.
           02  FMCC131V    PICTURE X.
           02  FMCC131O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC133C    PICTURE X.
           02  FMCC133P    PICTURE X.
           02  FMCC133H    PICTURE X.
           02  FMCC133V    PICTURE X.
           02  FMCC133O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC130C    PICTURE X.
           02  FMCC130P    PICTURE X.
           02  FMCC130H    PICTURE X.
           02  FMCC130V    PICTURE X.
           02  FMCC130O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCC134C    PICTURE X.
           02  FMCC134P    PICTURE X.
           02  FMCC134H    PICTURE X.
           02  FMCC134V    PICTURE X.
           02  FMCC134O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCOSDC    PICTURE X.
           02  FMCCOSDP    PICTURE X.
           02  FMCCOSDH    PICTURE X.
           02  FMCCOSDV    PICTURE X.
           02  FMCCOSDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPFS04C    PICTURE X.
           02  FMPFS04P    PICTURE X.
           02  FMPFS04H    PICTURE X.
           02  FMPFS04V    PICTURE X.
           02  FMPFS04O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR04C    PICTURE X.
           02  FMERR04P    PICTURE X.
           02  FMERR04H    PICTURE X.
           02  FMERR04V    PICTURE X.
           02  FMERR04O  PIC X(79).
       01  FMC1M05I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANEL    COMP  PIC  S9(4).
           02  FMTRANEF    PICTURE X.
           02  FILLER REDEFINES FMTRANEF.
             03 FMTRANEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANEI  PIC X(4).
           02  FMDATEEL    COMP  PIC  S9(4).
           02  FMDATEEF    PICTURE X.
           02  FILLER REDEFINES FMDATEEF.
             03 FMDATEEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEEI  PIC X(8).
           02  FMTIMEEL    COMP  PIC  S9(4).
           02  FMTIMEEF    PICTURE X.
           02  FILLER REDEFINES FMTIMEEF.
             03 FMTIMEEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEEI  PIC X(8).
           02  FMPAG04L    COMP  PIC  S9(4).
           02  FMPAG04F    PICTURE X.
           02  FILLER REDEFINES FMPAG04F.
             03 FMPAG04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG04I  PIC X(2).
           02  FMTPG04L    COMP  PIC  S9(4).
           02  FMTPG04F    PICTURE X.
           02  FILLER REDEFINES FMTPG04F.
             03 FMTPG04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG04I  PIC X(2).
           02  FMCOMPEL    COMP  PIC  S9(4).
           02  FMCOMPEF    PICTURE X.
           02  FILLER REDEFINES FMCOMPEF.
             03 FMCOMPEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPEI  PIC X(4).
           02  FMCC125L    COMP  PIC  S9(4).
           02  FMCC125F    PICTURE X.
           02  FILLER REDEFINES FMCC125F.
             03 FMCC125A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC125I  PIC X(1).
           02  FMCCMC5L    COMP  PIC  S9(4).
           02  FMCCMC5F    PICTURE X.
           02  FILLER REDEFINES FMCCMC5F.
             03 FMCCMC5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC5I  PIC X(4).
           02  FMCC111L    COMP  PIC  S9(4).
           02  FMCC111F    PICTURE X.
           02  FILLER REDEFINES FMCC111F.
             03 FMCC111A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC111I  PIC X(1).
           02  FMCCMC0L    COMP  PIC  S9(4).
           02  FMCCMC0F    PICTURE X.
           02  FILLER REDEFINES FMCCMC0F.
             03 FMCCMC0A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC0I  PIC X(10).
           02  FMCC122L    COMP  PIC  S9(4).
           02  FMCC122F    PICTURE X.
           02  FILLER REDEFINES FMCC122F.
             03 FMCC122A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC122I  PIC X(1).
           02  FMCCMC8L    COMP  PIC  S9(4).
           02  FMCCMC8F    PICTURE X.
           02  FILLER REDEFINES FMCCMC8F.
             03 FMCCMC8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC8I  PIC X(10).
           02  FMCC139L    COMP  PIC  S9(4).
           02  FMCC139F    PICTURE X.
           02  FILLER REDEFINES FMCC139F.
             03 FMCC139A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC139I  PIC X(2).
           02  FMCCMC9L    COMP  PIC  S9(4).
           02  FMCCMC9F    PICTURE X.
           02  FILLER REDEFINES FMCCMC9F.
             03 FMCCMC9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC9I  PIC X(10).
           02  FMCC118L    COMP  PIC  S9(4).
           02  FMCC118F    PICTURE X.
           02  FILLER REDEFINES FMCC118F.
             03 FMCC118A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC118I  PIC X(1).
           02  FMCCMC7L    COMP  PIC  S9(4).
           02  FMCCMC7F    PICTURE X.
           02  FILLER REDEFINES FMCCMC7F.
             03 FMCCMC7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC7I  PIC X(1).
           02  FMCCNMHL    COMP  PIC  S9(4).
           02  FMCCNMHF    PICTURE X.
           02  FILLER REDEFINES FMCCNMHF.
             03 FMCCNMHA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCNMHI  PIC X(2).
           02  FMCCMC4L    COMP  PIC  S9(4).
           02  FMCCMC4F    PICTURE X.
           02  FILLER REDEFINES FMCCMC4F.
             03 FMCCMC4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC4I  PIC X(1).
           02  FMCC113L    COMP  PIC  S9(4).
           02  FMCC113F    PICTURE X.
           02  FILLER REDEFINES FMCC113F.
             03 FMCC113A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC113I  PIC X(1).
           02  FMCCMC3L    COMP  PIC  S9(4).
           02  FMCCMC3F    PICTURE X.
           02  FILLER REDEFINES FMCCMC3F.
             03 FMCCMC3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC3I  PIC X(1).
           02  FMCC114L    COMP  PIC  S9(4).
           02  FMCC114F    PICTURE X.
           02  FILLER REDEFINES FMCC114F.
             03 FMCC114A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC114I  PIC X(1).
           02  FMCC121L    COMP  PIC  S9(4).
           02  FMCC121F    PICTURE X.
           02  FILLER REDEFINES FMCC121F.
             03 FMCC121A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC121I  PIC X(1).
           02  FMCCPYHL    COMP  PIC  S9(4).
           02  FMCCPYHF    PICTURE X.
           02  FILLER REDEFINES FMCCPYHF.
             03 FMCCPYHA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCPYHI  PIC X(1).
           02  FMCC129L    COMP  PIC  S9(4).
           02  FMCC129F    PICTURE X.
           02  FILLER REDEFINES FMCC129F.
             03 FMCC129A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC129I  PIC X(1).
           02  FMCC158L    COMP  PIC  S9(4).
           02  FMCC158F    PICTURE X.
           02  FILLER REDEFINES FMCC158F.
             03 FMCC158A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC158I  PIC X(1).
           02  FMCC166L    COMP  PIC  S9(4).
           02  FMCC166F    PICTURE X.
           02  FILLER REDEFINES FMCC166F.
             03 FMCC166A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC166I  PIC X(1).
           02  FMCC159L    COMP  PIC  S9(4).
           02  FMCC159F    PICTURE X.
           02  FILLER REDEFINES FMCC159F.
             03 FMCC159A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC159I  PIC X(1).
           02  FMCC120L    COMP  PIC  S9(4).
           02  FMCC120F    PICTURE X.
           02  FILLER REDEFINES FMCC120F.
             03 FMCC120A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC120I  PIC X(1).
           02  FMCC123L    COMP  PIC  S9(4).
           02  FMCC123F    PICTURE X.
           02  FILLER REDEFINES FMCC123F.
             03 FMCC123A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC123I  PIC X(1).
           02  FMCC127L    COMP  PIC  S9(4).
           02  FMCC127F    PICTURE X.
           02  FILLER REDEFINES FMCC127F.
             03 FMCC127A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC127I  PIC X(1).
           02  FMPFS05L    COMP  PIC  S9(4).
           02  FMPFS05F    PICTURE X.
           02  FILLER REDEFINES FMPFS05F.
             03 FMPFS05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS05I  PIC X(79).
           02  FMERR05L    COMP  PIC  S9(4).
           02  FMERR05F    PICTURE X.
           02  FILLER REDEFINES FMERR05F.
             03 FMERR05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR05I  PIC X(79).
       01  FMC1M05O REDEFINES FMC1M05I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANEC    PICTURE X.
           02  FMTRANEP    PICTURE X.
           02  FMTRANEH    PICTURE X.
           02  FMTRANEV    PICTURE X.
           02  FMTRANEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEEC    PICTURE X.
           02  FMDATEEP    PICTURE X.
           02  FMDATEEH    PICTURE X.
           02  FMDATEEV    PICTURE X.
           02  FMDATEEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEEC    PICTURE X.
           02  FMTIMEEP    PICTURE X.
           02  FMTIMEEH    PICTURE X.
           02  FMTIMEEV    PICTURE X.
           02  FMTIMEEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG04C    PICTURE X.
           02  FMPAG04P    PICTURE X.
           02  FMPAG04H    PICTURE X.
           02  FMPAG04V    PICTURE X.
           02  FMPAG04O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG04C    PICTURE X.
           02  FMTPG04P    PICTURE X.
           02  FMTPG04H    PICTURE X.
           02  FMTPG04V    PICTURE X.
           02  FMTPG04O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPEC    PICTURE X.
           02  FMCOMPEP    PICTURE X.
           02  FMCOMPEH    PICTURE X.
           02  FMCOMPEV    PICTURE X.
           02  FMCOMPEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC125C    PICTURE X.
           02  FMCC125P    PICTURE X.
           02  FMCC125H    PICTURE X.
           02  FMCC125V    PICTURE X.
           02  FMCC125O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCMC5C    PICTURE X.
           02  FMCCMC5P    PICTURE X.
           02  FMCCMC5H    PICTURE X.
           02  FMCCMC5V    PICTURE X.
           02  FMCCMC5O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC111C    PICTURE X.
           02  FMCC111P    PICTURE X.
           02  FMCC111H    PICTURE X.
           02  FMCC111V    PICTURE X.
           02  FMCC111O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCMC0C    PICTURE X.
           02  FMCCMC0P    PICTURE X.
           02  FMCCMC0H    PICTURE X.
           02  FMCCMC0V    PICTURE X.
           02  FMCCMC0O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCC122C    PICTURE X.
           02  FMCC122P    PICTURE X.
           02  FMCC122H    PICTURE X.
           02  FMCC122V    PICTURE X.
           02  FMCC122O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCMC8C    PICTURE X.
           02  FMCCMC8P    PICTURE X.
           02  FMCCMC8H    PICTURE X.
           02  FMCCMC8V    PICTURE X.
           02  FMCCMC8O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCC139C    PICTURE X.
           02  FMCC139P    PICTURE X.
           02  FMCC139H    PICTURE X.
           02  FMCC139V    PICTURE X.
           02  FMCC139O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCCMC9C    PICTURE X.
           02  FMCCMC9P    PICTURE X.
           02  FMCCMC9H    PICTURE X.
           02  FMCCMC9V    PICTURE X.
           02  FMCCMC9O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCC118C    PICTURE X.
           02  FMCC118P    PICTURE X.
           02  FMCC118H    PICTURE X.
           02  FMCC118V    PICTURE X.
           02  FMCC118O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCMC7C    PICTURE X.
           02  FMCCMC7P    PICTURE X.
           02  FMCCMC7H    PICTURE X.
           02  FMCCMC7V    PICTURE X.
           02  FMCCMC7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCNMHC    PICTURE X.
           02  FMCCNMHP    PICTURE X.
           02  FMCCNMHH    PICTURE X.
           02  FMCCNMHV    PICTURE X.
           02  FMCCNMHO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCCMC4C    PICTURE X.
           02  FMCCMC4P    PICTURE X.
           02  FMCCMC4H    PICTURE X.
           02  FMCCMC4V    PICTURE X.
           02  FMCCMC4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC113C    PICTURE X.
           02  FMCC113P    PICTURE X.
           02  FMCC113H    PICTURE X.
           02  FMCC113V    PICTURE X.
           02  FMCC113O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCMC3C    PICTURE X.
           02  FMCCMC3P    PICTURE X.
           02  FMCCMC3H    PICTURE X.
           02  FMCCMC3V    PICTURE X.
           02  FMCCMC3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC114C    PICTURE X.
           02  FMCC114P    PICTURE X.
           02  FMCC114H    PICTURE X.
           02  FMCC114V    PICTURE X.
           02  FMCC114O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC121C    PICTURE X.
           02  FMCC121P    PICTURE X.
           02  FMCC121H    PICTURE X.
           02  FMCC121V    PICTURE X.
           02  FMCC121O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCPYHC    PICTURE X.
           02  FMCCPYHP    PICTURE X.
           02  FMCCPYHH    PICTURE X.
           02  FMCCPYHV    PICTURE X.
           02  FMCCPYHO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC129C    PICTURE X.
           02  FMCC129P    PICTURE X.
           02  FMCC129H    PICTURE X.
           02  FMCC129V    PICTURE X.
           02  FMCC129O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC158C    PICTURE X.
           02  FMCC158P    PICTURE X.
           02  FMCC158H    PICTURE X.
           02  FMCC158V    PICTURE X.
           02  FMCC158O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC166C    PICTURE X.
           02  FMCC166P    PICTURE X.
           02  FMCC166H    PICTURE X.
           02  FMCC166V    PICTURE X.
           02  FMCC166O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC159C    PICTURE X.
           02  FMCC159P    PICTURE X.
           02  FMCC159H    PICTURE X.
           02  FMCC159V    PICTURE X.
           02  FMCC159O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC120C    PICTURE X.
           02  FMCC120P    PICTURE X.
           02  FMCC120H    PICTURE X.
           02  FMCC120V    PICTURE X.
           02  FMCC120O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC123C    PICTURE X.
           02  FMCC123P    PICTURE X.
           02  FMCC123H    PICTURE X.
           02  FMCC123V    PICTURE X.
           02  FMCC123O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC127C    PICTURE X.
           02  FMCC127P    PICTURE X.
           02  FMCC127H    PICTURE X.
           02  FMCC127V    PICTURE X.
           02  FMCC127O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPFS05C    PICTURE X.
           02  FMPFS05P    PICTURE X.
           02  FMPFS05H    PICTURE X.
           02  FMPFS05V    PICTURE X.
           02  FMPFS05O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR05C    PICTURE X.
           02  FMERR05P    PICTURE X.
           02  FMERR05H    PICTURE X.
           02  FMERR05V    PICTURE X.
           02  FMERR05O  PIC X(79).
       01  FMC1M06I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANFL    COMP  PIC  S9(4).
           02  FMTRANFF    PICTURE X.
           02  FILLER REDEFINES FMTRANFF.
             03 FMTRANFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANFI  PIC X(4).
           02  FMDATEFL    COMP  PIC  S9(4).
           02  FMDATEFF    PICTURE X.
           02  FILLER REDEFINES FMDATEFF.
             03 FMDATEFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEFI  PIC X(8).
           02  FMTIMEFL    COMP  PIC  S9(4).
           02  FMTIMEFF    PICTURE X.
           02  FILLER REDEFINES FMTIMEFF.
             03 FMTIMEFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEFI  PIC X(8).
           02  FMPAG05L    COMP  PIC  S9(4).
           02  FMPAG05F    PICTURE X.
           02  FILLER REDEFINES FMPAG05F.
             03 FMPAG05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG05I  PIC X(2).
           02  FMTPG05L    COMP  PIC  S9(4).
           02  FMTPG05F    PICTURE X.
           02  FILLER REDEFINES FMTPG05F.
             03 FMTPG05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG05I  PIC X(2).
           02  FMCOMPFL    COMP  PIC  S9(4).
           02  FMCOMPFF    PICTURE X.
           02  FILLER REDEFINES FMCOMPFF.
             03 FMCOMPFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPFI  PIC X(4).
           02  FMCCBF1L    COMP  PIC  S9(4).
           02  FMCCBF1F    PICTURE X.
           02  FILLER REDEFINES FMCCBF1F.
             03 FMCCBF1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCBF1I  PIC X(1).
           02  FMCCBF3L    COMP  PIC  S9(4).
           02  FMCCBF3F    PICTURE X.
           02  FILLER REDEFINES FMCCBF3F.
             03 FMCCBF3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCBF3I  PIC X(1).
           02  FMCC189L    COMP  PIC  S9(4).
           02  FMCC189F    PICTURE X.
           02  FILLER REDEFINES FMCC189F.
             03 FMCC189A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC189I  PIC X(3).
           02  FMCC190L    COMP  PIC  S9(4).
           02  FMCC190F    PICTURE X.
           02  FILLER REDEFINES FMCC190F.
             03 FMCC190A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC190I  PIC X(5).
           02  FMCC186L    COMP  PIC  S9(4).
           02  FMCC186F    PICTURE X.
           02  FILLER REDEFINES FMCC186F.
             03 FMCC186A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC186I  PIC X(8).
           02  FMCC185L    COMP  PIC  S9(4).
           02  FMCC185F    PICTURE X.
           02  FILLER REDEFINES FMCC185F.
             03 FMCC185A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC185I  PIC X(2).
           02  FMCCBF2L    COMP  PIC  S9(4).
           02  FMCCBF2F    PICTURE X.
           02  FILLER REDEFINES FMCCBF2F.
             03 FMCCBF2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCBF2I  PIC X(1).
           02  FMCCBF7L    COMP  PIC  S9(4).
           02  FMCCBF7F    PICTURE X.
           02  FILLER REDEFINES FMCCBF7F.
             03 FMCCBF7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCBF7I  PIC X(1).
           02  FMPFS06L    COMP  PIC  S9(4).
           02  FMPFS06F    PICTURE X.
           02  FILLER REDEFINES FMPFS06F.
             03 FMPFS06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS06I  PIC X(79).
           02  FMERR06L    COMP  PIC  S9(4).
           02  FMERR06F    PICTURE X.
           02  FILLER REDEFINES FMERR06F.
             03 FMERR06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR06I  PIC X(79).
       01  FMC1M06O REDEFINES FMC1M06I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANFC    PICTURE X.
           02  FMTRANFP    PICTURE X.
           02  FMTRANFH    PICTURE X.
           02  FMTRANFV    PICTURE X.
           02  FMTRANFO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEFC    PICTURE X.
           02  FMDATEFP    PICTURE X.
           02  FMDATEFH    PICTURE X.
           02  FMDATEFV    PICTURE X.
           02  FMDATEFO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEFC    PICTURE X.
           02  FMTIMEFP    PICTURE X.
           02  FMTIMEFH    PICTURE X.
           02  FMTIMEFV    PICTURE X.
           02  FMTIMEFO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG05C    PICTURE X.
           02  FMPAG05P    PICTURE X.
           02  FMPAG05H    PICTURE X.
           02  FMPAG05V    PICTURE X.
           02  FMPAG05O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG05C    PICTURE X.
           02  FMTPG05P    PICTURE X.
           02  FMTPG05H    PICTURE X.
           02  FMTPG05V    PICTURE X.
           02  FMTPG05O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPFC    PICTURE X.
           02  FMCOMPFP    PICTURE X.
           02  FMCOMPFH    PICTURE X.
           02  FMCOMPFV    PICTURE X.
           02  FMCOMPFO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCCBF1C    PICTURE X.
           02  FMCCBF1P    PICTURE X.
           02  FMCCBF1H    PICTURE X.
           02  FMCCBF1V    PICTURE X.
           02  FMCCBF1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCBF3C    PICTURE X.
           02  FMCCBF3P    PICTURE X.
           02  FMCCBF3H    PICTURE X.
           02  FMCCBF3V    PICTURE X.
           02  FMCCBF3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC189C    PICTURE X.
           02  FMCC189P    PICTURE X.
           02  FMCC189H    PICTURE X.
           02  FMCC189V    PICTURE X.
           02  FMCC189O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMCC190C    PICTURE X.
           02  FMCC190P    PICTURE X.
           02  FMCC190H    PICTURE X.
           02  FMCC190V    PICTURE X.
           02  FMCC190O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  FMCC186C    PICTURE X.
           02  FMCC186P    PICTURE X.
           02  FMCC186H    PICTURE X.
           02  FMCC186V    PICTURE X.
           02  FMCC186O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCC185C    PICTURE X.
           02  FMCC185P    PICTURE X.
           02  FMCC185H    PICTURE X.
           02  FMCC185V    PICTURE X.
           02  FMCC185O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCCBF2C    PICTURE X.
           02  FMCCBF2P    PICTURE X.
           02  FMCCBF2H    PICTURE X.
           02  FMCCBF2V    PICTURE X.
           02  FMCCBF2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCBF7C    PICTURE X.
           02  FMCCBF7P    PICTURE X.
           02  FMCCBF7H    PICTURE X.
           02  FMCCBF7V    PICTURE X.
           02  FMCCBF7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMPFS06C    PICTURE X.
           02  FMPFS06P    PICTURE X.
           02  FMPFS06H    PICTURE X.
           02  FMPFS06V    PICTURE X.
           02  FMPFS06O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR06C    PICTURE X.
           02  FMERR06P    PICTURE X.
           02  FMERR06H    PICTURE X.
           02  FMERR06V    PICTURE X.
           02  FMERR06O  PIC X(79).
       01  FMC1M07I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANGL    COMP  PIC  S9(4).
           02  FMTRANGF    PICTURE X.
           02  FILLER REDEFINES FMTRANGF.
             03 FMTRANGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANGI  PIC X(4).
           02  FMDATEGL    COMP  PIC  S9(4).
           02  FMDATEGF    PICTURE X.
           02  FILLER REDEFINES FMDATEGF.
             03 FMDATEGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEGI  PIC X(8).
           02  FMTIMEGL    COMP  PIC  S9(4).
           02  FMTIMEGF    PICTURE X.
           02  FILLER REDEFINES FMTIMEGF.
             03 FMTIMEGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEGI  PIC X(8).
           02  FMPAG06L    COMP  PIC  S9(4).
           02  FMPAG06F    PICTURE X.
           02  FILLER REDEFINES FMPAG06F.
             03 FMPAG06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG06I  PIC X(2).
           02  FMTPG06L    COMP  PIC  S9(4).
           02  FMTPG06F    PICTURE X.
           02  FILLER REDEFINES FMTPG06F.
             03 FMTPG06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG06I  PIC X(2).
           02  FMCOMPGL    COMP  PIC  S9(4).
           02  FMCOMPGF    PICTURE X.
           02  FILLER REDEFINES FMCOMPGF.
             03 FMCOMPGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPGI  PIC X(4).
           02  FMCCDC1L    COMP  PIC  S9(4).
           02  FMCCDC1F    PICTURE X.
           02  FILLER REDEFINES FMCCDC1F.
             03 FMCCDC1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCDC1I  PIC X(50).
           02  FMCCDC2L    COMP  PIC  S9(4).
           02  FMCCDC2F    PICTURE X.
           02  FILLER REDEFINES FMCCDC2F.
             03 FMCCDC2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCDC2I  PIC X(50).
           02  FMCCDC3L    COMP  PIC  S9(4).
           02  FMCCDC3F    PICTURE X.
           02  FILLER REDEFINES FMCCDC3F.
             03 FMCCDC3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCDC3I  PIC X(50).
           02  FMPFS07L    COMP  PIC  S9(4).
           02  FMPFS07F    PICTURE X.
           02  FILLER REDEFINES FMPFS07F.
             03 FMPFS07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS07I  PIC X(79).
           02  FMERR07L    COMP  PIC  S9(4).
           02  FMERR07F    PICTURE X.
           02  FILLER REDEFINES FMERR07F.
             03 FMERR07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR07I  PIC X(79).
       01  FMC1M07O REDEFINES FMC1M07I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANGC    PICTURE X.
           02  FMTRANGP    PICTURE X.
           02  FMTRANGH    PICTURE X.
           02  FMTRANGV    PICTURE X.
           02  FMTRANGO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEGC    PICTURE X.
           02  FMDATEGP    PICTURE X.
           02  FMDATEGH    PICTURE X.
           02  FMDATEGV    PICTURE X.
           02  FMDATEGO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEGC    PICTURE X.
           02  FMTIMEGP    PICTURE X.
           02  FMTIMEGH    PICTURE X.
           02  FMTIMEGV    PICTURE X.
           02  FMTIMEGO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG06C    PICTURE X.
           02  FMPAG06P    PICTURE X.
           02  FMPAG06H    PICTURE X.
           02  FMPAG06V    PICTURE X.
           02  FMPAG06O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG06C    PICTURE X.
           02  FMTPG06P    PICTURE X.
           02  FMTPG06H    PICTURE X.
           02  FMTPG06V    PICTURE X.
           02  FMTPG06O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPGC    PICTURE X.
           02  FMCOMPGP    PICTURE X.
           02  FMCOMPGH    PICTURE X.
           02  FMCOMPGV    PICTURE X.
           02  FMCOMPGO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCCDC1C    PICTURE X.
           02  FMCCDC1P    PICTURE X.
           02  FMCCDC1H    PICTURE X.
           02  FMCCDC1V    PICTURE X.
           02  FMCCDC1O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  FMCCDC2C    PICTURE X.
           02  FMCCDC2P    PICTURE X.
           02  FMCCDC2H    PICTURE X.
           02  FMCCDC2V    PICTURE X.
           02  FMCCDC2O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  FMCCDC3C    PICTURE X.
           02  FMCCDC3P    PICTURE X.
           02  FMCCDC3H    PICTURE X.
           02  FMCCDC3V    PICTURE X.
           02  FMCCDC3O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  FMPFS07C    PICTURE X.
           02  FMPFS07P    PICTURE X.
           02  FMPFS07H    PICTURE X.
           02  FMPFS07V    PICTURE X.
           02  FMPFS07O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR07C    PICTURE X.
           02  FMERR07P    PICTURE X.
           02  FMERR07H    PICTURE X.
           02  FMERR07V    PICTURE X.
           02  FMERR07O  PIC X(79).
       01  FMC1M08I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANHL    COMP  PIC  S9(4).
           02  FMTRANHF    PICTURE X.
           02  FILLER REDEFINES FMTRANHF.
             03 FMTRANHA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANHI  PIC X(4).
           02  FMDATEHL    COMP  PIC  S9(4).
           02  FMDATEHF    PICTURE X.
           02  FILLER REDEFINES FMDATEHF.
             03 FMDATEHA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEHI  PIC X(8).
           02  FMTIMEHL    COMP  PIC  S9(4).
           02  FMTIMEHF    PICTURE X.
           02  FILLER REDEFINES FMTIMEHF.
             03 FMTIMEHA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEHI  PIC X(8).
           02  FMPAG07L    COMP  PIC  S9(4).
           02  FMPAG07F    PICTURE X.
           02  FILLER REDEFINES FMPAG07F.
             03 FMPAG07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG07I  PIC X(2).
           02  FMTPG07L    COMP  PIC  S9(4).
           02  FMTPG07F    PICTURE X.
           02  FILLER REDEFINES FMTPG07F.
             03 FMTPG07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG07I  PIC X(2).
           02  FMCOMPHL    COMP  PIC  S9(4).
           02  FMCOMPHF    PICTURE X.
           02  FILLER REDEFINES FMCOMPHF.
             03 FMCOMPHA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPHI  PIC X(4).
           02  FMCC115L    COMP  PIC  S9(4).
           02  FMCC115F    PICTURE X.
           02  FILLER REDEFINES FMCC115F.
             03 FMCC115A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC115I  PIC X(1).
           02  FMCC116L    COMP  PIC  S9(4).
           02  FMCC116F    PICTURE X.
           02  FILLER REDEFINES FMCC116F.
             03 FMCC116A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC116I  PIC X(1).
           02  FMCC187L    COMP  PIC  S9(4).
           02  FMCC187F    PICTURE X.
           02  FILLER REDEFINES FMCC187F.
             03 FMCC187A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC187I  PIC X(1).
           02  FMCC119L    COMP  PIC  S9(4).
           02  FMCC119F    PICTURE X.
           02  FILLER REDEFINES FMCC119F.
             03 FMCC119A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC119I  PIC X(1).
           02  FMCC135L    COMP  PIC  S9(4).
           02  FMCC135F    PICTURE X.
           02  FILLER REDEFINES FMCC135F.
             03 FMCC135A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC135I  PIC X(4).
           02  FMCC128L    COMP  PIC  S9(4).
           02  FMCC128F    PICTURE X.
           02  FILLER REDEFINES FMCC128F.
             03 FMCC128A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC128I  PIC X(1).
           02  FMCC156L    COMP  PIC  S9(4).
           02  FMCC156F    PICTURE X.
           02  FILLER REDEFINES FMCC156F.
             03 FMCC156A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC156I  PIC X(15).
           02  FMCC155L    COMP  PIC  S9(4).
           02  FMCC155F    PICTURE X.
           02  FILLER REDEFINES FMCC155F.
             03 FMCC155A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC155I  PIC X(15).
           02  FMCCBSML    COMP  PIC  S9(4).
           02  FMCCBSMF    PICTURE X.
           02  FILLER REDEFINES FMCCBSMF.
             03 FMCCBSMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCBSMI  PIC X(10).
           02  FMCCIEML    COMP  PIC  S9(4).
           02  FMCCIEMF    PICTURE X.
           02  FILLER REDEFINES FMCCIEMF.
             03 FMCCIEMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCIEMI  PIC X(10).
           02  FMCC091L    COMP  PIC  S9(4).
           02  FMCC091F    PICTURE X.
           02  FILLER REDEFINES FMCC091F.
             03 FMCC091A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC091I  PIC X(1).
           02  FMCC092L    COMP  PIC  S9(4).
           02  FMCC092F    PICTURE X.
           02  FILLER REDEFINES FMCC092F.
             03 FMCC092A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC092I  PIC X(1).
           02  FMCC093L    COMP  PIC  S9(4).
           02  FMCC093F    PICTURE X.
           02  FILLER REDEFINES FMCC093F.
             03 FMCC093A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC093I  PIC X(1).
           02  FMCC094L    COMP  PIC  S9(4).
           02  FMCC094F    PICTURE X.
           02  FILLER REDEFINES FMCC094F.
             03 FMCC094A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC094I  PIC X(1).
           02  FMCCVC1L    COMP  PIC  S9(4).
           02  FMCCVC1F    PICTURE X.
           02  FILLER REDEFINES FMCCVC1F.
             03 FMCCVC1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCVC1I  PIC X(1).
           02  FMCCVC2L    COMP  PIC  S9(4).
           02  FMCCVC2F    PICTURE X.
           02  FILLER REDEFINES FMCCVC2F.
             03 FMCCVC2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCVC2I  PIC X(1).
           02  FMCCVC3L    COMP  PIC  S9(4).
           02  FMCCVC3F    PICTURE X.
           02  FILLER REDEFINES FMCCVC3F.
             03 FMCCVC3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCVC3I  PIC X(1).
           02  FMCCVC4L    COMP  PIC  S9(4).
           02  FMCCVC4F    PICTURE X.
           02  FILLER REDEFINES FMCCVC4F.
             03 FMCCVC4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCVC4I  PIC X(1).
           02  FMCCVC5L    COMP  PIC  S9(4).
           02  FMCCVC5F    PICTURE X.
           02  FILLER REDEFINES FMCCVC5F.
             03 FMCCVC5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCVC5I  PIC X(1).
           02  FMCC088L    COMP  PIC  S9(4).
           02  FMCC088F    PICTURE X.
           02  FILLER REDEFINES FMCC088F.
             03 FMCC088A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC088I  PIC X(1).
           02  FMCC090L    COMP  PIC  S9(4).
           02  FMCC090F    PICTURE X.
           02  FILLER REDEFINES FMCC090F.
             03 FMCC090A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC090I  PIC X(1).
           02  FMCC110L    COMP  PIC  S9(4).
           02  FMCC110F    PICTURE X.
           02  FILLER REDEFINES FMCC110F.
             03 FMCC110A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC110I  PIC X(1).
           02  FMCC143L    COMP  PIC  S9(4).
           02  FMCC143F    PICTURE X.
           02  FILLER REDEFINES FMCC143F.
             03 FMCC143A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC143I  PIC X(2).
           02  FMPFS08L    COMP  PIC  S9(4).
           02  FMPFS08F    PICTURE X.
           02  FILLER REDEFINES FMPFS08F.
             03 FMPFS08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS08I  PIC X(79).
           02  FMERR08L    COMP  PIC  S9(4).
           02  FMERR08F    PICTURE X.
           02  FILLER REDEFINES FMERR08F.
             03 FMERR08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR08I  PIC X(79).
       01  FMC1M08O REDEFINES FMC1M08I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANHC    PICTURE X.
           02  FMTRANHP    PICTURE X.
           02  FMTRANHH    PICTURE X.
           02  FMTRANHV    PICTURE X.
           02  FMTRANHO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEHC    PICTURE X.
           02  FMDATEHP    PICTURE X.
           02  FMDATEHH    PICTURE X.
           02  FMDATEHV    PICTURE X.
           02  FMDATEHO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEHC    PICTURE X.
           02  FMTIMEHP    PICTURE X.
           02  FMTIMEHH    PICTURE X.
           02  FMTIMEHV    PICTURE X.
           02  FMTIMEHO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG07C    PICTURE X.
           02  FMPAG07P    PICTURE X.
           02  FMPAG07H    PICTURE X.
           02  FMPAG07V    PICTURE X.
           02  FMPAG07O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG07C    PICTURE X.
           02  FMTPG07P    PICTURE X.
           02  FMTPG07H    PICTURE X.
           02  FMTPG07V    PICTURE X.
           02  FMTPG07O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPHC    PICTURE X.
           02  FMCOMPHP    PICTURE X.
           02  FMCOMPHH    PICTURE X.
           02  FMCOMPHV    PICTURE X.
           02  FMCOMPHO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC115C    PICTURE X.
           02  FMCC115P    PICTURE X.
           02  FMCC115H    PICTURE X.
           02  FMCC115V    PICTURE X.
           02  FMCC115O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC116C    PICTURE X.
           02  FMCC116P    PICTURE X.
           02  FMCC116H    PICTURE X.
           02  FMCC116V    PICTURE X.
           02  FMCC116O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC187C    PICTURE X.
           02  FMCC187P    PICTURE X.
           02  FMCC187H    PICTURE X.
           02  FMCC187V    PICTURE X.
           02  FMCC187O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC119C    PICTURE X.
           02  FMCC119P    PICTURE X.
           02  FMCC119H    PICTURE X.
           02  FMCC119V    PICTURE X.
           02  FMCC119O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC135C    PICTURE X.
           02  FMCC135P    PICTURE X.
           02  FMCC135H    PICTURE X.
           02  FMCC135V    PICTURE X.
           02  FMCC135O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC128C    PICTURE X.
           02  FMCC128P    PICTURE X.
           02  FMCC128H    PICTURE X.
           02  FMCC128V    PICTURE X.
           02  FMCC128O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC156C    PICTURE X.
           02  FMCC156P    PICTURE X.
           02  FMCC156H    PICTURE X.
           02  FMCC156V    PICTURE X.
           02  FMCC156O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMCC155C    PICTURE X.
           02  FMCC155P    PICTURE X.
           02  FMCC155H    PICTURE X.
           02  FMCC155V    PICTURE X.
           02  FMCC155O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  FMCCBSMC    PICTURE X.
           02  FMCCBSMP    PICTURE X.
           02  FMCCBSMH    PICTURE X.
           02  FMCCBSMV    PICTURE X.
           02  FMCCBSMO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCCIEMC    PICTURE X.
           02  FMCCIEMP    PICTURE X.
           02  FMCCIEMH    PICTURE X.
           02  FMCCIEMV    PICTURE X.
           02  FMCCIEMO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMCC091C    PICTURE X.
           02  FMCC091P    PICTURE X.
           02  FMCC091H    PICTURE X.
           02  FMCC091V    PICTURE X.
           02  FMCC091O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC092C    PICTURE X.
           02  FMCC092P    PICTURE X.
           02  FMCC092H    PICTURE X.
           02  FMCC092V    PICTURE X.
           02  FMCC092O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC093C    PICTURE X.
           02  FMCC093P    PICTURE X.
           02  FMCC093H    PICTURE X.
           02  FMCC093V    PICTURE X.
           02  FMCC093O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC094C    PICTURE X.
           02  FMCC094P    PICTURE X.
           02  FMCC094H    PICTURE X.
           02  FMCC094V    PICTURE X.
           02  FMCC094O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCVC1C    PICTURE X.
           02  FMCCVC1P    PICTURE X.
           02  FMCCVC1H    PICTURE X.
           02  FMCCVC1V    PICTURE X.
           02  FMCCVC1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCVC2C    PICTURE X.
           02  FMCCVC2P    PICTURE X.
           02  FMCCVC2H    PICTURE X.
           02  FMCCVC2V    PICTURE X.
           02  FMCCVC2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCVC3C    PICTURE X.
           02  FMCCVC3P    PICTURE X.
           02  FMCCVC3H    PICTURE X.
           02  FMCCVC3V    PICTURE X.
           02  FMCCVC3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCVC4C    PICTURE X.
           02  FMCCVC4P    PICTURE X.
           02  FMCCVC4H    PICTURE X.
           02  FMCCVC4V    PICTURE X.
           02  FMCCVC4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCVC5C    PICTURE X.
           02  FMCCVC5P    PICTURE X.
           02  FMCCVC5H    PICTURE X.
           02  FMCCVC5V    PICTURE X.
           02  FMCCVC5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC088C    PICTURE X.
           02  FMCC088P    PICTURE X.
           02  FMCC088H    PICTURE X.
           02  FMCC088V    PICTURE X.
           02  FMCC088O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC090C    PICTURE X.
           02  FMCC090P    PICTURE X.
           02  FMCC090H    PICTURE X.
           02  FMCC090V    PICTURE X.
           02  FMCC090O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC110C    PICTURE X.
           02  FMCC110P    PICTURE X.
           02  FMCC110H    PICTURE X.
           02  FMCC110V    PICTURE X.
           02  FMCC110O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC143C    PICTURE X.
           02  FMCC143P    PICTURE X.
           02  FMCC143H    PICTURE X.
           02  FMCC143V    PICTURE X.
           02  FMCC143O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMPFS08C    PICTURE X.
           02  FMPFS08P    PICTURE X.
           02  FMPFS08H    PICTURE X.
           02  FMPFS08V    PICTURE X.
           02  FMPFS08O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR08C    PICTURE X.
           02  FMERR08P    PICTURE X.
           02  FMERR08H    PICTURE X.
           02  FMERR08V    PICTURE X.
           02  FMERR08O  PIC X(79).
       01  FMC1M09I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANIL    COMP  PIC  S9(4).
           02  FMTRANIF    PICTURE X.
           02  FILLER REDEFINES FMTRANIF.
             03 FMTRANIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANII  PIC X(4).
           02  FMDATEIL    COMP  PIC  S9(4).
           02  FMDATEIF    PICTURE X.
           02  FILLER REDEFINES FMDATEIF.
             03 FMDATEIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEII  PIC X(8).
           02  FMTIMEIL    COMP  PIC  S9(4).
           02  FMTIMEIF    PICTURE X.
           02  FILLER REDEFINES FMTIMEIF.
             03 FMTIMEIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEII  PIC X(8).
           02  FMPAG08L    COMP  PIC  S9(4).
           02  FMPAG08F    PICTURE X.
           02  FILLER REDEFINES FMPAG08F.
             03 FMPAG08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG08I  PIC X(2).
           02  FMTPG08L    COMP  PIC  S9(4).
           02  FMTPG08F    PICTURE X.
           02  FILLER REDEFINES FMTPG08F.
             03 FMTPG08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG08I  PIC X(2).
           02  FMCOMPIL    COMP  PIC  S9(4).
           02  FMCOMPIF    PICTURE X.
           02  FILLER REDEFINES FMCOMPIF.
             03 FMCOMPIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPII  PIC X(4).
           02  FMCCPVPL    COMP  PIC  S9(4).
           02  FMCCPVPF    PICTURE X.
           02  FILLER REDEFINES FMCCPVPF.
             03 FMCCPVPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCPVPI  PIC X(8).
           02  FMCCRUNL    COMP  PIC  S9(4).
           02  FMCCRUNF    PICTURE X.
           02  FILLER REDEFINES FMCCRUNF.
             03 FMCCRUNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRUNI  PIC X(8).
           02  FMCCNPDL    COMP  PIC  S9(4).
           02  FMCCNPDF    PICTURE X.
           02  FILLER REDEFINES FMCCNPDF.
             03 FMCCNPDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCNPDI  PIC X(8).
           02  FMCCPPDL    COMP  PIC  S9(4).
           02  FMCCPPDF    PICTURE X.
           02  FILLER REDEFINES FMCCPPDF.
             03 FMCCPPDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCPPDI  PIC X(8).
           02  FMCCPTDL    COMP  PIC  S9(4).
           02  FMCCPTDF    PICTURE X.
           02  FILLER REDEFINES FMCCPTDF.
             03 FMCCPTDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCPTDI  PIC X(8).
           02  FMCCNPTL    COMP  PIC  S9(4).
           02  FMCCNPTF    PICTURE X.
           02  FILLER REDEFINES FMCCNPTF.
             03 FMCCNPTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCNPTI  PIC X(8).
           02  FMCCRA1L    COMP  PIC  S9(4).
           02  FMCCRA1F    PICTURE X.
           02  FILLER REDEFINES FMCCRA1F.
             03 FMCCRA1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRA1I  PIC X(8).
           02  FMCCRA2L    COMP  PIC  S9(4).
           02  FMCCRA2F    PICTURE X.
           02  FILLER REDEFINES FMCCRA2F.
             03 FMCCRA2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRA2I  PIC X(8).
           02  FMCCRA3L    COMP  PIC  S9(4).
           02  FMCCRA3F    PICTURE X.
           02  FILLER REDEFINES FMCCRA3F.
             03 FMCCRA3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRA3I  PIC X(8).
           02  FMCCAP1L    COMP  PIC  S9(4).
           02  FMCCAP1F    PICTURE X.
           02  FILLER REDEFINES FMCCAP1F.
             03 FMCCAP1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCAP1I  PIC X(1).
           02  FMCCAP2L    COMP  PIC  S9(4).
           02  FMCCAP2F    PICTURE X.
           02  FILLER REDEFINES FMCCAP2F.
             03 FMCCAP2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCAP2I  PIC X(1).
           02  FMCCAP3L    COMP  PIC  S9(4).
           02  FMCCAP3F    PICTURE X.
           02  FILLER REDEFINES FMCCAP3F.
             03 FMCCAP3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCAP3I  PIC X(1).
           02  FMCCAS1L    COMP  PIC  S9(4).
           02  FMCCAS1F    PICTURE X.
           02  FILLER REDEFINES FMCCAS1F.
             03 FMCCAS1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCAS1I  PIC X(1).
           02  FMCCAS2L    COMP  PIC  S9(4).
           02  FMCCAS2F    PICTURE X.
           02  FILLER REDEFINES FMCCAS2F.
             03 FMCCAS2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCAS2I  PIC X(1).
           02  FMCCAS3L    COMP  PIC  S9(4).
           02  FMCCAS3F    PICTURE X.
           02  FILLER REDEFINES FMCCAS3F.
             03 FMCCAS3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCAS3I  PIC X(1).
           02  FMCCRB1L    COMP  PIC  S9(4).
           02  FMCCRB1F    PICTURE X.
           02  FILLER REDEFINES FMCCRB1F.
             03 FMCCRB1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRB1I  PIC X(8).
           02  FMCCRB2L    COMP  PIC  S9(4).
           02  FMCCRB2F    PICTURE X.
           02  FILLER REDEFINES FMCCRB2F.
             03 FMCCRB2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRB2I  PIC X(8).
           02  FMCC160L    COMP  PIC  S9(4).
           02  FMCC160F    PICTURE X.
           02  FILLER REDEFINES FMCC160F.
             03 FMCC160A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC160I  PIC X(1).
           02  FMCC162L    COMP  PIC  S9(4).
           02  FMCC162F    PICTURE X.
           02  FILLER REDEFINES FMCC162F.
             03 FMCC162A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC162I  PIC X(1).
           02  FMCC161L    COMP  PIC  S9(4).
           02  FMCC161F    PICTURE X.
           02  FILLER REDEFINES FMCC161F.
             03 FMCC161A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC161I  PIC X(1).
           02  FMCC163L    COMP  PIC  S9(4).
           02  FMCC163F    PICTURE X.
           02  FILLER REDEFINES FMCC163F.
             03 FMCC163A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC163I  PIC X(1).
           02  FMCC137L    COMP  PIC  S9(4).
           02  FMCC137F    PICTURE X.
           02  FILLER REDEFINES FMCC137F.
             03 FMCC137A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC137I  PIC X(2).
           02  FMCCMEDL    COMP  PIC  S9(4).
           02  FMCCMEDF    PICTURE X.
           02  FILLER REDEFINES FMCCMEDF.
             03 FMCCMEDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMEDI  PIC X(4).
           02  FMCCQEDL    COMP  PIC  S9(4).
           02  FMCCQEDF    PICTURE X.
           02  FILLER REDEFINES FMCCQEDF.
             03 FMCCQEDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCQEDI  PIC X(4).
           02  FMPFS09L    COMP  PIC  S9(4).
           02  FMPFS09F    PICTURE X.
           02  FILLER REDEFINES FMPFS09F.
             03 FMPFS09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS09I  PIC X(79).
           02  FMERR09L    COMP  PIC  S9(4).
           02  FMERR09F    PICTURE X.
           02  FILLER REDEFINES FMERR09F.
             03 FMERR09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR09I  PIC X(79).
       01  FMC1M09O REDEFINES FMC1M09I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANIC    PICTURE X.
           02  FMTRANIP    PICTURE X.
           02  FMTRANIH    PICTURE X.
           02  FMTRANIV    PICTURE X.
           02  FMTRANIO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEIC    PICTURE X.
           02  FMDATEIP    PICTURE X.
           02  FMDATEIH    PICTURE X.
           02  FMDATEIV    PICTURE X.
           02  FMDATEIO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEIC    PICTURE X.
           02  FMTIMEIP    PICTURE X.
           02  FMTIMEIH    PICTURE X.
           02  FMTIMEIV    PICTURE X.
           02  FMTIMEIO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG08C    PICTURE X.
           02  FMPAG08P    PICTURE X.
           02  FMPAG08H    PICTURE X.
           02  FMPAG08V    PICTURE X.
           02  FMPAG08O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG08C    PICTURE X.
           02  FMTPG08P    PICTURE X.
           02  FMTPG08H    PICTURE X.
           02  FMTPG08V    PICTURE X.
           02  FMTPG08O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPIC    PICTURE X.
           02  FMCOMPIP    PICTURE X.
           02  FMCOMPIH    PICTURE X.
           02  FMCOMPIV    PICTURE X.
           02  FMCOMPIO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCCPVPC    PICTURE X.
           02  FMCCPVPP    PICTURE X.
           02  FMCCPVPH    PICTURE X.
           02  FMCCPVPV    PICTURE X.
           02  FMCCPVPO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCRUNC    PICTURE X.
           02  FMCCRUNP    PICTURE X.
           02  FMCCRUNH    PICTURE X.
           02  FMCCRUNV    PICTURE X.
           02  FMCCRUNO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCNPDC    PICTURE X.
           02  FMCCNPDP    PICTURE X.
           02  FMCCNPDH    PICTURE X.
           02  FMCCNPDV    PICTURE X.
           02  FMCCNPDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCPPDC    PICTURE X.
           02  FMCCPPDP    PICTURE X.
           02  FMCCPPDH    PICTURE X.
           02  FMCCPPDV    PICTURE X.
           02  FMCCPPDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCPTDC    PICTURE X.
           02  FMCCPTDP    PICTURE X.
           02  FMCCPTDH    PICTURE X.
           02  FMCCPTDV    PICTURE X.
           02  FMCCPTDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCNPTC    PICTURE X.
           02  FMCCNPTP    PICTURE X.
           02  FMCCNPTH    PICTURE X.
           02  FMCCNPTV    PICTURE X.
           02  FMCCNPTO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCRA1C    PICTURE X.
           02  FMCCRA1P    PICTURE X.
           02  FMCCRA1H    PICTURE X.
           02  FMCCRA1V    PICTURE X.
           02  FMCCRA1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCRA2C    PICTURE X.
           02  FMCCRA2P    PICTURE X.
           02  FMCCRA2H    PICTURE X.
           02  FMCCRA2V    PICTURE X.
           02  FMCCRA2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCRA3C    PICTURE X.
           02  FMCCRA3P    PICTURE X.
           02  FMCCRA3H    PICTURE X.
           02  FMCCRA3V    PICTURE X.
           02  FMCCRA3O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCAP1C    PICTURE X.
           02  FMCCAP1P    PICTURE X.
           02  FMCCAP1H    PICTURE X.
           02  FMCCAP1V    PICTURE X.
           02  FMCCAP1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCAP2C    PICTURE X.
           02  FMCCAP2P    PICTURE X.
           02  FMCCAP2H    PICTURE X.
           02  FMCCAP2V    PICTURE X.
           02  FMCCAP2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCAP3C    PICTURE X.
           02  FMCCAP3P    PICTURE X.
           02  FMCCAP3H    PICTURE X.
           02  FMCCAP3V    PICTURE X.
           02  FMCCAP3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCAS1C    PICTURE X.
           02  FMCCAS1P    PICTURE X.
           02  FMCCAS1H    PICTURE X.
           02  FMCCAS1V    PICTURE X.
           02  FMCCAS1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCAS2C    PICTURE X.
           02  FMCCAS2P    PICTURE X.
           02  FMCCAS2H    PICTURE X.
           02  FMCCAS2V    PICTURE X.
           02  FMCCAS2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCAS3C    PICTURE X.
           02  FMCCAS3P    PICTURE X.
           02  FMCCAS3H    PICTURE X.
           02  FMCCAS3V    PICTURE X.
           02  FMCCAS3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCRB1C    PICTURE X.
           02  FMCCRB1P    PICTURE X.
           02  FMCCRB1H    PICTURE X.
           02  FMCCRB1V    PICTURE X.
           02  FMCCRB1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCCRB2C    PICTURE X.
           02  FMCCRB2P    PICTURE X.
           02  FMCCRB2H    PICTURE X.
           02  FMCCRB2V    PICTURE X.
           02  FMCCRB2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMCC160C    PICTURE X.
           02  FMCC160P    PICTURE X.
           02  FMCC160H    PICTURE X.
           02  FMCC160V    PICTURE X.
           02  FMCC160O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC162C    PICTURE X.
           02  FMCC162P    PICTURE X.
           02  FMCC162H    PICTURE X.
           02  FMCC162V    PICTURE X.
           02  FMCC162O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC161C    PICTURE X.
           02  FMCC161P    PICTURE X.
           02  FMCC161H    PICTURE X.
           02  FMCC161V    PICTURE X.
           02  FMCC161O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC163C    PICTURE X.
           02  FMCC163P    PICTURE X.
           02  FMCC163H    PICTURE X.
           02  FMCC163V    PICTURE X.
           02  FMCC163O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC137C    PICTURE X.
           02  FMCC137P    PICTURE X.
           02  FMCC137H    PICTURE X.
           02  FMCC137V    PICTURE X.
           02  FMCC137O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCCMEDC    PICTURE X.
           02  FMCCMEDP    PICTURE X.
           02  FMCCMEDH    PICTURE X.
           02  FMCCMEDV    PICTURE X.
           02  FMCCMEDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCCQEDC    PICTURE X.
           02  FMCCQEDP    PICTURE X.
           02  FMCCQEDH    PICTURE X.
           02  FMCCQEDV    PICTURE X.
           02  FMCCQEDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMPFS09C    PICTURE X.
           02  FMPFS09P    PICTURE X.
           02  FMPFS09H    PICTURE X.
           02  FMPFS09V    PICTURE X.
           02  FMPFS09O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR09C    PICTURE X.
           02  FMERR09P    PICTURE X.
           02  FMERR09H    PICTURE X.
           02  FMERR09V    PICTURE X.
           02  FMERR09O  PIC X(79).
       01  FMC1M10I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANJL    COMP  PIC  S9(4).
           02  FMTRANJF    PICTURE X.
           02  FILLER REDEFINES FMTRANJF.
             03 FMTRANJA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANJI  PIC X(4).
           02  FMDATEJL    COMP  PIC  S9(4).
           02  FMDATEJF    PICTURE X.
           02  FILLER REDEFINES FMDATEJF.
             03 FMDATEJA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEJI  PIC X(8).
           02  FMTIMEJL    COMP  PIC  S9(4).
           02  FMTIMEJF    PICTURE X.
           02  FILLER REDEFINES FMTIMEJF.
             03 FMTIMEJA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEJI  PIC X(8).
           02  FMPAG09L    COMP  PIC  S9(4).
           02  FMPAG09F    PICTURE X.
           02  FILLER REDEFINES FMPAG09F.
             03 FMPAG09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG09I  PIC X(2).
           02  FMTPG09L    COMP  PIC  S9(4).
           02  FMTPG09F    PICTURE X.
           02  FILLER REDEFINES FMTPG09F.
             03 FMTPG09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG09I  PIC X(2).
           02  FMCOMPJL    COMP  PIC  S9(4).
           02  FMCOMPJF    PICTURE X.
           02  FILLER REDEFINES FMCOMPJF.
             03 FMCOMPJA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPJI  PIC X(4).
           02  FMCC195L    COMP  PIC  S9(4).
           02  FMCC195F    PICTURE X.
           02  FILLER REDEFINES FMCC195F.
             03 FMCC195A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC195I  PIC X(4).
           02  FMCC193L    COMP  PIC  S9(4).
           02  FMCC193F    PICTURE X.
           02  FILLER REDEFINES FMCC193F.
             03 FMCC193A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC193I  PIC X(4).
           02  FMCC191L    COMP  PIC  S9(4).
           02  FMCC191F    PICTURE X.
           02  FILLER REDEFINES FMCC191F.
             03 FMCC191A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC191I  PIC X(4).
           02  FMCC192L    COMP  PIC  S9(4).
           02  FMCC192F    PICTURE X.
           02  FILLER REDEFINES FMCC192F.
             03 FMCC192A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC192I  PIC X(4).
           02  FMCC194L    COMP  PIC  S9(4).
           02  FMCC194F    PICTURE X.
           02  FILLER REDEFINES FMCC194F.
             03 FMCC194A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC194I  PIC X(4).
           02  FMPFS10L    COMP  PIC  S9(4).
           02  FMPFS10F    PICTURE X.
           02  FILLER REDEFINES FMPFS10F.
             03 FMPFS10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS10I  PIC X(79).
           02  FMERR10L    COMP  PIC  S9(4).
           02  FMERR10F    PICTURE X.
           02  FILLER REDEFINES FMERR10F.
             03 FMERR10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR10I  PIC X(79).
       01  FMC1M10O REDEFINES FMC1M10I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANJC    PICTURE X.
           02  FMTRANJP    PICTURE X.
           02  FMTRANJH    PICTURE X.
           02  FMTRANJV    PICTURE X.
           02  FMTRANJO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEJC    PICTURE X.
           02  FMDATEJP    PICTURE X.
           02  FMDATEJH    PICTURE X.
           02  FMDATEJV    PICTURE X.
           02  FMDATEJO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEJC    PICTURE X.
           02  FMTIMEJP    PICTURE X.
           02  FMTIMEJH    PICTURE X.
           02  FMTIMEJV    PICTURE X.
           02  FMTIMEJO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG09C    PICTURE X.
           02  FMPAG09P    PICTURE X.
           02  FMPAG09H    PICTURE X.
           02  FMPAG09V    PICTURE X.
           02  FMPAG09O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG09C    PICTURE X.
           02  FMTPG09P    PICTURE X.
           02  FMTPG09H    PICTURE X.
           02  FMTPG09V    PICTURE X.
           02  FMTPG09O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPJC    PICTURE X.
           02  FMCOMPJP    PICTURE X.
           02  FMCOMPJH    PICTURE X.
           02  FMCOMPJV    PICTURE X.
           02  FMCOMPJO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC195C    PICTURE X.
           02  FMCC195P    PICTURE X.
           02  FMCC195H    PICTURE X.
           02  FMCC195V    PICTURE X.
           02  FMCC195O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC193C    PICTURE X.
           02  FMCC193P    PICTURE X.
           02  FMCC193H    PICTURE X.
           02  FMCC193V    PICTURE X.
           02  FMCC193O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC191C    PICTURE X.
           02  FMCC191P    PICTURE X.
           02  FMCC191H    PICTURE X.
           02  FMCC191V    PICTURE X.
           02  FMCC191O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC192C    PICTURE X.
           02  FMCC192P    PICTURE X.
           02  FMCC192H    PICTURE X.
           02  FMCC192V    PICTURE X.
           02  FMCC192O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC194C    PICTURE X.
           02  FMCC194P    PICTURE X.
           02  FMCC194H    PICTURE X.
           02  FMCC194V    PICTURE X.
           02  FMCC194O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMPFS10C    PICTURE X.
           02  FMPFS10P    PICTURE X.
           02  FMPFS10H    PICTURE X.
           02  FMPFS10V    PICTURE X.
           02  FMPFS10O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR10C    PICTURE X.
           02  FMERR10P    PICTURE X.
           02  FMERR10H    PICTURE X.
           02  FMERR10V    PICTURE X.
           02  FMERR10O  PIC X(79).
       01  FMC1M11I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANKL    COMP  PIC  S9(4).
           02  FMTRANKF    PICTURE X.
           02  FILLER REDEFINES FMTRANKF.
             03 FMTRANKA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANKI  PIC X(4).
           02  FMDATEKL    COMP  PIC  S9(4).
           02  FMDATEKF    PICTURE X.
           02  FILLER REDEFINES FMDATEKF.
             03 FMDATEKA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEKI  PIC X(8).
           02  FMTIMEKL    COMP  PIC  S9(4).
           02  FMTIMEKF    PICTURE X.
           02  FILLER REDEFINES FMTIMEKF.
             03 FMTIMEKA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEKI  PIC X(8).
           02  FMPAG10L    COMP  PIC  S9(4).
           02  FMPAG10F    PICTURE X.
           02  FILLER REDEFINES FMPAG10F.
             03 FMPAG10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG10I  PIC X(2).
           02  FMTPG10L    COMP  PIC  S9(4).
           02  FMTPG10F    PICTURE X.
           02  FILLER REDEFINES FMTPG10F.
             03 FMTPG10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG10I  PIC X(2).
           02  FMCOMPKL    COMP  PIC  S9(4).
           02  FMCOMPKF    PICTURE X.
           02  FILLER REDEFINES FMCOMPKF.
             03 FMCOMPKA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPKI  PIC X(4).
           02  FMCC256L    COMP  PIC  S9(4).
           02  FMCC256F    PICTURE X.
           02  FILLER REDEFINES FMCC256F.
             03 FMCC256A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC256I  PIC X(1).
           02  FMCC204L    COMP  PIC  S9(4).
           02  FMCC204F    PICTURE X.
           02  FILLER REDEFINES FMCC204F.
             03 FMCC204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC204I  PIC X(1).
           02  FMSPL01L    COMP  PIC  S9(4).
           02  FMSPL01F    PICTURE X.
           02  FILLER REDEFINES FMSPL01F.
             03 FMSPL01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL01I  PIC X(20).
           02  FMCC257L    COMP  PIC  S9(4).
           02  FMCC257F    PICTURE X.
           02  FILLER REDEFINES FMCC257F.
             03 FMCC257A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC257I  PIC X(1).
           02  FMCC205L    COMP  PIC  S9(4).
           02  FMCC205F    PICTURE X.
           02  FILLER REDEFINES FMCC205F.
             03 FMCC205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC205I  PIC X(1).
           02  FMSPL02L    COMP  PIC  S9(4).
           02  FMSPL02F    PICTURE X.
           02  FILLER REDEFINES FMSPL02F.
             03 FMSPL02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL02I  PIC X(20).
           02  FMCC258L    COMP  PIC  S9(4).
           02  FMCC258F    PICTURE X.
           02  FILLER REDEFINES FMCC258F.
             03 FMCC258A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC258I  PIC X(1).
           02  FMCC206L    COMP  PIC  S9(4).
           02  FMCC206F    PICTURE X.
           02  FILLER REDEFINES FMCC206F.
             03 FMCC206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC206I  PIC X(1).
           02  FMSPL03L    COMP  PIC  S9(4).
           02  FMSPL03F    PICTURE X.
           02  FILLER REDEFINES FMSPL03F.
             03 FMSPL03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL03I  PIC X(20).
           02  FMCC259L    COMP  PIC  S9(4).
           02  FMCC259F    PICTURE X.
           02  FILLER REDEFINES FMCC259F.
             03 FMCC259A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC259I  PIC X(1).
           02  FMCC207L    COMP  PIC  S9(4).
           02  FMCC207F    PICTURE X.
           02  FILLER REDEFINES FMCC207F.
             03 FMCC207A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC207I  PIC X(1).
           02  FMSPL04L    COMP  PIC  S9(4).
           02  FMSPL04F    PICTURE X.
           02  FILLER REDEFINES FMSPL04F.
             03 FMSPL04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL04I  PIC X(20).
           02  FMCC260L    COMP  PIC  S9(4).
           02  FMCC260F    PICTURE X.
           02  FILLER REDEFINES FMCC260F.
             03 FMCC260A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC260I  PIC X(1).
           02  FMCC208L    COMP  PIC  S9(4).
           02  FMCC208F    PICTURE X.
           02  FILLER REDEFINES FMCC208F.
             03 FMCC208A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC208I  PIC X(1).
           02  FMSPL05L    COMP  PIC  S9(4).
           02  FMSPL05F    PICTURE X.
           02  FILLER REDEFINES FMSPL05F.
             03 FMSPL05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL05I  PIC X(20).
           02  FMCC261L    COMP  PIC  S9(4).
           02  FMCC261F    PICTURE X.
           02  FILLER REDEFINES FMCC261F.
             03 FMCC261A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC261I  PIC X(1).
           02  FMCC209L    COMP  PIC  S9(4).
           02  FMCC209F    PICTURE X.
           02  FILLER REDEFINES FMCC209F.
             03 FMCC209A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC209I  PIC X(1).
           02  FMSPL06L    COMP  PIC  S9(4).
           02  FMSPL06F    PICTURE X.
           02  FILLER REDEFINES FMSPL06F.
             03 FMSPL06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL06I  PIC X(20).
           02  FMCC262L    COMP  PIC  S9(4).
           02  FMCC262F    PICTURE X.
           02  FILLER REDEFINES FMCC262F.
             03 FMCC262A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC262I  PIC X(1).
           02  FMCC210L    COMP  PIC  S9(4).
           02  FMCC210F    PICTURE X.
           02  FILLER REDEFINES FMCC210F.
             03 FMCC210A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC210I  PIC X(1).
           02  FMSPL07L    COMP  PIC  S9(4).
           02  FMSPL07F    PICTURE X.
           02  FILLER REDEFINES FMSPL07F.
             03 FMSPL07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL07I  PIC X(20).
           02  FMCC263L    COMP  PIC  S9(4).
           02  FMCC263F    PICTURE X.
           02  FILLER REDEFINES FMCC263F.
             03 FMCC263A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC263I  PIC X(1).
           02  FMCC211L    COMP  PIC  S9(4).
           02  FMCC211F    PICTURE X.
           02  FILLER REDEFINES FMCC211F.
             03 FMCC211A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC211I  PIC X(1).
           02  FMSPL08L    COMP  PIC  S9(4).
           02  FMSPL08F    PICTURE X.
           02  FILLER REDEFINES FMSPL08F.
             03 FMSPL08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL08I  PIC X(20).
           02  FMCCF08L    COMP  PIC  S9(4).
           02  FMCCF08F    PICTURE X.
           02  FILLER REDEFINES FMCCF08F.
             03 FMCCF08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCF08I  PIC X(1).
           02  FMCCS08L    COMP  PIC  S9(4).
           02  FMCCS08F    PICTURE X.
           02  FILLER REDEFINES FMCCS08F.
             03 FMCCS08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCS08I  PIC X(1).
           02  FMSPL8AL    COMP  PIC  S9(4).
           02  FMSPL8AF    PICTURE X.
           02  FILLER REDEFINES FMSPL8AF.
             03 FMSPL8AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL8AI  PIC X(20).
           02  FMCCF8ML    COMP  PIC  S9(4).
           02  FMCCF8MF    PICTURE X.
           02  FILLER REDEFINES FMCCF8MF.
             03 FMCCF8MA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCF8MI  PIC X(1).
           02  FMCCS8ML    COMP  PIC  S9(4).
           02  FMCCS8MF    PICTURE X.
           02  FILLER REDEFINES FMCCS8MF.
             03 FMCCS8MA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCS8MI  PIC X(1).
           02  FMSPL8BL    COMP  PIC  S9(4).
           02  FMSPL8BF    PICTURE X.
           02  FILLER REDEFINES FMSPL8BF.
             03 FMSPL8BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL8BI  PIC X(20).
           02  FMCC264L    COMP  PIC  S9(4).
           02  FMCC264F    PICTURE X.
           02  FILLER REDEFINES FMCC264F.
             03 FMCC264A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC264I  PIC X(1).
           02  FMCC212L    COMP  PIC  S9(4).
           02  FMCC212F    PICTURE X.
           02  FILLER REDEFINES FMCC212F.
             03 FMCC212A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC212I  PIC X(1).
           02  FMSPL09L    COMP  PIC  S9(4).
           02  FMSPL09F    PICTURE X.
           02  FILLER REDEFINES FMSPL09F.
             03 FMSPL09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL09I  PIC X(20).
           02  FMCCFRWL    COMP  PIC  S9(4).
           02  FMCCFRWF    PICTURE X.
           02  FILLER REDEFINES FMCCFRWF.
             03 FMCCFRWA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCFRWI  PIC X(1).
           02  FMCCSRWL    COMP  PIC  S9(4).
           02  FMCCSRWF    PICTURE X.
           02  FILLER REDEFINES FMCCSRWF.
             03 FMCCSRWA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCSRWI  PIC X(1).
           02  FMSPLRWL    COMP  PIC  S9(4).
           02  FMSPLRWF    PICTURE X.
           02  FILLER REDEFINES FMSPLRWF.
             03 FMSPLRWA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPLRWI  PIC X(20).
           02  FMCC265L    COMP  PIC  S9(4).
           02  FMCC265F    PICTURE X.
           02  FILLER REDEFINES FMCC265F.
             03 FMCC265A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC265I  PIC X(1).
           02  FMCC213L    COMP  PIC  S9(4).
           02  FMCC213F    PICTURE X.
           02  FILLER REDEFINES FMCC213F.
             03 FMCC213A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC213I  PIC X(1).
           02  FMSPL10L    COMP  PIC  S9(4).
           02  FMSPL10F    PICTURE X.
           02  FILLER REDEFINES FMSPL10F.
             03 FMSPL10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL10I  PIC X(20).
           02  FMPFS11L    COMP  PIC  S9(4).
           02  FMPFS11F    PICTURE X.
           02  FILLER REDEFINES FMPFS11F.
             03 FMPFS11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS11I  PIC X(79).
           02  FMERR11L    COMP  PIC  S9(4).
           02  FMERR11F    PICTURE X.
           02  FILLER REDEFINES FMERR11F.
             03 FMERR11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR11I  PIC X(79).
       01  FMC1M11O REDEFINES FMC1M11I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANKC    PICTURE X.
           02  FMTRANKP    PICTURE X.
           02  FMTRANKH    PICTURE X.
           02  FMTRANKV    PICTURE X.
           02  FMTRANKO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEKC    PICTURE X.
           02  FMDATEKP    PICTURE X.
           02  FMDATEKH    PICTURE X.
           02  FMDATEKV    PICTURE X.
           02  FMDATEKO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEKC    PICTURE X.
           02  FMTIMEKP    PICTURE X.
           02  FMTIMEKH    PICTURE X.
           02  FMTIMEKV    PICTURE X.
           02  FMTIMEKO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG10C    PICTURE X.
           02  FMPAG10P    PICTURE X.
           02  FMPAG10H    PICTURE X.
           02  FMPAG10V    PICTURE X.
           02  FMPAG10O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG10C    PICTURE X.
           02  FMTPG10P    PICTURE X.
           02  FMTPG10H    PICTURE X.
           02  FMTPG10V    PICTURE X.
           02  FMTPG10O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPKC    PICTURE X.
           02  FMCOMPKP    PICTURE X.
           02  FMCOMPKH    PICTURE X.
           02  FMCOMPKV    PICTURE X.
           02  FMCOMPKO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC256C    PICTURE X.
           02  FMCC256P    PICTURE X.
           02  FMCC256H    PICTURE X.
           02  FMCC256V    PICTURE X.
           02  FMCC256O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC204C    PICTURE X.
           02  FMCC204P    PICTURE X.
           02  FMCC204H    PICTURE X.
           02  FMCC204V    PICTURE X.
           02  FMCC204O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL01C    PICTURE X.
           02  FMSPL01P    PICTURE X.
           02  FMSPL01H    PICTURE X.
           02  FMSPL01V    PICTURE X.
           02  FMSPL01O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC257C    PICTURE X.
           02  FMCC257P    PICTURE X.
           02  FMCC257H    PICTURE X.
           02  FMCC257V    PICTURE X.
           02  FMCC257O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC205C    PICTURE X.
           02  FMCC205P    PICTURE X.
           02  FMCC205H    PICTURE X.
           02  FMCC205V    PICTURE X.
           02  FMCC205O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL02C    PICTURE X.
           02  FMSPL02P    PICTURE X.
           02  FMSPL02H    PICTURE X.
           02  FMSPL02V    PICTURE X.
           02  FMSPL02O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC258C    PICTURE X.
           02  FMCC258P    PICTURE X.
           02  FMCC258H    PICTURE X.
           02  FMCC258V    PICTURE X.
           02  FMCC258O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC206C    PICTURE X.
           02  FMCC206P    PICTURE X.
           02  FMCC206H    PICTURE X.
           02  FMCC206V    PICTURE X.
           02  FMCC206O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL03C    PICTURE X.
           02  FMSPL03P    PICTURE X.
           02  FMSPL03H    PICTURE X.
           02  FMSPL03V    PICTURE X.
           02  FMSPL03O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC259C    PICTURE X.
           02  FMCC259P    PICTURE X.
           02  FMCC259H    PICTURE X.
           02  FMCC259V    PICTURE X.
           02  FMCC259O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC207C    PICTURE X.
           02  FMCC207P    PICTURE X.
           02  FMCC207H    PICTURE X.
           02  FMCC207V    PICTURE X.
           02  FMCC207O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL04C    PICTURE X.
           02  FMSPL04P    PICTURE X.
           02  FMSPL04H    PICTURE X.
           02  FMSPL04V    PICTURE X.
           02  FMSPL04O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC260C    PICTURE X.
           02  FMCC260P    PICTURE X.
           02  FMCC260H    PICTURE X.
           02  FMCC260V    PICTURE X.
           02  FMCC260O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC208C    PICTURE X.
           02  FMCC208P    PICTURE X.
           02  FMCC208H    PICTURE X.
           02  FMCC208V    PICTURE X.
           02  FMCC208O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL05C    PICTURE X.
           02  FMSPL05P    PICTURE X.
           02  FMSPL05H    PICTURE X.
           02  FMSPL05V    PICTURE X.
           02  FMSPL05O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC261C    PICTURE X.
           02  FMCC261P    PICTURE X.
           02  FMCC261H    PICTURE X.
           02  FMCC261V    PICTURE X.
           02  FMCC261O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC209C    PICTURE X.
           02  FMCC209P    PICTURE X.
           02  FMCC209H    PICTURE X.
           02  FMCC209V    PICTURE X.
           02  FMCC209O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL06C    PICTURE X.
           02  FMSPL06P    PICTURE X.
           02  FMSPL06H    PICTURE X.
           02  FMSPL06V    PICTURE X.
           02  FMSPL06O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC262C    PICTURE X.
           02  FMCC262P    PICTURE X.
           02  FMCC262H    PICTURE X.
           02  FMCC262V    PICTURE X.
           02  FMCC262O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC210C    PICTURE X.
           02  FMCC210P    PICTURE X.
           02  FMCC210H    PICTURE X.
           02  FMCC210V    PICTURE X.
           02  FMCC210O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL07C    PICTURE X.
           02  FMSPL07P    PICTURE X.
           02  FMSPL07H    PICTURE X.
           02  FMSPL07V    PICTURE X.
           02  FMSPL07O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC263C    PICTURE X.
           02  FMCC263P    PICTURE X.
           02  FMCC263H    PICTURE X.
           02  FMCC263V    PICTURE X.
           02  FMCC263O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC211C    PICTURE X.
           02  FMCC211P    PICTURE X.
           02  FMCC211H    PICTURE X.
           02  FMCC211V    PICTURE X.
           02  FMCC211O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL08C    PICTURE X.
           02  FMSPL08P    PICTURE X.
           02  FMSPL08H    PICTURE X.
           02  FMSPL08V    PICTURE X.
           02  FMSPL08O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCF08C    PICTURE X.
           02  FMCCF08P    PICTURE X.
           02  FMCCF08H    PICTURE X.
           02  FMCCF08V    PICTURE X.
           02  FMCCF08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCS08C    PICTURE X.
           02  FMCCS08P    PICTURE X.
           02  FMCCS08H    PICTURE X.
           02  FMCCS08V    PICTURE X.
           02  FMCCS08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL8AC    PICTURE X.
           02  FMSPL8AP    PICTURE X.
           02  FMSPL8AH    PICTURE X.
           02  FMSPL8AV    PICTURE X.
           02  FMSPL8AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCF8MC    PICTURE X.
           02  FMCCF8MP    PICTURE X.
           02  FMCCF8MH    PICTURE X.
           02  FMCCF8MV    PICTURE X.
           02  FMCCF8MO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCS8MC    PICTURE X.
           02  FMCCS8MP    PICTURE X.
           02  FMCCS8MH    PICTURE X.
           02  FMCCS8MV    PICTURE X.
           02  FMCCS8MO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL8BC    PICTURE X.
           02  FMSPL8BP    PICTURE X.
           02  FMSPL8BH    PICTURE X.
           02  FMSPL8BV    PICTURE X.
           02  FMSPL8BO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC264C    PICTURE X.
           02  FMCC264P    PICTURE X.
           02  FMCC264H    PICTURE X.
           02  FMCC264V    PICTURE X.
           02  FMCC264O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC212C    PICTURE X.
           02  FMCC212P    PICTURE X.
           02  FMCC212H    PICTURE X.
           02  FMCC212V    PICTURE X.
           02  FMCC212O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL09C    PICTURE X.
           02  FMSPL09P    PICTURE X.
           02  FMSPL09H    PICTURE X.
           02  FMSPL09V    PICTURE X.
           02  FMSPL09O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCFRWC    PICTURE X.
           02  FMCCFRWP    PICTURE X.
           02  FMCCFRWH    PICTURE X.
           02  FMCCFRWV    PICTURE X.
           02  FMCCFRWO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCSRWC    PICTURE X.
           02  FMCCSRWP    PICTURE X.
           02  FMCCSRWH    PICTURE X.
           02  FMCCSRWV    PICTURE X.
           02  FMCCSRWO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPLRWC    PICTURE X.
           02  FMSPLRWP    PICTURE X.
           02  FMSPLRWH    PICTURE X.
           02  FMSPLRWV    PICTURE X.
           02  FMSPLRWO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC265C    PICTURE X.
           02  FMCC265P    PICTURE X.
           02  FMCC265H    PICTURE X.
           02  FMCC265V    PICTURE X.
           02  FMCC265O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC213C    PICTURE X.
           02  FMCC213P    PICTURE X.
           02  FMCC213H    PICTURE X.
           02  FMCC213V    PICTURE X.
           02  FMCC213O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL10C    PICTURE X.
           02  FMSPL10P    PICTURE X.
           02  FMSPL10H    PICTURE X.
           02  FMSPL10V    PICTURE X.
           02  FMSPL10O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMPFS11C    PICTURE X.
           02  FMPFS11P    PICTURE X.
           02  FMPFS11H    PICTURE X.
           02  FMPFS11V    PICTURE X.
           02  FMPFS11O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR11C    PICTURE X.
           02  FMERR11P    PICTURE X.
           02  FMERR11H    PICTURE X.
           02  FMERR11V    PICTURE X.
           02  FMERR11O  PIC X(79).
       01  FMC1M13I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANML    COMP  PIC  S9(4).
           02  FMTRANMF    PICTURE X.
           02  FILLER REDEFINES FMTRANMF.
             03 FMTRANMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANMI  PIC X(4).
           02  FMDATEML    COMP  PIC  S9(4).
           02  FMDATEMF    PICTURE X.
           02  FILLER REDEFINES FMDATEMF.
             03 FMDATEMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEMI  PIC X(8).
           02  FMTIMEML    COMP  PIC  S9(4).
           02  FMTIMEMF    PICTURE X.
           02  FILLER REDEFINES FMTIMEMF.
             03 FMTIMEMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEMI  PIC X(8).
           02  FMPAG12L    COMP  PIC  S9(4).
           02  FMPAG12F    PICTURE X.
           02  FILLER REDEFINES FMPAG12F.
             03 FMPAG12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG12I  PIC X(2).
           02  FMTPG12L    COMP  PIC  S9(4).
           02  FMTPG12F    PICTURE X.
           02  FILLER REDEFINES FMTPG12F.
             03 FMTPG12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG12I  PIC X(2).
           02  FMCOMPML    COMP  PIC  S9(4).
           02  FMCOMPMF    PICTURE X.
           02  FILLER REDEFINES FMCOMPMF.
             03 FMCOMPMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPMI  PIC X(4).
           02  FMCC279L    COMP  PIC  S9(4).
           02  FMCC279F    PICTURE X.
           02  FILLER REDEFINES FMCC279F.
             03 FMCC279A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC279I  PIC X(1).
           02  FMCC227L    COMP  PIC  S9(4).
           02  FMCC227F    PICTURE X.
           02  FILLER REDEFINES FMCC227F.
             03 FMCC227A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC227I  PIC X(1).
           02  FMSPL24L    COMP  PIC  S9(4).
           02  FMSPL24F    PICTURE X.
           02  FILLER REDEFINES FMSPL24F.
             03 FMSPL24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL24I  PIC X(20).
           02  FMCC280L    COMP  PIC  S9(4).
           02  FMCC280F    PICTURE X.
           02  FILLER REDEFINES FMCC280F.
             03 FMCC280A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC280I  PIC X(1).
           02  FMCC228L    COMP  PIC  S9(4).
           02  FMCC228F    PICTURE X.
           02  FILLER REDEFINES FMCC228F.
             03 FMCC228A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC228I  PIC X(1).
           02  FMSPL25L    COMP  PIC  S9(4).
           02  FMSPL25F    PICTURE X.
           02  FILLER REDEFINES FMSPL25F.
             03 FMSPL25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL25I  PIC X(20).
           02  FMCC281L    COMP  PIC  S9(4).
           02  FMCC281F    PICTURE X.
           02  FILLER REDEFINES FMCC281F.
             03 FMCC281A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC281I  PIC X(1).
           02  FMCC229L    COMP  PIC  S9(4).
           02  FMCC229F    PICTURE X.
           02  FILLER REDEFINES FMCC229F.
             03 FMCC229A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC229I  PIC X(1).
           02  FMSPL26L    COMP  PIC  S9(4).
           02  FMSPL26F    PICTURE X.
           02  FILLER REDEFINES FMSPL26F.
             03 FMSPL26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL26I  PIC X(20).
           02  FMCC282L    COMP  PIC  S9(4).
           02  FMCC282F    PICTURE X.
           02  FILLER REDEFINES FMCC282F.
             03 FMCC282A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC282I  PIC X(1).
           02  FMCC230L    COMP  PIC  S9(4).
           02  FMCC230F    PICTURE X.
           02  FILLER REDEFINES FMCC230F.
             03 FMCC230A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC230I  PIC X(1).
           02  FMSPL27L    COMP  PIC  S9(4).
           02  FMSPL27F    PICTURE X.
           02  FILLER REDEFINES FMSPL27F.
             03 FMSPL27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL27I  PIC X(20).
           02  FMCF36AL    COMP  PIC  S9(4).
           02  FMCF36AF    PICTURE X.
           02  FILLER REDEFINES FMCF36AF.
             03 FMCF36AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCF36AI  PIC X(1).
           02  FMCS36AL    COMP  PIC  S9(4).
           02  FMCS36AF    PICTURE X.
           02  FILLER REDEFINES FMCS36AF.
             03 FMCS36AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCS36AI  PIC X(1).
           02  FMSPL28L    COMP  PIC  S9(4).
           02  FMSPL28F    PICTURE X.
           02  FILLER REDEFINES FMSPL28F.
             03 FMSPL28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL28I  PIC X(20).
           02  FMCF36UL    COMP  PIC  S9(4).
           02  FMCF36UF    PICTURE X.
           02  FILLER REDEFINES FMCF36UF.
             03 FMCF36UA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCF36UI  PIC X(1).
           02  FMCS36UL    COMP  PIC  S9(4).
           02  FMCS36UF    PICTURE X.
           02  FILLER REDEFINES FMCS36UF.
             03 FMCS36UA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCS36UI  PIC X(1).
           02  FMSPL29L    COMP  PIC  S9(4).
           02  FMSPL29F    PICTURE X.
           02  FILLER REDEFINES FMSPL29F.
             03 FMSPL29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL29I  PIC X(20).
           02  FMCC283L    COMP  PIC  S9(4).
           02  FMCC283F    PICTURE X.
           02  FILLER REDEFINES FMCC283F.
             03 FMCC283A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC283I  PIC X(1).
           02  FMCC231L    COMP  PIC  S9(4).
           02  FMCC231F    PICTURE X.
           02  FILLER REDEFINES FMCC231F.
             03 FMCC231A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC231I  PIC X(1).
           02  FMSPL30L    COMP  PIC  S9(4).
           02  FMSPL30F    PICTURE X.
           02  FILLER REDEFINES FMSPL30F.
             03 FMSPL30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL30I  PIC X(20).
           02  FMCC284L    COMP  PIC  S9(4).
           02  FMCC284F    PICTURE X.
           02  FILLER REDEFINES FMCC284F.
             03 FMCC284A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC284I  PIC X(1).
           02  FMCC232L    COMP  PIC  S9(4).
           02  FMCC232F    PICTURE X.
           02  FILLER REDEFINES FMCC232F.
             03 FMCC232A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC232I  PIC X(1).
           02  FMSPL31L    COMP  PIC  S9(4).
           02  FMSPL31F    PICTURE X.
           02  FILLER REDEFINES FMSPL31F.
             03 FMSPL31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL31I  PIC X(20).
           02  FMCC298L    COMP  PIC  S9(4).
           02  FMCC298F    PICTURE X.
           02  FILLER REDEFINES FMCC298F.
             03 FMCC298A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC298I  PIC X(1).
           02  FMCC246L    COMP  PIC  S9(4).
           02  FMCC246F    PICTURE X.
           02  FILLER REDEFINES FMCC246F.
             03 FMCC246A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC246I  PIC X(1).
           02  FMSPL32L    COMP  PIC  S9(4).
           02  FMSPL32F    PICTURE X.
           02  FILLER REDEFINES FMSPL32F.
             03 FMSPL32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL32I  PIC X(20).
           02  FMCC299L    COMP  PIC  S9(4).
           02  FMCC299F    PICTURE X.
           02  FILLER REDEFINES FMCC299F.
             03 FMCC299A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC299I  PIC X(1).
           02  FMCC247L    COMP  PIC  S9(4).
           02  FMCC247F    PICTURE X.
           02  FILLER REDEFINES FMCC247F.
             03 FMCC247A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC247I  PIC X(1).
           02  FMSPL33L    COMP  PIC  S9(4).
           02  FMSPL33F    PICTURE X.
           02  FILLER REDEFINES FMSPL33F.
             03 FMSPL33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL33I  PIC X(20).
           02  FMCC300L    COMP  PIC  S9(4).
           02  FMCC300F    PICTURE X.
           02  FILLER REDEFINES FMCC300F.
             03 FMCC300A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC300I  PIC X(1).
           02  FMCC248L    COMP  PIC  S9(4).
           02  FMCC248F    PICTURE X.
           02  FILLER REDEFINES FMCC248F.
             03 FMCC248A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC248I  PIC X(1).
           02  FMSPL34L    COMP  PIC  S9(4).
           02  FMSPL34F    PICTURE X.
           02  FILLER REDEFINES FMSPL34F.
             03 FMSPL34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL34I  PIC X(20).
           02  FMCC301L    COMP  PIC  S9(4).
           02  FMCC301F    PICTURE X.
           02  FILLER REDEFINES FMCC301F.
             03 FMCC301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC301I  PIC X(1).
           02  FMCC249L    COMP  PIC  S9(4).
           02  FMCC249F    PICTURE X.
           02  FILLER REDEFINES FMCC249F.
             03 FMCC249A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC249I  PIC X(1).
           02  FMSPL35L    COMP  PIC  S9(4).
           02  FMSPL35F    PICTURE X.
           02  FILLER REDEFINES FMSPL35F.
             03 FMSPL35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL35I  PIC X(20).
           02  FMCC302L    COMP  PIC  S9(4).
           02  FMCC302F    PICTURE X.
           02  FILLER REDEFINES FMCC302F.
             03 FMCC302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC302I  PIC X(1).
           02  FMCC250L    COMP  PIC  S9(4).
           02  FMCC250F    PICTURE X.
           02  FILLER REDEFINES FMCC250F.
             03 FMCC250A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC250I  PIC X(1).
           02  FMSPL36L    COMP  PIC  S9(4).
           02  FMSPL36F    PICTURE X.
           02  FILLER REDEFINES FMSPL36F.
             03 FMSPL36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL36I  PIC X(20).
           02  FMPFS13L    COMP  PIC  S9(4).
           02  FMPFS13F    PICTURE X.
           02  FILLER REDEFINES FMPFS13F.
             03 FMPFS13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS13I  PIC X(79).
           02  FMERR13L    COMP  PIC  S9(4).
           02  FMERR13F    PICTURE X.
           02  FILLER REDEFINES FMERR13F.
             03 FMERR13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR13I  PIC X(79).
       01  FMC1M13O REDEFINES FMC1M13I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANMC    PICTURE X.
           02  FMTRANMP    PICTURE X.
           02  FMTRANMH    PICTURE X.
           02  FMTRANMV    PICTURE X.
           02  FMTRANMO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEMC    PICTURE X.
           02  FMDATEMP    PICTURE X.
           02  FMDATEMH    PICTURE X.
           02  FMDATEMV    PICTURE X.
           02  FMDATEMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEMC    PICTURE X.
           02  FMTIMEMP    PICTURE X.
           02  FMTIMEMH    PICTURE X.
           02  FMTIMEMV    PICTURE X.
           02  FMTIMEMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG12C    PICTURE X.
           02  FMPAG12P    PICTURE X.
           02  FMPAG12H    PICTURE X.
           02  FMPAG12V    PICTURE X.
           02  FMPAG12O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG12C    PICTURE X.
           02  FMTPG12P    PICTURE X.
           02  FMTPG12H    PICTURE X.
           02  FMTPG12V    PICTURE X.
           02  FMTPG12O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPMC    PICTURE X.
           02  FMCOMPMP    PICTURE X.
           02  FMCOMPMH    PICTURE X.
           02  FMCOMPMV    PICTURE X.
           02  FMCOMPMO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC279C    PICTURE X.
           02  FMCC279P    PICTURE X.
           02  FMCC279H    PICTURE X.
           02  FMCC279V    PICTURE X.
           02  FMCC279O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC227C    PICTURE X.
           02  FMCC227P    PICTURE X.
           02  FMCC227H    PICTURE X.
           02  FMCC227V    PICTURE X.
           02  FMCC227O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL24C    PICTURE X.
           02  FMSPL24P    PICTURE X.
           02  FMSPL24H    PICTURE X.
           02  FMSPL24V    PICTURE X.
           02  FMSPL24O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC280C    PICTURE X.
           02  FMCC280P    PICTURE X.
           02  FMCC280H    PICTURE X.
           02  FMCC280V    PICTURE X.
           02  FMCC280O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC228C    PICTURE X.
           02  FMCC228P    PICTURE X.
           02  FMCC228H    PICTURE X.
           02  FMCC228V    PICTURE X.
           02  FMCC228O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL25C    PICTURE X.
           02  FMSPL25P    PICTURE X.
           02  FMSPL25H    PICTURE X.
           02  FMSPL25V    PICTURE X.
           02  FMSPL25O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC281C    PICTURE X.
           02  FMCC281P    PICTURE X.
           02  FMCC281H    PICTURE X.
           02  FMCC281V    PICTURE X.
           02  FMCC281O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC229C    PICTURE X.
           02  FMCC229P    PICTURE X.
           02  FMCC229H    PICTURE X.
           02  FMCC229V    PICTURE X.
           02  FMCC229O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL26C    PICTURE X.
           02  FMSPL26P    PICTURE X.
           02  FMSPL26H    PICTURE X.
           02  FMSPL26V    PICTURE X.
           02  FMSPL26O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC282C    PICTURE X.
           02  FMCC282P    PICTURE X.
           02  FMCC282H    PICTURE X.
           02  FMCC282V    PICTURE X.
           02  FMCC282O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC230C    PICTURE X.
           02  FMCC230P    PICTURE X.
           02  FMCC230H    PICTURE X.
           02  FMCC230V    PICTURE X.
           02  FMCC230O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL27C    PICTURE X.
           02  FMSPL27P    PICTURE X.
           02  FMSPL27H    PICTURE X.
           02  FMSPL27V    PICTURE X.
           02  FMSPL27O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCF36AC    PICTURE X.
           02  FMCF36AP    PICTURE X.
           02  FMCF36AH    PICTURE X.
           02  FMCF36AV    PICTURE X.
           02  FMCF36AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCS36AC    PICTURE X.
           02  FMCS36AP    PICTURE X.
           02  FMCS36AH    PICTURE X.
           02  FMCS36AV    PICTURE X.
           02  FMCS36AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL28C    PICTURE X.
           02  FMSPL28P    PICTURE X.
           02  FMSPL28H    PICTURE X.
           02  FMSPL28V    PICTURE X.
           02  FMSPL28O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCF36UC    PICTURE X.
           02  FMCF36UP    PICTURE X.
           02  FMCF36UH    PICTURE X.
           02  FMCF36UV    PICTURE X.
           02  FMCF36UO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCS36UC    PICTURE X.
           02  FMCS36UP    PICTURE X.
           02  FMCS36UH    PICTURE X.
           02  FMCS36UV    PICTURE X.
           02  FMCS36UO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL29C    PICTURE X.
           02  FMSPL29P    PICTURE X.
           02  FMSPL29H    PICTURE X.
           02  FMSPL29V    PICTURE X.
           02  FMSPL29O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC283C    PICTURE X.
           02  FMCC283P    PICTURE X.
           02  FMCC283H    PICTURE X.
           02  FMCC283V    PICTURE X.
           02  FMCC283O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC231C    PICTURE X.
           02  FMCC231P    PICTURE X.
           02  FMCC231H    PICTURE X.
           02  FMCC231V    PICTURE X.
           02  FMCC231O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL30C    PICTURE X.
           02  FMSPL30P    PICTURE X.
           02  FMSPL30H    PICTURE X.
           02  FMSPL30V    PICTURE X.
           02  FMSPL30O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC284C    PICTURE X.
           02  FMCC284P    PICTURE X.
           02  FMCC284H    PICTURE X.
           02  FMCC284V    PICTURE X.
           02  FMCC284O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC232C    PICTURE X.
           02  FMCC232P    PICTURE X.
           02  FMCC232H    PICTURE X.
           02  FMCC232V    PICTURE X.
           02  FMCC232O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL31C    PICTURE X.
           02  FMSPL31P    PICTURE X.
           02  FMSPL31H    PICTURE X.
           02  FMSPL31V    PICTURE X.
           02  FMSPL31O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC298C    PICTURE X.
           02  FMCC298P    PICTURE X.
           02  FMCC298H    PICTURE X.
           02  FMCC298V    PICTURE X.
           02  FMCC298O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC246C    PICTURE X.
           02  FMCC246P    PICTURE X.
           02  FMCC246H    PICTURE X.
           02  FMCC246V    PICTURE X.
           02  FMCC246O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL32C    PICTURE X.
           02  FMSPL32P    PICTURE X.
           02  FMSPL32H    PICTURE X.
           02  FMSPL32V    PICTURE X.
           02  FMSPL32O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC299C    PICTURE X.
           02  FMCC299P    PICTURE X.
           02  FMCC299H    PICTURE X.
           02  FMCC299V    PICTURE X.
           02  FMCC299O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC247C    PICTURE X.
           02  FMCC247P    PICTURE X.
           02  FMCC247H    PICTURE X.
           02  FMCC247V    PICTURE X.
           02  FMCC247O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL33C    PICTURE X.
           02  FMSPL33P    PICTURE X.
           02  FMSPL33H    PICTURE X.
           02  FMSPL33V    PICTURE X.
           02  FMSPL33O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC300C    PICTURE X.
           02  FMCC300P    PICTURE X.
           02  FMCC300H    PICTURE X.
           02  FMCC300V    PICTURE X.
           02  FMCC300O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC248C    PICTURE X.
           02  FMCC248P    PICTURE X.
           02  FMCC248H    PICTURE X.
           02  FMCC248V    PICTURE X.
           02  FMCC248O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL34C    PICTURE X.
           02  FMSPL34P    PICTURE X.
           02  FMSPL34H    PICTURE X.
           02  FMSPL34V    PICTURE X.
           02  FMSPL34O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC301C    PICTURE X.
           02  FMCC301P    PICTURE X.
           02  FMCC301H    PICTURE X.
           02  FMCC301V    PICTURE X.
           02  FMCC301O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC249C    PICTURE X.
           02  FMCC249P    PICTURE X.
           02  FMCC249H    PICTURE X.
           02  FMCC249V    PICTURE X.
           02  FMCC249O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL35C    PICTURE X.
           02  FMSPL35P    PICTURE X.
           02  FMSPL35H    PICTURE X.
           02  FMSPL35V    PICTURE X.
           02  FMSPL35O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC302C    PICTURE X.
           02  FMCC302P    PICTURE X.
           02  FMCC302H    PICTURE X.
           02  FMCC302V    PICTURE X.
           02  FMCC302O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC250C    PICTURE X.
           02  FMCC250P    PICTURE X.
           02  FMCC250H    PICTURE X.
           02  FMCC250V    PICTURE X.
           02  FMCC250O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL36C    PICTURE X.
           02  FMSPL36P    PICTURE X.
           02  FMSPL36H    PICTURE X.
           02  FMSPL36V    PICTURE X.
           02  FMSPL36O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMPFS13C    PICTURE X.
           02  FMPFS13P    PICTURE X.
           02  FMPFS13H    PICTURE X.
           02  FMPFS13V    PICTURE X.
           02  FMPFS13O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR13C    PICTURE X.
           02  FMERR13P    PICTURE X.
           02  FMERR13H    PICTURE X.
           02  FMERR13V    PICTURE X.
           02  FMERR13O  PIC X(79).
       01  FMC1M14I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANNL    COMP  PIC  S9(4).
           02  FMTRANNF    PICTURE X.
           02  FILLER REDEFINES FMTRANNF.
             03 FMTRANNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANNI  PIC X(4).
           02  FMDATENL    COMP  PIC  S9(4).
           02  FMDATENF    PICTURE X.
           02  FILLER REDEFINES FMDATENF.
             03 FMDATENA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATENI  PIC X(8).
           02  FMTIMENL    COMP  PIC  S9(4).
           02  FMTIMENF    PICTURE X.
           02  FILLER REDEFINES FMTIMENF.
             03 FMTIMENA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMENI  PIC X(8).
           02  FMPAG13L    COMP  PIC  S9(4).
           02  FMPAG13F    PICTURE X.
           02  FILLER REDEFINES FMPAG13F.
             03 FMPAG13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG13I  PIC X(2).
           02  FMTPG13L    COMP  PIC  S9(4).
           02  FMTPG13F    PICTURE X.
           02  FILLER REDEFINES FMTPG13F.
             03 FMTPG13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG13I  PIC X(2).
           02  FMCOMPNL    COMP  PIC  S9(4).
           02  FMCOMPNF    PICTURE X.
           02  FILLER REDEFINES FMCOMPNF.
             03 FMCOMPNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPNI  PIC X(4).
           02  FMCC303L    COMP  PIC  S9(4).
           02  FMCC303F    PICTURE X.
           02  FILLER REDEFINES FMCC303F.
             03 FMCC303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC303I  PIC X(1).
           02  FMCC251L    COMP  PIC  S9(4).
           02  FMCC251F    PICTURE X.
           02  FILLER REDEFINES FMCC251F.
             03 FMCC251A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC251I  PIC X(1).
           02  FMSPL37L    COMP  PIC  S9(4).
           02  FMSPL37F    PICTURE X.
           02  FILLER REDEFINES FMSPL37F.
             03 FMSPL37A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL37I  PIC X(20).
           02  FMCC304L    COMP  PIC  S9(4).
           02  FMCC304F    PICTURE X.
           02  FILLER REDEFINES FMCC304F.
             03 FMCC304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC304I  PIC X(1).
           02  FMCC252L    COMP  PIC  S9(4).
           02  FMCC252F    PICTURE X.
           02  FILLER REDEFINES FMCC252F.
             03 FMCC252A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC252I  PIC X(1).
           02  FMSPL38L    COMP  PIC  S9(4).
           02  FMSPL38F    PICTURE X.
           02  FILLER REDEFINES FMSPL38F.
             03 FMSPL38A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL38I  PIC X(20).
           02  FMCC285L    COMP  PIC  S9(4).
           02  FMCC285F    PICTURE X.
           02  FILLER REDEFINES FMCC285F.
             03 FMCC285A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC285I  PIC X(1).
           02  FMCC233L    COMP  PIC  S9(4).
           02  FMCC233F    PICTURE X.
           02  FILLER REDEFINES FMCC233F.
             03 FMCC233A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC233I  PIC X(1).
           02  FMSPL39L    COMP  PIC  S9(4).
           02  FMSPL39F    PICTURE X.
           02  FILLER REDEFINES FMSPL39F.
             03 FMSPL39A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL39I  PIC X(20).
           02  FMCC286L    COMP  PIC  S9(4).
           02  FMCC286F    PICTURE X.
           02  FILLER REDEFINES FMCC286F.
             03 FMCC286A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC286I  PIC X(1).
           02  FMCC234L    COMP  PIC  S9(4).
           02  FMCC234F    PICTURE X.
           02  FILLER REDEFINES FMCC234F.
             03 FMCC234A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC234I  PIC X(1).
           02  FMSPL40L    COMP  PIC  S9(4).
           02  FMSPL40F    PICTURE X.
           02  FILLER REDEFINES FMSPL40F.
             03 FMSPL40A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL40I  PIC X(20).
           02  FMCC288L    COMP  PIC  S9(4).
           02  FMCC288F    PICTURE X.
           02  FILLER REDEFINES FMCC288F.
             03 FMCC288A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC288I  PIC X(1).
           02  FMCC236L    COMP  PIC  S9(4).
           02  FMCC236F    PICTURE X.
           02  FILLER REDEFINES FMCC236F.
             03 FMCC236A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC236I  PIC X(1).
           02  FMSPL41L    COMP  PIC  S9(4).
           02  FMSPL41F    PICTURE X.
           02  FILLER REDEFINES FMSPL41F.
             03 FMSPL41A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL41I  PIC X(20).
           02  FMCCFARL    COMP  PIC  S9(4).
           02  FMCCFARF    PICTURE X.
           02  FILLER REDEFINES FMCCFARF.
             03 FMCCFARA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCFARI  PIC X(1).
           02  FMCCSARL    COMP  PIC  S9(4).
           02  FMCCSARF    PICTURE X.
           02  FILLER REDEFINES FMCCSARF.
             03 FMCCSARA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCSARI  PIC X(1).
           02  FMSPLARL    COMP  PIC  S9(4).
           02  FMSPLARF    PICTURE X.
           02  FILLER REDEFINES FMSPLARF.
             03 FMSPLARA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPLARI  PIC X(20).
           02  FMCF60CL    COMP  PIC  S9(4).
           02  FMCF60CF    PICTURE X.
           02  FILLER REDEFINES FMCF60CF.
             03 FMCF60CA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCF60CI  PIC X(1).
           02  FMCS60CL    COMP  PIC  S9(4).
           02  FMCS60CF    PICTURE X.
           02  FILLER REDEFINES FMCS60CF.
             03 FMCS60CA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCS60CI  PIC X(1).
           02  FMSPL42L    COMP  PIC  S9(4).
           02  FMSPL42F    PICTURE X.
           02  FILLER REDEFINES FMSPL42F.
             03 FMSPL42A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL42I  PIC X(20).
           02  FMCF60DL    COMP  PIC  S9(4).
           02  FMCF60DF    PICTURE X.
           02  FILLER REDEFINES FMCF60DF.
             03 FMCF60DA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCF60DI  PIC X(1).
           02  FMCS60DL    COMP  PIC  S9(4).
           02  FMCS60DF    PICTURE X.
           02  FILLER REDEFINES FMCS60DF.
             03 FMCS60DA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCS60DI  PIC X(1).
           02  FMSPL43L    COMP  PIC  S9(4).
           02  FMSPL43F    PICTURE X.
           02  FILLER REDEFINES FMSPL43F.
             03 FMSPL43A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL43I  PIC X(20).
           02  FMCC290L    COMP  PIC  S9(4).
           02  FMCC290F    PICTURE X.
           02  FILLER REDEFINES FMCC290F.
             03 FMCC290A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC290I  PIC X(1).
           02  FMCC238L    COMP  PIC  S9(4).
           02  FMCC238F    PICTURE X.
           02  FILLER REDEFINES FMCC238F.
             03 FMCC238A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC238I  PIC X(1).
           02  FMSPL44L    COMP  PIC  S9(4).
           02  FMSPL44F    PICTURE X.
           02  FILLER REDEFINES FMSPL44F.
             03 FMSPL44A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL44I  PIC X(20).
           02  FMCC291L    COMP  PIC  S9(4).
           02  FMCC291F    PICTURE X.
           02  FILLER REDEFINES FMCC291F.
             03 FMCC291A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC291I  PIC X(1).
           02  FMCC239L    COMP  PIC  S9(4).
           02  FMCC239F    PICTURE X.
           02  FILLER REDEFINES FMCC239F.
             03 FMCC239A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC239I  PIC X(1).
           02  FMSPL45L    COMP  PIC  S9(4).
           02  FMSPL45F    PICTURE X.
           02  FILLER REDEFINES FMSPL45F.
             03 FMSPL45A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL45I  PIC X(20).
           02  FMCC292L    COMP  PIC  S9(4).
           02  FMCC292F    PICTURE X.
           02  FILLER REDEFINES FMCC292F.
             03 FMCC292A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC292I  PIC X(1).
           02  FMCC240L    COMP  PIC  S9(4).
           02  FMCC240F    PICTURE X.
           02  FILLER REDEFINES FMCC240F.
             03 FMCC240A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC240I  PIC X(1).
           02  FMSPL46L    COMP  PIC  S9(4).
           02  FMSPL46F    PICTURE X.
           02  FILLER REDEFINES FMSPL46F.
             03 FMSPL46A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL46I  PIC X(20).
           02  FMCC293L    COMP  PIC  S9(4).
           02  FMCC293F    PICTURE X.
           02  FILLER REDEFINES FMCC293F.
             03 FMCC293A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC293I  PIC X(1).
           02  FMCC241L    COMP  PIC  S9(4).
           02  FMCC241F    PICTURE X.
           02  FILLER REDEFINES FMCC241F.
             03 FMCC241A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC241I  PIC X(1).
           02  FMSPL47L    COMP  PIC  S9(4).
           02  FMSPL47F    PICTURE X.
           02  FILLER REDEFINES FMSPL47F.
             03 FMSPL47A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL47I  PIC X(20).
           02  FMPFS14L    COMP  PIC  S9(4).
           02  FMPFS14F    PICTURE X.
           02  FILLER REDEFINES FMPFS14F.
             03 FMPFS14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS14I  PIC X(79).
           02  FMERR14L    COMP  PIC  S9(4).
           02  FMERR14F    PICTURE X.
           02  FILLER REDEFINES FMERR14F.
             03 FMERR14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR14I  PIC X(79).
       01  FMC1M14O REDEFINES FMC1M14I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANNC    PICTURE X.
           02  FMTRANNP    PICTURE X.
           02  FMTRANNH    PICTURE X.
           02  FMTRANNV    PICTURE X.
           02  FMTRANNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATENC    PICTURE X.
           02  FMDATENP    PICTURE X.
           02  FMDATENH    PICTURE X.
           02  FMDATENV    PICTURE X.
           02  FMDATENO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMENC    PICTURE X.
           02  FMTIMENP    PICTURE X.
           02  FMTIMENH    PICTURE X.
           02  FMTIMENV    PICTURE X.
           02  FMTIMENO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG13C    PICTURE X.
           02  FMPAG13P    PICTURE X.
           02  FMPAG13H    PICTURE X.
           02  FMPAG13V    PICTURE X.
           02  FMPAG13O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG13C    PICTURE X.
           02  FMTPG13P    PICTURE X.
           02  FMTPG13H    PICTURE X.
           02  FMTPG13V    PICTURE X.
           02  FMTPG13O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPNC    PICTURE X.
           02  FMCOMPNP    PICTURE X.
           02  FMCOMPNH    PICTURE X.
           02  FMCOMPNV    PICTURE X.
           02  FMCOMPNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC303C    PICTURE X.
           02  FMCC303P    PICTURE X.
           02  FMCC303H    PICTURE X.
           02  FMCC303V    PICTURE X.
           02  FMCC303O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC251C    PICTURE X.
           02  FMCC251P    PICTURE X.
           02  FMCC251H    PICTURE X.
           02  FMCC251V    PICTURE X.
           02  FMCC251O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL37C    PICTURE X.
           02  FMSPL37P    PICTURE X.
           02  FMSPL37H    PICTURE X.
           02  FMSPL37V    PICTURE X.
           02  FMSPL37O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC304C    PICTURE X.
           02  FMCC304P    PICTURE X.
           02  FMCC304H    PICTURE X.
           02  FMCC304V    PICTURE X.
           02  FMCC304O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC252C    PICTURE X.
           02  FMCC252P    PICTURE X.
           02  FMCC252H    PICTURE X.
           02  FMCC252V    PICTURE X.
           02  FMCC252O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL38C    PICTURE X.
           02  FMSPL38P    PICTURE X.
           02  FMSPL38H    PICTURE X.
           02  FMSPL38V    PICTURE X.
           02  FMSPL38O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC285C    PICTURE X.
           02  FMCC285P    PICTURE X.
           02  FMCC285H    PICTURE X.
           02  FMCC285V    PICTURE X.
           02  FMCC285O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC233C    PICTURE X.
           02  FMCC233P    PICTURE X.
           02  FMCC233H    PICTURE X.
           02  FMCC233V    PICTURE X.
           02  FMCC233O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL39C    PICTURE X.
           02  FMSPL39P    PICTURE X.
           02  FMSPL39H    PICTURE X.
           02  FMSPL39V    PICTURE X.
           02  FMSPL39O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC286C    PICTURE X.
           02  FMCC286P    PICTURE X.
           02  FMCC286H    PICTURE X.
           02  FMCC286V    PICTURE X.
           02  FMCC286O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC234C    PICTURE X.
           02  FMCC234P    PICTURE X.
           02  FMCC234H    PICTURE X.
           02  FMCC234V    PICTURE X.
           02  FMCC234O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL40C    PICTURE X.
           02  FMSPL40P    PICTURE X.
           02  FMSPL40H    PICTURE X.
           02  FMSPL40V    PICTURE X.
           02  FMSPL40O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC288C    PICTURE X.
           02  FMCC288P    PICTURE X.
           02  FMCC288H    PICTURE X.
           02  FMCC288V    PICTURE X.
           02  FMCC288O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC236C    PICTURE X.
           02  FMCC236P    PICTURE X.
           02  FMCC236H    PICTURE X.
           02  FMCC236V    PICTURE X.
           02  FMCC236O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL41C    PICTURE X.
           02  FMSPL41P    PICTURE X.
           02  FMSPL41H    PICTURE X.
           02  FMSPL41V    PICTURE X.
           02  FMSPL41O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCFARC    PICTURE X.
           02  FMCCFARP    PICTURE X.
           02  FMCCFARH    PICTURE X.
           02  FMCCFARV    PICTURE X.
           02  FMCCFARO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCSARC    PICTURE X.
           02  FMCCSARP    PICTURE X.
           02  FMCCSARH    PICTURE X.
           02  FMCCSARV    PICTURE X.
           02  FMCCSARO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPLARC    PICTURE X.
           02  FMSPLARP    PICTURE X.
           02  FMSPLARH    PICTURE X.
           02  FMSPLARV    PICTURE X.
           02  FMSPLARO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCF60CC    PICTURE X.
           02  FMCF60CP    PICTURE X.
           02  FMCF60CH    PICTURE X.
           02  FMCF60CV    PICTURE X.
           02  FMCF60CO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCS60CC    PICTURE X.
           02  FMCS60CP    PICTURE X.
           02  FMCS60CH    PICTURE X.
           02  FMCS60CV    PICTURE X.
           02  FMCS60CO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL42C    PICTURE X.
           02  FMSPL42P    PICTURE X.
           02  FMSPL42H    PICTURE X.
           02  FMSPL42V    PICTURE X.
           02  FMSPL42O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCF60DC    PICTURE X.
           02  FMCF60DP    PICTURE X.
           02  FMCF60DH    PICTURE X.
           02  FMCF60DV    PICTURE X.
           02  FMCF60DO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCS60DC    PICTURE X.
           02  FMCS60DP    PICTURE X.
           02  FMCS60DH    PICTURE X.
           02  FMCS60DV    PICTURE X.
           02  FMCS60DO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL43C    PICTURE X.
           02  FMSPL43P    PICTURE X.
           02  FMSPL43H    PICTURE X.
           02  FMSPL43V    PICTURE X.
           02  FMSPL43O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC290C    PICTURE X.
           02  FMCC290P    PICTURE X.
           02  FMCC290H    PICTURE X.
           02  FMCC290V    PICTURE X.
           02  FMCC290O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC238C    PICTURE X.
           02  FMCC238P    PICTURE X.
           02  FMCC238H    PICTURE X.
           02  FMCC238V    PICTURE X.
           02  FMCC238O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL44C    PICTURE X.
           02  FMSPL44P    PICTURE X.
           02  FMSPL44H    PICTURE X.
           02  FMSPL44V    PICTURE X.
           02  FMSPL44O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC291C    PICTURE X.
           02  FMCC291P    PICTURE X.
           02  FMCC291H    PICTURE X.
           02  FMCC291V    PICTURE X.
           02  FMCC291O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC239C    PICTURE X.
           02  FMCC239P    PICTURE X.
           02  FMCC239H    PICTURE X.
           02  FMCC239V    PICTURE X.
           02  FMCC239O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL45C    PICTURE X.
           02  FMSPL45P    PICTURE X.
           02  FMSPL45H    PICTURE X.
           02  FMSPL45V    PICTURE X.
           02  FMSPL45O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC292C    PICTURE X.
           02  FMCC292P    PICTURE X.
           02  FMCC292H    PICTURE X.
           02  FMCC292V    PICTURE X.
           02  FMCC292O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC240C    PICTURE X.
           02  FMCC240P    PICTURE X.
           02  FMCC240H    PICTURE X.
           02  FMCC240V    PICTURE X.
           02  FMCC240O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL46C    PICTURE X.
           02  FMSPL46P    PICTURE X.
           02  FMSPL46H    PICTURE X.
           02  FMSPL46V    PICTURE X.
           02  FMSPL46O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC293C    PICTURE X.
           02  FMCC293P    PICTURE X.
           02  FMCC293H    PICTURE X.
           02  FMCC293V    PICTURE X.
           02  FMCC293O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC241C    PICTURE X.
           02  FMCC241P    PICTURE X.
           02  FMCC241H    PICTURE X.
           02  FMCC241V    PICTURE X.
           02  FMCC241O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL47C    PICTURE X.
           02  FMSPL47P    PICTURE X.
           02  FMSPL47H    PICTURE X.
           02  FMSPL47V    PICTURE X.
           02  FMSPL47O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMPFS14C    PICTURE X.
           02  FMPFS14P    PICTURE X.
           02  FMPFS14H    PICTURE X.
           02  FMPFS14V    PICTURE X.
           02  FMPFS14O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR14C    PICTURE X.
           02  FMERR14P    PICTURE X.
           02  FMERR14H    PICTURE X.
           02  FMERR14V    PICTURE X.
           02  FMERR14O  PIC X(79).
       01  FMC1M15I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANOL    COMP  PIC  S9(4).
           02  FMTRANOF    PICTURE X.
           02  FILLER REDEFINES FMTRANOF.
             03 FMTRANOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANOI  PIC X(4).
           02  FMDATEOL    COMP  PIC  S9(4).
           02  FMDATEOF    PICTURE X.
           02  FILLER REDEFINES FMDATEOF.
             03 FMDATEOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEOI  PIC X(8).
           02  FMTIMEOL    COMP  PIC  S9(4).
           02  FMTIMEOF    PICTURE X.
           02  FILLER REDEFINES FMTIMEOF.
             03 FMTIMEOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEOI  PIC X(8).
           02  FMPAG14L    COMP  PIC  S9(4).
           02  FMPAG14F    PICTURE X.
           02  FILLER REDEFINES FMPAG14F.
             03 FMPAG14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG14I  PIC X(2).
           02  FMTPG14L    COMP  PIC  S9(4).
           02  FMTPG14F    PICTURE X.
           02  FILLER REDEFINES FMTPG14F.
             03 FMTPG14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG14I  PIC X(2).
           02  FMCOMPOL    COMP  PIC  S9(4).
           02  FMCOMPOF    PICTURE X.
           02  FILLER REDEFINES FMCOMPOF.
             03 FMCOMPOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPOI  PIC X(4).
           02  FMCC294L    COMP  PIC  S9(4).
           02  FMCC294F    PICTURE X.
           02  FILLER REDEFINES FMCC294F.
             03 FMCC294A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC294I  PIC X(1).
           02  FMCC242L    COMP  PIC  S9(4).
           02  FMCC242F    PICTURE X.
           02  FILLER REDEFINES FMCC242F.
             03 FMCC242A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC242I  PIC X(1).
           02  FMSPL48L    COMP  PIC  S9(4).
           02  FMSPL48F    PICTURE X.
           02  FILLER REDEFINES FMSPL48F.
             03 FMSPL48A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL48I  PIC X(20).
           02  FMCC295L    COMP  PIC  S9(4).
           02  FMCC295F    PICTURE X.
           02  FILLER REDEFINES FMCC295F.
             03 FMCC295A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC295I  PIC X(1).
           02  FMCC243L    COMP  PIC  S9(4).
           02  FMCC243F    PICTURE X.
           02  FILLER REDEFINES FMCC243F.
             03 FMCC243A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC243I  PIC X(1).
           02  FMSPL49L    COMP  PIC  S9(4).
           02  FMSPL49F    PICTURE X.
           02  FILLER REDEFINES FMSPL49F.
             03 FMSPL49A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL49I  PIC X(20).
           02  FMCC296L    COMP  PIC  S9(4).
           02  FMCC296F    PICTURE X.
           02  FILLER REDEFINES FMCC296F.
             03 FMCC296A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC296I  PIC X(1).
           02  FMCC244L    COMP  PIC  S9(4).
           02  FMCC244F    PICTURE X.
           02  FILLER REDEFINES FMCC244F.
             03 FMCC244A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC244I  PIC X(1).
           02  FMSPL50L    COMP  PIC  S9(4).
           02  FMSPL50F    PICTURE X.
           02  FILLER REDEFINES FMSPL50F.
             03 FMSPL50A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL50I  PIC X(20).
           02  FMCCF85L    COMP  PIC  S9(4).
           02  FMCCF85F    PICTURE X.
           02  FILLER REDEFINES FMCCF85F.
             03 FMCCF85A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCF85I  PIC X(1).
           02  FMCCS85L    COMP  PIC  S9(4).
           02  FMCCS85F    PICTURE X.
           02  FILLER REDEFINES FMCCS85F.
             03 FMCCS85A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCS85I  PIC X(1).
           02  FMSPL51L    COMP  PIC  S9(4).
           02  FMSPL51F    PICTURE X.
           02  FILLER REDEFINES FMSPL51F.
             03 FMSPL51A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL51I  PIC X(20).
           02  FMCCF87L    COMP  PIC  S9(4).
           02  FMCCF87F    PICTURE X.
           02  FILLER REDEFINES FMCCF87F.
             03 FMCCF87A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCF87I  PIC X(1).
           02  FMCCS87L    COMP  PIC  S9(4).
           02  FMCCS87F    PICTURE X.
           02  FILLER REDEFINES FMCCS87F.
             03 FMCCS87A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCS87I  PIC X(1).
           02  FMSPL52L    COMP  PIC  S9(4).
           02  FMSPL52F    PICTURE X.
           02  FILLER REDEFINES FMSPL52F.
             03 FMSPL52A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL52I  PIC X(20).
           02  FMCCH87L    COMP  PIC  S9(4).
           02  FMCCH87F    PICTURE X.
           02  FILLER REDEFINES FMCCH87F.
             03 FMCCH87A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCH87I  PIC X(1).
           02  FMCC87HL    COMP  PIC  S9(4).
           02  FMCC87HF    PICTURE X.
           02  FILLER REDEFINES FMCC87HF.
             03 FMCC87HA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC87HI  PIC X(1).
           02  FMSPL53L    COMP  PIC  S9(4).
           02  FMSPL53F    PICTURE X.
           02  FILLER REDEFINES FMSPL53F.
             03 FMSPL53A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL53I  PIC X(20).
           02  FMCCF90L    COMP  PIC  S9(4).
           02  FMCCF90F    PICTURE X.
           02  FILLER REDEFINES FMCCF90F.
             03 FMCCF90A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCF90I  PIC X(1).
           02  FMCCS90L    COMP  PIC  S9(4).
           02  FMCCS90F    PICTURE X.
           02  FILLER REDEFINES FMCCS90F.
             03 FMCCS90A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCS90I  PIC X(1).
           02  FMSPL54L    COMP  PIC  S9(4).
           02  FMSPL54F    PICTURE X.
           02  FILLER REDEFINES FMSPL54F.
             03 FMSPL54A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL54I  PIC X(20).
           02  FMCCF91L    COMP  PIC  S9(4).
           02  FMCCF91F    PICTURE X.
           02  FILLER REDEFINES FMCCF91F.
             03 FMCCF91A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCF91I  PIC X(1).
           02  FMCCS91L    COMP  PIC  S9(4).
           02  FMCCS91F    PICTURE X.
           02  FILLER REDEFINES FMCCS91F.
             03 FMCCS91A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCS91I  PIC X(1).
           02  FMSPL55L    COMP  PIC  S9(4).
           02  FMSPL55F    PICTURE X.
           02  FILLER REDEFINES FMSPL55F.
             03 FMSPL55A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL55I  PIC X(20).
           02  FMCCF92L    COMP  PIC  S9(4).
           02  FMCCF92F    PICTURE X.
           02  FILLER REDEFINES FMCCF92F.
             03 FMCCF92A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCF92I  PIC X(1).
           02  FMCCS92L    COMP  PIC  S9(4).
           02  FMCCS92F    PICTURE X.
           02  FILLER REDEFINES FMCCS92F.
             03 FMCCS92A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCS92I  PIC X(1).
           02  FMSPL56L    COMP  PIC  S9(4).
           02  FMSPL56F    PICTURE X.
           02  FILLER REDEFINES FMSPL56F.
             03 FMSPL56A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL56I  PIC X(20).
           02  FMCCF93L    COMP  PIC  S9(4).
           02  FMCCF93F    PICTURE X.
           02  FILLER REDEFINES FMCCF93F.
             03 FMCCF93A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCF93I  PIC X(1).
           02  FMCCS93L    COMP  PIC  S9(4).
           02  FMCCS93F    PICTURE X.
           02  FILLER REDEFINES FMCCS93F.
             03 FMCCS93A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCS93I  PIC X(1).
           02  FMSPL5AL    COMP  PIC  S9(4).
           02  FMSPL5AF    PICTURE X.
           02  FILLER REDEFINES FMSPL5AF.
             03 FMSPL5AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL5AI  PIC X(20).
           02  FMCC297L    COMP  PIC  S9(4).
           02  FMCC297F    PICTURE X.
           02  FILLER REDEFINES FMCC297F.
             03 FMCC297A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC297I  PIC X(1).
           02  FMCC245L    COMP  PIC  S9(4).
           02  FMCC245F    PICTURE X.
           02  FILLER REDEFINES FMCC245F.
             03 FMCC245A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC245I  PIC X(1).
           02  FMSPL57L    COMP  PIC  S9(4).
           02  FMSPL57F    PICTURE X.
           02  FILLER REDEFINES FMSPL57F.
             03 FMSPL57A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPL57I  PIC X(20).
           02  FMPFS15L    COMP  PIC  S9(4).
           02  FMPFS15F    PICTURE X.
           02  FILLER REDEFINES FMPFS15F.
             03 FMPFS15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS15I  PIC X(79).
           02  FMERR15L    COMP  PIC  S9(4).
           02  FMERR15F    PICTURE X.
           02  FILLER REDEFINES FMERR15F.
             03 FMERR15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR15I  PIC X(79).
       01  FMC1M15O REDEFINES FMC1M15I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANOC    PICTURE X.
           02  FMTRANOP    PICTURE X.
           02  FMTRANOH    PICTURE X.
           02  FMTRANOV    PICTURE X.
           02  FMTRANOO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEOC    PICTURE X.
           02  FMDATEOP    PICTURE X.
           02  FMDATEOH    PICTURE X.
           02  FMDATEOV    PICTURE X.
           02  FMDATEOO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEOC    PICTURE X.
           02  FMTIMEOP    PICTURE X.
           02  FMTIMEOH    PICTURE X.
           02  FMTIMEOV    PICTURE X.
           02  FMTIMEOO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG14C    PICTURE X.
           02  FMPAG14P    PICTURE X.
           02  FMPAG14H    PICTURE X.
           02  FMPAG14V    PICTURE X.
           02  FMPAG14O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG14C    PICTURE X.
           02  FMTPG14P    PICTURE X.
           02  FMTPG14H    PICTURE X.
           02  FMTPG14V    PICTURE X.
           02  FMTPG14O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPOC    PICTURE X.
           02  FMCOMPOP    PICTURE X.
           02  FMCOMPOH    PICTURE X.
           02  FMCOMPOV    PICTURE X.
           02  FMCOMPOO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC294C    PICTURE X.
           02  FMCC294P    PICTURE X.
           02  FMCC294H    PICTURE X.
           02  FMCC294V    PICTURE X.
           02  FMCC294O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC242C    PICTURE X.
           02  FMCC242P    PICTURE X.
           02  FMCC242H    PICTURE X.
           02  FMCC242V    PICTURE X.
           02  FMCC242O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL48C    PICTURE X.
           02  FMSPL48P    PICTURE X.
           02  FMSPL48H    PICTURE X.
           02  FMSPL48V    PICTURE X.
           02  FMSPL48O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC295C    PICTURE X.
           02  FMCC295P    PICTURE X.
           02  FMCC295H    PICTURE X.
           02  FMCC295V    PICTURE X.
           02  FMCC295O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC243C    PICTURE X.
           02  FMCC243P    PICTURE X.
           02  FMCC243H    PICTURE X.
           02  FMCC243V    PICTURE X.
           02  FMCC243O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL49C    PICTURE X.
           02  FMSPL49P    PICTURE X.
           02  FMSPL49H    PICTURE X.
           02  FMSPL49V    PICTURE X.
           02  FMSPL49O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC296C    PICTURE X.
           02  FMCC296P    PICTURE X.
           02  FMCC296H    PICTURE X.
           02  FMCC296V    PICTURE X.
           02  FMCC296O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC244C    PICTURE X.
           02  FMCC244P    PICTURE X.
           02  FMCC244H    PICTURE X.
           02  FMCC244V    PICTURE X.
           02  FMCC244O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL50C    PICTURE X.
           02  FMSPL50P    PICTURE X.
           02  FMSPL50H    PICTURE X.
           02  FMSPL50V    PICTURE X.
           02  FMSPL50O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCF85C    PICTURE X.
           02  FMCCF85P    PICTURE X.
           02  FMCCF85H    PICTURE X.
           02  FMCCF85V    PICTURE X.
           02  FMCCF85O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCS85C    PICTURE X.
           02  FMCCS85P    PICTURE X.
           02  FMCCS85H    PICTURE X.
           02  FMCCS85V    PICTURE X.
           02  FMCCS85O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL51C    PICTURE X.
           02  FMSPL51P    PICTURE X.
           02  FMSPL51H    PICTURE X.
           02  FMSPL51V    PICTURE X.
           02  FMSPL51O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCF87C    PICTURE X.
           02  FMCCF87P    PICTURE X.
           02  FMCCF87H    PICTURE X.
           02  FMCCF87V    PICTURE X.
           02  FMCCF87O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCS87C    PICTURE X.
           02  FMCCS87P    PICTURE X.
           02  FMCCS87H    PICTURE X.
           02  FMCCS87V    PICTURE X.
           02  FMCCS87O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL52C    PICTURE X.
           02  FMSPL52P    PICTURE X.
           02  FMSPL52H    PICTURE X.
           02  FMSPL52V    PICTURE X.
           02  FMSPL52O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCH87C    PICTURE X.
           02  FMCCH87P    PICTURE X.
           02  FMCCH87H    PICTURE X.
           02  FMCCH87V    PICTURE X.
           02  FMCCH87O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC87HC    PICTURE X.
           02  FMCC87HP    PICTURE X.
           02  FMCC87HH    PICTURE X.
           02  FMCC87HV    PICTURE X.
           02  FMCC87HO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL53C    PICTURE X.
           02  FMSPL53P    PICTURE X.
           02  FMSPL53H    PICTURE X.
           02  FMSPL53V    PICTURE X.
           02  FMSPL53O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCF90C    PICTURE X.
           02  FMCCF90P    PICTURE X.
           02  FMCCF90H    PICTURE X.
           02  FMCCF90V    PICTURE X.
           02  FMCCF90O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCS90C    PICTURE X.
           02  FMCCS90P    PICTURE X.
           02  FMCCS90H    PICTURE X.
           02  FMCCS90V    PICTURE X.
           02  FMCCS90O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL54C    PICTURE X.
           02  FMSPL54P    PICTURE X.
           02  FMSPL54H    PICTURE X.
           02  FMSPL54V    PICTURE X.
           02  FMSPL54O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCF91C    PICTURE X.
           02  FMCCF91P    PICTURE X.
           02  FMCCF91H    PICTURE X.
           02  FMCCF91V    PICTURE X.
           02  FMCCF91O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCS91C    PICTURE X.
           02  FMCCS91P    PICTURE X.
           02  FMCCS91H    PICTURE X.
           02  FMCCS91V    PICTURE X.
           02  FMCCS91O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL55C    PICTURE X.
           02  FMSPL55P    PICTURE X.
           02  FMSPL55H    PICTURE X.
           02  FMSPL55V    PICTURE X.
           02  FMSPL55O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCF92C    PICTURE X.
           02  FMCCF92P    PICTURE X.
           02  FMCCF92H    PICTURE X.
           02  FMCCF92V    PICTURE X.
           02  FMCCF92O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCS92C    PICTURE X.
           02  FMCCS92P    PICTURE X.
           02  FMCCS92H    PICTURE X.
           02  FMCCS92V    PICTURE X.
           02  FMCCS92O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL56C    PICTURE X.
           02  FMSPL56P    PICTURE X.
           02  FMSPL56H    PICTURE X.
           02  FMSPL56V    PICTURE X.
           02  FMSPL56O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCCF93C    PICTURE X.
           02  FMCCF93P    PICTURE X.
           02  FMCCF93H    PICTURE X.
           02  FMCCF93V    PICTURE X.
           02  FMCCF93O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCCS93C    PICTURE X.
           02  FMCCS93P    PICTURE X.
           02  FMCCS93H    PICTURE X.
           02  FMCCS93V    PICTURE X.
           02  FMCCS93O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL5AC    PICTURE X.
           02  FMSPL5AP    PICTURE X.
           02  FMSPL5AH    PICTURE X.
           02  FMSPL5AV    PICTURE X.
           02  FMSPL5AO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMCC297C    PICTURE X.
           02  FMCC297P    PICTURE X.
           02  FMCC297H    PICTURE X.
           02  FMCC297V    PICTURE X.
           02  FMCC297O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCC245C    PICTURE X.
           02  FMCC245P    PICTURE X.
           02  FMCC245H    PICTURE X.
           02  FMCC245V    PICTURE X.
           02  FMCC245O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSPL57C    PICTURE X.
           02  FMSPL57P    PICTURE X.
           02  FMSPL57H    PICTURE X.
           02  FMSPL57V    PICTURE X.
           02  FMSPL57O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMPFS15C    PICTURE X.
           02  FMPFS15P    PICTURE X.
           02  FMPFS15H    PICTURE X.
           02  FMPFS15V    PICTURE X.
           02  FMPFS15O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR15C    PICTURE X.
           02  FMERR15P    PICTURE X.
           02  FMERR15H    PICTURE X.
           02  FMERR15V    PICTURE X.
           02  FMERR15O  PIC X(79).
       01  FMC1M16I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANPL    COMP  PIC  S9(4).
           02  FMTRANPF    PICTURE X.
           02  FILLER REDEFINES FMTRANPF.
             03 FMTRANPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANPI  PIC X(4).
           02  FMDATEPL    COMP  PIC  S9(4).
           02  FMDATEPF    PICTURE X.
           02  FILLER REDEFINES FMDATEPF.
             03 FMDATEPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEPI  PIC X(8).
           02  FMTIMEPL    COMP  PIC  S9(4).
           02  FMTIMEPF    PICTURE X.
           02  FILLER REDEFINES FMTIMEPF.
             03 FMTIMEPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEPI  PIC X(8).
           02  FMPAG15L    COMP  PIC  S9(4).
           02  FMPAG15F    PICTURE X.
           02  FILLER REDEFINES FMPAG15F.
             03 FMPAG15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG15I  PIC X(2).
           02  FMTPG15L    COMP  PIC  S9(4).
           02  FMTPG15F    PICTURE X.
           02  FILLER REDEFINES FMTPG15F.
             03 FMTPG15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG15I  PIC X(2).
           02  FMCOMPPL    COMP  PIC  S9(4).
           02  FMCOMPPF    PICTURE X.
           02  FILLER REDEFINES FMCOMPPF.
             03 FMCOMPPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPPI  PIC X(4).
           02  FMCCRANL    COMP  PIC  S9(4).
           02  FMCCRANF    PICTURE X.
           02  FILLER REDEFINES FMCCRANF.
             03 FMCCRANA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRANI  PIC X(4).
           02  FMCCRSNL    COMP  PIC  S9(4).
           02  FMCCRSNF    PICTURE X.
           02  FILLER REDEFINES FMCCRSNF.
             03 FMCCRSNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRSNI  PIC X(4).
           02  FMCCRFNL    COMP  PIC  S9(4).
           02  FMCCRFNF    PICTURE X.
           02  FILLER REDEFINES FMCCRFNF.
             03 FMCCRFNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCRFNI  PIC X(4).
           02  FMPFS16L    COMP  PIC  S9(4).
           02  FMPFS16F    PICTURE X.
           02  FILLER REDEFINES FMPFS16F.
             03 FMPFS16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS16I  PIC X(79).
           02  FMERR16L    COMP  PIC  S9(4).
           02  FMERR16F    PICTURE X.
           02  FILLER REDEFINES FMERR16F.
             03 FMERR16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR16I  PIC X(79).
       01  FMC1M16O REDEFINES FMC1M16I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANPC    PICTURE X.
           02  FMTRANPP    PICTURE X.
           02  FMTRANPH    PICTURE X.
           02  FMTRANPV    PICTURE X.
           02  FMTRANPO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEPC    PICTURE X.
           02  FMDATEPP    PICTURE X.
           02  FMDATEPH    PICTURE X.
           02  FMDATEPV    PICTURE X.
           02  FMDATEPO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEPC    PICTURE X.
           02  FMTIMEPP    PICTURE X.
           02  FMTIMEPH    PICTURE X.
           02  FMTIMEPV    PICTURE X.
           02  FMTIMEPO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG15C    PICTURE X.
           02  FMPAG15P    PICTURE X.
           02  FMPAG15H    PICTURE X.
           02  FMPAG15V    PICTURE X.
           02  FMPAG15O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG15C    PICTURE X.
           02  FMTPG15P    PICTURE X.
           02  FMTPG15H    PICTURE X.
           02  FMTPG15V    PICTURE X.
           02  FMTPG15O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPPC    PICTURE X.
           02  FMCOMPPP    PICTURE X.
           02  FMCOMPPH    PICTURE X.
           02  FMCOMPPV    PICTURE X.
           02  FMCOMPPO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCCRANC    PICTURE X.
           02  FMCCRANP    PICTURE X.
           02  FMCCRANH    PICTURE X.
           02  FMCCRANV    PICTURE X.
           02  FMCCRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCCRSNC    PICTURE X.
           02  FMCCRSNP    PICTURE X.
           02  FMCCRSNH    PICTURE X.
           02  FMCCRSNV    PICTURE X.
           02  FMCCRSNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCCRFNC    PICTURE X.
           02  FMCCRFNP    PICTURE X.
           02  FMCCRFNH    PICTURE X.
           02  FMCCRFNV    PICTURE X.
           02  FMCCRFNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMPFS16C    PICTURE X.
           02  FMPFS16P    PICTURE X.
           02  FMPFS16H    PICTURE X.
           02  FMPFS16V    PICTURE X.
           02  FMPFS16O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR16C    PICTURE X.
           02  FMERR16P    PICTURE X.
           02  FMERR16H    PICTURE X.
           02  FMERR16V    PICTURE X.
           02  FMERR16O  PIC X(79).
       01  FMC1M17I REDEFINES FMC1M12I.
           02  FILLER PIC X(12).
           02  FMTRANQL    COMP  PIC  S9(4).
           02  FMTRANQF    PICTURE X.
           02  FILLER REDEFINES FMTRANQF.
             03 FMTRANQA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANQI  PIC X(4).
           02  FMDATEQL    COMP  PIC  S9(4).
           02  FMDATEQF    PICTURE X.
           02  FILLER REDEFINES FMDATEQF.
             03 FMDATEQA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEQI  PIC X(8).
           02  FMTIMEQL    COMP  PIC  S9(4).
           02  FMTIMEQF    PICTURE X.
           02  FILLER REDEFINES FMTIMEQF.
             03 FMTIMEQA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEQI  PIC X(8).
           02  FMPAG16L    COMP  PIC  S9(4).
           02  FMPAG16F    PICTURE X.
           02  FILLER REDEFINES FMPAG16F.
             03 FMPAG16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPAG16I  PIC X(2).
           02  FMTPG16L    COMP  PIC  S9(4).
           02  FMTPG16F    PICTURE X.
           02  FILLER REDEFINES FMTPG16F.
             03 FMTPG16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTPG16I  PIC X(2).
           02  FMCOMPQL    COMP  PIC  S9(4).
           02  FMCOMPQF    PICTURE X.
           02  FILLER REDEFINES FMCOMPQF.
             03 FMCOMPQA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPQI  PIC X(4).
           02  FMCC167L    COMP  PIC  S9(4).
           02  FMCC167F    PICTURE X.
           02  FILLER REDEFINES FMCC167F.
             03 FMCC167A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC167I  PIC X(6).
           02  FMCC168L    COMP  PIC  S9(4).
           02  FMCC168F    PICTURE X.
           02  FILLER REDEFINES FMCC168F.
             03 FMCC168A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC168I  PIC X(23).
           02  FMCC171L    COMP  PIC  S9(4).
           02  FMCC171F    PICTURE X.
           02  FILLER REDEFINES FMCC171F.
             03 FMCC171A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC171I  PIC X(6).
           02  FMCC172L    COMP  PIC  S9(4).
           02  FMCC172F    PICTURE X.
           02  FILLER REDEFINES FMCC172F.
             03 FMCC172A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC172I  PIC X(23).
           02  FMCC169L    COMP  PIC  S9(4).
           02  FMCC169F    PICTURE X.
           02  FILLER REDEFINES FMCC169F.
             03 FMCC169A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC169I  PIC X(6).
           02  FMCC170L    COMP  PIC  S9(4).
           02  FMCC170F    PICTURE X.
           02  FILLER REDEFINES FMCC170F.
             03 FMCC170A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC170I  PIC X(23).
           02  FMCC175L    COMP  PIC  S9(4).
           02  FMCC175F    PICTURE X.
           02  FILLER REDEFINES FMCC175F.
             03 FMCC175A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC175I  PIC X(6).
           02  FMCC176L    COMP  PIC  S9(4).
           02  FMCC176F    PICTURE X.
           02  FILLER REDEFINES FMCC176F.
             03 FMCC176A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC176I  PIC X(23).
           02  FMCC146L    COMP  PIC  S9(4).
           02  FMCC146F    PICTURE X.
           02  FILLER REDEFINES FMCC146F.
             03 FMCC146A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC146I  PIC X(6).
           02  FMCC173L    COMP  PIC  S9(4).
           02  FMCC173F    PICTURE X.
           02  FILLER REDEFINES FMCC173F.
             03 FMCC173A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC173I  PIC X(6).
           02  FMCC174L    COMP  PIC  S9(4).
           02  FMCC174F    PICTURE X.
           02  FILLER REDEFINES FMCC174F.
             03 FMCC174A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC174I  PIC X(23).
           02  FMCC181L    COMP  PIC  S9(4).
           02  FMCC181F    PICTURE X.
           02  FILLER REDEFINES FMCC181F.
             03 FMCC181A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC181I  PIC X(23).
           02  FMCC182L    COMP  PIC  S9(4).
           02  FMCC182F    PICTURE X.
           02  FILLER REDEFINES FMCC182F.
             03 FMCC182A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC182I  PIC X(23).
           02  FMCC179L    COMP  PIC  S9(4).
           02  FMCC179F    PICTURE X.
           02  FILLER REDEFINES FMCC179F.
             03 FMCC179A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC179I  PIC X(22).
           02  FMCC180L    COMP  PIC  S9(4).
           02  FMCC180F    PICTURE X.
           02  FILLER REDEFINES FMCC180F.
             03 FMCC180A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC180I  PIC X(22).
           02  FMCC140L    COMP  PIC  S9(4).
           02  FMCC140F    PICTURE X.
           02  FILLER REDEFINES FMCC140F.
             03 FMCC140A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC140I  PIC X(9).
           02  FMCC145L    COMP  PIC  S9(4).
           02  FMCC145F    PICTURE X.
           02  FILLER REDEFINES FMCC145F.
             03 FMCC145A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC145I  PIC X(3).
           02  FMCC142L    COMP  PIC  S9(4).
           02  FMCC142F    PICTURE X.
           02  FILLER REDEFINES FMCC142F.
             03 FMCC142A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCC142I  PIC X(3).
           02  FMCCMC1L    COMP  PIC  S9(4).
           02  FMCCMC1F    PICTURE X.
           02  FILLER REDEFINES FMCCMC1F.
             03 FMCCMC1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC1I  PIC X(3).
           02  FMCCMC2L    COMP  PIC  S9(4).
           02  FMCCMC2F    PICTURE X.
           02  FILLER REDEFINES FMCCMC2F.
             03 FMCCMC2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCCMC2I  PIC X(3).
           02  FMPFS17L    COMP  PIC  S9(4).
           02  FMPFS17F    PICTURE X.
           02  FILLER REDEFINES FMPFS17F.
             03 FMPFS17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS17I  PIC X(79).
           02  FMERR17L    COMP  PIC  S9(4).
           02  FMERR17F    PICTURE X.
           02  FILLER REDEFINES FMERR17F.
             03 FMERR17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR17I  PIC X(79).
       01  FMC1M17O REDEFINES FMC1M17I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANQC    PICTURE X.
           02  FMTRANQP    PICTURE X.
           02  FMTRANQH    PICTURE X.
           02  FMTRANQV    PICTURE X.
           02  FMTRANQO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEQC    PICTURE X.
           02  FMDATEQP    PICTURE X.
           02  FMDATEQH    PICTURE X.
           02  FMDATEQV    PICTURE X.
           02  FMDATEQO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEQC    PICTURE X.
           02  FMTIMEQP    PICTURE X.
           02  FMTIMEQH    PICTURE X.
           02  FMTIMEQV    PICTURE X.
           02  FMTIMEQO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMPAG16C    PICTURE X.
           02  FMPAG16P    PICTURE X.
           02  FMPAG16H    PICTURE X.
           02  FMPAG16V    PICTURE X.
           02  FMPAG16O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMTPG16C    PICTURE X.
           02  FMTPG16P    PICTURE X.
           02  FMTPG16H    PICTURE X.
           02  FMTPG16V    PICTURE X.
           02  FMTPG16O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPQC    PICTURE X.
           02  FMCOMPQP    PICTURE X.
           02  FMCOMPQH    PICTURE X.
           02  FMCOMPQV    PICTURE X.
           02  FMCOMPQO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCC167C    PICTURE X.
           02  FMCC167P    PICTURE X.
           02  FMCC167H    PICTURE X.
           02  FMCC167V    PICTURE X.
           02  FMCC167O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCC168C    PICTURE X.
           02  FMCC168P    PICTURE X.
           02  FMCC168H    PICTURE X.
           02  FMCC168V    PICTURE X.
           02  FMCC168O  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMCC171C    PICTURE X.
           02  FMCC171P    PICTURE X.
           02  FMCC171H    PICTURE X.
           02  FMCC171V    PICTURE X.
           02  FMCC171O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCC172C    PICTURE X.
           02  FMCC172P    PICTURE X.
           02  FMCC172H    PICTURE X.
           02  FMCC172V    PICTURE X.
           02  FMCC172O  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMCC169C    PICTURE X.
           02  FMCC169P    PICTURE X.
           02  FMCC169H    PICTURE X.
           02  FMCC169V    PICTURE X.
           02  FMCC169O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCC170C    PICTURE X.
           02  FMCC170P    PICTURE X.
           02  FMCC170H    PICTURE X.
           02  FMCC170V    PICTURE X.
           02  FMCC170O  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMCC175C    PICTURE X.
           02  FMCC175P    PICTURE X.
           02  FMCC175H    PICTURE X.
           02  FMCC175V    PICTURE X.
           02  FMCC175O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCC176C    PICTURE X.
           02  FMCC176P    PICTURE X.
           02  FMCC176H    PICTURE X.
           02  FMCC176V    PICTURE X.
           02  FMCC176O  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMCC146C    PICTURE X.
           02  FMCC146P    PICTURE X.
           02  FMCC146H    PICTURE X.
           02  FMCC146V    PICTURE X.
           02  FMCC146O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCC173C    PICTURE X.
           02  FMCC173P    PICTURE X.
           02  FMCC173H    PICTURE X.
           02  FMCC173V    PICTURE X.
           02  FMCC173O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  FMCC174C    PICTURE X.
           02  FMCC174P    PICTURE X.
           02  FMCC174H    PICTURE X.
           02  FMCC174V    PICTURE X.
           02  FMCC174O  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMCC181C    PICTURE X.
           02  FMCC181P    PICTURE X.
           02  FMCC181H    PICTURE X.
           02  FMCC181V    PICTURE X.
           02  FMCC181O  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMCC182C    PICTURE X.
           02  FMCC182P    PICTURE X.
           02  FMCC182H    PICTURE X.
           02  FMCC182V    PICTURE X.
           02  FMCC182O  PIC X(23).
           02  FILLER PICTURE X(3).
           02  FMCC179C    PICTURE X.
           02  FMCC179P    PICTURE X.
           02  FMCC179H    PICTURE X.
           02  FMCC179V    PICTURE X.
           02  FMCC179O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMCC180C    PICTURE X.
           02  FMCC180P    PICTURE X.
           02  FMCC180H    PICTURE X.
           02  FMCC180V    PICTURE X.
           02  FMCC180O  PIC X(22).
           02  FILLER PICTURE X(3).
           02  FMCC140C    PICTURE X.
           02  FMCC140P    PICTURE X.
           02  FMCC140H    PICTURE X.
           02  FMCC140V    PICTURE X.
           02  FMCC140O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  FMCC145C    PICTURE X.
           02  FMCC145P    PICTURE X.
           02  FMCC145H    PICTURE X.
           02  FMCC145V    PICTURE X.
           02  FMCC145O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMCC142C    PICTURE X.
           02  FMCC142P    PICTURE X.
           02  FMCC142H    PICTURE X.
           02  FMCC142V    PICTURE X.
           02  FMCC142O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMCCMC1C    PICTURE X.
           02  FMCCMC1P    PICTURE X.
           02  FMCCMC1H    PICTURE X.
           02  FMCCMC1V    PICTURE X.
           02  FMCCMC1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMCCMC2C    PICTURE X.
           02  FMCCMC2P    PICTURE X.
           02  FMCCMC2H    PICTURE X.
           02  FMCCMC2V    PICTURE X.
           02  FMCCMC2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FMPFS17C    PICTURE X.
           02  FMPFS17P    PICTURE X.
           02  FMPFS17H    PICTURE X.
           02  FMPFS17V    PICTURE X.
           02  FMPFS17O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR17C    PICTURE X.
           02  FMERR17P    PICTURE X.
           02  FMERR17H    PICTURE X.
           02  FMERR17V    PICTURE X.
           02  FMERR17O  PIC X(79).