       01  FMH1M03I.
           02  FILLER PIC X(12).
           02  FMTRANCL    COMP  PIC  S9(4).
           02  FMTRANCF    PICTURE X.
           02  FILLER REDEFINES FMTRANCF.
             03 FMTRANCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANCI  PIC X(4).
           02  FMDATECL    COMP  PIC  S9(4).
           02  FMDATECF    PICTURE X.
           02  FILLER REDEFINES FMDATECF.
             03 FMDATECA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATECI  PIC X(8).
           02  FMTIMECL    COMP  PIC  S9(4).
           02  FMTIMECF    PICTURE X.
           02  FILLER REDEFINES FMTIMECF.
             03 FMTIMECA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMECI  PIC X(8).
           02  FMRCNBCL    COMP  PIC  S9(4).
           02  FMRCNBCF    PICTURE X.
           02  FILLER REDEFINES FMRCNBCF.
             03 FMRCNBCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCNBCI  PIC X(10).
           02  FMSTRUCL    COMP  PIC  S9(4).
           02  FMSTRUCF    PICTURE X.
           02  FILLER REDEFINES FMSTRUCF.
             03 FMSTRUCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSTRUCI  PIC X(1).
           02  FMCMPLCL    COMP  PIC  S9(4).
           02  FMCMPLCF    PICTURE X.
           02  FILLER REDEFINES FMCMPLCF.
             03 FMCMPLCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCMPLCI  PIC X(2).
           02  FMCOMPCL    COMP  PIC  S9(4).
           02  FMCOMPCF    PICTURE X.
           02  FILLER REDEFINES FMCOMPCF.
             03 FMCOMPCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPCI  PIC X(4).
           02  FMSPCLCL    COMP  PIC  S9(4).
           02  FMSPCLCF    PICTURE X.
           02  FILLER REDEFINES FMSPCLCF.
             03 FMSPCLCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPCLCI  PIC X(7).
           02  FMSPCOCL    COMP  PIC  S9(4).
           02  FMSPCOCF    PICTURE X.
           02  FILLER REDEFINES FMSPCOCF.
             03 FMSPCOCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPCOCI  PIC X(4).
           02  FMACTNCL    COMP  PIC  S9(4).
           02  FMACTNCF    PICTURE X.
           02  FILLER REDEFINES FMACTNCF.
             03 FMACTNCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACTNCI  PIC X(1).
           02  FMRC06FL    COMP  PIC  S9(4).
           02  FMRC06FF    PICTURE X.
           02  FILLER REDEFINES FMRC06FF.
             03 FMRC06FA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC06FI  PIC X(1).
           02  FMRC06SL    COMP  PIC  S9(4).
           02  FMRC06SF    PICTURE X.
           02  FILLER REDEFINES FMRC06SF.
             03 FMRC06SA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC06SI  PIC X(1).
           02  FMSLT01L    COMP  PIC  S9(4).
           02  FMSLT01F    PICTURE X.
           02  FILLER REDEFINES FMSLT01F.
             03 FMSLT01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT01I  PIC X(20).
           02  FMRC026L    COMP  PIC  S9(4).
           02  FMRC026F    PICTURE X.
           02  FILLER REDEFINES FMRC026F.
             03 FMRC026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC026I  PIC X(1).
           02  FMRC007L    COMP  PIC  S9(4).
           02  FMRC007F    PICTURE X.
           02  FILLER REDEFINES FMRC007F.
             03 FMRC007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC007I  PIC X(1).
           02  FMSLT02L    COMP  PIC  S9(4).
           02  FMSLT02F    PICTURE X.
           02  FILLER REDEFINES FMSLT02F.
             03 FMSLT02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT02I  PIC X(20).
           02  FMRC027L    COMP  PIC  S9(4).
           02  FMRC027F    PICTURE X.
           02  FILLER REDEFINES FMRC027F.
             03 FMRC027A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC027I  PIC X(1).
           02  FMRC008L    COMP  PIC  S9(4).
           02  FMRC008F    PICTURE X.
           02  FILLER REDEFINES FMRC008F.
             03 FMRC008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC008I  PIC X(1).
           02  FMSLT03L    COMP  PIC  S9(4).
           02  FMSLT03F    PICTURE X.
           02  FILLER REDEFINES FMSLT03F.
             03 FMSLT03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT03I  PIC X(20).
           02  FMRC028L    COMP  PIC  S9(4).
           02  FMRC028F    PICTURE X.
           02  FILLER REDEFINES FMRC028F.
             03 FMRC028A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC028I  PIC X(1).
           02  FMRC009L    COMP  PIC  S9(4).
           02  FMRC009F    PICTURE X.
           02  FILLER REDEFINES FMRC009F.
             03 FMRC009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC009I  PIC X(1).
           02  FMSLT04L    COMP  PIC  S9(4).
           02  FMSLT04F    PICTURE X.
           02  FILLER REDEFINES FMSLT04F.
             03 FMSLT04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT04I  PIC X(20).
           02  FMRC3AFL    COMP  PIC  S9(4).
           02  FMRC3AFF    PICTURE X.
           02  FILLER REDEFINES FMRC3AFF.
             03 FMRC3AFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC3AFI  PIC X(1).
           02  FMRC3ASL    COMP  PIC  S9(4).
           02  FMRC3ASF    PICTURE X.
           02  FILLER REDEFINES FMRC3ASF.
             03 FMRC3ASA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC3ASI  PIC X(1).
           02  FMSLT05L    COMP  PIC  S9(4).
           02  FMSLT05F    PICTURE X.
           02  FILLER REDEFINES FMSLT05F.
             03 FMSLT05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT05I  PIC X(20).
           02  FMRC3UFL    COMP  PIC  S9(4).
           02  FMRC3UFF    PICTURE X.
           02  FILLER REDEFINES FMRC3UFF.
             03 FMRC3UFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC3UFI  PIC X(1).
           02  FMRC3USL    COMP  PIC  S9(4).
           02  FMRC3USF    PICTURE X.
           02  FILLER REDEFINES FMRC3USF.
             03 FMRC3USA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC3USI  PIC X(1).
           02  FMSLT06L    COMP  PIC  S9(4).
           02  FMSLT06F    PICTURE X.
           02  FILLER REDEFINES FMSLT06F.
             03 FMSLT06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT06I  PIC X(20).
           02  FMRC6AFL    COMP  PIC  S9(4).
           02  FMRC6AFF    PICTURE X.
           02  FILLER REDEFINES FMRC6AFF.
             03 FMRC6AFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC6AFI  PIC X(1).
           02  FMRC6ASL    COMP  PIC  S9(4).
           02  FMRC6ASF    PICTURE X.
           02  FILLER REDEFINES FMRC6ASF.
             03 FMRC6ASA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC6ASI  PIC X(1).
           02  FMSLT07L    COMP  PIC  S9(4).
           02  FMSLT07F    PICTURE X.
           02  FILLER REDEFINES FMSLT07F.
             03 FMSLT07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT07I  PIC X(20).
           02  FMRC6BFL    COMP  PIC  S9(4).
           02  FMRC6BFF    PICTURE X.
           02  FILLER REDEFINES FMRC6BFF.
             03 FMRC6BFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC6BFI  PIC X(1).
           02  FMRC6BSL    COMP  PIC  S9(4).
           02  FMRC6BSF    PICTURE X.
           02  FILLER REDEFINES FMRC6BSF.
             03 FMRC6BSA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC6BSI  PIC X(1).
           02  FMSLT08L    COMP  PIC  S9(4).
           02  FMSLT08F    PICTURE X.
           02  FILLER REDEFINES FMSLT08F.
             03 FMSLT08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT08I  PIC X(20).
           02  FMRC032L    COMP  PIC  S9(4).
           02  FMRC032F    PICTURE X.
           02  FILLER REDEFINES FMRC032F.
             03 FMRC032A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC032I  PIC X(1).
           02  FMRC013L    COMP  PIC  S9(4).
           02  FMRC013F    PICTURE X.
           02  FILLER REDEFINES FMRC013F.
             03 FMRC013A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC013I  PIC X(1).
           02  FMSLT09L    COMP  PIC  S9(4).
           02  FMSLT09F    PICTURE X.
           02  FILLER REDEFINES FMSLT09F.
             03 FMSLT09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT09I  PIC X(20).
           02  FMRC033L    COMP  PIC  S9(4).
           02  FMRC033F    PICTURE X.
           02  FILLER REDEFINES FMRC033F.
             03 FMRC033A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC033I  PIC X(1).
           02  FMRC014L    COMP  PIC  S9(4).
           02  FMRC014F    PICTURE X.
           02  FILLER REDEFINES FMRC014F.
             03 FMRC014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC014I  PIC X(1).
           02  FMSLT10L    COMP  PIC  S9(4).
           02  FMSLT10F    PICTURE X.
           02  FILLER REDEFINES FMSLT10F.
             03 FMSLT10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT10I  PIC X(20).
           02  FMRC034L    COMP  PIC  S9(4).
           02  FMRC034F    PICTURE X.
           02  FILLER REDEFINES FMRC034F.
             03 FMRC034A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC034I  PIC X(1).
           02  FMRC015L    COMP  PIC  S9(4).
           02  FMRC015F    PICTURE X.
           02  FILLER REDEFINES FMRC015F.
             03 FMRC015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC015I  PIC X(1).
           02  FMSLT11L    COMP  PIC  S9(4).
           02  FMSLT11F    PICTURE X.
           02  FILLER REDEFINES FMSLT11F.
             03 FMSLT11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT11I  PIC X(20).
           02  FMRC035L    COMP  PIC  S9(4).
           02  FMRC035F    PICTURE X.
           02  FILLER REDEFINES FMRC035F.
             03 FMRC035A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC035I  PIC X(1).
           02  FMRC016L    COMP  PIC  S9(4).
           02  FMRC016F    PICTURE X.
           02  FILLER REDEFINES FMRC016F.
             03 FMRC016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC016I  PIC X(1).
           02  FMSLT12L    COMP  PIC  S9(4).
           02  FMSLT12F    PICTURE X.
           02  FILLER REDEFINES FMSLT12F.
             03 FMSLT12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT12I  PIC X(20).
           02  FMRC036L    COMP  PIC  S9(4).
           02  FMRC036F    PICTURE X.
           02  FILLER REDEFINES FMRC036F.
             03 FMRC036A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC036I  PIC X(1).
           02  FMRC017L    COMP  PIC  S9(4).
           02  FMRC017F    PICTURE X.
           02  FILLER REDEFINES FMRC017F.
             03 FMRC017A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC017I  PIC X(1).
           02  FMSLT13L    COMP  PIC  S9(4).
           02  FMSLT13F    PICTURE X.
           02  FILLER REDEFINES FMSLT13F.
             03 FMSLT13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT13I  PIC X(20).
           02  FMRC037L    COMP  PIC  S9(4).
           02  FMRC037F    PICTURE X.
           02  FILLER REDEFINES FMRC037F.
             03 FMRC037A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC037I  PIC X(1).
           02  FMRC018L    COMP  PIC  S9(4).
           02  FMRC018F    PICTURE X.
           02  FILLER REDEFINES FMRC018F.
             03 FMRC018A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC018I  PIC X(1).
           02  FMSLT14L    COMP  PIC  S9(4).
           02  FMSLT14F    PICTURE X.
           02  FILLER REDEFINES FMSLT14F.
             03 FMSLT14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT14I  PIC X(20).
           02  FMRC038L    COMP  PIC  S9(4).
           02  FMRC038F    PICTURE X.
           02  FILLER REDEFINES FMRC038F.
             03 FMRC038A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC038I  PIC X(1).
           02  FMRC019L    COMP  PIC  S9(4).
           02  FMRC019F    PICTURE X.
           02  FILLER REDEFINES FMRC019F.
             03 FMRC019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC019I  PIC X(1).
           02  FMSLT15L    COMP  PIC  S9(4).
           02  FMSLT15F    PICTURE X.
           02  FILLER REDEFINES FMSLT15F.
             03 FMSLT15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT15I  PIC X(20).
           02  FMRC039L    COMP  PIC  S9(4).
           02  FMRC039F    PICTURE X.
           02  FILLER REDEFINES FMRC039F.
             03 FMRC039A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC039I  PIC X(1).
           02  FMRC020L    COMP  PIC  S9(4).
           02  FMRC020F    PICTURE X.
           02  FILLER REDEFINES FMRC020F.
             03 FMRC020A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC020I  PIC X(1).
           02  FMSLT16L    COMP  PIC  S9(4).
           02  FMSLT16F    PICTURE X.
           02  FILLER REDEFINES FMSLT16F.
             03 FMSLT16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT16I  PIC X(20).
           02  FMRC040L    COMP  PIC  S9(4).
           02  FMRC040F    PICTURE X.
           02  FILLER REDEFINES FMRC040F.
             03 FMRC040A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC040I  PIC X(1).
           02  FMRC021L    COMP  PIC  S9(4).
           02  FMRC021F    PICTURE X.
           02  FILLER REDEFINES FMRC021F.
             03 FMRC021A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC021I  PIC X(1).
           02  FMSLT17L    COMP  PIC  S9(4).
           02  FMSLT17F    PICTURE X.
           02  FILLER REDEFINES FMSLT17F.
             03 FMSLT17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT17I  PIC X(20).
           02  FMRC041L    COMP  PIC  S9(4).
           02  FMRC041F    PICTURE X.
           02  FILLER REDEFINES FMRC041F.
             03 FMRC041A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC041I  PIC X(1).
           02  FMRC022L    COMP  PIC  S9(4).
           02  FMRC022F    PICTURE X.
           02  FILLER REDEFINES FMRC022F.
             03 FMRC022A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC022I  PIC X(1).
           02  FMSLT18L    COMP  PIC  S9(4).
           02  FMSLT18F    PICTURE X.
           02  FILLER REDEFINES FMSLT18F.
             03 FMSLT18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSLT18I  PIC X(20).
           02  FMRC965L    COMP  PIC  S9(4).
           02  FMRC965F    PICTURE X.
           02  FILLER REDEFINES FMRC965F.
             03 FMRC965A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC965I  PIC X(50).
           02  FMRC970L    COMP  PIC  S9(4).
           02  FMRC970F    PICTURE X.
           02  FILLER REDEFINES FMRC970F.
             03 FMRC970A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC970I  PIC X(50).
           02  FMPFS03L    COMP  PIC  S9(4).
           02  FMPFS03F    PICTURE X.
           02  FILLER REDEFINES FMPFS03F.
             03 FMPFS03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS03I  PIC X(79).
           02  FMERR03L    COMP  PIC  S9(4).
           02  FMERR03F    PICTURE X.
           02  FILLER REDEFINES FMERR03F.
             03 FMERR03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR03I  PIC X(79).
       01  FMH1M03O REDEFINES FMH1M03I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANCC    PICTURE X.
           02  FMTRANCP    PICTURE X.
           02  FMTRANCH    PICTURE X.
           02  FMTRANCV    PICTURE X.
           02  FMTRANCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATECC    PICTURE X.
           02  FMDATECP    PICTURE X.
           02  FMDATECH    PICTURE X.
           02  FMDATECV    PICTURE X.
           02  FMDATECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMECC    PICTURE X.
           02  FMTIMECP    PICTURE X.
           02  FMTIMECH    PICTURE X.
           02  FMTIMECV    PICTURE X.
           02  FMTIMECO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCNBCC    PICTURE X.
           02  FMRCNBCP    PICTURE X.
           02  FMRCNBCH    PICTURE X.
           02  FMRCNBCV    PICTURE X.
           02  FMRCNBCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMSTRUCC    PICTURE X.
           02  FMSTRUCP    PICTURE X.
           02  FMSTRUCH    PICTURE X.
           02  FMSTRUCV    PICTURE X.
           02  FMSTRUCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCMPLCC    PICTURE X.
           02  FMCMPLCP    PICTURE X.
           02  FMCMPLCH    PICTURE X.
           02  FMCMPLCV    PICTURE X.
           02  FMCMPLCO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPCC    PICTURE X.
           02  FMCOMPCP    PICTURE X.
           02  FMCOMPCH    PICTURE X.
           02  FMCOMPCV    PICTURE X.
           02  FMCOMPCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMSPCLCC    PICTURE X.
           02  FMSPCLCP    PICTURE X.
           02  FMSPCLCH    PICTURE X.
           02  FMSPCLCV    PICTURE X.
           02  FMSPCLCO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMSPCOCC    PICTURE X.
           02  FMSPCOCP    PICTURE X.
           02  FMSPCOCH    PICTURE X.
           02  FMSPCOCV    PICTURE X.
           02  FMSPCOCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACTNCC    PICTURE X.
           02  FMACTNCP    PICTURE X.
           02  FMACTNCH    PICTURE X.
           02  FMACTNCV    PICTURE X.
           02  FMACTNCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC06FC    PICTURE X.
           02  FMRC06FP    PICTURE X.
           02  FMRC06FH    PICTURE X.
           02  FMRC06FV    PICTURE X.
           02  FMRC06FO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC06SC    PICTURE X.
           02  FMRC06SP    PICTURE X.
           02  FMRC06SH    PICTURE X.
           02  FMRC06SV    PICTURE X.
           02  FMRC06SO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT01C    PICTURE X.
           02  FMSLT01P    PICTURE X.
           02  FMSLT01H    PICTURE X.
           02  FMSLT01V    PICTURE X.
           02  FMSLT01O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC026C    PICTURE X.
           02  FMRC026P    PICTURE X.
           02  FMRC026H    PICTURE X.
           02  FMRC026V    PICTURE X.
           02  FMRC026O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC007C    PICTURE X.
           02  FMRC007P    PICTURE X.
           02  FMRC007H    PICTURE X.
           02  FMRC007V    PICTURE X.
           02  FMRC007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT02C    PICTURE X.
           02  FMSLT02P    PICTURE X.
           02  FMSLT02H    PICTURE X.
           02  FMSLT02V    PICTURE X.
           02  FMSLT02O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC027C    PICTURE X.
           02  FMRC027P    PICTURE X.
           02  FMRC027H    PICTURE X.
           02  FMRC027V    PICTURE X.
           02  FMRC027O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC008C    PICTURE X.
           02  FMRC008P    PICTURE X.
           02  FMRC008H    PICTURE X.
           02  FMRC008V    PICTURE X.
           02  FMRC008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT03C    PICTURE X.
           02  FMSLT03P    PICTURE X.
           02  FMSLT03H    PICTURE X.
           02  FMSLT03V    PICTURE X.
           02  FMSLT03O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC028C    PICTURE X.
           02  FMRC028P    PICTURE X.
           02  FMRC028H    PICTURE X.
           02  FMRC028V    PICTURE X.
           02  FMRC028O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC009C    PICTURE X.
           02  FMRC009P    PICTURE X.
           02  FMRC009H    PICTURE X.
           02  FMRC009V    PICTURE X.
           02  FMRC009O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT04C    PICTURE X.
           02  FMSLT04P    PICTURE X.
           02  FMSLT04H    PICTURE X.
           02  FMSLT04V    PICTURE X.
           02  FMSLT04O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC3AFC    PICTURE X.
           02  FMRC3AFP    PICTURE X.
           02  FMRC3AFH    PICTURE X.
           02  FMRC3AFV    PICTURE X.
           02  FMRC3AFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC3ASC    PICTURE X.
           02  FMRC3ASP    PICTURE X.
           02  FMRC3ASH    PICTURE X.
           02  FMRC3ASV    PICTURE X.
           02  FMRC3ASO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT05C    PICTURE X.
           02  FMSLT05P    PICTURE X.
           02  FMSLT05H    PICTURE X.
           02  FMSLT05V    PICTURE X.
           02  FMSLT05O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC3UFC    PICTURE X.
           02  FMRC3UFP    PICTURE X.
           02  FMRC3UFH    PICTURE X.
           02  FMRC3UFV    PICTURE X.
           02  FMRC3UFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC3USC    PICTURE X.
           02  FMRC3USP    PICTURE X.
           02  FMRC3USH    PICTURE X.
           02  FMRC3USV    PICTURE X.
           02  FMRC3USO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT06C    PICTURE X.
           02  FMSLT06P    PICTURE X.
           02  FMSLT06H    PICTURE X.
           02  FMSLT06V    PICTURE X.
           02  FMSLT06O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC6AFC    PICTURE X.
           02  FMRC6AFP    PICTURE X.
           02  FMRC6AFH    PICTURE X.
           02  FMRC6AFV    PICTURE X.
           02  FMRC6AFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC6ASC    PICTURE X.
           02  FMRC6ASP    PICTURE X.
           02  FMRC6ASH    PICTURE X.
           02  FMRC6ASV    PICTURE X.
           02  FMRC6ASO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT07C    PICTURE X.
           02  FMSLT07P    PICTURE X.
           02  FMSLT07H    PICTURE X.
           02  FMSLT07V    PICTURE X.
           02  FMSLT07O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC6BFC    PICTURE X.
           02  FMRC6BFP    PICTURE X.
           02  FMRC6BFH    PICTURE X.
           02  FMRC6BFV    PICTURE X.
           02  FMRC6BFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC6BSC    PICTURE X.
           02  FMRC6BSP    PICTURE X.
           02  FMRC6BSH    PICTURE X.
           02  FMRC6BSV    PICTURE X.
           02  FMRC6BSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT08C    PICTURE X.
           02  FMSLT08P    PICTURE X.
           02  FMSLT08H    PICTURE X.
           02  FMSLT08V    PICTURE X.
           02  FMSLT08O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC032C    PICTURE X.
           02  FMRC032P    PICTURE X.
           02  FMRC032H    PICTURE X.
           02  FMRC032V    PICTURE X.
           02  FMRC032O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC013C    PICTURE X.
           02  FMRC013P    PICTURE X.
           02  FMRC013H    PICTURE X.
           02  FMRC013V    PICTURE X.
           02  FMRC013O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT09C    PICTURE X.
           02  FMSLT09P    PICTURE X.
           02  FMSLT09H    PICTURE X.
           02  FMSLT09V    PICTURE X.
           02  FMSLT09O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC033C    PICTURE X.
           02  FMRC033P    PICTURE X.
           02  FMRC033H    PICTURE X.
           02  FMRC033V    PICTURE X.
           02  FMRC033O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC014C    PICTURE X.
           02  FMRC014P    PICTURE X.
           02  FMRC014H    PICTURE X.
           02  FMRC014V    PICTURE X.
           02  FMRC014O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT10C    PICTURE X.
           02  FMSLT10P    PICTURE X.
           02  FMSLT10H    PICTURE X.
           02  FMSLT10V    PICTURE X.
           02  FMSLT10O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC034C    PICTURE X.
           02  FMRC034P    PICTURE X.
           02  FMRC034H    PICTURE X.
           02  FMRC034V    PICTURE X.
           02  FMRC034O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC015C    PICTURE X.
           02  FMRC015P    PICTURE X.
           02  FMRC015H    PICTURE X.
           02  FMRC015V    PICTURE X.
           02  FMRC015O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT11C    PICTURE X.
           02  FMSLT11P    PICTURE X.
           02  FMSLT11H    PICTURE X.
           02  FMSLT11V    PICTURE X.
           02  FMSLT11O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC035C    PICTURE X.
           02  FMRC035P    PICTURE X.
           02  FMRC035H    PICTURE X.
           02  FMRC035V    PICTURE X.
           02  FMRC035O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC016C    PICTURE X.
           02  FMRC016P    PICTURE X.
           02  FMRC016H    PICTURE X.
           02  FMRC016V    PICTURE X.
           02  FMRC016O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT12C    PICTURE X.
           02  FMSLT12P    PICTURE X.
           02  FMSLT12H    PICTURE X.
           02  FMSLT12V    PICTURE X.
           02  FMSLT12O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC036C    PICTURE X.
           02  FMRC036P    PICTURE X.
           02  FMRC036H    PICTURE X.
           02  FMRC036V    PICTURE X.
           02  FMRC036O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC017C    PICTURE X.
           02  FMRC017P    PICTURE X.
           02  FMRC017H    PICTURE X.
           02  FMRC017V    PICTURE X.
           02  FMRC017O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT13C    PICTURE X.
           02  FMSLT13P    PICTURE X.
           02  FMSLT13H    PICTURE X.
           02  FMSLT13V    PICTURE X.
           02  FMSLT13O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC037C    PICTURE X.
           02  FMRC037P    PICTURE X.
           02  FMRC037H    PICTURE X.
           02  FMRC037V    PICTURE X.
           02  FMRC037O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC018C    PICTURE X.
           02  FMRC018P    PICTURE X.
           02  FMRC018H    PICTURE X.
           02  FMRC018V    PICTURE X.
           02  FMRC018O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT14C    PICTURE X.
           02  FMSLT14P    PICTURE X.
           02  FMSLT14H    PICTURE X.
           02  FMSLT14V    PICTURE X.
           02  FMSLT14O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC038C    PICTURE X.
           02  FMRC038P    PICTURE X.
           02  FMRC038H    PICTURE X.
           02  FMRC038V    PICTURE X.
           02  FMRC038O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC019C    PICTURE X.
           02  FMRC019P    PICTURE X.
           02  FMRC019H    PICTURE X.
           02  FMRC019V    PICTURE X.
           02  FMRC019O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT15C    PICTURE X.
           02  FMSLT15P    PICTURE X.
           02  FMSLT15H    PICTURE X.
           02  FMSLT15V    PICTURE X.
           02  FMSLT15O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC039C    PICTURE X.
           02  FMRC039P    PICTURE X.
           02  FMRC039H    PICTURE X.
           02  FMRC039V    PICTURE X.
           02  FMRC039O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC020C    PICTURE X.
           02  FMRC020P    PICTURE X.
           02  FMRC020H    PICTURE X.
           02  FMRC020V    PICTURE X.
           02  FMRC020O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT16C    PICTURE X.
           02  FMSLT16P    PICTURE X.
           02  FMSLT16H    PICTURE X.
           02  FMSLT16V    PICTURE X.
           02  FMSLT16O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC040C    PICTURE X.
           02  FMRC040P    PICTURE X.
           02  FMRC040H    PICTURE X.
           02  FMRC040V    PICTURE X.
           02  FMRC040O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC021C    PICTURE X.
           02  FMRC021P    PICTURE X.
           02  FMRC021H    PICTURE X.
           02  FMRC021V    PICTURE X.
           02  FMRC021O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT17C    PICTURE X.
           02  FMSLT17P    PICTURE X.
           02  FMSLT17H    PICTURE X.
           02  FMSLT17V    PICTURE X.
           02  FMSLT17O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC041C    PICTURE X.
           02  FMRC041P    PICTURE X.
           02  FMRC041H    PICTURE X.
           02  FMRC041V    PICTURE X.
           02  FMRC041O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRC022C    PICTURE X.
           02  FMRC022P    PICTURE X.
           02  FMRC022H    PICTURE X.
           02  FMRC022V    PICTURE X.
           02  FMRC022O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMSLT18C    PICTURE X.
           02  FMSLT18P    PICTURE X.
           02  FMSLT18H    PICTURE X.
           02  FMSLT18V    PICTURE X.
           02  FMSLT18O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC965C    PICTURE X.
           02  FMRC965P    PICTURE X.
           02  FMRC965H    PICTURE X.
           02  FMRC965V    PICTURE X.
           02  FMRC965O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  FMRC970C    PICTURE X.
           02  FMRC970P    PICTURE X.
           02  FMRC970H    PICTURE X.
           02  FMRC970V    PICTURE X.
           02  FMRC970O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  FMPFS03C    PICTURE X.
           02  FMPFS03P    PICTURE X.
           02  FMPFS03H    PICTURE X.
           02  FMPFS03V    PICTURE X.
           02  FMPFS03O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR03C    PICTURE X.
           02  FMERR03P    PICTURE X.
           02  FMERR03H    PICTURE X.
           02  FMERR03V    PICTURE X.
           02  FMERR03O  PIC X(79).
       01  FMH1M01I REDEFINES FMH1M03I.
           02  FILLER PIC X(12).
           02  FMTRANAL    COMP  PIC  S9(4).
           02  FMTRANAF    PICTURE X.
           02  FILLER REDEFINES FMTRANAF.
             03 FMTRANAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANAI  PIC X(4).
           02  FMDATEAL    COMP  PIC  S9(4).
           02  FMDATEAF    PICTURE X.
           02  FILLER REDEFINES FMDATEAF.
             03 FMDATEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEAI  PIC X(8).
           02  FMTIMEAL    COMP  PIC  S9(4).
           02  FMTIMEAF    PICTURE X.
           02  FILLER REDEFINES FMTIMEAF.
             03 FMTIMEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEAI  PIC X(8).
           02  FMRCNBAL    COMP  PIC  S9(4).
           02  FMRCNBAF    PICTURE X.
           02  FILLER REDEFINES FMRCNBAF.
             03 FMRCNBAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCNBAI  PIC X(10).
           02  FMSTRUAL    COMP  PIC  S9(4).
           02  FMSTRUAF    PICTURE X.
           02  FILLER REDEFINES FMSTRUAF.
             03 FMSTRUAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSTRUAI  PIC X(1).
           02  FMCMPLAL    COMP  PIC  S9(4).
           02  FMCMPLAF    PICTURE X.
           02  FILLER REDEFINES FMCMPLAF.
             03 FMCMPLAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCMPLAI  PIC X(2).
           02  FMCOMPAL    COMP  PIC  S9(4).
           02  FMCOMPAF    PICTURE X.
           02  FILLER REDEFINES FMCOMPAF.
             03 FMCOMPAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPAI  PIC X(4).
           02  FMSPCLAL    COMP  PIC  S9(4).
           02  FMSPCLAF    PICTURE X.
           02  FILLER REDEFINES FMSPCLAF.
             03 FMSPCLAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPCLAI  PIC X(7).
           02  FMSPCOAL    COMP  PIC  S9(4).
           02  FMSPCOAF    PICTURE X.
           02  FILLER REDEFINES FMSPCOAF.
             03 FMSPCOAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPCOAI  PIC X(4).
           02  FMACTNAL    COMP  PIC  S9(4).
           02  FMACTNAF    PICTURE X.
           02  FILLER REDEFINES FMACTNAF.
             03 FMACTNAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACTNAI  PIC X(1).
           02  FMDLTL1L    COMP  PIC  S9(4).
           02  FMDLTL1F    PICTURE X.
           02  FILLER REDEFINES FMDLTL1F.
             03 FMDLTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDLTL1I  PIC X(20).
           02  FMDHIERL    COMP  PIC  S9(4).
           02  FMDHIERF    PICTURE X.
           02  FILLER REDEFINES FMDHIERF.
             03 FMDHIERA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDHIERI  PIC X(1).
           02  FMRCER1L    COMP  PIC  S9(4).
           02  FMRCER1F    PICTURE X.
           02  FILLER REDEFINES FMRCER1F.
             03 FMRCER1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCER1I  PIC X(79).
           02  FMPFS01L    COMP  PIC  S9(4).
           02  FMPFS01F    PICTURE X.
           02  FILLER REDEFINES FMPFS01F.
             03 FMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS01I  PIC X(79).
           02  FMERR01L    COMP  PIC  S9(4).
           02  FMERR01F    PICTURE X.
           02  FILLER REDEFINES FMERR01F.
             03 FMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR01I  PIC X(79).
       01  FMH1M01O REDEFINES FMH1M01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANAC    PICTURE X.
           02  FMTRANAP    PICTURE X.
           02  FMTRANAH    PICTURE X.
           02  FMTRANAV    PICTURE X.
           02  FMTRANAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEAC    PICTURE X.
           02  FMDATEAP    PICTURE X.
           02  FMDATEAH    PICTURE X.
           02  FMDATEAV    PICTURE X.
           02  FMDATEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEAC    PICTURE X.
           02  FMTIMEAP    PICTURE X.
           02  FMTIMEAH    PICTURE X.
           02  FMTIMEAV    PICTURE X.
           02  FMTIMEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCNBAC    PICTURE X.
           02  FMRCNBAP    PICTURE X.
           02  FMRCNBAH    PICTURE X.
           02  FMRCNBAV    PICTURE X.
           02  FMRCNBAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMSTRUAC    PICTURE X.
           02  FMSTRUAP    PICTURE X.
           02  FMSTRUAH    PICTURE X.
           02  FMSTRUAV    PICTURE X.
           02  FMSTRUAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCMPLAC    PICTURE X.
           02  FMCMPLAP    PICTURE X.
           02  FMCMPLAH    PICTURE X.
           02  FMCMPLAV    PICTURE X.
           02  FMCMPLAO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPAC    PICTURE X.
           02  FMCOMPAP    PICTURE X.
           02  FMCOMPAH    PICTURE X.
           02  FMCOMPAV    PICTURE X.
           02  FMCOMPAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMSPCLAC    PICTURE X.
           02  FMSPCLAP    PICTURE X.
           02  FMSPCLAH    PICTURE X.
           02  FMSPCLAV    PICTURE X.
           02  FMSPCLAO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMSPCOAC    PICTURE X.
           02  FMSPCOAP    PICTURE X.
           02  FMSPCOAH    PICTURE X.
           02  FMSPCOAV    PICTURE X.
           02  FMSPCOAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACTNAC    PICTURE X.
           02  FMACTNAP    PICTURE X.
           02  FMACTNAH    PICTURE X.
           02  FMACTNAV    PICTURE X.
           02  FMACTNAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMDLTL1C    PICTURE X.
           02  FMDLTL1P    PICTURE X.
           02  FMDLTL1H    PICTURE X.
           02  FMDLTL1V    PICTURE X.
           02  FMDLTL1O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMDHIERC    PICTURE X.
           02  FMDHIERP    PICTURE X.
           02  FMDHIERH    PICTURE X.
           02  FMDHIERV    PICTURE X.
           02  FMDHIERO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRCER1C    PICTURE X.
           02  FMRCER1P    PICTURE X.
           02  FMRCER1H    PICTURE X.
           02  FMRCER1V    PICTURE X.
           02  FMRCER1O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMPFS01C    PICTURE X.
           02  FMPFS01P    PICTURE X.
           02  FMPFS01H    PICTURE X.
           02  FMPFS01V    PICTURE X.
           02  FMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR01C    PICTURE X.
           02  FMERR01P    PICTURE X.
           02  FMERR01H    PICTURE X.
           02  FMERR01V    PICTURE X.
           02  FMERR01O  PIC X(79).
       01  FMH1M02I REDEFINES FMH1M03I.
           02  FILLER PIC X(12).
           02  FMTRANBL    COMP  PIC  S9(4).
           02  FMTRANBF    PICTURE X.
           02  FILLER REDEFINES FMTRANBF.
             03 FMTRANBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANBI  PIC X(4).
           02  FMDATEBL    COMP  PIC  S9(4).
           02  FMDATEBF    PICTURE X.
           02  FILLER REDEFINES FMDATEBF.
             03 FMDATEBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEBI  PIC X(8).
           02  FMTIMEBL    COMP  PIC  S9(4).
           02  FMTIMEBF    PICTURE X.
           02  FILLER REDEFINES FMTIMEBF.
             03 FMTIMEBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEBI  PIC X(8).
           02  FMRCNBBL    COMP  PIC  S9(4).
           02  FMRCNBBF    PICTURE X.
           02  FILLER REDEFINES FMRCNBBF.
             03 FMRCNBBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCNBBI  PIC X(10).
           02  FMSTRUBL    COMP  PIC  S9(4).
           02  FMSTRUBF    PICTURE X.
           02  FILLER REDEFINES FMSTRUBF.
             03 FMSTRUBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSTRUBI  PIC X(1).
           02  FMCMPLBL    COMP  PIC  S9(4).
           02  FMCMPLBF    PICTURE X.
           02  FILLER REDEFINES FMCMPLBF.
             03 FMCMPLBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCMPLBI  PIC X(2).
           02  FMCOMPBL    COMP  PIC  S9(4).
           02  FMCOMPBF    PICTURE X.
           02  FILLER REDEFINES FMCOMPBF.
             03 FMCOMPBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPBI  PIC X(4).
           02  FMSPCLBL    COMP  PIC  S9(4).
           02  FMSPCLBF    PICTURE X.
           02  FILLER REDEFINES FMSPCLBF.
             03 FMSPCLBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPCLBI  PIC X(7).
           02  FMSPCOBL    COMP  PIC  S9(4).
           02  FMSPCOBF    PICTURE X.
           02  FILLER REDEFINES FMSPCOBF.
             03 FMSPCOBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPCOBI  PIC X(4).
           02  FMACTNBL    COMP  PIC  S9(4).
           02  FMACTNBF    PICTURE X.
           02  FILLER REDEFINES FMACTNBF.
             03 FMACTNBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACTNBI  PIC X(1).
           02  FMHIERYL    COMP  PIC  S9(4).
           02  FMHIERYF    PICTURE X.
           02  FILLER REDEFINES FMHIERYF.
             03 FMHIERYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMHIERYI  PIC X(20).
           02  FMRC004L    COMP  PIC  S9(4).
           02  FMRC004F    PICTURE X.
           02  FILLER REDEFINES FMRC004F.
             03 FMRC004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRC004I  PIC X(1).
           02  FMRCHD1L    COMP  PIC  S9(4).
           02  FMRCHD1F    PICTURE X.
           02  FILLER REDEFINES FMRCHD1F.
             03 FMRCHD1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCHD1I  PIC X(40).
           02  FMRCHD2L    COMP  PIC  S9(4).
           02  FMRCHD2F    PICTURE X.
           02  FILLER REDEFINES FMRCHD2F.
             03 FMRCHD2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCHD2I  PIC X(40).
           02  FMRCHD3L    COMP  PIC  S9(4).
           02  FMRCHD3F    PICTURE X.
           02  FILLER REDEFINES FMRCHD3F.
             03 FMRCHD3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCHD3I  PIC X(40).
           02  FMRCHD4L    COMP  PIC  S9(4).
           02  FMRCHD4F    PICTURE X.
           02  FILLER REDEFINES FMRCHD4F.
             03 FMRCHD4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCHD4I  PIC X(40).
           02  FMRCHD5L    COMP  PIC  S9(4).
           02  FMRCHD5F    PICTURE X.
           02  FILLER REDEFINES FMRCHD5F.
             03 FMRCHD5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCHD5I  PIC X(40).
           02  FMRCERRL    COMP  PIC  S9(4).
           02  FMRCERRF    PICTURE X.
           02  FILLER REDEFINES FMRCERRF.
             03 FMRCERRA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMRCERRI  PIC X(79).
           02  FMPFS02L    COMP  PIC  S9(4).
           02  FMPFS02F    PICTURE X.
           02  FILLER REDEFINES FMPFS02F.
             03 FMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS02I  PIC X(79).
           02  FMERR02L    COMP  PIC  S9(4).
           02  FMERR02F    PICTURE X.
           02  FILLER REDEFINES FMERR02F.
             03 FMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR02I  PIC X(79).
       01  FMH1M02O REDEFINES FMH1M02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANBC    PICTURE X.
           02  FMTRANBP    PICTURE X.
           02  FMTRANBH    PICTURE X.
           02  FMTRANBV    PICTURE X.
           02  FMTRANBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEBC    PICTURE X.
           02  FMDATEBP    PICTURE X.
           02  FMDATEBH    PICTURE X.
           02  FMDATEBV    PICTURE X.
           02  FMDATEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEBC    PICTURE X.
           02  FMTIMEBP    PICTURE X.
           02  FMTIMEBH    PICTURE X.
           02  FMTIMEBV    PICTURE X.
           02  FMTIMEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMRCNBBC    PICTURE X.
           02  FMRCNBBP    PICTURE X.
           02  FMRCNBBH    PICTURE X.
           02  FMRCNBBV    PICTURE X.
           02  FMRCNBBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  FMSTRUBC    PICTURE X.
           02  FMSTRUBP    PICTURE X.
           02  FMSTRUBH    PICTURE X.
           02  FMSTRUBV    PICTURE X.
           02  FMSTRUBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCMPLBC    PICTURE X.
           02  FMCMPLBP    PICTURE X.
           02  FMCMPLBH    PICTURE X.
           02  FMCMPLBV    PICTURE X.
           02  FMCMPLBO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPBC    PICTURE X.
           02  FMCOMPBP    PICTURE X.
           02  FMCOMPBH    PICTURE X.
           02  FMCOMPBV    PICTURE X.
           02  FMCOMPBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMSPCLBC    PICTURE X.
           02  FMSPCLBP    PICTURE X.
           02  FMSPCLBH    PICTURE X.
           02  FMSPCLBV    PICTURE X.
           02  FMSPCLBO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMSPCOBC    PICTURE X.
           02  FMSPCOBP    PICTURE X.
           02  FMSPCOBH    PICTURE X.
           02  FMSPCOBV    PICTURE X.
           02  FMSPCOBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACTNBC    PICTURE X.
           02  FMACTNBP    PICTURE X.
           02  FMACTNBH    PICTURE X.
           02  FMACTNBV    PICTURE X.
           02  FMACTNBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMHIERYC    PICTURE X.
           02  FMHIERYP    PICTURE X.
           02  FMHIERYH    PICTURE X.
           02  FMHIERYV    PICTURE X.
           02  FMHIERYO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  FMRC004C    PICTURE X.
           02  FMRC004P    PICTURE X.
           02  FMRC004H    PICTURE X.
           02  FMRC004V    PICTURE X.
           02  FMRC004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMRCHD1C    PICTURE X.
           02  FMRCHD1P    PICTURE X.
           02  FMRCHD1H    PICTURE X.
           02  FMRCHD1V    PICTURE X.
           02  FMRCHD1O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  FMRCHD2C    PICTURE X.
           02  FMRCHD2P    PICTURE X.
           02  FMRCHD2H    PICTURE X.
           02  FMRCHD2V    PICTURE X.
           02  FMRCHD2O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  FMRCHD3C    PICTURE X.
           02  FMRCHD3P    PICTURE X.
           02  FMRCHD3H    PICTURE X.
           02  FMRCHD3V    PICTURE X.
           02  FMRCHD3O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  FMRCHD4C    PICTURE X.
           02  FMRCHD4P    PICTURE X.
           02  FMRCHD4H    PICTURE X.
           02  FMRCHD4V    PICTURE X.
           02  FMRCHD4O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  FMRCHD5C    PICTURE X.
           02  FMRCHD5P    PICTURE X.
           02  FMRCHD5H    PICTURE X.
           02  FMRCHD5V    PICTURE X.
           02  FMRCHD5O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  FMRCERRC    PICTURE X.
           02  FMRCERRP    PICTURE X.
           02  FMRCERRH    PICTURE X.
           02  FMRCERRV    PICTURE X.
           02  FMRCERRO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMPFS02C    PICTURE X.
           02  FMPFS02P    PICTURE X.
           02  FMPFS02H    PICTURE X.
           02  FMPFS02V    PICTURE X.
           02  FMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR02C    PICTURE X.
           02  FMERR02P    PICTURE X.
           02  FMERR02H    PICTURE X.
           02  FMERR02V    PICTURE X.
           02  FMERR02O  PIC X(79).