       01  FMLTM01I.
           02  FILLER PIC X(12).
           02  FMTRANAL    COMP  PIC  S9(4).
           02  FMTRANAF    PICTURE X.
           02  FILLER REDEFINES FMTRANAF.
             03 FMTRANAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANAI  PIC X(4).
           02  FMDATEAL    COMP  PIC  S9(4).
           02  FMDATEAF    PICTURE X.
           02  FILLER REDEFINES FMDATEAF.
             03 FMDATEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEAI  PIC X(8).
           02  FMTIMEAL    COMP  PIC  S9(4).
           02  FMTIMEAF    PICTURE X.
           02  FILLER REDEFINES FMTIMEAF.
             03 FMTIMEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEAI  PIC X(8).
           02  FMALLCOL    COMP  PIC  S9(4).
           02  FMALLCOF    PICTURE X.
           02  FILLER REDEFINES FMALLCOF.
             03 FMALLCOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMALLCOI  PIC X(1).
           02  FMCOMPAL    COMP  PIC  S9(4).
           02  FMCOMPAF    PICTURE X.
           02  FILLER REDEFINES FMCOMPAF.
             03 FMCOMPAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPAI  PIC X(4).
           02  FMHDG01L    COMP  PIC  S9(4).
           02  FMHDG01F    PICTURE X.
           02  FILLER REDEFINES FMHDG01F.
             03 FMHDG01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMHDG01I  PIC X(7).
           02  FMHDG02L    COMP  PIC  S9(4).
           02  FMHDG02F    PICTURE X.
           02  FILLER REDEFINES FMHDG02F.
             03 FMHDG02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMHDG02I  PIC X(7).
           02  FMHDG03L    COMP  PIC  S9(4).
           02  FMHDG03F    PICTURE X.
           02  FILLER REDEFINES FMHDG03F.
             03 FMHDG03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMHDG03I  PIC X(7).
           02  FMHDG04L    COMP  PIC  S9(4).
           02  FMHDG04F    PICTURE X.
           02  FILLER REDEFINES FMHDG04F.
             03 FMHDG04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMHDG04I  PIC X(7).
           02  FMHDG05L    COMP  PIC  S9(4).
           02  FMHDG05F    PICTURE X.
           02  FILLER REDEFINES FMHDG05F.
             03 FMHDG05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMHDG05I  PIC X(7).
           02  FMLIN01L    COMP  PIC  S9(4).
           02  FMLIN01F    PICTURE X.
           02  FILLER REDEFINES FMLIN01F.
             03 FMLIN01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN01I  PIC X(75).
           02  FMLIN02L    COMP  PIC  S9(4).
           02  FMLIN02F    PICTURE X.
           02  FILLER REDEFINES FMLIN02F.
             03 FMLIN02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN02I  PIC X(75).
           02  FMLIN03L    COMP  PIC  S9(4).
           02  FMLIN03F    PICTURE X.
           02  FILLER REDEFINES FMLIN03F.
             03 FMLIN03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN03I  PIC X(75).
           02  FMLIN04L    COMP  PIC  S9(4).
           02  FMLIN04F    PICTURE X.
           02  FILLER REDEFINES FMLIN04F.
             03 FMLIN04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN04I  PIC X(75).
           02  FMLIN05L    COMP  PIC  S9(4).
           02  FMLIN05F    PICTURE X.
           02  FILLER REDEFINES FMLIN05F.
             03 FMLIN05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN05I  PIC X(75).
           02  FMLIN06L    COMP  PIC  S9(4).
           02  FMLIN06F    PICTURE X.
           02  FILLER REDEFINES FMLIN06F.
             03 FMLIN06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN06I  PIC X(75).
           02  FMLIN07L    COMP  PIC  S9(4).
           02  FMLIN07F    PICTURE X.
           02  FILLER REDEFINES FMLIN07F.
             03 FMLIN07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN07I  PIC X(75).
           02  FMLIN08L    COMP  PIC  S9(4).
           02  FMLIN08F    PICTURE X.
           02  FILLER REDEFINES FMLIN08F.
             03 FMLIN08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN08I  PIC X(75).
           02  FMLIN09L    COMP  PIC  S9(4).
           02  FMLIN09F    PICTURE X.
           02  FILLER REDEFINES FMLIN09F.
             03 FMLIN09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN09I  PIC X(75).
           02  FMLIN10L    COMP  PIC  S9(4).
           02  FMLIN10F    PICTURE X.
           02  FILLER REDEFINES FMLIN10F.
             03 FMLIN10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN10I  PIC X(75).
           02  FMLIN11L    COMP  PIC  S9(4).
           02  FMLIN11F    PICTURE X.
           02  FILLER REDEFINES FMLIN11F.
             03 FMLIN11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN11I  PIC X(75).
           02  FMLIN12L    COMP  PIC  S9(4).
           02  FMLIN12F    PICTURE X.
           02  FILLER REDEFINES FMLIN12F.
             03 FMLIN12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN12I  PIC X(75).
           02  FMLIN13L    COMP  PIC  S9(4).
           02  FMLIN13F    PICTURE X.
           02  FILLER REDEFINES FMLIN13F.
             03 FMLIN13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN13I  PIC X(75).
           02  FMLIN14L    COMP  PIC  S9(4).
           02  FMLIN14F    PICTURE X.
           02  FILLER REDEFINES FMLIN14F.
             03 FMLIN14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN14I  PIC X(75).
           02  FMLIN15L    COMP  PIC  S9(4).
           02  FMLIN15F    PICTURE X.
           02  FILLER REDEFINES FMLIN15F.
             03 FMLIN15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN15I  PIC X(75).
           02  FMLIN16L    COMP  PIC  S9(4).
           02  FMLIN16F    PICTURE X.
           02  FILLER REDEFINES FMLIN16F.
             03 FMLIN16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN16I  PIC X(75).
           02  FMLIN17L    COMP  PIC  S9(4).
           02  FMLIN17F    PICTURE X.
           02  FILLER REDEFINES FMLIN17F.
             03 FMLIN17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMLIN17I  PIC X(75).
           02  FMPFS01L    COMP  PIC  S9(4).
           02  FMPFS01F    PICTURE X.
           02  FILLER REDEFINES FMPFS01F.
             03 FMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS01I  PIC X(79).
           02  FMERR01L    COMP  PIC  S9(4).
           02  FMERR01F    PICTURE X.
           02  FILLER REDEFINES FMERR01F.
             03 FMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR01I  PIC X(79).
       01  FMLTM01O REDEFINES FMLTM01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANAC    PICTURE X.
           02  FMTRANAP    PICTURE X.
           02  FMTRANAH    PICTURE X.
           02  FMTRANAV    PICTURE X.
           02  FMTRANAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEAC    PICTURE X.
           02  FMDATEAP    PICTURE X.
           02  FMDATEAH    PICTURE X.
           02  FMDATEAV    PICTURE X.
           02  FMDATEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEAC    PICTURE X.
           02  FMTIMEAP    PICTURE X.
           02  FMTIMEAH    PICTURE X.
           02  FMTIMEAV    PICTURE X.
           02  FMTIMEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMALLCOC    PICTURE X.
           02  FMALLCOP    PICTURE X.
           02  FMALLCOH    PICTURE X.
           02  FMALLCOV    PICTURE X.
           02  FMALLCOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMCOMPAC    PICTURE X.
           02  FMCOMPAP    PICTURE X.
           02  FMCOMPAH    PICTURE X.
           02  FMCOMPAV    PICTURE X.
           02  FMCOMPAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMHDG01C    PICTURE X.
           02  FMHDG01P    PICTURE X.
           02  FMHDG01H    PICTURE X.
           02  FMHDG01V    PICTURE X.
           02  FMHDG01O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMHDG02C    PICTURE X.
           02  FMHDG02P    PICTURE X.
           02  FMHDG02H    PICTURE X.
           02  FMHDG02V    PICTURE X.
           02  FMHDG02O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMHDG03C    PICTURE X.
           02  FMHDG03P    PICTURE X.
           02  FMHDG03H    PICTURE X.
           02  FMHDG03V    PICTURE X.
           02  FMHDG03O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMHDG04C    PICTURE X.
           02  FMHDG04P    PICTURE X.
           02  FMHDG04H    PICTURE X.
           02  FMHDG04V    PICTURE X.
           02  FMHDG04O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMHDG05C    PICTURE X.
           02  FMHDG05P    PICTURE X.
           02  FMHDG05H    PICTURE X.
           02  FMHDG05V    PICTURE X.
           02  FMHDG05O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMLIN01C    PICTURE X.
           02  FMLIN01P    PICTURE X.
           02  FMLIN01H    PICTURE X.
           02  FMLIN01V    PICTURE X.
           02  FMLIN01O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN02C    PICTURE X.
           02  FMLIN02P    PICTURE X.
           02  FMLIN02H    PICTURE X.
           02  FMLIN02V    PICTURE X.
           02  FMLIN02O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN03C    PICTURE X.
           02  FMLIN03P    PICTURE X.
           02  FMLIN03H    PICTURE X.
           02  FMLIN03V    PICTURE X.
           02  FMLIN03O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN04C    PICTURE X.
           02  FMLIN04P    PICTURE X.
           02  FMLIN04H    PICTURE X.
           02  FMLIN04V    PICTURE X.
           02  FMLIN04O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN05C    PICTURE X.
           02  FMLIN05P    PICTURE X.
           02  FMLIN05H    PICTURE X.
           02  FMLIN05V    PICTURE X.
           02  FMLIN05O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN06C    PICTURE X.
           02  FMLIN06P    PICTURE X.
           02  FMLIN06H    PICTURE X.
           02  FMLIN06V    PICTURE X.
           02  FMLIN06O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN07C    PICTURE X.
           02  FMLIN07P    PICTURE X.
           02  FMLIN07H    PICTURE X.
           02  FMLIN07V    PICTURE X.
           02  FMLIN07O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN08C    PICTURE X.
           02  FMLIN08P    PICTURE X.
           02  FMLIN08H    PICTURE X.
           02  FMLIN08V    PICTURE X.
           02  FMLIN08O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN09C    PICTURE X.
           02  FMLIN09P    PICTURE X.
           02  FMLIN09H    PICTURE X.
           02  FMLIN09V    PICTURE X.
           02  FMLIN09O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN10C    PICTURE X.
           02  FMLIN10P    PICTURE X.
           02  FMLIN10H    PICTURE X.
           02  FMLIN10V    PICTURE X.
           02  FMLIN10O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN11C    PICTURE X.
           02  FMLIN11P    PICTURE X.
           02  FMLIN11H    PICTURE X.
           02  FMLIN11V    PICTURE X.
           02  FMLIN11O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN12C    PICTURE X.
           02  FMLIN12P    PICTURE X.
           02  FMLIN12H    PICTURE X.
           02  FMLIN12V    PICTURE X.
           02  FMLIN12O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN13C    PICTURE X.
           02  FMLIN13P    PICTURE X.
           02  FMLIN13H    PICTURE X.
           02  FMLIN13V    PICTURE X.
           02  FMLIN13O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN14C    PICTURE X.
           02  FMLIN14P    PICTURE X.
           02  FMLIN14H    PICTURE X.
           02  FMLIN14V    PICTURE X.
           02  FMLIN14O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN15C    PICTURE X.
           02  FMLIN15P    PICTURE X.
           02  FMLIN15H    PICTURE X.
           02  FMLIN15V    PICTURE X.
           02  FMLIN15O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN16C    PICTURE X.
           02  FMLIN16P    PICTURE X.
           02  FMLIN16H    PICTURE X.
           02  FMLIN16V    PICTURE X.
           02  FMLIN16O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMLIN17C    PICTURE X.
           02  FMLIN17P    PICTURE X.
           02  FMLIN17H    PICTURE X.
           02  FMLIN17V    PICTURE X.
           02  FMLIN17O  PIC X(75).
           02  FILLER PICTURE X(3).
           02  FMPFS01C    PICTURE X.
           02  FMPFS01P    PICTURE X.
           02  FMPFS01H    PICTURE X.
           02  FMPFS01V    PICTURE X.
           02  FMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR01C    PICTURE X.
           02  FMERR01P    PICTURE X.
           02  FMERR01H    PICTURE X.
           02  FMERR01V    PICTURE X.
           02  FMERR01O  PIC X(79).