       01  FMRNM02I.
           02  FILLER PIC X(12).
           02  FMTRANBL    COMP  PIC  S9(4).
           02  FMTRANBF    PICTURE X.
           02  FILLER REDEFINES FMTRANBF.
             03 FMTRANBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANBI  PIC X(4).
           02  FMDATEBL    COMP  PIC  S9(4).
           02  FMDATEBF    PICTURE X.
           02  FILLER REDEFINES FMDATEBF.
             03 FMDATEBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEBI  PIC X(8).
           02  FMTIMEBL    COMP  PIC  S9(4).
           02  FMTIMEBF    PICTURE X.
           02  FILLER REDEFINES FMTIMEBF.
             03 FMTIMEBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEBI  PIC X(8).
           02  FMTBLNBL    COMP  PIC  S9(4).
           02  FMTBLNBF    PICTURE X.
           02  FILLER REDEFINES FMTBLNBF.
             03 FMTBLNBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBLNBI  PIC X(4).
           02  FMCOMPLL    COMP  PIC  S9(4).
           02  FMCOMPLF    PICTURE X.
           02  FILLER REDEFINES FMCOMPLF.
             03 FMCOMPLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPLI  PIC X(2).
           02  FMCOMPBL    COMP  PIC  S9(4).
           02  FMCOMPBF    PICTURE X.
           02  FILLER REDEFINES FMCOMPBF.
             03 FMCOMPBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPBI  PIC X(4).
           02  FMSPCOLL    COMP  PIC  S9(4).
           02  FMSPCOLF    PICTURE X.
           02  FILLER REDEFINES FMSPCOLF.
             03 FMSPCOLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPCOLI  PIC X(7).
           02  FMSPCOBL    COMP  PIC  S9(4).
           02  FMSPCOBF    PICTURE X.
           02  FILLER REDEFINES FMSPCOBF.
             03 FMSPCOBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPCOBI  PIC X(4).
           02  FMACT01L    COMP  PIC  S9(4).
           02  FMACT01F    PICTURE X.
           02  FILLER REDEFINES FMACT01F.
             03 FMACT01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT01I  PIC X(1).
           02  FMTBL01L    COMP  PIC  S9(4).
           02  FMTBL01F    PICTURE X.
           02  FILLER REDEFINES FMTBL01F.
             03 FMTBL01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL01I  PIC X(4).
           02  FMACT02L    COMP  PIC  S9(4).
           02  FMACT02F    PICTURE X.
           02  FILLER REDEFINES FMACT02F.
             03 FMACT02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT02I  PIC X(1).
           02  FMTBL02L    COMP  PIC  S9(4).
           02  FMTBL02F    PICTURE X.
           02  FILLER REDEFINES FMTBL02F.
             03 FMTBL02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL02I  PIC X(4).
           02  FMACT03L    COMP  PIC  S9(4).
           02  FMACT03F    PICTURE X.
           02  FILLER REDEFINES FMACT03F.
             03 FMACT03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT03I  PIC X(1).
           02  FMTBL03L    COMP  PIC  S9(4).
           02  FMTBL03F    PICTURE X.
           02  FILLER REDEFINES FMTBL03F.
             03 FMTBL03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL03I  PIC X(4).
           02  FMACT04L    COMP  PIC  S9(4).
           02  FMACT04F    PICTURE X.
           02  FILLER REDEFINES FMACT04F.
             03 FMACT04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT04I  PIC X(1).
           02  FMTBL04L    COMP  PIC  S9(4).
           02  FMTBL04F    PICTURE X.
           02  FILLER REDEFINES FMTBL04F.
             03 FMTBL04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL04I  PIC X(4).
           02  FMACT05L    COMP  PIC  S9(4).
           02  FMACT05F    PICTURE X.
           02  FILLER REDEFINES FMACT05F.
             03 FMACT05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT05I  PIC X(1).
           02  FMTBL05L    COMP  PIC  S9(4).
           02  FMTBL05F    PICTURE X.
           02  FILLER REDEFINES FMTBL05F.
             03 FMTBL05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL05I  PIC X(4).
           02  FMACT06L    COMP  PIC  S9(4).
           02  FMACT06F    PICTURE X.
           02  FILLER REDEFINES FMACT06F.
             03 FMACT06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT06I  PIC X(1).
           02  FMTBL06L    COMP  PIC  S9(4).
           02  FMTBL06F    PICTURE X.
           02  FILLER REDEFINES FMTBL06F.
             03 FMTBL06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL06I  PIC X(4).
           02  FMACT07L    COMP  PIC  S9(4).
           02  FMACT07F    PICTURE X.
           02  FILLER REDEFINES FMACT07F.
             03 FMACT07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT07I  PIC X(1).
           02  FMTBL07L    COMP  PIC  S9(4).
           02  FMTBL07F    PICTURE X.
           02  FILLER REDEFINES FMTBL07F.
             03 FMTBL07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL07I  PIC X(4).
           02  FMACT08L    COMP  PIC  S9(4).
           02  FMACT08F    PICTURE X.
           02  FILLER REDEFINES FMACT08F.
             03 FMACT08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT08I  PIC X(1).
           02  FMTBL08L    COMP  PIC  S9(4).
           02  FMTBL08F    PICTURE X.
           02  FILLER REDEFINES FMTBL08F.
             03 FMTBL08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL08I  PIC X(4).
           02  FMACT09L    COMP  PIC  S9(4).
           02  FMACT09F    PICTURE X.
           02  FILLER REDEFINES FMACT09F.
             03 FMACT09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT09I  PIC X(1).
           02  FMTBL09L    COMP  PIC  S9(4).
           02  FMTBL09F    PICTURE X.
           02  FILLER REDEFINES FMTBL09F.
             03 FMTBL09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL09I  PIC X(4).
           02  FMACT10L    COMP  PIC  S9(4).
           02  FMACT10F    PICTURE X.
           02  FILLER REDEFINES FMACT10F.
             03 FMACT10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT10I  PIC X(1).
           02  FMTBL10L    COMP  PIC  S9(4).
           02  FMTBL10F    PICTURE X.
           02  FILLER REDEFINES FMTBL10F.
             03 FMTBL10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL10I  PIC X(4).
           02  FMACT11L    COMP  PIC  S9(4).
           02  FMACT11F    PICTURE X.
           02  FILLER REDEFINES FMACT11F.
             03 FMACT11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT11I  PIC X(1).
           02  FMTBL11L    COMP  PIC  S9(4).
           02  FMTBL11F    PICTURE X.
           02  FILLER REDEFINES FMTBL11F.
             03 FMTBL11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL11I  PIC X(4).
           02  FMACT12L    COMP  PIC  S9(4).
           02  FMACT12F    PICTURE X.
           02  FILLER REDEFINES FMACT12F.
             03 FMACT12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT12I  PIC X(1).
           02  FMTBL12L    COMP  PIC  S9(4).
           02  FMTBL12F    PICTURE X.
           02  FILLER REDEFINES FMTBL12F.
             03 FMTBL12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL12I  PIC X(4).
           02  FMACT13L    COMP  PIC  S9(4).
           02  FMACT13F    PICTURE X.
           02  FILLER REDEFINES FMACT13F.
             03 FMACT13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT13I  PIC X(1).
           02  FMTBL13L    COMP  PIC  S9(4).
           02  FMTBL13F    PICTURE X.
           02  FILLER REDEFINES FMTBL13F.
             03 FMTBL13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL13I  PIC X(4).
           02  FMACT14L    COMP  PIC  S9(4).
           02  FMACT14F    PICTURE X.
           02  FILLER REDEFINES FMACT14F.
             03 FMACT14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT14I  PIC X(1).
           02  FMTBL14L    COMP  PIC  S9(4).
           02  FMTBL14F    PICTURE X.
           02  FILLER REDEFINES FMTBL14F.
             03 FMTBL14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL14I  PIC X(4).
           02  FMACT15L    COMP  PIC  S9(4).
           02  FMACT15F    PICTURE X.
           02  FILLER REDEFINES FMACT15F.
             03 FMACT15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT15I  PIC X(1).
           02  FMTBL15L    COMP  PIC  S9(4).
           02  FMTBL15F    PICTURE X.
           02  FILLER REDEFINES FMTBL15F.
             03 FMTBL15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL15I  PIC X(4).
           02  FMACT16L    COMP  PIC  S9(4).
           02  FMACT16F    PICTURE X.
           02  FILLER REDEFINES FMACT16F.
             03 FMACT16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT16I  PIC X(1).
           02  FMTBL16L    COMP  PIC  S9(4).
           02  FMTBL16F    PICTURE X.
           02  FILLER REDEFINES FMTBL16F.
             03 FMTBL16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL16I  PIC X(4).
           02  FMACT17L    COMP  PIC  S9(4).
           02  FMACT17F    PICTURE X.
           02  FILLER REDEFINES FMACT17F.
             03 FMACT17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT17I  PIC X(1).
           02  FMTBL17L    COMP  PIC  S9(4).
           02  FMTBL17F    PICTURE X.
           02  FILLER REDEFINES FMTBL17F.
             03 FMTBL17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL17I  PIC X(4).
           02  FMACT18L    COMP  PIC  S9(4).
           02  FMACT18F    PICTURE X.
           02  FILLER REDEFINES FMACT18F.
             03 FMACT18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT18I  PIC X(1).
           02  FMTBL18L    COMP  PIC  S9(4).
           02  FMTBL18F    PICTURE X.
           02  FILLER REDEFINES FMTBL18F.
             03 FMTBL18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL18I  PIC X(4).
           02  FMACT19L    COMP  PIC  S9(4).
           02  FMACT19F    PICTURE X.
           02  FILLER REDEFINES FMACT19F.
             03 FMACT19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT19I  PIC X(1).
           02  FMTBL19L    COMP  PIC  S9(4).
           02  FMTBL19F    PICTURE X.
           02  FILLER REDEFINES FMTBL19F.
             03 FMTBL19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL19I  PIC X(4).
           02  FMACT20L    COMP  PIC  S9(4).
           02  FMACT20F    PICTURE X.
           02  FILLER REDEFINES FMACT20F.
             03 FMACT20A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT20I  PIC X(1).
           02  FMTBL20L    COMP  PIC  S9(4).
           02  FMTBL20F    PICTURE X.
           02  FILLER REDEFINES FMTBL20F.
             03 FMTBL20A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL20I  PIC X(4).
           02  FMACT21L    COMP  PIC  S9(4).
           02  FMACT21F    PICTURE X.
           02  FILLER REDEFINES FMACT21F.
             03 FMACT21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT21I  PIC X(1).
           02  FMTBL21L    COMP  PIC  S9(4).
           02  FMTBL21F    PICTURE X.
           02  FILLER REDEFINES FMTBL21F.
             03 FMTBL21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL21I  PIC X(4).
           02  FMACT22L    COMP  PIC  S9(4).
           02  FMACT22F    PICTURE X.
           02  FILLER REDEFINES FMACT22F.
             03 FMACT22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT22I  PIC X(1).
           02  FMTBL22L    COMP  PIC  S9(4).
           02  FMTBL22F    PICTURE X.
           02  FILLER REDEFINES FMTBL22F.
             03 FMTBL22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL22I  PIC X(4).
           02  FNACT23L    COMP  PIC  S9(4).
           02  FNACT23F    PICTURE X.
           02  FILLER REDEFINES FNACT23F.
             03 FNACT23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FNACT23I  PIC X(1).
           02  FMTBL23L    COMP  PIC  S9(4).
           02  FMTBL23F    PICTURE X.
           02  FILLER REDEFINES FMTBL23F.
             03 FMTBL23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL23I  PIC X(4).
           02  FMACT24L    COMP  PIC  S9(4).
           02  FMACT24F    PICTURE X.
           02  FILLER REDEFINES FMACT24F.
             03 FMACT24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT24I  PIC X(1).
           02  FMTBL24L    COMP  PIC  S9(4).
           02  FMTBL24F    PICTURE X.
           02  FILLER REDEFINES FMTBL24F.
             03 FMTBL24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL24I  PIC X(4).
           02  FMACT25L    COMP  PIC  S9(4).
           02  FMACT25F    PICTURE X.
           02  FILLER REDEFINES FMACT25F.
             03 FMACT25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT25I  PIC X(1).
           02  FMTBL25L    COMP  PIC  S9(4).
           02  FMTBL25F    PICTURE X.
           02  FILLER REDEFINES FMTBL25F.
             03 FMTBL25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL25I  PIC X(4).
           02  FMACT26L    COMP  PIC  S9(4).
           02  FMACT26F    PICTURE X.
           02  FILLER REDEFINES FMACT26F.
             03 FMACT26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT26I  PIC X(1).
           02  FMTBL26L    COMP  PIC  S9(4).
           02  FMTBL26F    PICTURE X.
           02  FILLER REDEFINES FMTBL26F.
             03 FMTBL26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL26I  PIC X(4).
           02  FMACT27L    COMP  PIC  S9(4).
           02  FMACT27F    PICTURE X.
           02  FILLER REDEFINES FMACT27F.
             03 FMACT27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT27I  PIC X(1).
           02  FMTBL27L    COMP  PIC  S9(4).
           02  FMTBL27F    PICTURE X.
           02  FILLER REDEFINES FMTBL27F.
             03 FMTBL27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL27I  PIC X(4).
           02  FMACT28L    COMP  PIC  S9(4).
           02  FMACT28F    PICTURE X.
           02  FILLER REDEFINES FMACT28F.
             03 FMACT28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT28I  PIC X(1).
           02  FMTBL28L    COMP  PIC  S9(4).
           02  FMTBL28F    PICTURE X.
           02  FILLER REDEFINES FMTBL28F.
             03 FMTBL28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL28I  PIC X(4).
           02  FMACT29L    COMP  PIC  S9(4).
           02  FMACT29F    PICTURE X.
           02  FILLER REDEFINES FMACT29F.
             03 FMACT29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT29I  PIC X(1).
           02  FMTBL29L    COMP  PIC  S9(4).
           02  FMTBL29F    PICTURE X.
           02  FILLER REDEFINES FMTBL29F.
             03 FMTBL29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL29I  PIC X(4).
           02  FMACT30L    COMP  PIC  S9(4).
           02  FMACT30F    PICTURE X.
           02  FILLER REDEFINES FMACT30F.
             03 FMACT30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT30I  PIC X(1).
           02  FMTBL30L    COMP  PIC  S9(4).
           02  FMTBL30F    PICTURE X.
           02  FILLER REDEFINES FMTBL30F.
             03 FMTBL30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL30I  PIC X(4).
           02  FMACT31L    COMP  PIC  S9(4).
           02  FMACT31F    PICTURE X.
           02  FILLER REDEFINES FMACT31F.
             03 FMACT31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT31I  PIC X(1).
           02  FMTBL31L    COMP  PIC  S9(4).
           02  FMTBL31F    PICTURE X.
           02  FILLER REDEFINES FMTBL31F.
             03 FMTBL31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL31I  PIC X(4).
           02  FMACT32L    COMP  PIC  S9(4).
           02  FMACT32F    PICTURE X.
           02  FILLER REDEFINES FMACT32F.
             03 FMACT32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT32I  PIC X(1).
           02  FMTBL32L    COMP  PIC  S9(4).
           02  FMTBL32F    PICTURE X.
           02  FILLER REDEFINES FMTBL32F.
             03 FMTBL32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL32I  PIC X(4).
           02  FMACT33L    COMP  PIC  S9(4).
           02  FMACT33F    PICTURE X.
           02  FILLER REDEFINES FMACT33F.
             03 FMACT33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT33I  PIC X(1).
           02  FMTBL33L    COMP  PIC  S9(4).
           02  FMTBL33F    PICTURE X.
           02  FILLER REDEFINES FMTBL33F.
             03 FMTBL33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL33I  PIC X(4).
           02  FMACT34L    COMP  PIC  S9(4).
           02  FMACT34F    PICTURE X.
           02  FILLER REDEFINES FMACT34F.
             03 FMACT34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT34I  PIC X(1).
           02  FMTBL34L    COMP  PIC  S9(4).
           02  FMTBL34F    PICTURE X.
           02  FILLER REDEFINES FMTBL34F.
             03 FMTBL34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL34I  PIC X(4).
           02  FMACT35L    COMP  PIC  S9(4).
           02  FMACT35F    PICTURE X.
           02  FILLER REDEFINES FMACT35F.
             03 FMACT35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT35I  PIC X(1).
           02  FMTBL35L    COMP  PIC  S9(4).
           02  FMTBL35F    PICTURE X.
           02  FILLER REDEFINES FMTBL35F.
             03 FMTBL35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL35I  PIC X(4).
           02  FMACT36L    COMP  PIC  S9(4).
           02  FMACT36F    PICTURE X.
           02  FILLER REDEFINES FMACT36F.
             03 FMACT36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT36I  PIC X(1).
           02  FMTBL36L    COMP  PIC  S9(4).
           02  FMTBL36F    PICTURE X.
           02  FILLER REDEFINES FMTBL36F.
             03 FMTBL36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL36I  PIC X(4).
           02  FMACT37L    COMP  PIC  S9(4).
           02  FMACT37F    PICTURE X.
           02  FILLER REDEFINES FMACT37F.
             03 FMACT37A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT37I  PIC X(1).
           02  FMTBL37L    COMP  PIC  S9(4).
           02  FMTBL37F    PICTURE X.
           02  FILLER REDEFINES FMTBL37F.
             03 FMTBL37A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL37I  PIC X(4).
           02  FMACT38L    COMP  PIC  S9(4).
           02  FMACT38F    PICTURE X.
           02  FILLER REDEFINES FMACT38F.
             03 FMACT38A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT38I  PIC X(1).
           02  FMTBL38L    COMP  PIC  S9(4).
           02  FMTBL38F    PICTURE X.
           02  FILLER REDEFINES FMTBL38F.
             03 FMTBL38A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL38I  PIC X(4).
           02  FMACT39L    COMP  PIC  S9(4).
           02  FMACT39F    PICTURE X.
           02  FILLER REDEFINES FMACT39F.
             03 FMACT39A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT39I  PIC X(1).
           02  FMTBL39L    COMP  PIC  S9(4).
           02  FMTBL39F    PICTURE X.
           02  FILLER REDEFINES FMTBL39F.
             03 FMTBL39A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL39I  PIC X(4).
           02  FMACT40L    COMP  PIC  S9(4).
           02  FMACT40F    PICTURE X.
           02  FILLER REDEFINES FMACT40F.
             03 FMACT40A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT40I  PIC X(1).
           02  FMTBL40L    COMP  PIC  S9(4).
           02  FMTBL40F    PICTURE X.
           02  FILLER REDEFINES FMTBL40F.
             03 FMTBL40A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL40I  PIC X(4).
           02  FMACT41L    COMP  PIC  S9(4).
           02  FMACT41F    PICTURE X.
           02  FILLER REDEFINES FMACT41F.
             03 FMACT41A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT41I  PIC X(1).
           02  FMTBL41L    COMP  PIC  S9(4).
           02  FMTBL41F    PICTURE X.
           02  FILLER REDEFINES FMTBL41F.
             03 FMTBL41A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL41I  PIC X(4).
           02  FMACT42L    COMP  PIC  S9(4).
           02  FMACT42F    PICTURE X.
           02  FILLER REDEFINES FMACT42F.
             03 FMACT42A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT42I  PIC X(1).
           02  FMTBL42L    COMP  PIC  S9(4).
           02  FMTBL42F    PICTURE X.
           02  FILLER REDEFINES FMTBL42F.
             03 FMTBL42A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL42I  PIC X(4).
           02  FMACT43L    COMP  PIC  S9(4).
           02  FMACT43F    PICTURE X.
           02  FILLER REDEFINES FMACT43F.
             03 FMACT43A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT43I  PIC X(1).
           02  FMTBL43L    COMP  PIC  S9(4).
           02  FMTBL43F    PICTURE X.
           02  FILLER REDEFINES FMTBL43F.
             03 FMTBL43A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL43I  PIC X(4).
           02  FMACT44L    COMP  PIC  S9(4).
           02  FMACT44F    PICTURE X.
           02  FILLER REDEFINES FMACT44F.
             03 FMACT44A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT44I  PIC X(1).
           02  FMTBL44L    COMP  PIC  S9(4).
           02  FMTBL44F    PICTURE X.
           02  FILLER REDEFINES FMTBL44F.
             03 FMTBL44A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL44I  PIC X(4).
           02  FMACT45L    COMP  PIC  S9(4).
           02  FMACT45F    PICTURE X.
           02  FILLER REDEFINES FMACT45F.
             03 FMACT45A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT45I  PIC X(1).
           02  FMTBL45L    COMP  PIC  S9(4).
           02  FMTBL45F    PICTURE X.
           02  FILLER REDEFINES FMTBL45F.
             03 FMTBL45A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL45I  PIC X(4).
           02  FMACT46L    COMP  PIC  S9(4).
           02  FMACT46F    PICTURE X.
           02  FILLER REDEFINES FMACT46F.
             03 FMACT46A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT46I  PIC X(1).
           02  FMTBL46L    COMP  PIC  S9(4).
           02  FMTBL46F    PICTURE X.
           02  FILLER REDEFINES FMTBL46F.
             03 FMTBL46A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL46I  PIC X(4).
           02  FMACT47L    COMP  PIC  S9(4).
           02  FMACT47F    PICTURE X.
           02  FILLER REDEFINES FMACT47F.
             03 FMACT47A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT47I  PIC X(1).
           02  FMTBL47L    COMP  PIC  S9(4).
           02  FMTBL47F    PICTURE X.
           02  FILLER REDEFINES FMTBL47F.
             03 FMTBL47A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL47I  PIC X(4).
           02  FMACT48L    COMP  PIC  S9(4).
           02  FMACT48F    PICTURE X.
           02  FILLER REDEFINES FMACT48F.
             03 FMACT48A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT48I  PIC X(1).
           02  FMTBL48L    COMP  PIC  S9(4).
           02  FMTBL48F    PICTURE X.
           02  FILLER REDEFINES FMTBL48F.
             03 FMTBL48A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL48I  PIC X(4).
           02  FMACT49L    COMP  PIC  S9(4).
           02  FMACT49F    PICTURE X.
           02  FILLER REDEFINES FMACT49F.
             03 FMACT49A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT49I  PIC X(1).
           02  FMTBL49L    COMP  PIC  S9(4).
           02  FMTBL49F    PICTURE X.
           02  FILLER REDEFINES FMTBL49F.
             03 FMTBL49A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL49I  PIC X(4).
           02  FMACT50L    COMP  PIC  S9(4).
           02  FMACT50F    PICTURE X.
           02  FILLER REDEFINES FMACT50F.
             03 FMACT50A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT50I  PIC X(1).
           02  FMTBL50L    COMP  PIC  S9(4).
           02  FMTBL50F    PICTURE X.
           02  FILLER REDEFINES FMTBL50F.
             03 FMTBL50A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL50I  PIC X(4).
           02  FMACT51L    COMP  PIC  S9(4).
           02  FMACT51F    PICTURE X.
           02  FILLER REDEFINES FMACT51F.
             03 FMACT51A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT51I  PIC X(1).
           02  FMTBL51L    COMP  PIC  S9(4).
           02  FMTBL51F    PICTURE X.
           02  FILLER REDEFINES FMTBL51F.
             03 FMTBL51A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL51I  PIC X(4).
           02  FMACT52L    COMP  PIC  S9(4).
           02  FMACT52F    PICTURE X.
           02  FILLER REDEFINES FMACT52F.
             03 FMACT52A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT52I  PIC X(1).
           02  FMTBL52L    COMP  PIC  S9(4).
           02  FMTBL52F    PICTURE X.
           02  FILLER REDEFINES FMTBL52F.
             03 FMTBL52A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL52I  PIC X(4).
           02  FMACT53L    COMP  PIC  S9(4).
           02  FMACT53F    PICTURE X.
           02  FILLER REDEFINES FMACT53F.
             03 FMACT53A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT53I  PIC X(1).
           02  FMTBL53L    COMP  PIC  S9(4).
           02  FMTBL53F    PICTURE X.
           02  FILLER REDEFINES FMTBL53F.
             03 FMTBL53A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL53I  PIC X(4).
           02  FMACT54L    COMP  PIC  S9(4).
           02  FMACT54F    PICTURE X.
           02  FILLER REDEFINES FMACT54F.
             03 FMACT54A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT54I  PIC X(1).
           02  FMTBL54L    COMP  PIC  S9(4).
           02  FMTBL54F    PICTURE X.
           02  FILLER REDEFINES FMTBL54F.
             03 FMTBL54A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL54I  PIC X(4).
           02  FMACT55L    COMP  PIC  S9(4).
           02  FMACT55F    PICTURE X.
           02  FILLER REDEFINES FMACT55F.
             03 FMACT55A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT55I  PIC X(1).
           02  FMTBL55L    COMP  PIC  S9(4).
           02  FMTBL55F    PICTURE X.
           02  FILLER REDEFINES FMTBL55F.
             03 FMTBL55A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL55I  PIC X(4).
           02  FMACT56L    COMP  PIC  S9(4).
           02  FMACT56F    PICTURE X.
           02  FILLER REDEFINES FMACT56F.
             03 FMACT56A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMACT56I  PIC X(1).
           02  FMTBL56L    COMP  PIC  S9(4).
           02  FMTBL56F    PICTURE X.
           02  FILLER REDEFINES FMTBL56F.
             03 FMTBL56A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBL56I  PIC X(4).
           02  FMPFS02L    COMP  PIC  S9(4).
           02  FMPFS02F    PICTURE X.
           02  FILLER REDEFINES FMPFS02F.
             03 FMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS02I  PIC X(79).
           02  FMERR02L    COMP  PIC  S9(4).
           02  FMERR02F    PICTURE X.
           02  FILLER REDEFINES FMERR02F.
             03 FMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR02I  PIC X(79).
       01  FMRNM02O REDEFINES FMRNM02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANBC    PICTURE X.
           02  FMTRANBP    PICTURE X.
           02  FMTRANBH    PICTURE X.
           02  FMTRANBV    PICTURE X.
           02  FMTRANBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEBC    PICTURE X.
           02  FMDATEBP    PICTURE X.
           02  FMDATEBH    PICTURE X.
           02  FMDATEBV    PICTURE X.
           02  FMDATEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEBC    PICTURE X.
           02  FMTIMEBP    PICTURE X.
           02  FMTIMEBH    PICTURE X.
           02  FMTIMEBV    PICTURE X.
           02  FMTIMEBO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTBLNBC    PICTURE X.
           02  FMTBLNBP    PICTURE X.
           02  FMTBLNBH    PICTURE X.
           02  FMTBLNBV    PICTURE X.
           02  FMTBLNBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCOMPLC    PICTURE X.
           02  FMCOMPLP    PICTURE X.
           02  FMCOMPLH    PICTURE X.
           02  FMCOMPLV    PICTURE X.
           02  FMCOMPLO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  FMCOMPBC    PICTURE X.
           02  FMCOMPBP    PICTURE X.
           02  FMCOMPBH    PICTURE X.
           02  FMCOMPBV    PICTURE X.
           02  FMCOMPBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMSPCOLC    PICTURE X.
           02  FMSPCOLP    PICTURE X.
           02  FMSPCOLH    PICTURE X.
           02  FMSPCOLV    PICTURE X.
           02  FMSPCOLO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FMSPCOBC    PICTURE X.
           02  FMSPCOBP    PICTURE X.
           02  FMSPCOBH    PICTURE X.
           02  FMSPCOBV    PICTURE X.
           02  FMSPCOBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT01C    PICTURE X.
           02  FMACT01P    PICTURE X.
           02  FMACT01H    PICTURE X.
           02  FMACT01V    PICTURE X.
           02  FMACT01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL01C    PICTURE X.
           02  FMTBL01P    PICTURE X.
           02  FMTBL01H    PICTURE X.
           02  FMTBL01V    PICTURE X.
           02  FMTBL01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT02C    PICTURE X.
           02  FMACT02P    PICTURE X.
           02  FMACT02H    PICTURE X.
           02  FMACT02V    PICTURE X.
           02  FMACT02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL02C    PICTURE X.
           02  FMTBL02P    PICTURE X.
           02  FMTBL02H    PICTURE X.
           02  FMTBL02V    PICTURE X.
           02  FMTBL02O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT03C    PICTURE X.
           02  FMACT03P    PICTURE X.
           02  FMACT03H    PICTURE X.
           02  FMACT03V    PICTURE X.
           02  FMACT03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL03C    PICTURE X.
           02  FMTBL03P    PICTURE X.
           02  FMTBL03H    PICTURE X.
           02  FMTBL03V    PICTURE X.
           02  FMTBL03O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT04C    PICTURE X.
           02  FMACT04P    PICTURE X.
           02  FMACT04H    PICTURE X.
           02  FMACT04V    PICTURE X.
           02  FMACT04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL04C    PICTURE X.
           02  FMTBL04P    PICTURE X.
           02  FMTBL04H    PICTURE X.
           02  FMTBL04V    PICTURE X.
           02  FMTBL04O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT05C    PICTURE X.
           02  FMACT05P    PICTURE X.
           02  FMACT05H    PICTURE X.
           02  FMACT05V    PICTURE X.
           02  FMACT05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL05C    PICTURE X.
           02  FMTBL05P    PICTURE X.
           02  FMTBL05H    PICTURE X.
           02  FMTBL05V    PICTURE X.
           02  FMTBL05O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT06C    PICTURE X.
           02  FMACT06P    PICTURE X.
           02  FMACT06H    PICTURE X.
           02  FMACT06V    PICTURE X.
           02  FMACT06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL06C    PICTURE X.
           02  FMTBL06P    PICTURE X.
           02  FMTBL06H    PICTURE X.
           02  FMTBL06V    PICTURE X.
           02  FMTBL06O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT07C    PICTURE X.
           02  FMACT07P    PICTURE X.
           02  FMACT07H    PICTURE X.
           02  FMACT07V    PICTURE X.
           02  FMACT07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL07C    PICTURE X.
           02  FMTBL07P    PICTURE X.
           02  FMTBL07H    PICTURE X.
           02  FMTBL07V    PICTURE X.
           02  FMTBL07O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT08C    PICTURE X.
           02  FMACT08P    PICTURE X.
           02  FMACT08H    PICTURE X.
           02  FMACT08V    PICTURE X.
           02  FMACT08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL08C    PICTURE X.
           02  FMTBL08P    PICTURE X.
           02  FMTBL08H    PICTURE X.
           02  FMTBL08V    PICTURE X.
           02  FMTBL08O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT09C    PICTURE X.
           02  FMACT09P    PICTURE X.
           02  FMACT09H    PICTURE X.
           02  FMACT09V    PICTURE X.
           02  FMACT09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL09C    PICTURE X.
           02  FMTBL09P    PICTURE X.
           02  FMTBL09H    PICTURE X.
           02  FMTBL09V    PICTURE X.
           02  FMTBL09O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT10C    PICTURE X.
           02  FMACT10P    PICTURE X.
           02  FMACT10H    PICTURE X.
           02  FMACT10V    PICTURE X.
           02  FMACT10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL10C    PICTURE X.
           02  FMTBL10P    PICTURE X.
           02  FMTBL10H    PICTURE X.
           02  FMTBL10V    PICTURE X.
           02  FMTBL10O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT11C    PICTURE X.
           02  FMACT11P    PICTURE X.
           02  FMACT11H    PICTURE X.
           02  FMACT11V    PICTURE X.
           02  FMACT11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL11C    PICTURE X.
           02  FMTBL11P    PICTURE X.
           02  FMTBL11H    PICTURE X.
           02  FMTBL11V    PICTURE X.
           02  FMTBL11O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT12C    PICTURE X.
           02  FMACT12P    PICTURE X.
           02  FMACT12H    PICTURE X.
           02  FMACT12V    PICTURE X.
           02  FMACT12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL12C    PICTURE X.
           02  FMTBL12P    PICTURE X.
           02  FMTBL12H    PICTURE X.
           02  FMTBL12V    PICTURE X.
           02  FMTBL12O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT13C    PICTURE X.
           02  FMACT13P    PICTURE X.
           02  FMACT13H    PICTURE X.
           02  FMACT13V    PICTURE X.
           02  FMACT13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL13C    PICTURE X.
           02  FMTBL13P    PICTURE X.
           02  FMTBL13H    PICTURE X.
           02  FMTBL13V    PICTURE X.
           02  FMTBL13O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT14C    PICTURE X.
           02  FMACT14P    PICTURE X.
           02  FMACT14H    PICTURE X.
           02  FMACT14V    PICTURE X.
           02  FMACT14O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL14C    PICTURE X.
           02  FMTBL14P    PICTURE X.
           02  FMTBL14H    PICTURE X.
           02  FMTBL14V    PICTURE X.
           02  FMTBL14O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT15C    PICTURE X.
           02  FMACT15P    PICTURE X.
           02  FMACT15H    PICTURE X.
           02  FMACT15V    PICTURE X.
           02  FMACT15O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL15C    PICTURE X.
           02  FMTBL15P    PICTURE X.
           02  FMTBL15H    PICTURE X.
           02  FMTBL15V    PICTURE X.
           02  FMTBL15O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT16C    PICTURE X.
           02  FMACT16P    PICTURE X.
           02  FMACT16H    PICTURE X.
           02  FMACT16V    PICTURE X.
           02  FMACT16O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL16C    PICTURE X.
           02  FMTBL16P    PICTURE X.
           02  FMTBL16H    PICTURE X.
           02  FMTBL16V    PICTURE X.
           02  FMTBL16O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT17C    PICTURE X.
           02  FMACT17P    PICTURE X.
           02  FMACT17H    PICTURE X.
           02  FMACT17V    PICTURE X.
           02  FMACT17O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL17C    PICTURE X.
           02  FMTBL17P    PICTURE X.
           02  FMTBL17H    PICTURE X.
           02  FMTBL17V    PICTURE X.
           02  FMTBL17O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT18C    PICTURE X.
           02  FMACT18P    PICTURE X.
           02  FMACT18H    PICTURE X.
           02  FMACT18V    PICTURE X.
           02  FMACT18O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL18C    PICTURE X.
           02  FMTBL18P    PICTURE X.
           02  FMTBL18H    PICTURE X.
           02  FMTBL18V    PICTURE X.
           02  FMTBL18O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT19C    PICTURE X.
           02  FMACT19P    PICTURE X.
           02  FMACT19H    PICTURE X.
           02  FMACT19V    PICTURE X.
           02  FMACT19O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL19C    PICTURE X.
           02  FMTBL19P    PICTURE X.
           02  FMTBL19H    PICTURE X.
           02  FMTBL19V    PICTURE X.
           02  FMTBL19O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT20C    PICTURE X.
           02  FMACT20P    PICTURE X.
           02  FMACT20H    PICTURE X.
           02  FMACT20V    PICTURE X.
           02  FMACT20O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL20C    PICTURE X.
           02  FMTBL20P    PICTURE X.
           02  FMTBL20H    PICTURE X.
           02  FMTBL20V    PICTURE X.
           02  FMTBL20O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT21C    PICTURE X.
           02  FMACT21P    PICTURE X.
           02  FMACT21H    PICTURE X.
           02  FMACT21V    PICTURE X.
           02  FMACT21O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL21C    PICTURE X.
           02  FMTBL21P    PICTURE X.
           02  FMTBL21H    PICTURE X.
           02  FMTBL21V    PICTURE X.
           02  FMTBL21O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT22C    PICTURE X.
           02  FMACT22P    PICTURE X.
           02  FMACT22H    PICTURE X.
           02  FMACT22V    PICTURE X.
           02  FMACT22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL22C    PICTURE X.
           02  FMTBL22P    PICTURE X.
           02  FMTBL22H    PICTURE X.
           02  FMTBL22V    PICTURE X.
           02  FMTBL22O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FNACT23C    PICTURE X.
           02  FNACT23P    PICTURE X.
           02  FNACT23H    PICTURE X.
           02  FNACT23V    PICTURE X.
           02  FNACT23O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL23C    PICTURE X.
           02  FMTBL23P    PICTURE X.
           02  FMTBL23H    PICTURE X.
           02  FMTBL23V    PICTURE X.
           02  FMTBL23O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT24C    PICTURE X.
           02  FMACT24P    PICTURE X.
           02  FMACT24H    PICTURE X.
           02  FMACT24V    PICTURE X.
           02  FMACT24O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL24C    PICTURE X.
           02  FMTBL24P    PICTURE X.
           02  FMTBL24H    PICTURE X.
           02  FMTBL24V    PICTURE X.
           02  FMTBL24O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT25C    PICTURE X.
           02  FMACT25P    PICTURE X.
           02  FMACT25H    PICTURE X.
           02  FMACT25V    PICTURE X.
           02  FMACT25O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL25C    PICTURE X.
           02  FMTBL25P    PICTURE X.
           02  FMTBL25H    PICTURE X.
           02  FMTBL25V    PICTURE X.
           02  FMTBL25O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT26C    PICTURE X.
           02  FMACT26P    PICTURE X.
           02  FMACT26H    PICTURE X.
           02  FMACT26V    PICTURE X.
           02  FMACT26O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL26C    PICTURE X.
           02  FMTBL26P    PICTURE X.
           02  FMTBL26H    PICTURE X.
           02  FMTBL26V    PICTURE X.
           02  FMTBL26O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT27C    PICTURE X.
           02  FMACT27P    PICTURE X.
           02  FMACT27H    PICTURE X.
           02  FMACT27V    PICTURE X.
           02  FMACT27O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL27C    PICTURE X.
           02  FMTBL27P    PICTURE X.
           02  FMTBL27H    PICTURE X.
           02  FMTBL27V    PICTURE X.
           02  FMTBL27O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT28C    PICTURE X.
           02  FMACT28P    PICTURE X.
           02  FMACT28H    PICTURE X.
           02  FMACT28V    PICTURE X.
           02  FMACT28O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL28C    PICTURE X.
           02  FMTBL28P    PICTURE X.
           02  FMTBL28H    PICTURE X.
           02  FMTBL28V    PICTURE X.
           02  FMTBL28O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT29C    PICTURE X.
           02  FMACT29P    PICTURE X.
           02  FMACT29H    PICTURE X.
           02  FMACT29V    PICTURE X.
           02  FMACT29O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL29C    PICTURE X.
           02  FMTBL29P    PICTURE X.
           02  FMTBL29H    PICTURE X.
           02  FMTBL29V    PICTURE X.
           02  FMTBL29O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT30C    PICTURE X.
           02  FMACT30P    PICTURE X.
           02  FMACT30H    PICTURE X.
           02  FMACT30V    PICTURE X.
           02  FMACT30O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL30C    PICTURE X.
           02  FMTBL30P    PICTURE X.
           02  FMTBL30H    PICTURE X.
           02  FMTBL30V    PICTURE X.
           02  FMTBL30O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT31C    PICTURE X.
           02  FMACT31P    PICTURE X.
           02  FMACT31H    PICTURE X.
           02  FMACT31V    PICTURE X.
           02  FMACT31O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL31C    PICTURE X.
           02  FMTBL31P    PICTURE X.
           02  FMTBL31H    PICTURE X.
           02  FMTBL31V    PICTURE X.
           02  FMTBL31O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT32C    PICTURE X.
           02  FMACT32P    PICTURE X.
           02  FMACT32H    PICTURE X.
           02  FMACT32V    PICTURE X.
           02  FMACT32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL32C    PICTURE X.
           02  FMTBL32P    PICTURE X.
           02  FMTBL32H    PICTURE X.
           02  FMTBL32V    PICTURE X.
           02  FMTBL32O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT33C    PICTURE X.
           02  FMACT33P    PICTURE X.
           02  FMACT33H    PICTURE X.
           02  FMACT33V    PICTURE X.
           02  FMACT33O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL33C    PICTURE X.
           02  FMTBL33P    PICTURE X.
           02  FMTBL33H    PICTURE X.
           02  FMTBL33V    PICTURE X.
           02  FMTBL33O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT34C    PICTURE X.
           02  FMACT34P    PICTURE X.
           02  FMACT34H    PICTURE X.
           02  FMACT34V    PICTURE X.
           02  FMACT34O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL34C    PICTURE X.
           02  FMTBL34P    PICTURE X.
           02  FMTBL34H    PICTURE X.
           02  FMTBL34V    PICTURE X.
           02  FMTBL34O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT35C    PICTURE X.
           02  FMACT35P    PICTURE X.
           02  FMACT35H    PICTURE X.
           02  FMACT35V    PICTURE X.
           02  FMACT35O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL35C    PICTURE X.
           02  FMTBL35P    PICTURE X.
           02  FMTBL35H    PICTURE X.
           02  FMTBL35V    PICTURE X.
           02  FMTBL35O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT36C    PICTURE X.
           02  FMACT36P    PICTURE X.
           02  FMACT36H    PICTURE X.
           02  FMACT36V    PICTURE X.
           02  FMACT36O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL36C    PICTURE X.
           02  FMTBL36P    PICTURE X.
           02  FMTBL36H    PICTURE X.
           02  FMTBL36V    PICTURE X.
           02  FMTBL36O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT37C    PICTURE X.
           02  FMACT37P    PICTURE X.
           02  FMACT37H    PICTURE X.
           02  FMACT37V    PICTURE X.
           02  FMACT37O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL37C    PICTURE X.
           02  FMTBL37P    PICTURE X.
           02  FMTBL37H    PICTURE X.
           02  FMTBL37V    PICTURE X.
           02  FMTBL37O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT38C    PICTURE X.
           02  FMACT38P    PICTURE X.
           02  FMACT38H    PICTURE X.
           02  FMACT38V    PICTURE X.
           02  FMACT38O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL38C    PICTURE X.
           02  FMTBL38P    PICTURE X.
           02  FMTBL38H    PICTURE X.
           02  FMTBL38V    PICTURE X.
           02  FMTBL38O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT39C    PICTURE X.
           02  FMACT39P    PICTURE X.
           02  FMACT39H    PICTURE X.
           02  FMACT39V    PICTURE X.
           02  FMACT39O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL39C    PICTURE X.
           02  FMTBL39P    PICTURE X.
           02  FMTBL39H    PICTURE X.
           02  FMTBL39V    PICTURE X.
           02  FMTBL39O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT40C    PICTURE X.
           02  FMACT40P    PICTURE X.
           02  FMACT40H    PICTURE X.
           02  FMACT40V    PICTURE X.
           02  FMACT40O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL40C    PICTURE X.
           02  FMTBL40P    PICTURE X.
           02  FMTBL40H    PICTURE X.
           02  FMTBL40V    PICTURE X.
           02  FMTBL40O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT41C    PICTURE X.
           02  FMACT41P    PICTURE X.
           02  FMACT41H    PICTURE X.
           02  FMACT41V    PICTURE X.
           02  FMACT41O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL41C    PICTURE X.
           02  FMTBL41P    PICTURE X.
           02  FMTBL41H    PICTURE X.
           02  FMTBL41V    PICTURE X.
           02  FMTBL41O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT42C    PICTURE X.
           02  FMACT42P    PICTURE X.
           02  FMACT42H    PICTURE X.
           02  FMACT42V    PICTURE X.
           02  FMACT42O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL42C    PICTURE X.
           02  FMTBL42P    PICTURE X.
           02  FMTBL42H    PICTURE X.
           02  FMTBL42V    PICTURE X.
           02  FMTBL42O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT43C    PICTURE X.
           02  FMACT43P    PICTURE X.
           02  FMACT43H    PICTURE X.
           02  FMACT43V    PICTURE X.
           02  FMACT43O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL43C    PICTURE X.
           02  FMTBL43P    PICTURE X.
           02  FMTBL43H    PICTURE X.
           02  FMTBL43V    PICTURE X.
           02  FMTBL43O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT44C    PICTURE X.
           02  FMACT44P    PICTURE X.
           02  FMACT44H    PICTURE X.
           02  FMACT44V    PICTURE X.
           02  FMACT44O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL44C    PICTURE X.
           02  FMTBL44P    PICTURE X.
           02  FMTBL44H    PICTURE X.
           02  FMTBL44V    PICTURE X.
           02  FMTBL44O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT45C    PICTURE X.
           02  FMACT45P    PICTURE X.
           02  FMACT45H    PICTURE X.
           02  FMACT45V    PICTURE X.
           02  FMACT45O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL45C    PICTURE X.
           02  FMTBL45P    PICTURE X.
           02  FMTBL45H    PICTURE X.
           02  FMTBL45V    PICTURE X.
           02  FMTBL45O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT46C    PICTURE X.
           02  FMACT46P    PICTURE X.
           02  FMACT46H    PICTURE X.
           02  FMACT46V    PICTURE X.
           02  FMACT46O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL46C    PICTURE X.
           02  FMTBL46P    PICTURE X.
           02  FMTBL46H    PICTURE X.
           02  FMTBL46V    PICTURE X.
           02  FMTBL46O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT47C    PICTURE X.
           02  FMACT47P    PICTURE X.
           02  FMACT47H    PICTURE X.
           02  FMACT47V    PICTURE X.
           02  FMACT47O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL47C    PICTURE X.
           02  FMTBL47P    PICTURE X.
           02  FMTBL47H    PICTURE X.
           02  FMTBL47V    PICTURE X.
           02  FMTBL47O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT48C    PICTURE X.
           02  FMACT48P    PICTURE X.
           02  FMACT48H    PICTURE X.
           02  FMACT48V    PICTURE X.
           02  FMACT48O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL48C    PICTURE X.
           02  FMTBL48P    PICTURE X.
           02  FMTBL48H    PICTURE X.
           02  FMTBL48V    PICTURE X.
           02  FMTBL48O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT49C    PICTURE X.
           02  FMACT49P    PICTURE X.
           02  FMACT49H    PICTURE X.
           02  FMACT49V    PICTURE X.
           02  FMACT49O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL49C    PICTURE X.
           02  FMTBL49P    PICTURE X.
           02  FMTBL49H    PICTURE X.
           02  FMTBL49V    PICTURE X.
           02  FMTBL49O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT50C    PICTURE X.
           02  FMACT50P    PICTURE X.
           02  FMACT50H    PICTURE X.
           02  FMACT50V    PICTURE X.
           02  FMACT50O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL50C    PICTURE X.
           02  FMTBL50P    PICTURE X.
           02  FMTBL50H    PICTURE X.
           02  FMTBL50V    PICTURE X.
           02  FMTBL50O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT51C    PICTURE X.
           02  FMACT51P    PICTURE X.
           02  FMACT51H    PICTURE X.
           02  FMACT51V    PICTURE X.
           02  FMACT51O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL51C    PICTURE X.
           02  FMTBL51P    PICTURE X.
           02  FMTBL51H    PICTURE X.
           02  FMTBL51V    PICTURE X.
           02  FMTBL51O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT52C    PICTURE X.
           02  FMACT52P    PICTURE X.
           02  FMACT52H    PICTURE X.
           02  FMACT52V    PICTURE X.
           02  FMACT52O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL52C    PICTURE X.
           02  FMTBL52P    PICTURE X.
           02  FMTBL52H    PICTURE X.
           02  FMTBL52V    PICTURE X.
           02  FMTBL52O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT53C    PICTURE X.
           02  FMACT53P    PICTURE X.
           02  FMACT53H    PICTURE X.
           02  FMACT53V    PICTURE X.
           02  FMACT53O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL53C    PICTURE X.
           02  FMTBL53P    PICTURE X.
           02  FMTBL53H    PICTURE X.
           02  FMTBL53V    PICTURE X.
           02  FMTBL53O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT54C    PICTURE X.
           02  FMACT54P    PICTURE X.
           02  FMACT54H    PICTURE X.
           02  FMACT54V    PICTURE X.
           02  FMACT54O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL54C    PICTURE X.
           02  FMTBL54P    PICTURE X.
           02  FMTBL54H    PICTURE X.
           02  FMTBL54V    PICTURE X.
           02  FMTBL54O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT55C    PICTURE X.
           02  FMACT55P    PICTURE X.
           02  FMACT55H    PICTURE X.
           02  FMACT55V    PICTURE X.
           02  FMACT55O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL55C    PICTURE X.
           02  FMTBL55P    PICTURE X.
           02  FMTBL55H    PICTURE X.
           02  FMTBL55V    PICTURE X.
           02  FMTBL55O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMACT56C    PICTURE X.
           02  FMACT56P    PICTURE X.
           02  FMACT56H    PICTURE X.
           02  FMACT56V    PICTURE X.
           02  FMACT56O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FMTBL56C    PICTURE X.
           02  FMTBL56P    PICTURE X.
           02  FMTBL56H    PICTURE X.
           02  FMTBL56V    PICTURE X.
           02  FMTBL56O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMPFS02C    PICTURE X.
           02  FMPFS02P    PICTURE X.
           02  FMPFS02H    PICTURE X.
           02  FMPFS02V    PICTURE X.
           02  FMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR02C    PICTURE X.
           02  FMERR02P    PICTURE X.
           02  FMERR02H    PICTURE X.
           02  FMERR02V    PICTURE X.
           02  FMERR02O  PIC X(79).
       01  FMRNM01I REDEFINES FMRNM02I.
           02  FILLER PIC X(12).
           02  FMTRANAL    COMP  PIC  S9(4).
           02  FMTRANAF    PICTURE X.
           02  FILLER REDEFINES FMTRANAF.
             03 FMTRANAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTRANAI  PIC X(4).
           02  FMDATEAL    COMP  PIC  S9(4).
           02  FMDATEAF    PICTURE X.
           02  FILLER REDEFINES FMDATEAF.
             03 FMDATEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMDATEAI  PIC X(8).
           02  FMTIMEAL    COMP  PIC  S9(4).
           02  FMTIMEAF    PICTURE X.
           02  FILLER REDEFINES FMTIMEAF.
             03 FMTIMEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTIMEAI  PIC X(8).
           02  FMTBLNAL    COMP  PIC  S9(4).
           02  FMTBLNAF    PICTURE X.
           02  FILLER REDEFINES FMTBLNAF.
             03 FMTBLNAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMTBLNAI  PIC X(4).
           02  FMCOMPAL    COMP  PIC  S9(4).
           02  FMCOMPAF    PICTURE X.
           02  FILLER REDEFINES FMCOMPAF.
             03 FMCOMPAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMCOMPAI  PIC X(4).
           02  FMSPCOAL    COMP  PIC  S9(4).
           02  FMSPCOAF    PICTURE X.
           02  FILLER REDEFINES FMSPCOAF.
             03 FMSPCOAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMSPCOAI  PIC X(4).
           02  FMPFS01L    COMP  PIC  S9(4).
           02  FMPFS01F    PICTURE X.
           02  FILLER REDEFINES FMPFS01F.
             03 FMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMPFS01I  PIC X(79).
           02  FMERR01L    COMP  PIC  S9(4).
           02  FMERR01F    PICTURE X.
           02  FILLER REDEFINES FMERR01F.
             03 FMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FMERR01I  PIC X(79).
       01  FMRNM01O REDEFINES FMRNM01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  FMTRANAC    PICTURE X.
           02  FMTRANAP    PICTURE X.
           02  FMTRANAH    PICTURE X.
           02  FMTRANAV    PICTURE X.
           02  FMTRANAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMDATEAC    PICTURE X.
           02  FMDATEAP    PICTURE X.
           02  FMDATEAH    PICTURE X.
           02  FMDATEAV    PICTURE X.
           02  FMDATEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTIMEAC    PICTURE X.
           02  FMTIMEAP    PICTURE X.
           02  FMTIMEAH    PICTURE X.
           02  FMTIMEAV    PICTURE X.
           02  FMTIMEAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FMTBLNAC    PICTURE X.
           02  FMTBLNAP    PICTURE X.
           02  FMTBLNAH    PICTURE X.
           02  FMTBLNAV    PICTURE X.
           02  FMTBLNAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMCOMPAC    PICTURE X.
           02  FMCOMPAP    PICTURE X.
           02  FMCOMPAH    PICTURE X.
           02  FMCOMPAV    PICTURE X.
           02  FMCOMPAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMSPCOAC    PICTURE X.
           02  FMSPCOAP    PICTURE X.
           02  FMSPCOAH    PICTURE X.
           02  FMSPCOAV    PICTURE X.
           02  FMSPCOAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  FMPFS01C    PICTURE X.
           02  FMPFS01P    PICTURE X.
           02  FMPFS01H    PICTURE X.
           02  FMPFS01V    PICTURE X.
           02  FMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  FMERR01C    PICTURE X.
           02  FMERR01P    PICTURE X.
           02  FMERR01H    PICTURE X.
           02  FMERR01V    PICTURE X.
           02  FMERR01O  PIC X(79).