*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*---------------------------------------------------------------------* 00010000
*                   ** COPYBOOK DESCRIPTION **                        * 00020000
*                                                                     * 00030000
* COPYBOOK:  GN2COMPU                                                 * 00040000
*            THIS COPYBOOK IS USED TO COMMUNICATE WITH GNBCOMPU.      * 00050000
*                                                                     * 00060000
*---------------------------------------------------------------------* 00070000
         EJECT                                                          00080000
*---------------------------------------------------------------------* 00090000
*                  ** HISTORY OF REVISIONS **                         * 00100000
*                                                                     * 00110000
* DESCRIPTION                                                 CHNGID  * 00120000
* __________________________________________________________  _______ * 00130000
* 07/13/05 INITIAL DISTRIBUTION                               ~~~5191   00140000
*                                                                     * 00150000
*---------------------------------------------------------------------* 00160000
GN2COMPU DSECT                   GNBCOMPU COMMUNICATIONS AREA           00170000
GN2C3EAD DS    F                 ADDRESS OF ICR 3E SEGMENT              00180000
GN2CFTAD DS    F                 ADDRESS OF FUNCTION TABLE              00190000
GN2CRTCD DS    F                 RETURN CODE                            00200000
GN2CVARA DS    0CL17             VARIABLE A VALUES                      00210000
         DS    PL16              VARIABLE A VALUE                       00220000
         DS    CL1               VARIABLE A DECIMAL POSITIONS           00230000
GN2CVARB DS    0CL17             VARIABLE B VALUES                      00240000
         DS    PL16              VARIABLE B VALUE                       00250000
         DS    CL1               VARIABLE B DECIMAL POSITIONS           00260000
GN2CVARC DS    0CL17             VARIABLE C VALUES                      00270000
         DS    PL16              VARIABLE C VALUE                       00280000
         DS    CL1               VARIABLE C DECIMAL POSITIONS           00290000
GN2CVARD DS    0CL17             VARIABLE D VALUES                      00300000
         DS    PL16              VARIABLE D VALUE                       00310000
         DS    CL1               VARIABLE D DECIMAL POSITIONS           00320000
GN2CVARE DS    0CL17             VARIABLE E VALUES                      00330000
         DS    PL16              VARIABLE E VALUE                       00340000
         DS    CL1               VARIABLE E DECIMAL POSITIONS           00350000
GN2CVARF DS    0CL17             VARIABLE F VALUES                      00360000
         DS    PL16              VARIABLE F VALUE                       00370000
         DS    CL1               VARIABLE F DECIMAL POSITIONS           00380000
GN2CVARG DS    0CL17             VARIABLE G VALUES                      00390000
         DS    PL16              VARIABLE G VALUE                       00400000
         DS    CL1               VARIABLE G DECIMAL POSITIONS           00410000
GN2CVARH DS    0CL17             VARIABLE H VALUES                      00420000
         DS    PL16              VARIABLE H VALUE                       00430000
         DS    CL1               VARIABLE H DECIMAL POSITIONS           00440000
GN2CRSLT DS    0CL17             RESULT VALUES                          00450000
         DS    PL16              RESULT VALUE                           00460000
         DS    CL1               RESULT DECIMAL POSITIONS               00470000