*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
         TITLE 'GN2TSSET - TSSETDB I/O COMMAREA'                        00001000
*********************************************************************** 00002000
* GN2TSSET - THIS COPYBOOK DESCRIBES THE COMMUNICATION AREA TO        * 00003000
*            THE TSSETDB DB2 I/O MODULES.                             * 00004000
*---------------------------------------------------------------------* 00005000
*                     ** HISTORY OF REVISIONS **                      * 00006000
* DESCRIPTION                                                 CHNGID  * 00007000
*------------------------------------------------------------ ------- * 00008000
* 10/31/16 INITIAL RELEASE                                     GN7046 * 00010000
*********************************************************************** 00011000
PSELIST  DS    0CL133                DB2 IO PARM LIST                   00012000
PSEFUNC  DS    CL2                   FUNCTION CODE                      00013000
*              VALUE 'DE'            DELETE                             00014000
*              VALUE 'EQ'            GET EQUAL                          00015000
*              VALUE 'GE'            GET GREATER THAN OR EQUAL          00016000
*              VALUE 'GT'            GET GREATER THAN                   00017000
*              VALUE 'GU'            GET FOR UPDATE                     00018000
*              VALUE 'IN'            INSERT                             00019000
*              VALUE 'LT'            GET LESS THAN                      00020000
*              VALUE 'UP'            UPDATE                             00021000
PSECURSR DS    CL1                   CURSOR SET FLAG                    00022000
*              VALUE Y               CURSOR SET YES                     00023000
*              VALUE N               CURSOR SET NO (DEFAULT)            00024000
PSEKEY   DS    CL2                   KEY                                00025000
PSERECAD DS    XL4                   RECORD ADDRESS                     00026000
PSERECLN DS    XL2                   RECORD LENGTH                      00027000
PSERTCDE DS    XL2                   RETURN CODE                        00028000
*              VALUE 0               OK                                 00029000
*              VALUE 16              BAD REQUEST                        00030000
*              VALUE 100             NOT FOUND OR END OF FILE           00031000
*              VALUE -305            NULLS                              00032000
*              VALUE -803            DUPLICATE RECORD                   00033000
*              VALUE -911            DEADLOCK WITH ROLLBACK             00034000
*              VALUE -913            DEADLOCK WITHOUT ROLLBACK          00035000
PSERTTXT DS    CL120                 MSG TEXT                           00036000
PSELEN   EQU   *-PSELIST             PARM LIST LENGTH                   00037000