       01  FIIM2CAI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMCNTL2L    COMP  PIC  S9(4).
           02  IMCNTL2F    PICTURE X.
           02  FILLER REDEFINES IMCNTL2F.
             03 IMCNTL2A    PICTURE X.
           02  IMCNTL2I  PIC X(3).
           02  IMCNTL3L    COMP  PIC  S9(4).
           02  IMCNTL3F    PICTURE X.
           02  FILLER REDEFINES IMCNTL3F.
             03 IMCNTL3A    PICTURE X.
           02  IMCNTL3I  PIC X(3).
           02  IMCNTL4L    COMP  PIC  S9(4).
           02  IMCNTL4F    PICTURE X.
           02  FILLER REDEFINES IMCNTL4F.
             03 IMCNTL4A    PICTURE X.
           02  IMCNTL4I  PIC X(4).
           02  IMACCTL    COMP  PIC  S9(4).
           02  IMACCTF    PICTURE X.
           02  FILLER REDEFINES IMACCTF.
             03 IMACCTA    PICTURE X.
           02  IMACCTI  PIC X(10).
           02  IMAPOSTL    COMP  PIC  S9(4).
           02  IMAPOSTF    PICTURE X.
           02  FILLER REDEFINES IMAPOSTF.
             03 IMAPOSTA    PICTURE X.
           02  IMAPOSTI  PIC X(1).
           02  IMINITL    COMP  PIC  S9(4).
           02  IMINITF    PICTURE X.
           02  FILLER REDEFINES IMINITF.
             03 IMINITA    PICTURE X.
           02  IMINITI  PIC X(3).
           02  IMCREQL    COMP  PIC  S9(4).
           02  IMCREQF    PICTURE X.
           02  FILLER REDEFINES IMCREQF.
             03 IMCREQA    PICTURE X.
           02  IMCREQI  PIC X(1).
           02  IMPSEQL    COMP  PIC  S9(4).
           02  IMPSEQF    PICTURE X.
           02  FILLER REDEFINES IMPSEQF.
             03 IMPSEQA    PICTURE X.
           02  IMPSEQI  PIC X(1).
           02  IMUSERCL    COMP  PIC  S9(4).
           02  IMUSERCF    PICTURE X.
           02  FILLER REDEFINES IMUSERCF.
             03 IMUSERCA    PICTURE X.
           02  IMUSERCI  PIC X(1).
           02  IMCALCPL    COMP  PIC  S9(4).
           02  IMCALCPF    PICTURE X.
           02  FILLER REDEFINES IMCALCPF.
             03 IMCALCPA    PICTURE X.
           02  IMCALCPI  PIC X(1).
           02  IMRATEPL    COMP  PIC  S9(4).
           02  IMRATEPF    PICTURE X.
           02  FILLER REDEFINES IMRATEPF.
             03 IMRATEPA    PICTURE X.
           02  IMRATEPI  PIC X(1).
           02  IMTRINPL    COMP  PIC  S9(4).
           02  IMTRINPF    PICTURE X.
           02  FILLER REDEFINES IMTRINPF.
             03 IMTRINPA    PICTURE X.
           02  IMTRINPI  PIC X(1).
           02  IMMXFLGL    COMP  PIC  S9(4).
           02  IMMXFLGF    PICTURE X.
           02  FILLER REDEFINES IMMXFLGF.
             03 IMMXFLGA    PICTURE X.
           02  IMMXFLGI  PIC X(1).
           02  IMMXAMTL    COMP  PIC  S9(4).
           02  IMMXAMTF    PICTURE X.
           02  FILLER REDEFINES IMMXAMTF.
             03 IMMXAMTA    PICTURE X.
           02  IMMXAMTI  PIC X(13).
           02  IMCMAIDL    COMP  PIC  S9(4).
           02  IMCMAIDF    PICTURE X.
           02  FILLER REDEFINES IMCMAIDF.
             03 IMCMAIDA    PICTURE X.
           02  IMCMAIDI  PIC X(1).
           02  IMCMAFCL    COMP  PIC  S9(4).
           02  IMCMAFCF    PICTURE X.
           02  FILLER REDEFINES IMCMAFCF.
             03 IMCMAFCA    PICTURE X.
           02  IMCMAFCI  PIC X(1).
           02  IMCMAFIL    COMP  PIC  S9(4).
           02  IMCMAFIF    PICTURE X.
           02  FILLER REDEFINES IMCMAFIF.
             03 IMCMAFIA    PICTURE X.
           02  IMCMAFII  PIC X(3).
           02  IMCMASDL    COMP  PIC  S9(4).
           02  IMCMASDF    PICTURE X.
           02  FILLER REDEFINES IMCMASDF.
             03 IMCMASDA    PICTURE X.
           02  IMCMASDI  PIC X(6).
           02  IMCMABCL    COMP  PIC  S9(4).
           02  IMCMABCF    PICTURE X.
           02  FILLER REDEFINES IMCMABCF.
             03 IMCMABCA    PICTURE X.
           02  IMCMABCI  PIC X(1).
           02  IMCMAPTL    COMP  PIC  S9(4).
           02  IMCMAPTF    PICTURE X.
           02  FILLER REDEFINES IMCMAPTF.
             03 IMCMAPTA    PICTURE X.
           02  IMCMAPTI  PIC X(1).
           02  IMDORFLL    COMP  PIC  S9(4).
           02  IMDORFLF    PICTURE X.
           02  FILLER REDEFINES IMDORFLF.
             03 IMDORFLA    PICTURE X.
           02  IMDORFLI  PIC X(1).
           02  IMDORDAL    COMP  PIC  S9(4).
           02  IMDORDAF    PICTURE X.
           02  FILLER REDEFINES IMDORDAF.
             03 IMDORDAA    PICTURE X.
           02  IMDORDAI  PIC X(3).
           02  IMMINSPL    COMP  PIC  S9(4).
           02  IMMINSPF    PICTURE X.
           02  FILLER REDEFINES IMMINSPF.
             03 IMMINSPA    PICTURE X.
           02  IMMINSPI  PIC X(13).
           02  IMMAXSPL    COMP  PIC  S9(4).
           02  IMMAXSPF    PICTURE X.
           02  FILLER REDEFINES IMMAXSPF.
             03 IMMAXSPA    PICTURE X.
           02  IMMAXSPI  PIC X(3).
           02  IMDSTCDL    COMP  PIC  S9(4).
           02  IMDSTCDF    PICTURE X.
           02  FILLER REDEFINES IMDSTCDF.
             03 IMDSTCDA    PICTURE X.
           02  IMDSTCDI  PIC X(1).
           02  IMXFRCDL    COMP  PIC  S9(4).
           02  IMXFRCDF    PICTURE X.
           02  FILLER REDEFINES IMXFRCDF.
             03 IMXFRCDA    PICTURE X.
           02  IMXFRCDI  PIC X(1).
           02  IMCMAUCL    COMP  PIC  S9(4).
           02  IMCMAUCF    PICTURE X.
           02  FILLER REDEFINES IMCMAUCF.
             03 IMCMAUCA    PICTURE X.
           02  IMCMAUCI  PIC X(1).
           02  IMXDRTCL    COMP  PIC  S9(4).
           02  IMXDRTCF    PICTURE X.
           02  FILLER REDEFINES IMXDRTCF.
             03 IMXDRTCA    PICTURE X.
           02  IMXDRTCI  PIC X(4).
           02  IMBHOPTL    COMP  PIC  S9(4).
           02  IMBHOPTF    PICTURE X.
           02  FILLER REDEFINES IMBHOPTF.
             03 IMBHOPTA    PICTURE X.
           02  IMBHOPTI  PIC X(1).
           02  IMXCRTCL    COMP  PIC  S9(4).
           02  IMXCRTCF    PICTURE X.
           02  FILLER REDEFINES IMXCRTCF.
             03 IMXCRTCA    PICTURE X.
           02  IMXCRTCI  PIC X(4).
           02  IMBHRETL    COMP  PIC  S9(4).
           02  IMBHRETF    PICTURE X.
           02  FILLER REDEFINES IMBHRETF.
             03 IMBHRETA    PICTURE X.
           02  IMBHRETI  PIC X(3).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIM2CAO REDEFINES FIIM2CAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMCNTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMAPOSTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMINITO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCREQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPSEQO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMUSERCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCALCPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMRATEPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMTRINPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMXFLGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMXAMTO PIC Z(12)9.
           02  FILLER PICTURE X(3).
           02  IMCMAIDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCMAFCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCMAFIO PIC ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCMASDO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMCMABCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCMAPTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMDORFLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMDORDAO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMMINSPO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMMAXSPO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMDSTCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMXFRCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCMAUCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMXDRTCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMBHOPTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMXCRTCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMBHRETO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).