       01  FIIM2EAI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMCNTL2L    COMP  PIC  S9(4).
           02  IMCNTL2F    PICTURE X.
           02  FILLER REDEFINES IMCNTL2F.
             03 IMCNTL2A    PICTURE X.
           02  IMCNTL2I  PIC X(3).
           02  IMCNTL3L    COMP  PIC  S9(4).
           02  IMCNTL3F    PICTURE X.
           02  FILLER REDEFINES IMCNTL3F.
             03 IMCNTL3A    PICTURE X.
           02  IMCNTL3I  PIC X(3).
           02  IMCNTL4L    COMP  PIC  S9(4).
           02  IMCNTL4F    PICTURE X.
           02  FILLER REDEFINES IMCNTL4F.
             03 IMCNTL4A    PICTURE X.
           02  IMCNTL4I  PIC X(4).
           02  IMACCTL    COMP  PIC  S9(4).
           02  IMACCTF    PICTURE X.
           02  FILLER REDEFINES IMACCTF.
             03 IMACCTA    PICTURE X.
           02  IMACCTI  PIC X(10).
           02  IMINITL    COMP  PIC  S9(4).
           02  IMINITF    PICTURE X.
           02  FILLER REDEFINES IMINITF.
             03 IMINITA    PICTURE X.
           02  IMINITI  PIC X(3).
           02  IMFLD01L    COMP  PIC  S9(4).
           02  IMFLD01F    PICTURE X.
           02  FILLER REDEFINES IMFLD01F.
             03 IMFLD01A    PICTURE X.
           02  IMFLD01I  PIC X(4).
           02  IMDAT01L    COMP  PIC  S9(4).
           02  IMDAT01F    PICTURE X.
           02  FILLER REDEFINES IMDAT01F.
             03 IMDAT01A    PICTURE X.
           02  IMDAT01I  PIC X(35).
           02  IMNEG01L    COMP  PIC  S9(4).
           02  IMNEG01F    PICTURE X.
           02  FILLER REDEFINES IMNEG01F.
             03 IMNEG01A    PICTURE X.
           02  IMNEG01I  PIC X(1).
           02  IMAPST1L    COMP  PIC  S9(4).
           02  IMAPST1F    PICTURE X.
           02  FILLER REDEFINES IMAPST1F.
             03 IMAPST1A    PICTURE X.
           02  IMAPST1I  PIC X(1).
           02  IMCREQ1L    COMP  PIC  S9(4).
           02  IMCREQ1F    PICTURE X.
           02  FILLER REDEFINES IMCREQ1F.
             03 IMCREQ1A    PICTURE X.
           02  IMCREQ1I  PIC X(1).
           02  IMPSEQ1L    COMP  PIC  S9(4).
           02  IMPSEQ1F    PICTURE X.
           02  FILLER REDEFINES IMPSEQ1F.
             03 IMPSEQ1A    PICTURE X.
           02  IMPSEQ1I  PIC X(1).
           02  IMFLD02L    COMP  PIC  S9(4).
           02  IMFLD02F    PICTURE X.
           02  FILLER REDEFINES IMFLD02F.
             03 IMFLD02A    PICTURE X.
           02  IMFLD02I  PIC X(4).
           02  IMDAT02L    COMP  PIC  S9(4).
           02  IMDAT02F    PICTURE X.
           02  FILLER REDEFINES IMDAT02F.
             03 IMDAT02A    PICTURE X.
           02  IMDAT02I  PIC X(35).
           02  IMNEG02L    COMP  PIC  S9(4).
           02  IMNEG02F    PICTURE X.
           02  FILLER REDEFINES IMNEG02F.
             03 IMNEG02A    PICTURE X.
           02  IMNEG02I  PIC X(1).
           02  IMAPST2L    COMP  PIC  S9(4).
           02  IMAPST2F    PICTURE X.
           02  FILLER REDEFINES IMAPST2F.
             03 IMAPST2A    PICTURE X.
           02  IMAPST2I  PIC X(1).
           02  IMCREQ2L    COMP  PIC  S9(4).
           02  IMCREQ2F    PICTURE X.
           02  FILLER REDEFINES IMCREQ2F.
             03 IMCREQ2A    PICTURE X.
           02  IMCREQ2I  PIC X(1).
           02  IMPSEQ2L    COMP  PIC  S9(4).
           02  IMPSEQ2F    PICTURE X.
           02  FILLER REDEFINES IMPSEQ2F.
             03 IMPSEQ2A    PICTURE X.
           02  IMPSEQ2I  PIC X(1).
           02  IMFLD03L    COMP  PIC  S9(4).
           02  IMFLD03F    PICTURE X.
           02  FILLER REDEFINES IMFLD03F.
             03 IMFLD03A    PICTURE X.
           02  IMFLD03I  PIC X(4).
           02  IMDAT03L    COMP  PIC  S9(4).
           02  IMDAT03F    PICTURE X.
           02  FILLER REDEFINES IMDAT03F.
             03 IMDAT03A    PICTURE X.
           02  IMDAT03I  PIC X(35).
           02  IMNEG03L    COMP  PIC  S9(4).
           02  IMNEG03F    PICTURE X.
           02  FILLER REDEFINES IMNEG03F.
             03 IMNEG03A    PICTURE X.
           02  IMNEG03I  PIC X(1).
           02  IMAPST3L    COMP  PIC  S9(4).
           02  IMAPST3F    PICTURE X.
           02  FILLER REDEFINES IMAPST3F.
             03 IMAPST3A    PICTURE X.
           02  IMAPST3I  PIC X(1).
           02  IMCREQ3L    COMP  PIC  S9(4).
           02  IMCREQ3F    PICTURE X.
           02  FILLER REDEFINES IMCREQ3F.
             03 IMCREQ3A    PICTURE X.
           02  IMCREQ3I  PIC X(1).
           02  IMPSEQ3L    COMP  PIC  S9(4).
           02  IMPSEQ3F    PICTURE X.
           02  FILLER REDEFINES IMPSEQ3F.
             03 IMPSEQ3A    PICTURE X.
           02  IMPSEQ3I  PIC X(1).
           02  IMFLD04L    COMP  PIC  S9(4).
           02  IMFLD04F    PICTURE X.
           02  FILLER REDEFINES IMFLD04F.
             03 IMFLD04A    PICTURE X.
           02  IMFLD04I  PIC X(4).
           02  IMDAT04L    COMP  PIC  S9(4).
           02  IMDAT04F    PICTURE X.
           02  FILLER REDEFINES IMDAT04F.
             03 IMDAT04A    PICTURE X.
           02  IMDAT04I  PIC X(35).
           02  IMNEG04L    COMP  PIC  S9(4).
           02  IMNEG04F    PICTURE X.
           02  FILLER REDEFINES IMNEG04F.
             03 IMNEG04A    PICTURE X.
           02  IMNEG04I  PIC X(1).
           02  IMAPST4L    COMP  PIC  S9(4).
           02  IMAPST4F    PICTURE X.
           02  FILLER REDEFINES IMAPST4F.
             03 IMAPST4A    PICTURE X.
           02  IMAPST4I  PIC X(1).
           02  IMCREQ4L    COMP  PIC  S9(4).
           02  IMCREQ4F    PICTURE X.
           02  FILLER REDEFINES IMCREQ4F.
             03 IMCREQ4A    PICTURE X.
           02  IMCREQ4I  PIC X(1).
           02  IMPSEQ4L    COMP  PIC  S9(4).
           02  IMPSEQ4F    PICTURE X.
           02  FILLER REDEFINES IMPSEQ4F.
             03 IMPSEQ4A    PICTURE X.
           02  IMPSEQ4I  PIC X(1).
           02  IMFLD05L    COMP  PIC  S9(4).
           02  IMFLD05F    PICTURE X.
           02  FILLER REDEFINES IMFLD05F.
             03 IMFLD05A    PICTURE X.
           02  IMFLD05I  PIC X(4).
           02  IMDAT05L    COMP  PIC  S9(4).
           02  IMDAT05F    PICTURE X.
           02  FILLER REDEFINES IMDAT05F.
             03 IMDAT05A    PICTURE X.
           02  IMDAT05I  PIC X(35).
           02  IMNEG05L    COMP  PIC  S9(4).
           02  IMNEG05F    PICTURE X.
           02  FILLER REDEFINES IMNEG05F.
             03 IMNEG05A    PICTURE X.
           02  IMNEG05I  PIC X(1).
           02  IMAPST5L    COMP  PIC  S9(4).
           02  IMAPST5F    PICTURE X.
           02  FILLER REDEFINES IMAPST5F.
             03 IMAPST5A    PICTURE X.
           02  IMAPST5I  PIC X(1).
           02  IMCREQ5L    COMP  PIC  S9(4).
           02  IMCREQ5F    PICTURE X.
           02  FILLER REDEFINES IMCREQ5F.
             03 IMCREQ5A    PICTURE X.
           02  IMCREQ5I  PIC X(1).
           02  IMPSEQ5L    COMP  PIC  S9(4).
           02  IMPSEQ5F    PICTURE X.
           02  FILLER REDEFINES IMPSEQ5F.
             03 IMPSEQ5A    PICTURE X.
           02  IMPSEQ5I  PIC X(1).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIM2EAO REDEFINES FIIM2EAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMCNTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMINITO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMFLD01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDAT01O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMNEG01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAPST1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCREQ1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPSEQ1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD02O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDAT02O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMNEG02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAPST2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCREQ2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPSEQ2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD03O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDAT03O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMNEG03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAPST3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCREQ3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPSEQ3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD04O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDAT04O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMNEG04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAPST4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCREQ4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPSEQ4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFLD05O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDAT05O  PIC X(35).
           02  FILLER PICTURE X(3).
           02  IMNEG05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMAPST5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCREQ5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPSEQ5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).