       01  IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN22L    COMP  PIC  S9(4).
           02  IMTRN22F    PICTURE X.
           02  FILLER REDEFINES IMTRN22F.
             03 IMTRN22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN22I  PIC X(4).
           02  BDATE24L    COMP  PIC  S9(4).
           02  BDATE24F    PICTURE X.
           02  FILLER REDEFINES BDATE24F.
             03 BDATE24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE24I  PIC X(8).
           02  BTIME24L    COMP  PIC  S9(4).
           02  BTIME24F    PICTURE X.
           02  FILLER REDEFINES BTIME24F.
             03 BTIME24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME24I  PIC X(8).
           02  IMPGE24L    COMP  PIC  S9(4).
           02  IMPGE24F    PICTURE X.
           02  FILLER REDEFINES IMPGE24F.
             03 IMPGE24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE24I  PIC X(2).
           02  CTL1024L    COMP  PIC  S9(4).
           02  CTL1024F    PICTURE X.
           02  FILLER REDEFINES CTL1024F.
             03 CTL1024A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1024I  PIC X(2).
           02  CTL2024L    COMP  PIC  S9(4).
           02  CTL2024F    PICTURE X.
           02  FILLER REDEFINES CTL2024F.
             03 CTL2024A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2024I  PIC X(3).
           02  CTL3024L    COMP  PIC  S9(4).
           02  CTL3024F    PICTURE X.
           02  FILLER REDEFINES CTL3024F.
             03 CTL3024A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3024I  PIC X(3).
           02  B200801L    COMP  PIC  S9(4).
           02  B200801F    PICTURE X.
           02  FILLER REDEFINES B200801F.
             03 B200801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200801I  PIC X(2).
           02  B200901L    COMP  PIC  S9(4).
           02  B200901F    PICTURE X.
           02  FILLER REDEFINES B200901F.
             03 B200901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200901I  PIC X(1).
           02  E200901L    COMP  PIC  S9(4).
           02  E200901F    PICTURE X.
           02  FILLER REDEFINES E200901F.
             03 E200901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200901I  PIC X(13).
           02  E301401L    COMP  PIC  S9(4).
           02  E301401F    PICTURE X.
           02  FILLER REDEFINES E301401F.
             03 E301401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301401I  PIC X(3).
           02  E301501L    COMP  PIC  S9(4).
           02  E301501F    PICTURE X.
           02  FILLER REDEFINES E301501F.
             03 E301501A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301501I  PIC X(3).
           02  B200802L    COMP  PIC  S9(4).
           02  B200802F    PICTURE X.
           02  FILLER REDEFINES B200802F.
             03 B200802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200802I  PIC X(2).
           02  B200902L    COMP  PIC  S9(4).
           02  B200902F    PICTURE X.
           02  FILLER REDEFINES B200902F.
             03 B200902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200902I  PIC X(1).
           02  E200902L    COMP  PIC  S9(4).
           02  E200902F    PICTURE X.
           02  FILLER REDEFINES E200902F.
             03 E200902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200902I  PIC X(13).
           02  E301402L    COMP  PIC  S9(4).
           02  E301402F    PICTURE X.
           02  FILLER REDEFINES E301402F.
             03 E301402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301402I  PIC X(3).
           02  B301502L    COMP  PIC  S9(4).
           02  B301502F    PICTURE X.
           02  FILLER REDEFINES B301502F.
             03 B301502A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301502I  PIC X(3).
           02  B200803L    COMP  PIC  S9(4).
           02  B200803F    PICTURE X.
           02  FILLER REDEFINES B200803F.
             03 B200803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200803I  PIC X(2).
           02  B200903L    COMP  PIC  S9(4).
           02  B200903F    PICTURE X.
           02  FILLER REDEFINES B200903F.
             03 B200903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200903I  PIC X(1).
           02  E200903L    COMP  PIC  S9(4).
           02  E200903F    PICTURE X.
           02  FILLER REDEFINES E200903F.
             03 E200903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200903I  PIC X(13).
           02  E301403L    COMP  PIC  S9(4).
           02  E301403F    PICTURE X.
           02  FILLER REDEFINES E301403F.
             03 E301403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301403I  PIC X(3).
           02  E301503L    COMP  PIC  S9(4).
           02  E301503F    PICTURE X.
           02  FILLER REDEFINES E301503F.
             03 E301503A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301503I  PIC X(3).
           02  B200804L    COMP  PIC  S9(4).
           02  B200804F    PICTURE X.
           02  FILLER REDEFINES B200804F.
             03 B200804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200804I  PIC X(2).
           02  B200904L    COMP  PIC  S9(4).
           02  B200904F    PICTURE X.
           02  FILLER REDEFINES B200904F.
             03 B200904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200904I  PIC X(1).
           02  E200904L    COMP  PIC  S9(4).
           02  E200904F    PICTURE X.
           02  FILLER REDEFINES E200904F.
             03 E200904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200904I  PIC X(13).
           02  E301404L    COMP  PIC  S9(4).
           02  E301404F    PICTURE X.
           02  FILLER REDEFINES E301404F.
             03 E301404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301404I  PIC X(3).
           02  E301504L    COMP  PIC  S9(4).
           02  E301504F    PICTURE X.
           02  FILLER REDEFINES E301504F.
             03 E301504A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301504I  PIC X(3).
           02  B200805L    COMP  PIC  S9(4).
           02  B200805F    PICTURE X.
           02  FILLER REDEFINES B200805F.
             03 B200805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200805I  PIC X(2).
           02  B200905L    COMP  PIC  S9(4).
           02  B200905F    PICTURE X.
           02  FILLER REDEFINES B200905F.
             03 B200905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200905I  PIC X(1).
           02  E200905L    COMP  PIC  S9(4).
           02  E200905F    PICTURE X.
           02  FILLER REDEFINES E200905F.
             03 E200905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200905I  PIC X(13).
           02  E301405L    COMP  PIC  S9(4).
           02  E301405F    PICTURE X.
           02  FILLER REDEFINES E301405F.
             03 E301405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301405I  PIC X(3).
           02  E301505L    COMP  PIC  S9(4).
           02  E301505F    PICTURE X.
           02  FILLER REDEFINES E301505F.
             03 E301505A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301505I  PIC X(3).
           02  B200806L    COMP  PIC  S9(4).
           02  B200806F    PICTURE X.
           02  FILLER REDEFINES B200806F.
             03 B200806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200806I  PIC X(2).
           02  B200906L    COMP  PIC  S9(4).
           02  B200906F    PICTURE X.
           02  FILLER REDEFINES B200906F.
             03 B200906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200906I  PIC X(1).
           02  E200906L    COMP  PIC  S9(4).
           02  E200906F    PICTURE X.
           02  FILLER REDEFINES E200906F.
             03 E200906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200906I  PIC X(13).
           02  E301406L    COMP  PIC  S9(4).
           02  E301406F    PICTURE X.
           02  FILLER REDEFINES E301406F.
             03 E301406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301406I  PIC X(3).
           02  E301506L    COMP  PIC  S9(4).
           02  E301506F    PICTURE X.
           02  FILLER REDEFINES E301506F.
             03 E301506A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301506I  PIC X(3).
           02  B200807L    COMP  PIC  S9(4).
           02  B200807F    PICTURE X.
           02  FILLER REDEFINES B200807F.
             03 B200807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200807I  PIC X(2).
           02  B200907L    COMP  PIC  S9(4).
           02  B200907F    PICTURE X.
           02  FILLER REDEFINES B200907F.
             03 B200907A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200907I  PIC X(1).
           02  E200907L    COMP  PIC  S9(4).
           02  E200907F    PICTURE X.
           02  FILLER REDEFINES E200907F.
             03 E200907A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200907I  PIC X(13).
           02  E301407L    COMP  PIC  S9(4).
           02  E301407F    PICTURE X.
           02  FILLER REDEFINES E301407F.
             03 E301407A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301407I  PIC X(3).
           02  E301507L    COMP  PIC  S9(4).
           02  E301507F    PICTURE X.
           02  FILLER REDEFINES E301507F.
             03 E301507A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301507I  PIC X(3).
           02  B200808L    COMP  PIC  S9(4).
           02  B200808F    PICTURE X.
           02  FILLER REDEFINES B200808F.
             03 B200808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200808I  PIC X(2).
           02  B200908L    COMP  PIC  S9(4).
           02  B200908F    PICTURE X.
           02  FILLER REDEFINES B200908F.
             03 B200908A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200908I  PIC X(1).
           02  E200908L    COMP  PIC  S9(4).
           02  E200908F    PICTURE X.
           02  FILLER REDEFINES E200908F.
             03 E200908A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200908I  PIC X(13).
           02  E301408L    COMP  PIC  S9(4).
           02  E301408F    PICTURE X.
           02  FILLER REDEFINES E301408F.
             03 E301408A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301408I  PIC X(3).
           02  E301508L    COMP  PIC  S9(4).
           02  E301508F    PICTURE X.
           02  FILLER REDEFINES E301508F.
             03 E301508A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301508I  PIC X(3).
           02  B200809L    COMP  PIC  S9(4).
           02  B200809F    PICTURE X.
           02  FILLER REDEFINES B200809F.
             03 B200809A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200809I  PIC X(2).
           02  B200909L    COMP  PIC  S9(4).
           02  B200909F    PICTURE X.
           02  FILLER REDEFINES B200909F.
             03 B200909A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200909I  PIC X(1).
           02  E200909L    COMP  PIC  S9(4).
           02  E200909F    PICTURE X.
           02  FILLER REDEFINES E200909F.
             03 E200909A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200909I  PIC X(13).
           02  E301409L    COMP  PIC  S9(4).
           02  E301409F    PICTURE X.
           02  FILLER REDEFINES E301409F.
             03 E301409A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301409I  PIC X(3).
           02  E301509L    COMP  PIC  S9(4).
           02  E301509F    PICTURE X.
           02  FILLER REDEFINES E301509F.
             03 E301509A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301509I  PIC X(3).
           02  B200810L    COMP  PIC  S9(4).
           02  B200810F    PICTURE X.
           02  FILLER REDEFINES B200810F.
             03 B200810A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200810I  PIC X(2).
           02  B200910L    COMP  PIC  S9(4).
           02  B200910F    PICTURE X.
           02  FILLER REDEFINES B200910F.
             03 B200910A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200910I  PIC X(1).
           02  E200910L    COMP  PIC  S9(4).
           02  E200910F    PICTURE X.
           02  FILLER REDEFINES E200910F.
             03 E200910A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200910I  PIC X(13).
           02  E301410L    COMP  PIC  S9(4).
           02  E301410F    PICTURE X.
           02  FILLER REDEFINES E301410F.
             03 E301410A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301410I  PIC X(3).
           02  E301510L    COMP  PIC  S9(4).
           02  E301510F    PICTURE X.
           02  FILLER REDEFINES E301510F.
             03 E301510A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301510I  PIC X(3).
           02  B200811L    COMP  PIC  S9(4).
           02  B200811F    PICTURE X.
           02  FILLER REDEFINES B200811F.
             03 B200811A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200811I  PIC X(2).
           02  B200911L    COMP  PIC  S9(4).
           02  B200911F    PICTURE X.
           02  FILLER REDEFINES B200911F.
             03 B200911A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200911I  PIC X(1).
           02  E200911L    COMP  PIC  S9(4).
           02  E200911F    PICTURE X.
           02  FILLER REDEFINES E200911F.
             03 E200911A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200911I  PIC X(13).
           02  E301411L    COMP  PIC  S9(4).
           02  E301411F    PICTURE X.
           02  FILLER REDEFINES E301411F.
             03 E301411A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301411I  PIC X(3).
           02  E301511L    COMP  PIC  S9(4).
           02  E301511F    PICTURE X.
           02  FILLER REDEFINES E301511F.
             03 E301511A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301511I  PIC X(3).
           02  B200812L    COMP  PIC  S9(4).
           02  B200812F    PICTURE X.
           02  FILLER REDEFINES B200812F.
             03 B200812A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200812I  PIC X(2).
           02  B200912L    COMP  PIC  S9(4).
           02  B200912F    PICTURE X.
           02  FILLER REDEFINES B200912F.
             03 B200912A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200912I  PIC X(1).
           02  E200912L    COMP  PIC  S9(4).
           02  E200912F    PICTURE X.
           02  FILLER REDEFINES E200912F.
             03 E200912A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200912I  PIC X(13).
           02  E301412L    COMP  PIC  S9(4).
           02  E301412F    PICTURE X.
           02  FILLER REDEFINES E301412F.
             03 E301412A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301412I  PIC X(3).
           02  E301512L    COMP  PIC  S9(4).
           02  E301512F    PICTURE X.
           02  FILLER REDEFINES E301512F.
             03 E301512A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301512I  PIC X(3).
           02  B200813L    COMP  PIC  S9(4).
           02  B200813F    PICTURE X.
           02  FILLER REDEFINES B200813F.
             03 B200813A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200813I  PIC X(2).
           02  B200913L    COMP  PIC  S9(4).
           02  B200913F    PICTURE X.
           02  FILLER REDEFINES B200913F.
             03 B200913A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200913I  PIC X(1).
           02  E200913L    COMP  PIC  S9(4).
           02  E200913F    PICTURE X.
           02  FILLER REDEFINES E200913F.
             03 E200913A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200913I  PIC X(13).
           02  E301413L    COMP  PIC  S9(4).
           02  E301413F    PICTURE X.
           02  FILLER REDEFINES E301413F.
             03 E301413A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301413I  PIC X(3).
           02  E301513L    COMP  PIC  S9(4).
           02  E301513F    PICTURE X.
           02  FILLER REDEFINES E301513F.
             03 E301513A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301513I  PIC X(3).
           02  B200814L    COMP  PIC  S9(4).
           02  B200814F    PICTURE X.
           02  FILLER REDEFINES B200814F.
             03 B200814A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200814I  PIC X(2).
           02  B200914L    COMP  PIC  S9(4).
           02  B200914F    PICTURE X.
           02  FILLER REDEFINES B200914F.
             03 B200914A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200914I  PIC X(1).
           02  E200914L    COMP  PIC  S9(4).
           02  E200914F    PICTURE X.
           02  FILLER REDEFINES E200914F.
             03 E200914A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200914I  PIC X(13).
           02  E301414L    COMP  PIC  S9(4).
           02  E301414F    PICTURE X.
           02  FILLER REDEFINES E301414F.
             03 E301414A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301414I  PIC X(3).
           02  E301514L    COMP  PIC  S9(4).
           02  E301514F    PICTURE X.
           02  FILLER REDEFINES E301514F.
             03 E301514A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301514I  PIC X(3).
           02  B200815L    COMP  PIC  S9(4).
           02  B200815F    PICTURE X.
           02  FILLER REDEFINES B200815F.
             03 B200815A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200815I  PIC X(2).
           02  B200915L    COMP  PIC  S9(4).
           02  B200915F    PICTURE X.
           02  FILLER REDEFINES B200915F.
             03 B200915A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200915I  PIC X(1).
           02  E200915L    COMP  PIC  S9(4).
           02  E200915F    PICTURE X.
           02  FILLER REDEFINES E200915F.
             03 E200915A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200915I  PIC X(13).
           02  E301415L    COMP  PIC  S9(4).
           02  E301415F    PICTURE X.
           02  FILLER REDEFINES E301415F.
             03 E301415A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301415I  PIC X(3).
           02  E301515L    COMP  PIC  S9(4).
           02  E301515F    PICTURE X.
           02  FILLER REDEFINES E301515F.
             03 E301515A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301515I  PIC X(3).
           02  B200816L    COMP  PIC  S9(4).
           02  B200816F    PICTURE X.
           02  FILLER REDEFINES B200816F.
             03 B200816A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200816I  PIC X(2).
           02  B200916L    COMP  PIC  S9(4).
           02  B200916F    PICTURE X.
           02  FILLER REDEFINES B200916F.
             03 B200916A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200916I  PIC X(1).
           02  E200916L    COMP  PIC  S9(4).
           02  E200916F    PICTURE X.
           02  FILLER REDEFINES E200916F.
             03 E200916A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200916I  PIC X(13).
           02  E301416L    COMP  PIC  S9(4).
           02  E301416F    PICTURE X.
           02  FILLER REDEFINES E301416F.
             03 E301416A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301416I  PIC X(3).
           02  E301516L    COMP  PIC  S9(4).
           02  E301516F    PICTURE X.
           02  FILLER REDEFINES E301516F.
             03 E301516A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301516I  PIC X(3).
           02  B200817L    COMP  PIC  S9(4).
           02  B200817F    PICTURE X.
           02  FILLER REDEFINES B200817F.
             03 B200817A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200817I  PIC X(2).
           02  B200917L    COMP  PIC  S9(4).
           02  B200917F    PICTURE X.
           02  FILLER REDEFINES B200917F.
             03 B200917A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200917I  PIC X(1).
           02  E200917L    COMP  PIC  S9(4).
           02  E200917F    PICTURE X.
           02  FILLER REDEFINES E200917F.
             03 E200917A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200917I  PIC X(13).
           02  E301417L    COMP  PIC  S9(4).
           02  E301417F    PICTURE X.
           02  FILLER REDEFINES E301417F.
             03 E301417A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301417I  PIC X(3).
           02  E301517L    COMP  PIC  S9(4).
           02  E301517F    PICTURE X.
           02  FILLER REDEFINES E301517F.
             03 E301517A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301517I  PIC X(3).
           02  B200818L    COMP  PIC  S9(4).
           02  B200818F    PICTURE X.
           02  FILLER REDEFINES B200818F.
             03 B200818A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200818I  PIC X(2).
           02  B200918L    COMP  PIC  S9(4).
           02  B200918F    PICTURE X.
           02  FILLER REDEFINES B200918F.
             03 B200918A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200918I  PIC X(1).
           02  E200918L    COMP  PIC  S9(4).
           02  E200918F    PICTURE X.
           02  FILLER REDEFINES E200918F.
             03 E200918A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200918I  PIC X(13).
           02  E301418L    COMP  PIC  S9(4).
           02  E301418F    PICTURE X.
           02  FILLER REDEFINES E301418F.
             03 E301418A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301418I  PIC X(3).
           02  E301518L    COMP  PIC  S9(4).
           02  E301518F    PICTURE X.
           02  FILLER REDEFINES E301518F.
             03 E301518A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301518I  PIC X(3).
           02  B200819L    COMP  PIC  S9(4).
           02  B200819F    PICTURE X.
           02  FILLER REDEFINES B200819F.
             03 B200819A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200819I  PIC X(2).
           02  B200919L    COMP  PIC  S9(4).
           02  B200919F    PICTURE X.
           02  FILLER REDEFINES B200919F.
             03 B200919A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200919I  PIC X(1).
           02  E200919L    COMP  PIC  S9(4).
           02  E200919F    PICTURE X.
           02  FILLER REDEFINES E200919F.
             03 E200919A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200919I  PIC X(13).
           02  E301419L    COMP  PIC  S9(4).
           02  E301419F    PICTURE X.
           02  FILLER REDEFINES E301419F.
             03 E301419A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301419I  PIC X(3).
           02  E301519L    COMP  PIC  S9(4).
           02  E301519F    PICTURE X.
           02  FILLER REDEFINES E301519F.
             03 E301519A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301519I  PIC X(3).
           02  B200820L    COMP  PIC  S9(4).
           02  B200820F    PICTURE X.
           02  FILLER REDEFINES B200820F.
             03 B200820A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200820I  PIC X(2).
           02  B200920L    COMP  PIC  S9(4).
           02  B200920F    PICTURE X.
           02  FILLER REDEFINES B200920F.
             03 B200920A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200920I  PIC X(1).
           02  E200920L    COMP  PIC  S9(4).
           02  E200920F    PICTURE X.
           02  FILLER REDEFINES E200920F.
             03 E200920A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200920I  PIC X(13).
           02  E301420L    COMP  PIC  S9(4).
           02  E301420F    PICTURE X.
           02  FILLER REDEFINES E301420F.
             03 E301420A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301420I  PIC X(3).
           02  E301520L    COMP  PIC  S9(4).
           02  E301520F    PICTURE X.
           02  FILLER REDEFINES E301520F.
             03 E301520A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301520I  PIC X(3).
           02  B200821L    COMP  PIC  S9(4).
           02  B200821F    PICTURE X.
           02  FILLER REDEFINES B200821F.
             03 B200821A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200821I  PIC X(2).
           02  B200921L    COMP  PIC  S9(4).
           02  B200921F    PICTURE X.
           02  FILLER REDEFINES B200921F.
             03 B200921A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200921I  PIC X(1).
           02  E200921L    COMP  PIC  S9(4).
           02  E200921F    PICTURE X.
           02  FILLER REDEFINES E200921F.
             03 E200921A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200921I  PIC X(13).
           02  E301421L    COMP  PIC  S9(4).
           02  E301421F    PICTURE X.
           02  FILLER REDEFINES E301421F.
             03 E301421A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301421I  PIC X(3).
           02  E301521L    COMP  PIC  S9(4).
           02  E301521F    PICTURE X.
           02  FILLER REDEFINES E301521F.
             03 E301521A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301521I  PIC X(3).
           02  B200822L    COMP  PIC  S9(4).
           02  B200822F    PICTURE X.
           02  FILLER REDEFINES B200822F.
             03 B200822A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200822I  PIC X(2).
           02  B200922L    COMP  PIC  S9(4).
           02  B200922F    PICTURE X.
           02  FILLER REDEFINES B200922F.
             03 B200922A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200922I  PIC X(1).
           02  E200922L    COMP  PIC  S9(4).
           02  E200922F    PICTURE X.
           02  FILLER REDEFINES E200922F.
             03 E200922A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200922I  PIC X(13).
           02  E301422L    COMP  PIC  S9(4).
           02  E301422F    PICTURE X.
           02  FILLER REDEFINES E301422F.
             03 E301422A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301422I  PIC X(3).
           02  E301522L    COMP  PIC  S9(4).
           02  E301522F    PICTURE X.
           02  FILLER REDEFINES E301522F.
             03 E301522A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301522I  PIC X(3).
           02  B200823L    COMP  PIC  S9(4).
           02  B200823F    PICTURE X.
           02  FILLER REDEFINES B200823F.
             03 B200823A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200823I  PIC X(2).
           02  B200923L    COMP  PIC  S9(4).
           02  B200923F    PICTURE X.
           02  FILLER REDEFINES B200923F.
             03 B200923A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200923I  PIC X(1).
           02  E200923L    COMP  PIC  S9(4).
           02  E200923F    PICTURE X.
           02  FILLER REDEFINES E200923F.
             03 E200923A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200923I  PIC X(13).
           02  E301423L    COMP  PIC  S9(4).
           02  E301423F    PICTURE X.
           02  FILLER REDEFINES E301423F.
             03 E301423A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301423I  PIC X(3).
           02  E301523L    COMP  PIC  S9(4).
           02  E301523F    PICTURE X.
           02  FILLER REDEFINES E301523F.
             03 E301523A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301523I  PIC X(3).
           02  B200824L    COMP  PIC  S9(4).
           02  B200824F    PICTURE X.
           02  FILLER REDEFINES B200824F.
             03 B200824A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200824I  PIC X(2).
           02  B200924L    COMP  PIC  S9(4).
           02  B200924F    PICTURE X.
           02  FILLER REDEFINES B200924F.
             03 B200924A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200924I  PIC X(1).
           02  E200924L    COMP  PIC  S9(4).
           02  E200924F    PICTURE X.
           02  FILLER REDEFINES E200924F.
             03 E200924A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200924I  PIC X(13).
           02  E301424L    COMP  PIC  S9(4).
           02  E301424F    PICTURE X.
           02  FILLER REDEFINES E301424F.
             03 E301424A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301424I  PIC X(3).
           02  E301524L    COMP  PIC  S9(4).
           02  E301524F    PICTURE X.
           02  FILLER REDEFINES E301524F.
             03 E301524A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301524I  PIC X(3).
           02  B200825L    COMP  PIC  S9(4).
           02  B200825F    PICTURE X.
           02  FILLER REDEFINES B200825F.
             03 B200825A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200825I  PIC X(2).
           02  B200925L    COMP  PIC  S9(4).
           02  B200925F    PICTURE X.
           02  FILLER REDEFINES B200925F.
             03 B200925A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200925I  PIC X(1).
           02  E200925L    COMP  PIC  S9(4).
           02  E200925F    PICTURE X.
           02  FILLER REDEFINES E200925F.
             03 E200925A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200925I  PIC X(13).
           02  E301425L    COMP  PIC  S9(4).
           02  E301425F    PICTURE X.
           02  FILLER REDEFINES E301425F.
             03 E301425A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301425I  PIC X(3).
           02  E301525L    COMP  PIC  S9(4).
           02  E301525F    PICTURE X.
           02  FILLER REDEFINES E301525F.
             03 E301525A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301525I  PIC X(3).
           02  B200826L    COMP  PIC  S9(4).
           02  B200826F    PICTURE X.
           02  FILLER REDEFINES B200826F.
             03 B200826A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200826I  PIC X(2).
           02  B200926L    COMP  PIC  S9(4).
           02  B200926F    PICTURE X.
           02  FILLER REDEFINES B200926F.
             03 B200926A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200926I  PIC X(1).
           02  E200926L    COMP  PIC  S9(4).
           02  E200926F    PICTURE X.
           02  FILLER REDEFINES E200926F.
             03 E200926A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200926I  PIC X(13).
           02  E301426L    COMP  PIC  S9(4).
           02  E301426F    PICTURE X.
           02  FILLER REDEFINES E301426F.
             03 E301426A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301426I  PIC X(3).
           02  E301526L    COMP  PIC  S9(4).
           02  E301526F    PICTURE X.
           02  FILLER REDEFINES E301526F.
             03 E301526A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301526I  PIC X(3).
           02  B200827L    COMP  PIC  S9(4).
           02  B200827F    PICTURE X.
           02  FILLER REDEFINES B200827F.
             03 B200827A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200827I  PIC X(2).
           02  B200927L    COMP  PIC  S9(4).
           02  B200927F    PICTURE X.
           02  FILLER REDEFINES B200927F.
             03 B200927A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200927I  PIC X(1).
           02  E200927L    COMP  PIC  S9(4).
           02  E200927F    PICTURE X.
           02  FILLER REDEFINES E200927F.
             03 E200927A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200927I  PIC X(13).
           02  E301427L    COMP  PIC  S9(4).
           02  E301427F    PICTURE X.
           02  FILLER REDEFINES E301427F.
             03 E301427A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301427I  PIC X(3).
           02  E301527L    COMP  PIC  S9(4).
           02  E301527F    PICTURE X.
           02  FILLER REDEFINES E301527F.
             03 E301527A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301527I  PIC X(3).
           02  B200828L    COMP  PIC  S9(4).
           02  B200828F    PICTURE X.
           02  FILLER REDEFINES B200828F.
             03 B200828A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200828I  PIC X(2).
           02  B200928L    COMP  PIC  S9(4).
           02  B200928F    PICTURE X.
           02  FILLER REDEFINES B200928F.
             03 B200928A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200928I  PIC X(1).
           02  E200928L    COMP  PIC  S9(4).
           02  E200928F    PICTURE X.
           02  FILLER REDEFINES E200928F.
             03 E200928A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200928I  PIC X(13).
           02  E301428L    COMP  PIC  S9(4).
           02  E301428F    PICTURE X.
           02  FILLER REDEFINES E301428F.
             03 E301428A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301428I  PIC X(3).
           02  E301528L    COMP  PIC  S9(4).
           02  E301528F    PICTURE X.
           02  FILLER REDEFINES E301528F.
             03 E301528A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301528I  PIC X(3).
           02  IMPFS23L    COMP  PIC  S9(4).
           02  IMPFS23F    PICTURE X.
           02  FILLER REDEFINES IMPFS23F.
             03 IMPFS23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS23I  PIC X(79).
           02  IMERR23L    COMP  PIC  S9(4).
           02  IMERR23F    PICTURE X.
           02  FILLER REDEFINES IMERR23F.
             03 IMERR23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR23I  PIC X(79).
       01  IMB1M23O REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN22C    PICTURE X.
           02  IMTRN22P    PICTURE X.
           02  IMTRN22H    PICTURE X.
           02  IMTRN22V    PICTURE X.
           02  IMTRN22O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE24C    PICTURE X.
           02  BDATE24P    PICTURE X.
           02  BDATE24H    PICTURE X.
           02  BDATE24V    PICTURE X.
           02  BDATE24O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME24C    PICTURE X.
           02  BTIME24P    PICTURE X.
           02  BTIME24H    PICTURE X.
           02  BTIME24V    PICTURE X.
           02  BTIME24O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE24C    PICTURE X.
           02  IMPGE24P    PICTURE X.
           02  IMPGE24H    PICTURE X.
           02  IMPGE24V    PICTURE X.
           02  IMPGE24O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1024C    PICTURE X.
           02  CTL1024P    PICTURE X.
           02  CTL1024H    PICTURE X.
           02  CTL1024V    PICTURE X.
           02  CTL1024O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2024C    PICTURE X.
           02  CTL2024P    PICTURE X.
           02  CTL2024H    PICTURE X.
           02  CTL2024V    PICTURE X.
           02  CTL2024O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3024C    PICTURE X.
           02  CTL3024P    PICTURE X.
           02  CTL3024H    PICTURE X.
           02  CTL3024V    PICTURE X.
           02  CTL3024O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200801C    PICTURE X.
           02  B200801P    PICTURE X.
           02  B200801H    PICTURE X.
           02  B200801V    PICTURE X.
           02  B200801O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200901C    PICTURE X.
           02  B200901P    PICTURE X.
           02  B200901H    PICTURE X.
           02  B200901V    PICTURE X.
           02  B200901O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200901C    PICTURE X.
           02  E200901P    PICTURE X.
           02  E200901H    PICTURE X.
           02  E200901V    PICTURE X.
           02  E200901O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301401C    PICTURE X.
           02  E301401P    PICTURE X.
           02  E301401H    PICTURE X.
           02  E301401V    PICTURE X.
           02  E301401O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301501C    PICTURE X.
           02  E301501P    PICTURE X.
           02  E301501H    PICTURE X.
           02  E301501V    PICTURE X.
           02  E301501O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200802C    PICTURE X.
           02  B200802P    PICTURE X.
           02  B200802H    PICTURE X.
           02  B200802V    PICTURE X.
           02  B200802O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200902C    PICTURE X.
           02  B200902P    PICTURE X.
           02  B200902H    PICTURE X.
           02  B200902V    PICTURE X.
           02  B200902O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200902C    PICTURE X.
           02  E200902P    PICTURE X.
           02  E200902H    PICTURE X.
           02  E200902V    PICTURE X.
           02  E200902O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301402C    PICTURE X.
           02  E301402P    PICTURE X.
           02  E301402H    PICTURE X.
           02  E301402V    PICTURE X.
           02  E301402O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B301502C    PICTURE X.
           02  B301502P    PICTURE X.
           02  B301502H    PICTURE X.
           02  B301502V    PICTURE X.
           02  B301502O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200803C    PICTURE X.
           02  B200803P    PICTURE X.
           02  B200803H    PICTURE X.
           02  B200803V    PICTURE X.
           02  B200803O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200903C    PICTURE X.
           02  B200903P    PICTURE X.
           02  B200903H    PICTURE X.
           02  B200903V    PICTURE X.
           02  B200903O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200903C    PICTURE X.
           02  E200903P    PICTURE X.
           02  E200903H    PICTURE X.
           02  E200903V    PICTURE X.
           02  E200903O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301403C    PICTURE X.
           02  E301403P    PICTURE X.
           02  E301403H    PICTURE X.
           02  E301403V    PICTURE X.
           02  E301403O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301503C    PICTURE X.
           02  E301503P    PICTURE X.
           02  E301503H    PICTURE X.
           02  E301503V    PICTURE X.
           02  E301503O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200804C    PICTURE X.
           02  B200804P    PICTURE X.
           02  B200804H    PICTURE X.
           02  B200804V    PICTURE X.
           02  B200804O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200904C    PICTURE X.
           02  B200904P    PICTURE X.
           02  B200904H    PICTURE X.
           02  B200904V    PICTURE X.
           02  B200904O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200904C    PICTURE X.
           02  E200904P    PICTURE X.
           02  E200904H    PICTURE X.
           02  E200904V    PICTURE X.
           02  E200904O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301404C    PICTURE X.
           02  E301404P    PICTURE X.
           02  E301404H    PICTURE X.
           02  E301404V    PICTURE X.
           02  E301404O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301504C    PICTURE X.
           02  E301504P    PICTURE X.
           02  E301504H    PICTURE X.
           02  E301504V    PICTURE X.
           02  E301504O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200805C    PICTURE X.
           02  B200805P    PICTURE X.
           02  B200805H    PICTURE X.
           02  B200805V    PICTURE X.
           02  B200805O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200905C    PICTURE X.
           02  B200905P    PICTURE X.
           02  B200905H    PICTURE X.
           02  B200905V    PICTURE X.
           02  B200905O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200905C    PICTURE X.
           02  E200905P    PICTURE X.
           02  E200905H    PICTURE X.
           02  E200905V    PICTURE X.
           02  E200905O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301405C    PICTURE X.
           02  E301405P    PICTURE X.
           02  E301405H    PICTURE X.
           02  E301405V    PICTURE X.
           02  E301405O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301505C    PICTURE X.
           02  E301505P    PICTURE X.
           02  E301505H    PICTURE X.
           02  E301505V    PICTURE X.
           02  E301505O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200806C    PICTURE X.
           02  B200806P    PICTURE X.
           02  B200806H    PICTURE X.
           02  B200806V    PICTURE X.
           02  B200806O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200906C    PICTURE X.
           02  B200906P    PICTURE X.
           02  B200906H    PICTURE X.
           02  B200906V    PICTURE X.
           02  B200906O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200906C    PICTURE X.
           02  E200906P    PICTURE X.
           02  E200906H    PICTURE X.
           02  E200906V    PICTURE X.
           02  E200906O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301406C    PICTURE X.
           02  E301406P    PICTURE X.
           02  E301406H    PICTURE X.
           02  E301406V    PICTURE X.
           02  E301406O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301506C    PICTURE X.
           02  E301506P    PICTURE X.
           02  E301506H    PICTURE X.
           02  E301506V    PICTURE X.
           02  E301506O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200807C    PICTURE X.
           02  B200807P    PICTURE X.
           02  B200807H    PICTURE X.
           02  B200807V    PICTURE X.
           02  B200807O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200907C    PICTURE X.
           02  B200907P    PICTURE X.
           02  B200907H    PICTURE X.
           02  B200907V    PICTURE X.
           02  B200907O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200907C    PICTURE X.
           02  E200907P    PICTURE X.
           02  E200907H    PICTURE X.
           02  E200907V    PICTURE X.
           02  E200907O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301407C    PICTURE X.
           02  E301407P    PICTURE X.
           02  E301407H    PICTURE X.
           02  E301407V    PICTURE X.
           02  E301407O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301507C    PICTURE X.
           02  E301507P    PICTURE X.
           02  E301507H    PICTURE X.
           02  E301507V    PICTURE X.
           02  E301507O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200808C    PICTURE X.
           02  B200808P    PICTURE X.
           02  B200808H    PICTURE X.
           02  B200808V    PICTURE X.
           02  B200808O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200908C    PICTURE X.
           02  B200908P    PICTURE X.
           02  B200908H    PICTURE X.
           02  B200908V    PICTURE X.
           02  B200908O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200908C    PICTURE X.
           02  E200908P    PICTURE X.
           02  E200908H    PICTURE X.
           02  E200908V    PICTURE X.
           02  E200908O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301408C    PICTURE X.
           02  E301408P    PICTURE X.
           02  E301408H    PICTURE X.
           02  E301408V    PICTURE X.
           02  E301408O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301508C    PICTURE X.
           02  E301508P    PICTURE X.
           02  E301508H    PICTURE X.
           02  E301508V    PICTURE X.
           02  E301508O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200809C    PICTURE X.
           02  B200809P    PICTURE X.
           02  B200809H    PICTURE X.
           02  B200809V    PICTURE X.
           02  B200809O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200909C    PICTURE X.
           02  B200909P    PICTURE X.
           02  B200909H    PICTURE X.
           02  B200909V    PICTURE X.
           02  B200909O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200909C    PICTURE X.
           02  E200909P    PICTURE X.
           02  E200909H    PICTURE X.
           02  E200909V    PICTURE X.
           02  E200909O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301409C    PICTURE X.
           02  E301409P    PICTURE X.
           02  E301409H    PICTURE X.
           02  E301409V    PICTURE X.
           02  E301409O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301509C    PICTURE X.
           02  E301509P    PICTURE X.
           02  E301509H    PICTURE X.
           02  E301509V    PICTURE X.
           02  E301509O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200810C    PICTURE X.
           02  B200810P    PICTURE X.
           02  B200810H    PICTURE X.
           02  B200810V    PICTURE X.
           02  B200810O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200910C    PICTURE X.
           02  B200910P    PICTURE X.
           02  B200910H    PICTURE X.
           02  B200910V    PICTURE X.
           02  B200910O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200910C    PICTURE X.
           02  E200910P    PICTURE X.
           02  E200910H    PICTURE X.
           02  E200910V    PICTURE X.
           02  E200910O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301410C    PICTURE X.
           02  E301410P    PICTURE X.
           02  E301410H    PICTURE X.
           02  E301410V    PICTURE X.
           02  E301410O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301510C    PICTURE X.
           02  E301510P    PICTURE X.
           02  E301510H    PICTURE X.
           02  E301510V    PICTURE X.
           02  E301510O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200811C    PICTURE X.
           02  B200811P    PICTURE X.
           02  B200811H    PICTURE X.
           02  B200811V    PICTURE X.
           02  B200811O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200911C    PICTURE X.
           02  B200911P    PICTURE X.
           02  B200911H    PICTURE X.
           02  B200911V    PICTURE X.
           02  B200911O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200911C    PICTURE X.
           02  E200911P    PICTURE X.
           02  E200911H    PICTURE X.
           02  E200911V    PICTURE X.
           02  E200911O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301411C    PICTURE X.
           02  E301411P    PICTURE X.
           02  E301411H    PICTURE X.
           02  E301411V    PICTURE X.
           02  E301411O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301511C    PICTURE X.
           02  E301511P    PICTURE X.
           02  E301511H    PICTURE X.
           02  E301511V    PICTURE X.
           02  E301511O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200812C    PICTURE X.
           02  B200812P    PICTURE X.
           02  B200812H    PICTURE X.
           02  B200812V    PICTURE X.
           02  B200812O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200912C    PICTURE X.
           02  B200912P    PICTURE X.
           02  B200912H    PICTURE X.
           02  B200912V    PICTURE X.
           02  B200912O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200912C    PICTURE X.
           02  E200912P    PICTURE X.
           02  E200912H    PICTURE X.
           02  E200912V    PICTURE X.
           02  E200912O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301412C    PICTURE X.
           02  E301412P    PICTURE X.
           02  E301412H    PICTURE X.
           02  E301412V    PICTURE X.
           02  E301412O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301512C    PICTURE X.
           02  E301512P    PICTURE X.
           02  E301512H    PICTURE X.
           02  E301512V    PICTURE X.
           02  E301512O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200813C    PICTURE X.
           02  B200813P    PICTURE X.
           02  B200813H    PICTURE X.
           02  B200813V    PICTURE X.
           02  B200813O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200913C    PICTURE X.
           02  B200913P    PICTURE X.
           02  B200913H    PICTURE X.
           02  B200913V    PICTURE X.
           02  B200913O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200913C    PICTURE X.
           02  E200913P    PICTURE X.
           02  E200913H    PICTURE X.
           02  E200913V    PICTURE X.
           02  E200913O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301413C    PICTURE X.
           02  E301413P    PICTURE X.
           02  E301413H    PICTURE X.
           02  E301413V    PICTURE X.
           02  E301413O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301513C    PICTURE X.
           02  E301513P    PICTURE X.
           02  E301513H    PICTURE X.
           02  E301513V    PICTURE X.
           02  E301513O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200814C    PICTURE X.
           02  B200814P    PICTURE X.
           02  B200814H    PICTURE X.
           02  B200814V    PICTURE X.
           02  B200814O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200914C    PICTURE X.
           02  B200914P    PICTURE X.
           02  B200914H    PICTURE X.
           02  B200914V    PICTURE X.
           02  B200914O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200914C    PICTURE X.
           02  E200914P    PICTURE X.
           02  E200914H    PICTURE X.
           02  E200914V    PICTURE X.
           02  E200914O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301414C    PICTURE X.
           02  E301414P    PICTURE X.
           02  E301414H    PICTURE X.
           02  E301414V    PICTURE X.
           02  E301414O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301514C    PICTURE X.
           02  E301514P    PICTURE X.
           02  E301514H    PICTURE X.
           02  E301514V    PICTURE X.
           02  E301514O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200815C    PICTURE X.
           02  B200815P    PICTURE X.
           02  B200815H    PICTURE X.
           02  B200815V    PICTURE X.
           02  B200815O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200915C    PICTURE X.
           02  B200915P    PICTURE X.
           02  B200915H    PICTURE X.
           02  B200915V    PICTURE X.
           02  B200915O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200915C    PICTURE X.
           02  E200915P    PICTURE X.
           02  E200915H    PICTURE X.
           02  E200915V    PICTURE X.
           02  E200915O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301415C    PICTURE X.
           02  E301415P    PICTURE X.
           02  E301415H    PICTURE X.
           02  E301415V    PICTURE X.
           02  E301415O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301515C    PICTURE X.
           02  E301515P    PICTURE X.
           02  E301515H    PICTURE X.
           02  E301515V    PICTURE X.
           02  E301515O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200816C    PICTURE X.
           02  B200816P    PICTURE X.
           02  B200816H    PICTURE X.
           02  B200816V    PICTURE X.
           02  B200816O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200916C    PICTURE X.
           02  B200916P    PICTURE X.
           02  B200916H    PICTURE X.
           02  B200916V    PICTURE X.
           02  B200916O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200916C    PICTURE X.
           02  E200916P    PICTURE X.
           02  E200916H    PICTURE X.
           02  E200916V    PICTURE X.
           02  E200916O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301416C    PICTURE X.
           02  E301416P    PICTURE X.
           02  E301416H    PICTURE X.
           02  E301416V    PICTURE X.
           02  E301416O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301516C    PICTURE X.
           02  E301516P    PICTURE X.
           02  E301516H    PICTURE X.
           02  E301516V    PICTURE X.
           02  E301516O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200817C    PICTURE X.
           02  B200817P    PICTURE X.
           02  B200817H    PICTURE X.
           02  B200817V    PICTURE X.
           02  B200817O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200917C    PICTURE X.
           02  B200917P    PICTURE X.
           02  B200917H    PICTURE X.
           02  B200917V    PICTURE X.
           02  B200917O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200917C    PICTURE X.
           02  E200917P    PICTURE X.
           02  E200917H    PICTURE X.
           02  E200917V    PICTURE X.
           02  E200917O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301417C    PICTURE X.
           02  E301417P    PICTURE X.
           02  E301417H    PICTURE X.
           02  E301417V    PICTURE X.
           02  E301417O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301517C    PICTURE X.
           02  E301517P    PICTURE X.
           02  E301517H    PICTURE X.
           02  E301517V    PICTURE X.
           02  E301517O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200818C    PICTURE X.
           02  B200818P    PICTURE X.
           02  B200818H    PICTURE X.
           02  B200818V    PICTURE X.
           02  B200818O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200918C    PICTURE X.
           02  B200918P    PICTURE X.
           02  B200918H    PICTURE X.
           02  B200918V    PICTURE X.
           02  B200918O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200918C    PICTURE X.
           02  E200918P    PICTURE X.
           02  E200918H    PICTURE X.
           02  E200918V    PICTURE X.
           02  E200918O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301418C    PICTURE X.
           02  E301418P    PICTURE X.
           02  E301418H    PICTURE X.
           02  E301418V    PICTURE X.
           02  E301418O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301518C    PICTURE X.
           02  E301518P    PICTURE X.
           02  E301518H    PICTURE X.
           02  E301518V    PICTURE X.
           02  E301518O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200819C    PICTURE X.
           02  B200819P    PICTURE X.
           02  B200819H    PICTURE X.
           02  B200819V    PICTURE X.
           02  B200819O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200919C    PICTURE X.
           02  B200919P    PICTURE X.
           02  B200919H    PICTURE X.
           02  B200919V    PICTURE X.
           02  B200919O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200919C    PICTURE X.
           02  E200919P    PICTURE X.
           02  E200919H    PICTURE X.
           02  E200919V    PICTURE X.
           02  E200919O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301419C    PICTURE X.
           02  E301419P    PICTURE X.
           02  E301419H    PICTURE X.
           02  E301419V    PICTURE X.
           02  E301419O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301519C    PICTURE X.
           02  E301519P    PICTURE X.
           02  E301519H    PICTURE X.
           02  E301519V    PICTURE X.
           02  E301519O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200820C    PICTURE X.
           02  B200820P    PICTURE X.
           02  B200820H    PICTURE X.
           02  B200820V    PICTURE X.
           02  B200820O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200920C    PICTURE X.
           02  B200920P    PICTURE X.
           02  B200920H    PICTURE X.
           02  B200920V    PICTURE X.
           02  B200920O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200920C    PICTURE X.
           02  E200920P    PICTURE X.
           02  E200920H    PICTURE X.
           02  E200920V    PICTURE X.
           02  E200920O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301420C    PICTURE X.
           02  E301420P    PICTURE X.
           02  E301420H    PICTURE X.
           02  E301420V    PICTURE X.
           02  E301420O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301520C    PICTURE X.
           02  E301520P    PICTURE X.
           02  E301520H    PICTURE X.
           02  E301520V    PICTURE X.
           02  E301520O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200821C    PICTURE X.
           02  B200821P    PICTURE X.
           02  B200821H    PICTURE X.
           02  B200821V    PICTURE X.
           02  B200821O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200921C    PICTURE X.
           02  B200921P    PICTURE X.
           02  B200921H    PICTURE X.
           02  B200921V    PICTURE X.
           02  B200921O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200921C    PICTURE X.
           02  E200921P    PICTURE X.
           02  E200921H    PICTURE X.
           02  E200921V    PICTURE X.
           02  E200921O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301421C    PICTURE X.
           02  E301421P    PICTURE X.
           02  E301421H    PICTURE X.
           02  E301421V    PICTURE X.
           02  E301421O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301521C    PICTURE X.
           02  E301521P    PICTURE X.
           02  E301521H    PICTURE X.
           02  E301521V    PICTURE X.
           02  E301521O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200822C    PICTURE X.
           02  B200822P    PICTURE X.
           02  B200822H    PICTURE X.
           02  B200822V    PICTURE X.
           02  B200822O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200922C    PICTURE X.
           02  B200922P    PICTURE X.
           02  B200922H    PICTURE X.
           02  B200922V    PICTURE X.
           02  B200922O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200922C    PICTURE X.
           02  E200922P    PICTURE X.
           02  E200922H    PICTURE X.
           02  E200922V    PICTURE X.
           02  E200922O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301422C    PICTURE X.
           02  E301422P    PICTURE X.
           02  E301422H    PICTURE X.
           02  E301422V    PICTURE X.
           02  E301422O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301522C    PICTURE X.
           02  E301522P    PICTURE X.
           02  E301522H    PICTURE X.
           02  E301522V    PICTURE X.
           02  E301522O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200823C    PICTURE X.
           02  B200823P    PICTURE X.
           02  B200823H    PICTURE X.
           02  B200823V    PICTURE X.
           02  B200823O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200923C    PICTURE X.
           02  B200923P    PICTURE X.
           02  B200923H    PICTURE X.
           02  B200923V    PICTURE X.
           02  B200923O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200923C    PICTURE X.
           02  E200923P    PICTURE X.
           02  E200923H    PICTURE X.
           02  E200923V    PICTURE X.
           02  E200923O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301423C    PICTURE X.
           02  E301423P    PICTURE X.
           02  E301423H    PICTURE X.
           02  E301423V    PICTURE X.
           02  E301423O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301523C    PICTURE X.
           02  E301523P    PICTURE X.
           02  E301523H    PICTURE X.
           02  E301523V    PICTURE X.
           02  E301523O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200824C    PICTURE X.
           02  B200824P    PICTURE X.
           02  B200824H    PICTURE X.
           02  B200824V    PICTURE X.
           02  B200824O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200924C    PICTURE X.
           02  B200924P    PICTURE X.
           02  B200924H    PICTURE X.
           02  B200924V    PICTURE X.
           02  B200924O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200924C    PICTURE X.
           02  E200924P    PICTURE X.
           02  E200924H    PICTURE X.
           02  E200924V    PICTURE X.
           02  E200924O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301424C    PICTURE X.
           02  E301424P    PICTURE X.
           02  E301424H    PICTURE X.
           02  E301424V    PICTURE X.
           02  E301424O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301524C    PICTURE X.
           02  E301524P    PICTURE X.
           02  E301524H    PICTURE X.
           02  E301524V    PICTURE X.
           02  E301524O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200825C    PICTURE X.
           02  B200825P    PICTURE X.
           02  B200825H    PICTURE X.
           02  B200825V    PICTURE X.
           02  B200825O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200925C    PICTURE X.
           02  B200925P    PICTURE X.
           02  B200925H    PICTURE X.
           02  B200925V    PICTURE X.
           02  B200925O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200925C    PICTURE X.
           02  E200925P    PICTURE X.
           02  E200925H    PICTURE X.
           02  E200925V    PICTURE X.
           02  E200925O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301425C    PICTURE X.
           02  E301425P    PICTURE X.
           02  E301425H    PICTURE X.
           02  E301425V    PICTURE X.
           02  E301425O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301525C    PICTURE X.
           02  E301525P    PICTURE X.
           02  E301525H    PICTURE X.
           02  E301525V    PICTURE X.
           02  E301525O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200826C    PICTURE X.
           02  B200826P    PICTURE X.
           02  B200826H    PICTURE X.
           02  B200826V    PICTURE X.
           02  B200826O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200926C    PICTURE X.
           02  B200926P    PICTURE X.
           02  B200926H    PICTURE X.
           02  B200926V    PICTURE X.
           02  B200926O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200926C    PICTURE X.
           02  E200926P    PICTURE X.
           02  E200926H    PICTURE X.
           02  E200926V    PICTURE X.
           02  E200926O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301426C    PICTURE X.
           02  E301426P    PICTURE X.
           02  E301426H    PICTURE X.
           02  E301426V    PICTURE X.
           02  E301426O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301526C    PICTURE X.
           02  E301526P    PICTURE X.
           02  E301526H    PICTURE X.
           02  E301526V    PICTURE X.
           02  E301526O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200827C    PICTURE X.
           02  B200827P    PICTURE X.
           02  B200827H    PICTURE X.
           02  B200827V    PICTURE X.
           02  B200827O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200927C    PICTURE X.
           02  B200927P    PICTURE X.
           02  B200927H    PICTURE X.
           02  B200927V    PICTURE X.
           02  B200927O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200927C    PICTURE X.
           02  E200927P    PICTURE X.
           02  E200927H    PICTURE X.
           02  E200927V    PICTURE X.
           02  E200927O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301427C    PICTURE X.
           02  E301427P    PICTURE X.
           02  E301427H    PICTURE X.
           02  E301427V    PICTURE X.
           02  E301427O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301527C    PICTURE X.
           02  E301527P    PICTURE X.
           02  E301527H    PICTURE X.
           02  E301527V    PICTURE X.
           02  E301527O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200828C    PICTURE X.
           02  B200828P    PICTURE X.
           02  B200828H    PICTURE X.
           02  B200828V    PICTURE X.
           02  B200828O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200928C    PICTURE X.
           02  B200928P    PICTURE X.
           02  B200928H    PICTURE X.
           02  B200928V    PICTURE X.
           02  B200928O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200928C    PICTURE X.
           02  E200928P    PICTURE X.
           02  E200928H    PICTURE X.
           02  E200928V    PICTURE X.
           02  E200928O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301428C    PICTURE X.
           02  E301428P    PICTURE X.
           02  E301428H    PICTURE X.
           02  E301428V    PICTURE X.
           02  E301428O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301528C    PICTURE X.
           02  E301528P    PICTURE X.
           02  E301528H    PICTURE X.
           02  E301528V    PICTURE X.
           02  E301528O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMPFS23C    PICTURE X.
           02  IMPFS23P    PICTURE X.
           02  IMPFS23H    PICTURE X.
           02  IMPFS23V    PICTURE X.
           02  IMPFS23O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR23C    PICTURE X.
           02  IMERR23P    PICTURE X.
           02  IMERR23H    PICTURE X.
           02  IMERR23V    PICTURE X.
           02  IMERR23O  PIC X(79).
       01  IMB1M01I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN00L    COMP  PIC  S9(4).
           02  IMTRN00F    PICTURE X.
           02  FILLER REDEFINES IMTRN00F.
             03 IMTRN00A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN00I  PIC X(4).
           02  BDATE0AL    COMP  PIC  S9(4).
           02  BDATE0AF    PICTURE X.
           02  FILLER REDEFINES BDATE0AF.
             03 BDATE0AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE0AI  PIC X(8).
           02  BTIME0AL    COMP  PIC  S9(4).
           02  BTIME0AF    PICTURE X.
           02  FILLER REDEFINES BTIME0AF.
             03 BTIME0AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME0AI  PIC X(8).
           02  IMXCTL1L    COMP  PIC  S9(4).
           02  IMXCTL1F    PICTURE X.
           02  FILLER REDEFINES IMXCTL1F.
             03 IMXCTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL1I  PIC X(2).
           02  IMXCTL2L    COMP  PIC  S9(4).
           02  IMXCTL2F    PICTURE X.
           02  FILLER REDEFINES IMXCTL2F.
             03 IMXCTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL2I  PIC X(3).
           02  IMXCTL3L    COMP  PIC  S9(4).
           02  IMXCTL3F    PICTURE X.
           02  FILLER REDEFINES IMXCTL3F.
             03 IMXCTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL3I  PIC X(3).
           02  IMACTN1L    COMP  PIC  S9(4).
           02  IMACTN1F    PICTURE X.
           02  FILLER REDEFINES IMACTN1F.
             03 IMACTN1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMACTN1I  PIC X(1).
           02  CTL100BL    COMP  PIC  S9(4).
           02  CTL100BF    PICTURE X.
           02  FILLER REDEFINES CTL100BF.
             03 CTL100BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL100BI  PIC X(2).
           02  CTL200BL    COMP  PIC  S9(4).
           02  CTL200BF    PICTURE X.
           02  FILLER REDEFINES CTL200BF.
             03 CTL200BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL200BI  PIC X(3).
           02  CTL300BL    COMP  PIC  S9(4).
           02  CTL300BF    PICTURE X.
           02  FILLER REDEFINES CTL300BF.
             03 CTL300BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL300BI  PIC X(3).
           02  SELB001L    COMP  PIC  S9(4).
           02  SELB001F    PICTURE X.
           02  FILLER REDEFINES SELB001F.
             03 SELB001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB001I  PIC X(1).
           02  SELB002L    COMP  PIC  S9(4).
           02  SELB002F    PICTURE X.
           02  FILLER REDEFINES SELB002F.
             03 SELB002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB002I  PIC X(1).
           02  SELB009L    COMP  PIC  S9(4).
           02  SELB009F    PICTURE X.
           02  FILLER REDEFINES SELB009F.
             03 SELB009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB009I  PIC X(1).
           02  SELB004L    COMP  PIC  S9(4).
           02  SELB004F    PICTURE X.
           02  FILLER REDEFINES SELB004F.
             03 SELB004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB004I  PIC X(1).
           02  SELB005L    COMP  PIC  S9(4).
           02  SELB005F    PICTURE X.
           02  FILLER REDEFINES SELB005F.
             03 SELB005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB005I  PIC X(1).
           02  SELB012L    COMP  PIC  S9(4).
           02  SELB012F    PICTURE X.
           02  FILLER REDEFINES SELB012F.
             03 SELB012A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB012I  PIC X(1).
           02  SELB007L    COMP  PIC  S9(4).
           02  SELB007F    PICTURE X.
           02  FILLER REDEFINES SELB007F.
             03 SELB007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB007I  PIC X(1).
           02  SELB008L    COMP  PIC  S9(4).
           02  SELB008F    PICTURE X.
           02  FILLER REDEFINES SELB008F.
             03 SELB008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB008I  PIC X(1).
           02  SELB015L    COMP  PIC  S9(4).
           02  SELB015F    PICTURE X.
           02  FILLER REDEFINES SELB015F.
             03 SELB015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB015I  PIC X(1).
           02  SELB010L    COMP  PIC  S9(4).
           02  SELB010F    PICTURE X.
           02  FILLER REDEFINES SELB010F.
             03 SELB010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB010I  PIC X(1).
           02  SELB011L    COMP  PIC  S9(4).
           02  SELB011F    PICTURE X.
           02  FILLER REDEFINES SELB011F.
             03 SELB011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB011I  PIC X(1).
           02  SELB018L    COMP  PIC  S9(4).
           02  SELB018F    PICTURE X.
           02  FILLER REDEFINES SELB018F.
             03 SELB018A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB018I  PIC X(1).
           02  SELB013L    COMP  PIC  S9(4).
           02  SELB013F    PICTURE X.
           02  FILLER REDEFINES SELB013F.
             03 SELB013A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB013I  PIC X(1).
           02  SELB014L    COMP  PIC  S9(4).
           02  SELB014F    PICTURE X.
           02  FILLER REDEFINES SELB014F.
             03 SELB014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB014I  PIC X(1).
           02  SELB021L    COMP  PIC  S9(4).
           02  SELB021F    PICTURE X.
           02  FILLER REDEFINES SELB021F.
             03 SELB021A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB021I  PIC X(1).
           02  SELB016L    COMP  PIC  S9(4).
           02  SELB016F    PICTURE X.
           02  FILLER REDEFINES SELB016F.
             03 SELB016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB016I  PIC X(1).
           02  SELB017L    COMP  PIC  S9(4).
           02  SELB017F    PICTURE X.
           02  FILLER REDEFINES SELB017F.
             03 SELB017A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB017I  PIC X(1).
           02  SELB024L    COMP  PIC  S9(4).
           02  SELB024F    PICTURE X.
           02  FILLER REDEFINES SELB024F.
             03 SELB024A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB024I  PIC X(1).
           02  SELB019L    COMP  PIC  S9(4).
           02  SELB019F    PICTURE X.
           02  FILLER REDEFINES SELB019F.
             03 SELB019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB019I  PIC X(1).
           02  SELB023L    COMP  PIC  S9(4).
           02  SELB023F    PICTURE X.
           02  FILLER REDEFINES SELB023F.
             03 SELB023A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB023I  PIC X(1).
           02  SELB027L    COMP  PIC  S9(4).
           02  SELB027F    PICTURE X.
           02  FILLER REDEFINES SELB027F.
             03 SELB027A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB027I  PIC X(1).
           02  SELB022L    COMP  PIC  S9(4).
           02  SELB022F    PICTURE X.
           02  FILLER REDEFINES SELB022F.
             03 SELB022A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB022I  PIC X(1).
           02  SELB029L    COMP  PIC  S9(4).
           02  SELB029F    PICTURE X.
           02  FILLER REDEFINES SELB029F.
             03 SELB029A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB029I  PIC X(1).
           02  SELB030L    COMP  PIC  S9(4).
           02  SELB030F    PICTURE X.
           02  FILLER REDEFINES SELB030F.
             03 SELB030A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB030I  PIC X(1).
           02  SELB025L    COMP  PIC  S9(4).
           02  SELB025F    PICTURE X.
           02  FILLER REDEFINES SELB025F.
             03 SELB025A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB025I  PIC X(1).
           02  SELB032L    COMP  PIC  S9(4).
           02  SELB032F    PICTURE X.
           02  FILLER REDEFINES SELB032F.
             03 SELB032A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB032I  PIC X(1).
           02  SELB033L    COMP  PIC  S9(4).
           02  SELB033F    PICTURE X.
           02  FILLER REDEFINES SELB033F.
             03 SELB033A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB033I  PIC X(1).
           02  SELB028L    COMP  PIC  S9(4).
           02  SELB028F    PICTURE X.
           02  FILLER REDEFINES SELB028F.
             03 SELB028A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB028I  PIC X(1).
           02  SELB035L    COMP  PIC  S9(4).
           02  SELB035F    PICTURE X.
           02  FILLER REDEFINES SELB035F.
             03 SELB035A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB035I  PIC X(1).
           02  SELB036L    COMP  PIC  S9(4).
           02  SELB036F    PICTURE X.
           02  FILLER REDEFINES SELB036F.
             03 SELB036A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB036I  PIC X(1).
           02  SELB031L    COMP  PIC  S9(4).
           02  SELB031F    PICTURE X.
           02  FILLER REDEFINES SELB031F.
             03 SELB031A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB031I  PIC X(1).
           02  SELB003L    COMP  PIC  S9(4).
           02  SELB003F    PICTURE X.
           02  FILLER REDEFINES SELB003F.
             03 SELB003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB003I  PIC X(1).
           02  SELB034L    COMP  PIC  S9(4).
           02  SELB034F    PICTURE X.
           02  FILLER REDEFINES SELB034F.
             03 SELB034A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB034I  PIC X(1).
           02  SELB006L    COMP  PIC  S9(4).
           02  SELB006F    PICTURE X.
           02  FILLER REDEFINES SELB006F.
             03 SELB006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SELB006I  PIC X(1).
           02  IMPFS01L    COMP  PIC  S9(4).
           02  IMPFS01F    PICTURE X.
           02  FILLER REDEFINES IMPFS01F.
             03 IMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS01I  PIC X(79).
           02  IMERR01L    COMP  PIC  S9(4).
           02  IMERR01F    PICTURE X.
           02  FILLER REDEFINES IMERR01F.
             03 IMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR01I  PIC X(79).
       01  IMB1M01O REDEFINES IMB1M01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN00C    PICTURE X.
           02  IMTRN00P    PICTURE X.
           02  IMTRN00H    PICTURE X.
           02  IMTRN00V    PICTURE X.
           02  IMTRN00O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE0AC    PICTURE X.
           02  BDATE0AP    PICTURE X.
           02  BDATE0AH    PICTURE X.
           02  BDATE0AV    PICTURE X.
           02  BDATE0AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME0AC    PICTURE X.
           02  BTIME0AP    PICTURE X.
           02  BTIME0AH    PICTURE X.
           02  BTIME0AV    PICTURE X.
           02  BTIME0AO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMXCTL1C    PICTURE X.
           02  IMXCTL1P    PICTURE X.
           02  IMXCTL1H    PICTURE X.
           02  IMXCTL1V    PICTURE X.
           02  IMXCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMXCTL2C    PICTURE X.
           02  IMXCTL2P    PICTURE X.
           02  IMXCTL2H    PICTURE X.
           02  IMXCTL2V    PICTURE X.
           02  IMXCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL3C    PICTURE X.
           02  IMXCTL3P    PICTURE X.
           02  IMXCTL3H    PICTURE X.
           02  IMXCTL3V    PICTURE X.
           02  IMXCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMACTN1C    PICTURE X.
           02  IMACTN1P    PICTURE X.
           02  IMACTN1H    PICTURE X.
           02  IMACTN1V    PICTURE X.
           02  IMACTN1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CTL100BC    PICTURE X.
           02  CTL100BP    PICTURE X.
           02  CTL100BH    PICTURE X.
           02  CTL100BV    PICTURE X.
           02  CTL100BO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL200BC    PICTURE X.
           02  CTL200BP    PICTURE X.
           02  CTL200BH    PICTURE X.
           02  CTL200BV    PICTURE X.
           02  CTL200BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL300BC    PICTURE X.
           02  CTL300BP    PICTURE X.
           02  CTL300BH    PICTURE X.
           02  CTL300BV    PICTURE X.
           02  CTL300BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  SELB001C    PICTURE X.
           02  SELB001P    PICTURE X.
           02  SELB001H    PICTURE X.
           02  SELB001V    PICTURE X.
           02  SELB001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB002C    PICTURE X.
           02  SELB002P    PICTURE X.
           02  SELB002H    PICTURE X.
           02  SELB002V    PICTURE X.
           02  SELB002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB009C    PICTURE X.
           02  SELB009P    PICTURE X.
           02  SELB009H    PICTURE X.
           02  SELB009V    PICTURE X.
           02  SELB009O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB004C    PICTURE X.
           02  SELB004P    PICTURE X.
           02  SELB004H    PICTURE X.
           02  SELB004V    PICTURE X.
           02  SELB004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB005C    PICTURE X.
           02  SELB005P    PICTURE X.
           02  SELB005H    PICTURE X.
           02  SELB005V    PICTURE X.
           02  SELB005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB012C    PICTURE X.
           02  SELB012P    PICTURE X.
           02  SELB012H    PICTURE X.
           02  SELB012V    PICTURE X.
           02  SELB012O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB007C    PICTURE X.
           02  SELB007P    PICTURE X.
           02  SELB007H    PICTURE X.
           02  SELB007V    PICTURE X.
           02  SELB007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB008C    PICTURE X.
           02  SELB008P    PICTURE X.
           02  SELB008H    PICTURE X.
           02  SELB008V    PICTURE X.
           02  SELB008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB015C    PICTURE X.
           02  SELB015P    PICTURE X.
           02  SELB015H    PICTURE X.
           02  SELB015V    PICTURE X.
           02  SELB015O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB010C    PICTURE X.
           02  SELB010P    PICTURE X.
           02  SELB010H    PICTURE X.
           02  SELB010V    PICTURE X.
           02  SELB010O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB011C    PICTURE X.
           02  SELB011P    PICTURE X.
           02  SELB011H    PICTURE X.
           02  SELB011V    PICTURE X.
           02  SELB011O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB018C    PICTURE X.
           02  SELB018P    PICTURE X.
           02  SELB018H    PICTURE X.
           02  SELB018V    PICTURE X.
           02  SELB018O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB013C    PICTURE X.
           02  SELB013P    PICTURE X.
           02  SELB013H    PICTURE X.
           02  SELB013V    PICTURE X.
           02  SELB013O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB014C    PICTURE X.
           02  SELB014P    PICTURE X.
           02  SELB014H    PICTURE X.
           02  SELB014V    PICTURE X.
           02  SELB014O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB021C    PICTURE X.
           02  SELB021P    PICTURE X.
           02  SELB021H    PICTURE X.
           02  SELB021V    PICTURE X.
           02  SELB021O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB016C    PICTURE X.
           02  SELB016P    PICTURE X.
           02  SELB016H    PICTURE X.
           02  SELB016V    PICTURE X.
           02  SELB016O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB017C    PICTURE X.
           02  SELB017P    PICTURE X.
           02  SELB017H    PICTURE X.
           02  SELB017V    PICTURE X.
           02  SELB017O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB024C    PICTURE X.
           02  SELB024P    PICTURE X.
           02  SELB024H    PICTURE X.
           02  SELB024V    PICTURE X.
           02  SELB024O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB019C    PICTURE X.
           02  SELB019P    PICTURE X.
           02  SELB019H    PICTURE X.
           02  SELB019V    PICTURE X.
           02  SELB019O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB023C    PICTURE X.
           02  SELB023P    PICTURE X.
           02  SELB023H    PICTURE X.
           02  SELB023V    PICTURE X.
           02  SELB023O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB027C    PICTURE X.
           02  SELB027P    PICTURE X.
           02  SELB027H    PICTURE X.
           02  SELB027V    PICTURE X.
           02  SELB027O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB022C    PICTURE X.
           02  SELB022P    PICTURE X.
           02  SELB022H    PICTURE X.
           02  SELB022V    PICTURE X.
           02  SELB022O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB029C    PICTURE X.
           02  SELB029P    PICTURE X.
           02  SELB029H    PICTURE X.
           02  SELB029V    PICTURE X.
           02  SELB029O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB030C    PICTURE X.
           02  SELB030P    PICTURE X.
           02  SELB030H    PICTURE X.
           02  SELB030V    PICTURE X.
           02  SELB030O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB025C    PICTURE X.
           02  SELB025P    PICTURE X.
           02  SELB025H    PICTURE X.
           02  SELB025V    PICTURE X.
           02  SELB025O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB032C    PICTURE X.
           02  SELB032P    PICTURE X.
           02  SELB032H    PICTURE X.
           02  SELB032V    PICTURE X.
           02  SELB032O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB033C    PICTURE X.
           02  SELB033P    PICTURE X.
           02  SELB033H    PICTURE X.
           02  SELB033V    PICTURE X.
           02  SELB033O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB028C    PICTURE X.
           02  SELB028P    PICTURE X.
           02  SELB028H    PICTURE X.
           02  SELB028V    PICTURE X.
           02  SELB028O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB035C    PICTURE X.
           02  SELB035P    PICTURE X.
           02  SELB035H    PICTURE X.
           02  SELB035V    PICTURE X.
           02  SELB035O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB036C    PICTURE X.
           02  SELB036P    PICTURE X.
           02  SELB036H    PICTURE X.
           02  SELB036V    PICTURE X.
           02  SELB036O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB031C    PICTURE X.
           02  SELB031P    PICTURE X.
           02  SELB031H    PICTURE X.
           02  SELB031V    PICTURE X.
           02  SELB031O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB003C    PICTURE X.
           02  SELB003P    PICTURE X.
           02  SELB003H    PICTURE X.
           02  SELB003V    PICTURE X.
           02  SELB003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB034C    PICTURE X.
           02  SELB034P    PICTURE X.
           02  SELB034H    PICTURE X.
           02  SELB034V    PICTURE X.
           02  SELB034O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SELB006C    PICTURE X.
           02  SELB006P    PICTURE X.
           02  SELB006H    PICTURE X.
           02  SELB006V    PICTURE X.
           02  SELB006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS01C    PICTURE X.
           02  IMPFS01P    PICTURE X.
           02  IMPFS01H    PICTURE X.
           02  IMPFS01V    PICTURE X.
           02  IMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR01C    PICTURE X.
           02  IMERR01P    PICTURE X.
           02  IMERR01H    PICTURE X.
           02  IMERR01V    PICTURE X.
           02  IMERR01O  PIC X(79).
       01  IMB1M02I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN01L    COMP  PIC  S9(4).
           02  IMTRN01F    PICTURE X.
           02  FILLER REDEFINES IMTRN01F.
             03 IMTRN01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN01I  PIC X(4).
           02  BDATE01L    COMP  PIC  S9(4).
           02  BDATE01F    PICTURE X.
           02  FILLER REDEFINES BDATE01F.
             03 BDATE01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE01I  PIC X(8).
           02  BTIME01L    COMP  PIC  S9(4).
           02  BTIME01F    PICTURE X.
           02  FILLER REDEFINES BTIME01F.
             03 BTIME01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME01I  PIC X(8).
           02  IMPGE01L    COMP  PIC  S9(4).
           02  IMPGE01F    PICTURE X.
           02  FILLER REDEFINES IMPGE01F.
             03 IMPGE01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE01I  PIC X(2).
           02  CTL1001L    COMP  PIC  S9(4).
           02  CTL1001F    PICTURE X.
           02  FILLER REDEFINES CTL1001F.
             03 CTL1001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1001I  PIC X(2).
           02  CTL2001L    COMP  PIC  S9(4).
           02  CTL2001F    PICTURE X.
           02  FILLER REDEFINES CTL2001F.
             03 CTL2001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2001I  PIC X(3).
           02  CTL3001L    COMP  PIC  S9(4).
           02  CTL3001F    PICTURE X.
           02  FILLER REDEFINES CTL3001F.
             03 CTL3001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3001I  PIC X(3).
           02  IMB1014L    COMP  PIC  S9(4).
           02  IMB1014F    PICTURE X.
           02  FILLER REDEFINES IMB1014F.
             03 IMB1014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1014I  PIC X(30).
           02  IMB6025L    COMP  PIC  S9(4).
           02  IMB6025F    PICTURE X.
           02  FILLER REDEFINES IMB6025F.
             03 IMB6025A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6025I  PIC X(40).
           02  IMB1212L    COMP  PIC  S9(4).
           02  IMB1212F    PICTURE X.
           02  FILLER REDEFINES IMB1212F.
             03 IMB1212A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1212I  PIC X(10).
           02  IMB6026L    COMP  PIC  S9(4).
           02  IMB6026F    PICTURE X.
           02  FILLER REDEFINES IMB6026F.
             03 IMB6026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6026I  PIC X(40).
           02  IMB6027L    COMP  PIC  S9(4).
           02  IMB6027F    PICTURE X.
           02  FILLER REDEFINES IMB6027F.
             03 IMB6027A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6027I  PIC X(30).
           02  IMB6028L    COMP  PIC  S9(4).
           02  IMB6028F    PICTURE X.
           02  FILLER REDEFINES IMB6028F.
             03 IMB6028A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6028I  PIC X(10).
           02  IMB6031L    COMP  PIC  S9(4).
           02  IMB6031F    PICTURE X.
           02  FILLER REDEFINES IMB6031F.
             03 IMB6031A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6031I  PIC X(3).
           02  IMB6032L    COMP  PIC  S9(4).
           02  IMB6032F    PICTURE X.
           02  FILLER REDEFINES IMB6032F.
             03 IMB6032A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6032I  PIC X(11).
           02  IMB1007L    COMP  PIC  S9(4).
           02  IMB1007F    PICTURE X.
           02  FILLER REDEFINES IMB1007F.
             03 IMB1007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1007I  PIC X(10).
           02  IMB1008L    COMP  PIC  S9(4).
           02  IMB1008F    PICTURE X.
           02  FILLER REDEFINES IMB1008F.
             03 IMB1008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1008I  PIC X(1).
           02  IMB1009L    COMP  PIC  S9(4).
           02  IMB1009F    PICTURE X.
           02  FILLER REDEFINES IMB1009F.
             03 IMB1009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1009I  PIC X(10).
           02  B300501L    COMP  PIC  S9(4).
           02  B300501F    PICTURE X.
           02  FILLER REDEFINES B300501F.
             03 B300501A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300501I  PIC X(3).
           02  B300601L    COMP  PIC  S9(4).
           02  B300601F    PICTURE X.
           02  FILLER REDEFINES B300601F.
             03 B300601A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300601I  PIC X(3).
           02  B300502L    COMP  PIC  S9(4).
           02  B300502F    PICTURE X.
           02  FILLER REDEFINES B300502F.
             03 B300502A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300502I  PIC X(3).
           02  B300602L    COMP  PIC  S9(4).
           02  B300602F    PICTURE X.
           02  FILLER REDEFINES B300602F.
             03 B300602A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300602I  PIC X(3).
           02  B300503L    COMP  PIC  S9(4).
           02  B300503F    PICTURE X.
           02  FILLER REDEFINES B300503F.
             03 B300503A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300503I  PIC X(3).
           02  B300603L    COMP  PIC  S9(4).
           02  B300603F    PICTURE X.
           02  FILLER REDEFINES B300603F.
             03 B300603A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300603I  PIC X(3).
           02  B300504L    COMP  PIC  S9(4).
           02  B300504F    PICTURE X.
           02  FILLER REDEFINES B300504F.
             03 B300504A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300504I  PIC X(3).
           02  B300604L    COMP  PIC  S9(4).
           02  B300604F    PICTURE X.
           02  FILLER REDEFINES B300604F.
             03 B300604A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300604I  PIC X(3).
           02  B300505L    COMP  PIC  S9(4).
           02  B300505F    PICTURE X.
           02  FILLER REDEFINES B300505F.
             03 B300505A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300505I  PIC X(3).
           02  B300605L    COMP  PIC  S9(4).
           02  B300605F    PICTURE X.
           02  FILLER REDEFINES B300605F.
             03 B300605A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300605I  PIC X(3).
           02  IMB1010L    COMP  PIC  S9(4).
           02  IMB1010F    PICTURE X.
           02  FILLER REDEFINES IMB1010F.
             03 IMB1010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1010I  PIC X(1).
           02  IMB1011L    COMP  PIC  S9(4).
           02  IMB1011F    PICTURE X.
           02  FILLER REDEFINES IMB1011F.
             03 IMB1011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1011I  PIC X(10).
           02  B300701L    COMP  PIC  S9(4).
           02  B300701F    PICTURE X.
           02  FILLER REDEFINES B300701F.
             03 B300701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300701I  PIC X(3).
           02  B300801L    COMP  PIC  S9(4).
           02  B300801F    PICTURE X.
           02  FILLER REDEFINES B300801F.
             03 B300801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300801I  PIC X(3).
           02  B300702L    COMP  PIC  S9(4).
           02  B300702F    PICTURE X.
           02  FILLER REDEFINES B300702F.
             03 B300702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300702I  PIC X(3).
           02  B300802L    COMP  PIC  S9(4).
           02  B300802F    PICTURE X.
           02  FILLER REDEFINES B300802F.
             03 B300802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300802I  PIC X(3).
           02  B300703L    COMP  PIC  S9(4).
           02  B300703F    PICTURE X.
           02  FILLER REDEFINES B300703F.
             03 B300703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300703I  PIC X(3).
           02  B300803L    COMP  PIC  S9(4).
           02  B300803F    PICTURE X.
           02  FILLER REDEFINES B300803F.
             03 B300803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300803I  PIC X(3).
           02  B300704L    COMP  PIC  S9(4).
           02  B300704F    PICTURE X.
           02  FILLER REDEFINES B300704F.
             03 B300704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300704I  PIC X(3).
           02  B300804L    COMP  PIC  S9(4).
           02  B300804F    PICTURE X.
           02  FILLER REDEFINES B300804F.
             03 B300804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300804I  PIC X(3).
           02  B300705L    COMP  PIC  S9(4).
           02  B300705F    PICTURE X.
           02  FILLER REDEFINES B300705F.
             03 B300705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300705I  PIC X(3).
           02  B300805L    COMP  PIC  S9(4).
           02  B300805F    PICTURE X.
           02  FILLER REDEFINES B300805F.
             03 B300805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300805I  PIC X(3).
           02  IMB1012L    COMP  PIC  S9(4).
           02  IMB1012F    PICTURE X.
           02  FILLER REDEFINES IMB1012F.
             03 IMB1012A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1012I  PIC X(1).
           02  IMB1013L    COMP  PIC  S9(4).
           02  IMB1013F    PICTURE X.
           02  FILLER REDEFINES IMB1013F.
             03 IMB1013A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1013I  PIC X(10).
           02  B300901L    COMP  PIC  S9(4).
           02  B300901F    PICTURE X.
           02  FILLER REDEFINES B300901F.
             03 B300901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300901I  PIC X(4).
           02  B301001L    COMP  PIC  S9(4).
           02  B301001F    PICTURE X.
           02  FILLER REDEFINES B301001F.
             03 B301001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301001I  PIC X(4).
           02  B300902L    COMP  PIC  S9(4).
           02  B300902F    PICTURE X.
           02  FILLER REDEFINES B300902F.
             03 B300902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300902I  PIC X(4).
           02  B301002L    COMP  PIC  S9(4).
           02  B301002F    PICTURE X.
           02  FILLER REDEFINES B301002F.
             03 B301002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301002I  PIC X(4).
           02  B300903L    COMP  PIC  S9(4).
           02  B300903F    PICTURE X.
           02  FILLER REDEFINES B300903F.
             03 B300903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300903I  PIC X(4).
           02  B301003L    COMP  PIC  S9(4).
           02  B301003F    PICTURE X.
           02  FILLER REDEFINES B301003F.
             03 B301003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301003I  PIC X(4).
           02  B300904L    COMP  PIC  S9(4).
           02  B300904F    PICTURE X.
           02  FILLER REDEFINES B300904F.
             03 B300904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300904I  PIC X(4).
           02  B301004L    COMP  PIC  S9(4).
           02  B301004F    PICTURE X.
           02  FILLER REDEFINES B301004F.
             03 B301004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301004I  PIC X(4).
           02  B300905L    COMP  PIC  S9(4).
           02  B300905F    PICTURE X.
           02  FILLER REDEFINES B300905F.
             03 B300905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B300905I  PIC X(4).
           02  B301005L    COMP  PIC  S9(4).
           02  B301005F    PICTURE X.
           02  FILLER REDEFINES B301005F.
             03 B301005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301005I  PIC X(4).
           02  B113801L    COMP  PIC  S9(4).
           02  B113801F    PICTURE X.
           02  FILLER REDEFINES B113801F.
             03 B113801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B113801I  PIC X(9).
           02  IMB1006L    COMP  PIC  S9(4).
           02  IMB1006F    PICTURE X.
           02  FILLER REDEFINES IMB1006F.
             03 IMB1006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1006I  PIC X(4).
           02  B304301L    COMP  PIC  S9(4).
           02  B304301F    PICTURE X.
           02  FILLER REDEFINES B304301F.
             03 B304301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304301I  PIC X(30).
           02  B113802L    COMP  PIC  S9(4).
           02  B113802F    PICTURE X.
           02  FILLER REDEFINES B113802F.
             03 B113802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B113802I  PIC X(9).
           02  IMB1005L    COMP  PIC  S9(4).
           02  IMB1005F    PICTURE X.
           02  FILLER REDEFINES IMB1005F.
             03 IMB1005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1005I  PIC X(1).
           02  B304302L    COMP  PIC  S9(4).
           02  B304302F    PICTURE X.
           02  FILLER REDEFINES B304302F.
             03 B304302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304302I  PIC X(30).
           02  B113803L    COMP  PIC  S9(4).
           02  B113803F    PICTURE X.
           02  FILLER REDEFINES B113803F.
             03 B113803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B113803I  PIC X(9).
           02  IMB1225L    COMP  PIC  S9(4).
           02  IMB1225F    PICTURE X.
           02  FILLER REDEFINES IMB1225F.
             03 IMB1225A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1225I  PIC X(5).
           02  B304303L    COMP  PIC  S9(4).
           02  B304303F    PICTURE X.
           02  FILLER REDEFINES B304303F.
             03 B304303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304303I  PIC X(30).
           02  B113804L    COMP  PIC  S9(4).
           02  B113804F    PICTURE X.
           02  FILLER REDEFINES B113804F.
             03 B113804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B113804I  PIC X(9).
           02  B304304L    COMP  PIC  S9(4).
           02  B304304F    PICTURE X.
           02  FILLER REDEFINES B304304F.
             03 B304304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304304I  PIC X(30).
           02  IMB1098L    COMP  PIC  S9(4).
           02  IMB1098F    PICTURE X.
           02  FILLER REDEFINES IMB1098F.
             03 IMB1098A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1098I  PIC X(12).
           02  IMB1226L    COMP  PIC  S9(4).
           02  IMB1226F    PICTURE X.
           02  FILLER REDEFINES IMB1226F.
             03 IMB1226A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1226I  PIC X(2).
           02  B304305L    COMP  PIC  S9(4).
           02  B304305F    PICTURE X.
           02  FILLER REDEFINES B304305F.
             03 B304305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304305I  PIC X(30).
           02  IMPFS02L    COMP  PIC  S9(4).
           02  IMPFS02F    PICTURE X.
           02  FILLER REDEFINES IMPFS02F.
             03 IMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS02I  PIC X(79).
           02  IMERR02L    COMP  PIC  S9(4).
           02  IMERR02F    PICTURE X.
           02  FILLER REDEFINES IMERR02F.
             03 IMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR02I  PIC X(79).
       01  IMB1M02O REDEFINES IMB1M02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN01C    PICTURE X.
           02  IMTRN01P    PICTURE X.
           02  IMTRN01H    PICTURE X.
           02  IMTRN01V    PICTURE X.
           02  IMTRN01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE01C    PICTURE X.
           02  BDATE01P    PICTURE X.
           02  BDATE01H    PICTURE X.
           02  BDATE01V    PICTURE X.
           02  BDATE01O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME01C    PICTURE X.
           02  BTIME01P    PICTURE X.
           02  BTIME01H    PICTURE X.
           02  BTIME01V    PICTURE X.
           02  BTIME01O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE01C    PICTURE X.
           02  IMPGE01P    PICTURE X.
           02  IMPGE01H    PICTURE X.
           02  IMPGE01V    PICTURE X.
           02  IMPGE01O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1001C    PICTURE X.
           02  CTL1001P    PICTURE X.
           02  CTL1001H    PICTURE X.
           02  CTL1001V    PICTURE X.
           02  CTL1001O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2001C    PICTURE X.
           02  CTL2001P    PICTURE X.
           02  CTL2001H    PICTURE X.
           02  CTL2001V    PICTURE X.
           02  CTL2001O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3001C    PICTURE X.
           02  CTL3001P    PICTURE X.
           02  CTL3001H    PICTURE X.
           02  CTL3001V    PICTURE X.
           02  CTL3001O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1014C    PICTURE X.
           02  IMB1014P    PICTURE X.
           02  IMB1014H    PICTURE X.
           02  IMB1014V    PICTURE X.
           02  IMB1014O  PIC X(30).
           02  FILLER PICTURE X(3).
           02  IMB6025C    PICTURE X.
           02  IMB6025P    PICTURE X.
           02  IMB6025H    PICTURE X.
           02  IMB6025V    PICTURE X.
           02  IMB6025O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMB1212C    PICTURE X.
           02  IMB1212P    PICTURE X.
           02  IMB1212H    PICTURE X.
           02  IMB1212V    PICTURE X.
           02  IMB1212O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB6026C    PICTURE X.
           02  IMB6026P    PICTURE X.
           02  IMB6026H    PICTURE X.
           02  IMB6026V    PICTURE X.
           02  IMB6026O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMB6027C    PICTURE X.
           02  IMB6027P    PICTURE X.
           02  IMB6027H    PICTURE X.
           02  IMB6027V    PICTURE X.
           02  IMB6027O  PIC X(30).
           02  FILLER PICTURE X(3).
           02  IMB6028C    PICTURE X.
           02  IMB6028P    PICTURE X.
           02  IMB6028H    PICTURE X.
           02  IMB6028V    PICTURE X.
           02  IMB6028O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB6031C    PICTURE X.
           02  IMB6031P    PICTURE X.
           02  IMB6031H    PICTURE X.
           02  IMB6031V    PICTURE X.
           02  IMB6031O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB6032C    PICTURE X.
           02  IMB6032P    PICTURE X.
           02  IMB6032H    PICTURE X.
           02  IMB6032V    PICTURE X.
           02  IMB6032O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  IMB1007C    PICTURE X.
           02  IMB1007P    PICTURE X.
           02  IMB1007H    PICTURE X.
           02  IMB1007V    PICTURE X.
           02  IMB1007O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB1008C    PICTURE X.
           02  IMB1008P    PICTURE X.
           02  IMB1008H    PICTURE X.
           02  IMB1008V    PICTURE X.
           02  IMB1008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1009C    PICTURE X.
           02  IMB1009P    PICTURE X.
           02  IMB1009H    PICTURE X.
           02  IMB1009V    PICTURE X.
           02  IMB1009O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  B300501C    PICTURE X.
           02  B300501P    PICTURE X.
           02  B300501H    PICTURE X.
           02  B300501V    PICTURE X.
           02  B300501O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300601C    PICTURE X.
           02  B300601P    PICTURE X.
           02  B300601H    PICTURE X.
           02  B300601V    PICTURE X.
           02  B300601O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300502C    PICTURE X.
           02  B300502P    PICTURE X.
           02  B300502H    PICTURE X.
           02  B300502V    PICTURE X.
           02  B300502O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300602C    PICTURE X.
           02  B300602P    PICTURE X.
           02  B300602H    PICTURE X.
           02  B300602V    PICTURE X.
           02  B300602O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300503C    PICTURE X.
           02  B300503P    PICTURE X.
           02  B300503H    PICTURE X.
           02  B300503V    PICTURE X.
           02  B300503O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300603C    PICTURE X.
           02  B300603P    PICTURE X.
           02  B300603H    PICTURE X.
           02  B300603V    PICTURE X.
           02  B300603O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300504C    PICTURE X.
           02  B300504P    PICTURE X.
           02  B300504H    PICTURE X.
           02  B300504V    PICTURE X.
           02  B300504O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300604C    PICTURE X.
           02  B300604P    PICTURE X.
           02  B300604H    PICTURE X.
           02  B300604V    PICTURE X.
           02  B300604O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300505C    PICTURE X.
           02  B300505P    PICTURE X.
           02  B300505H    PICTURE X.
           02  B300505V    PICTURE X.
           02  B300505O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300605C    PICTURE X.
           02  B300605P    PICTURE X.
           02  B300605H    PICTURE X.
           02  B300605V    PICTURE X.
           02  B300605O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1010C    PICTURE X.
           02  IMB1010P    PICTURE X.
           02  IMB1010H    PICTURE X.
           02  IMB1010V    PICTURE X.
           02  IMB1010O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1011C    PICTURE X.
           02  IMB1011P    PICTURE X.
           02  IMB1011H    PICTURE X.
           02  IMB1011V    PICTURE X.
           02  IMB1011O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  B300701C    PICTURE X.
           02  B300701P    PICTURE X.
           02  B300701H    PICTURE X.
           02  B300701V    PICTURE X.
           02  B300701O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300801C    PICTURE X.
           02  B300801P    PICTURE X.
           02  B300801H    PICTURE X.
           02  B300801V    PICTURE X.
           02  B300801O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300702C    PICTURE X.
           02  B300702P    PICTURE X.
           02  B300702H    PICTURE X.
           02  B300702V    PICTURE X.
           02  B300702O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300802C    PICTURE X.
           02  B300802P    PICTURE X.
           02  B300802H    PICTURE X.
           02  B300802V    PICTURE X.
           02  B300802O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300703C    PICTURE X.
           02  B300703P    PICTURE X.
           02  B300703H    PICTURE X.
           02  B300703V    PICTURE X.
           02  B300703O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300803C    PICTURE X.
           02  B300803P    PICTURE X.
           02  B300803H    PICTURE X.
           02  B300803V    PICTURE X.
           02  B300803O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300704C    PICTURE X.
           02  B300704P    PICTURE X.
           02  B300704H    PICTURE X.
           02  B300704V    PICTURE X.
           02  B300704O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300804C    PICTURE X.
           02  B300804P    PICTURE X.
           02  B300804H    PICTURE X.
           02  B300804V    PICTURE X.
           02  B300804O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300705C    PICTURE X.
           02  B300705P    PICTURE X.
           02  B300705H    PICTURE X.
           02  B300705V    PICTURE X.
           02  B300705O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B300805C    PICTURE X.
           02  B300805P    PICTURE X.
           02  B300805H    PICTURE X.
           02  B300805V    PICTURE X.
           02  B300805O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1012C    PICTURE X.
           02  IMB1012P    PICTURE X.
           02  IMB1012H    PICTURE X.
           02  IMB1012V    PICTURE X.
           02  IMB1012O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1013C    PICTURE X.
           02  IMB1013P    PICTURE X.
           02  IMB1013H    PICTURE X.
           02  IMB1013V    PICTURE X.
           02  IMB1013O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  B300901C    PICTURE X.
           02  B300901P    PICTURE X.
           02  B300901H    PICTURE X.
           02  B300901V    PICTURE X.
           02  B300901O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B301001C    PICTURE X.
           02  B301001P    PICTURE X.
           02  B301001H    PICTURE X.
           02  B301001V    PICTURE X.
           02  B301001O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B300902C    PICTURE X.
           02  B300902P    PICTURE X.
           02  B300902H    PICTURE X.
           02  B300902V    PICTURE X.
           02  B300902O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B301002C    PICTURE X.
           02  B301002P    PICTURE X.
           02  B301002H    PICTURE X.
           02  B301002V    PICTURE X.
           02  B301002O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B300903C    PICTURE X.
           02  B300903P    PICTURE X.
           02  B300903H    PICTURE X.
           02  B300903V    PICTURE X.
           02  B300903O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B301003C    PICTURE X.
           02  B301003P    PICTURE X.
           02  B301003H    PICTURE X.
           02  B301003V    PICTURE X.
           02  B301003O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B300904C    PICTURE X.
           02  B300904P    PICTURE X.
           02  B300904H    PICTURE X.
           02  B300904V    PICTURE X.
           02  B300904O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B301004C    PICTURE X.
           02  B301004P    PICTURE X.
           02  B301004H    PICTURE X.
           02  B301004V    PICTURE X.
           02  B301004O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B300905C    PICTURE X.
           02  B300905P    PICTURE X.
           02  B300905H    PICTURE X.
           02  B300905V    PICTURE X.
           02  B300905O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B301005C    PICTURE X.
           02  B301005P    PICTURE X.
           02  B301005H    PICTURE X.
           02  B301005V    PICTURE X.
           02  B301005O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B113801C    PICTURE X.
           02  B113801P    PICTURE X.
           02  B113801H    PICTURE X.
           02  B113801V    PICTURE X.
           02  B113801O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  IMB1006C    PICTURE X.
           02  IMB1006P    PICTURE X.
           02  IMB1006H    PICTURE X.
           02  IMB1006V    PICTURE X.
           02  IMB1006O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B304301C    PICTURE X.
           02  B304301P    PICTURE X.
           02  B304301H    PICTURE X.
           02  B304301V    PICTURE X.
           02  B304301O  PIC X(30).
           02  FILLER PICTURE X(3).
           02  B113802C    PICTURE X.
           02  B113802P    PICTURE X.
           02  B113802H    PICTURE X.
           02  B113802V    PICTURE X.
           02  B113802O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  IMB1005C    PICTURE X.
           02  IMB1005P    PICTURE X.
           02  IMB1005H    PICTURE X.
           02  IMB1005V    PICTURE X.
           02  IMB1005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304302C    PICTURE X.
           02  B304302P    PICTURE X.
           02  B304302H    PICTURE X.
           02  B304302V    PICTURE X.
           02  B304302O  PIC X(30).
           02  FILLER PICTURE X(3).
           02  B113803C    PICTURE X.
           02  B113803P    PICTURE X.
           02  B113803H    PICTURE X.
           02  B113803V    PICTURE X.
           02  B113803O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  IMB1225C    PICTURE X.
           02  IMB1225P    PICTURE X.
           02  IMB1225H    PICTURE X.
           02  IMB1225V    PICTURE X.
           02  IMB1225O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B304303C    PICTURE X.
           02  B304303P    PICTURE X.
           02  B304303H    PICTURE X.
           02  B304303V    PICTURE X.
           02  B304303O  PIC X(30).
           02  FILLER PICTURE X(3).
           02  B113804C    PICTURE X.
           02  B113804P    PICTURE X.
           02  B113804H    PICTURE X.
           02  B113804V    PICTURE X.
           02  B113804O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B304304C    PICTURE X.
           02  B304304P    PICTURE X.
           02  B304304H    PICTURE X.
           02  B304304V    PICTURE X.
           02  B304304O  PIC X(30).
           02  FILLER PICTURE X(3).
           02  IMB1098C    PICTURE X.
           02  IMB1098P    PICTURE X.
           02  IMB1098H    PICTURE X.
           02  IMB1098V    PICTURE X.
           02  IMB1098O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMB1226C    PICTURE X.
           02  IMB1226P    PICTURE X.
           02  IMB1226H    PICTURE X.
           02  IMB1226V    PICTURE X.
           02  IMB1226O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304305C    PICTURE X.
           02  B304305P    PICTURE X.
           02  B304305H    PICTURE X.
           02  B304305V    PICTURE X.
           02  B304305O  PIC X(30).
           02  FILLER PICTURE X(3).
           02  IMPFS02C    PICTURE X.
           02  IMPFS02P    PICTURE X.
           02  IMPFS02H    PICTURE X.
           02  IMPFS02V    PICTURE X.
           02  IMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR02C    PICTURE X.
           02  IMERR02P    PICTURE X.
           02  IMERR02H    PICTURE X.
           02  IMERR02V    PICTURE X.
           02  IMERR02O  PIC X(79).
       01  IMB1M03I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN02L    COMP  PIC  S9(4).
           02  IMTRN02F    PICTURE X.
           02  FILLER REDEFINES IMTRN02F.
             03 IMTRN02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN02I  PIC X(4).
           02  BDATE17L    COMP  PIC  S9(4).
           02  BDATE17F    PICTURE X.
           02  FILLER REDEFINES BDATE17F.
             03 BDATE17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE17I  PIC X(8).
           02  BTIME17L    COMP  PIC  S9(4).
           02  BTIME17F    PICTURE X.
           02  FILLER REDEFINES BTIME17F.
             03 BTIME17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME17I  PIC X(8).
           02  IMPGE17L    COMP  PIC  S9(4).
           02  IMPGE17F    PICTURE X.
           02  FILLER REDEFINES IMPGE17F.
             03 IMPGE17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE17I  PIC X(2).
           02  CTL1017L    COMP  PIC  S9(4).
           02  CTL1017F    PICTURE X.
           02  FILLER REDEFINES CTL1017F.
             03 CTL1017A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1017I  PIC X(2).
           02  CTL2017L    COMP  PIC  S9(4).
           02  CTL2017F    PICTURE X.
           02  FILLER REDEFINES CTL2017F.
             03 CTL2017A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2017I  PIC X(3).
           02  CTL3017L    COMP  PIC  S9(4).
           02  CTL3017F    PICTURE X.
           02  FILLER REDEFINES CTL3017F.
             03 CTL3017A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3017I  PIC X(3).
           02  IMB9103L    COMP  PIC  S9(4).
           02  IMB9103F    PICTURE X.
           02  FILLER REDEFINES IMB9103F.
             03 IMB9103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9103I  PIC X(6).
           02  IMB9119L    COMP  PIC  S9(4).
           02  IMB9119F    PICTURE X.
           02  FILLER REDEFINES IMB9119F.
             03 IMB9119A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9119I  PIC X(6).
           02  IMB9106L    COMP  PIC  S9(4).
           02  IMB9106F    PICTURE X.
           02  FILLER REDEFINES IMB9106F.
             03 IMB9106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9106I  PIC X(6).
           02  IMB9104L    COMP  PIC  S9(4).
           02  IMB9104F    PICTURE X.
           02  FILLER REDEFINES IMB9104F.
             03 IMB9104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9104I  PIC X(6).
           02  IMB9115L    COMP  PIC  S9(4).
           02  IMB9115F    PICTURE X.
           02  FILLER REDEFINES IMB9115F.
             03 IMB9115A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9115I  PIC X(6).
           02  IMB9107L    COMP  PIC  S9(4).
           02  IMB9107F    PICTURE X.
           02  FILLER REDEFINES IMB9107F.
             03 IMB9107A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9107I  PIC X(6).
           02  IMB9122L    COMP  PIC  S9(4).
           02  IMB9122F    PICTURE X.
           02  FILLER REDEFINES IMB9122F.
             03 IMB9122A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9122I  PIC X(6).
           02  IMB9120L    COMP  PIC  S9(4).
           02  IMB9120F    PICTURE X.
           02  FILLER REDEFINES IMB9120F.
             03 IMB9120A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9120I  PIC X(6).
           02  IMB9124L    COMP  PIC  S9(4).
           02  IMB9124F    PICTURE X.
           02  FILLER REDEFINES IMB9124F.
             03 IMB9124A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9124I  PIC X(6).
           02  IMB9123L    COMP  PIC  S9(4).
           02  IMB9123F    PICTURE X.
           02  FILLER REDEFINES IMB9123F.
             03 IMB9123A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9123I  PIC X(6).
           02  IMB9121L    COMP  PIC  S9(4).
           02  IMB9121F    PICTURE X.
           02  FILLER REDEFINES IMB9121F.
             03 IMB9121A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9121I  PIC X(6).
           02  IMB9125L    COMP  PIC  S9(4).
           02  IMB9125F    PICTURE X.
           02  FILLER REDEFINES IMB9125F.
             03 IMB9125A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9125I  PIC X(6).
           02  IMB1054L    COMP  PIC  S9(4).
           02  IMB1054F    PICTURE X.
           02  FILLER REDEFINES IMB1054F.
             03 IMB1054A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1054I  PIC X(2).
           02  IMB1035L    COMP  PIC  S9(4).
           02  IMB1035F    PICTURE X.
           02  FILLER REDEFINES IMB1035F.
             03 IMB1035A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1035I  PIC X(2).
           02  IMB1073L    COMP  PIC  S9(4).
           02  IMB1073F    PICTURE X.
           02  FILLER REDEFINES IMB1073F.
             03 IMB1073A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1073I  PIC X(2).
           02  IMB1055L    COMP  PIC  S9(4).
           02  IMB1055F    PICTURE X.
           02  FILLER REDEFINES IMB1055F.
             03 IMB1055A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1055I  PIC X(2).
           02  IMB1036L    COMP  PIC  S9(4).
           02  IMB1036F    PICTURE X.
           02  FILLER REDEFINES IMB1036F.
             03 IMB1036A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1036I  PIC X(2).
           02  IMB1074L    COMP  PIC  S9(4).
           02  IMB1074F    PICTURE X.
           02  FILLER REDEFINES IMB1074F.
             03 IMB1074A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1074I  PIC X(2).
           02  IMB1057L    COMP  PIC  S9(4).
           02  IMB1057F    PICTURE X.
           02  FILLER REDEFINES IMB1057F.
             03 IMB1057A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1057I  PIC X(2).
           02  IMB1038L    COMP  PIC  S9(4).
           02  IMB1038F    PICTURE X.
           02  FILLER REDEFINES IMB1038F.
             03 IMB1038A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1038I  PIC X(2).
           02  IMB1076L    COMP  PIC  S9(4).
           02  IMB1076F    PICTURE X.
           02  FILLER REDEFINES IMB1076F.
             03 IMB1076A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1076I  PIC X(2).
           02  IMB1271L    COMP  PIC  S9(4).
           02  IMB1271F    PICTURE X.
           02  FILLER REDEFINES IMB1271F.
             03 IMB1271A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1271I  PIC X(2).
           02  IMB1270L    COMP  PIC  S9(4).
           02  IMB1270F    PICTURE X.
           02  FILLER REDEFINES IMB1270F.
             03 IMB1270A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1270I  PIC X(2).
           02  IMB1272L    COMP  PIC  S9(4).
           02  IMB1272F    PICTURE X.
           02  FILLER REDEFINES IMB1272F.
             03 IMB1272A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1272I  PIC X(2).
           02  IMB1274L    COMP  PIC  S9(4).
           02  IMB1274F    PICTURE X.
           02  FILLER REDEFINES IMB1274F.
             03 IMB1274A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1274I  PIC X(2).
           02  IMB1275L    COMP  PIC  S9(4).
           02  IMB1275F    PICTURE X.
           02  FILLER REDEFINES IMB1275F.
             03 IMB1275A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1275I  PIC X(2).
           02  IMB1276L    COMP  PIC  S9(4).
           02  IMB1276F    PICTURE X.
           02  FILLER REDEFINES IMB1276F.
             03 IMB1276A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1276I  PIC X(2).
           02  IMB1056L    COMP  PIC  S9(4).
           02  IMB1056F    PICTURE X.
           02  FILLER REDEFINES IMB1056F.
             03 IMB1056A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1056I  PIC X(1).
           02  IMB1037L    COMP  PIC  S9(4).
           02  IMB1037F    PICTURE X.
           02  FILLER REDEFINES IMB1037F.
             03 IMB1037A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1037I  PIC X(1).
           02  IMB1075L    COMP  PIC  S9(4).
           02  IMB1075F    PICTURE X.
           02  FILLER REDEFINES IMB1075F.
             03 IMB1075A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1075I  PIC X(1).
           02  IMB1058L    COMP  PIC  S9(4).
           02  IMB1058F    PICTURE X.
           02  FILLER REDEFINES IMB1058F.
             03 IMB1058A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1058I  PIC X(1).
           02  IMB1039L    COMP  PIC  S9(4).
           02  IMB1039F    PICTURE X.
           02  FILLER REDEFINES IMB1039F.
             03 IMB1039A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1039I  PIC X(1).
           02  IMB1077L    COMP  PIC  S9(4).
           02  IMB1077F    PICTURE X.
           02  FILLER REDEFINES IMB1077F.
             03 IMB1077A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1077I  PIC X(1).
           02  IMB1059L    COMP  PIC  S9(4).
           02  IMB1059F    PICTURE X.
           02  FILLER REDEFINES IMB1059F.
             03 IMB1059A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1059I  PIC X(1).
           02  IMB1040L    COMP  PIC  S9(4).
           02  IMB1040F    PICTURE X.
           02  FILLER REDEFINES IMB1040F.
             03 IMB1040A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1040I  PIC X(1).
           02  IMB1078L    COMP  PIC  S9(4).
           02  IMB1078F    PICTURE X.
           02  FILLER REDEFINES IMB1078F.
             03 IMB1078A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1078I  PIC X(1).
           02  IMB1060L    COMP  PIC  S9(4).
           02  IMB1060F    PICTURE X.
           02  FILLER REDEFINES IMB1060F.
             03 IMB1060A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1060I  PIC X(1).
           02  IMB1041L    COMP  PIC  S9(4).
           02  IMB1041F    PICTURE X.
           02  FILLER REDEFINES IMB1041F.
             03 IMB1041A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1041I  PIC X(1).
           02  IMB1079L    COMP  PIC  S9(4).
           02  IMB1079F    PICTURE X.
           02  FILLER REDEFINES IMB1079F.
             03 IMB1079A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1079I  PIC X(1).
           02  IMB1113L    COMP  PIC  S9(4).
           02  IMB1113F    PICTURE X.
           02  FILLER REDEFINES IMB1113F.
             03 IMB1113A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1113I  PIC X(3).
           02  B108001L    COMP  PIC  S9(4).
           02  B108001F    PICTURE X.
           02  FILLER REDEFINES B108001F.
             03 B108001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B108001I  PIC X(1).
           02  B108002L    COMP  PIC  S9(4).
           02  B108002F    PICTURE X.
           02  FILLER REDEFINES B108002F.
             03 B108002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B108002I  PIC X(1).
           02  B108003L    COMP  PIC  S9(4).
           02  B108003F    PICTURE X.
           02  FILLER REDEFINES B108003F.
             03 B108003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B108003I  PIC X(1).
           02  B108004L    COMP  PIC  S9(4).
           02  B108004F    PICTURE X.
           02  FILLER REDEFINES B108004F.
             03 B108004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B108004I  PIC X(1).
           02  B108005L    COMP  PIC  S9(4).
           02  B108005F    PICTURE X.
           02  FILLER REDEFINES B108005F.
             03 B108005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B108005I  PIC X(1).
           02  B108006L    COMP  PIC  S9(4).
           02  B108006F    PICTURE X.
           02  FILLER REDEFINES B108006F.
             03 B108006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B108006I  PIC X(1).
           02  IMPFS03L    COMP  PIC  S9(4).
           02  IMPFS03F    PICTURE X.
           02  FILLER REDEFINES IMPFS03F.
             03 IMPFS03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS03I  PIC X(79).
           02  IMERR03L    COMP  PIC  S9(4).
           02  IMERR03F    PICTURE X.
           02  FILLER REDEFINES IMERR03F.
             03 IMERR03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR03I  PIC X(79).
       01  IMB1M03O REDEFINES IMB1M03I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN02C    PICTURE X.
           02  IMTRN02P    PICTURE X.
           02  IMTRN02H    PICTURE X.
           02  IMTRN02V    PICTURE X.
           02  IMTRN02O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE17C    PICTURE X.
           02  BDATE17P    PICTURE X.
           02  BDATE17H    PICTURE X.
           02  BDATE17V    PICTURE X.
           02  BDATE17O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME17C    PICTURE X.
           02  BTIME17P    PICTURE X.
           02  BTIME17H    PICTURE X.
           02  BTIME17V    PICTURE X.
           02  BTIME17O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE17C    PICTURE X.
           02  IMPGE17P    PICTURE X.
           02  IMPGE17H    PICTURE X.
           02  IMPGE17V    PICTURE X.
           02  IMPGE17O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1017C    PICTURE X.
           02  CTL1017P    PICTURE X.
           02  CTL1017H    PICTURE X.
           02  CTL1017V    PICTURE X.
           02  CTL1017O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2017C    PICTURE X.
           02  CTL2017P    PICTURE X.
           02  CTL2017H    PICTURE X.
           02  CTL2017V    PICTURE X.
           02  CTL2017O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3017C    PICTURE X.
           02  CTL3017P    PICTURE X.
           02  CTL3017H    PICTURE X.
           02  CTL3017V    PICTURE X.
           02  CTL3017O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB9103C    PICTURE X.
           02  IMB9103P    PICTURE X.
           02  IMB9103H    PICTURE X.
           02  IMB9103V    PICTURE X.
           02  IMB9103O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9119C    PICTURE X.
           02  IMB9119P    PICTURE X.
           02  IMB9119H    PICTURE X.
           02  IMB9119V    PICTURE X.
           02  IMB9119O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9106C    PICTURE X.
           02  IMB9106P    PICTURE X.
           02  IMB9106H    PICTURE X.
           02  IMB9106V    PICTURE X.
           02  IMB9106O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9104C    PICTURE X.
           02  IMB9104P    PICTURE X.
           02  IMB9104H    PICTURE X.
           02  IMB9104V    PICTURE X.
           02  IMB9104O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9115C    PICTURE X.
           02  IMB9115P    PICTURE X.
           02  IMB9115H    PICTURE X.
           02  IMB9115V    PICTURE X.
           02  IMB9115O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9107C    PICTURE X.
           02  IMB9107P    PICTURE X.
           02  IMB9107H    PICTURE X.
           02  IMB9107V    PICTURE X.
           02  IMB9107O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9122C    PICTURE X.
           02  IMB9122P    PICTURE X.
           02  IMB9122H    PICTURE X.
           02  IMB9122V    PICTURE X.
           02  IMB9122O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9120C    PICTURE X.
           02  IMB9120P    PICTURE X.
           02  IMB9120H    PICTURE X.
           02  IMB9120V    PICTURE X.
           02  IMB9120O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9124C    PICTURE X.
           02  IMB9124P    PICTURE X.
           02  IMB9124H    PICTURE X.
           02  IMB9124V    PICTURE X.
           02  IMB9124O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9123C    PICTURE X.
           02  IMB9123P    PICTURE X.
           02  IMB9123H    PICTURE X.
           02  IMB9123V    PICTURE X.
           02  IMB9123O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9121C    PICTURE X.
           02  IMB9121P    PICTURE X.
           02  IMB9121H    PICTURE X.
           02  IMB9121V    PICTURE X.
           02  IMB9121O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB9125C    PICTURE X.
           02  IMB9125P    PICTURE X.
           02  IMB9125H    PICTURE X.
           02  IMB9125V    PICTURE X.
           02  IMB9125O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB1054C    PICTURE X.
           02  IMB1054P    PICTURE X.
           02  IMB1054H    PICTURE X.
           02  IMB1054V    PICTURE X.
           02  IMB1054O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1035C    PICTURE X.
           02  IMB1035P    PICTURE X.
           02  IMB1035H    PICTURE X.
           02  IMB1035V    PICTURE X.
           02  IMB1035O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1073C    PICTURE X.
           02  IMB1073P    PICTURE X.
           02  IMB1073H    PICTURE X.
           02  IMB1073V    PICTURE X.
           02  IMB1073O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1055C    PICTURE X.
           02  IMB1055P    PICTURE X.
           02  IMB1055H    PICTURE X.
           02  IMB1055V    PICTURE X.
           02  IMB1055O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1036C    PICTURE X.
           02  IMB1036P    PICTURE X.
           02  IMB1036H    PICTURE X.
           02  IMB1036V    PICTURE X.
           02  IMB1036O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1074C    PICTURE X.
           02  IMB1074P    PICTURE X.
           02  IMB1074H    PICTURE X.
           02  IMB1074V    PICTURE X.
           02  IMB1074O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1057C    PICTURE X.
           02  IMB1057P    PICTURE X.
           02  IMB1057H    PICTURE X.
           02  IMB1057V    PICTURE X.
           02  IMB1057O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1038C    PICTURE X.
           02  IMB1038P    PICTURE X.
           02  IMB1038H    PICTURE X.
           02  IMB1038V    PICTURE X.
           02  IMB1038O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1076C    PICTURE X.
           02  IMB1076P    PICTURE X.
           02  IMB1076H    PICTURE X.
           02  IMB1076V    PICTURE X.
           02  IMB1076O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1271C    PICTURE X.
           02  IMB1271P    PICTURE X.
           02  IMB1271H    PICTURE X.
           02  IMB1271V    PICTURE X.
           02  IMB1271O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1270C    PICTURE X.
           02  IMB1270P    PICTURE X.
           02  IMB1270H    PICTURE X.
           02  IMB1270V    PICTURE X.
           02  IMB1270O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1272C    PICTURE X.
           02  IMB1272P    PICTURE X.
           02  IMB1272H    PICTURE X.
           02  IMB1272V    PICTURE X.
           02  IMB1272O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1274C    PICTURE X.
           02  IMB1274P    PICTURE X.
           02  IMB1274H    PICTURE X.
           02  IMB1274V    PICTURE X.
           02  IMB1274O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1275C    PICTURE X.
           02  IMB1275P    PICTURE X.
           02  IMB1275H    PICTURE X.
           02  IMB1275V    PICTURE X.
           02  IMB1275O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1276C    PICTURE X.
           02  IMB1276P    PICTURE X.
           02  IMB1276H    PICTURE X.
           02  IMB1276V    PICTURE X.
           02  IMB1276O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1056C    PICTURE X.
           02  IMB1056P    PICTURE X.
           02  IMB1056H    PICTURE X.
           02  IMB1056V    PICTURE X.
           02  IMB1056O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1037C    PICTURE X.
           02  IMB1037P    PICTURE X.
           02  IMB1037H    PICTURE X.
           02  IMB1037V    PICTURE X.
           02  IMB1037O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1075C    PICTURE X.
           02  IMB1075P    PICTURE X.
           02  IMB1075H    PICTURE X.
           02  IMB1075V    PICTURE X.
           02  IMB1075O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1058C    PICTURE X.
           02  IMB1058P    PICTURE X.
           02  IMB1058H    PICTURE X.
           02  IMB1058V    PICTURE X.
           02  IMB1058O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1039C    PICTURE X.
           02  IMB1039P    PICTURE X.
           02  IMB1039H    PICTURE X.
           02  IMB1039V    PICTURE X.
           02  IMB1039O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1077C    PICTURE X.
           02  IMB1077P    PICTURE X.
           02  IMB1077H    PICTURE X.
           02  IMB1077V    PICTURE X.
           02  IMB1077O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1059C    PICTURE X.
           02  IMB1059P    PICTURE X.
           02  IMB1059H    PICTURE X.
           02  IMB1059V    PICTURE X.
           02  IMB1059O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1040C    PICTURE X.
           02  IMB1040P    PICTURE X.
           02  IMB1040H    PICTURE X.
           02  IMB1040V    PICTURE X.
           02  IMB1040O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1078C    PICTURE X.
           02  IMB1078P    PICTURE X.
           02  IMB1078H    PICTURE X.
           02  IMB1078V    PICTURE X.
           02  IMB1078O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1060C    PICTURE X.
           02  IMB1060P    PICTURE X.
           02  IMB1060H    PICTURE X.
           02  IMB1060V    PICTURE X.
           02  IMB1060O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1041C    PICTURE X.
           02  IMB1041P    PICTURE X.
           02  IMB1041H    PICTURE X.
           02  IMB1041V    PICTURE X.
           02  IMB1041O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1079C    PICTURE X.
           02  IMB1079P    PICTURE X.
           02  IMB1079H    PICTURE X.
           02  IMB1079V    PICTURE X.
           02  IMB1079O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1113C    PICTURE X.
           02  IMB1113P    PICTURE X.
           02  IMB1113H    PICTURE X.
           02  IMB1113V    PICTURE X.
           02  IMB1113O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B108001C    PICTURE X.
           02  B108001P    PICTURE X.
           02  B108001H    PICTURE X.
           02  B108001V    PICTURE X.
           02  B108001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B108002C    PICTURE X.
           02  B108002P    PICTURE X.
           02  B108002H    PICTURE X.
           02  B108002V    PICTURE X.
           02  B108002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B108003C    PICTURE X.
           02  B108003P    PICTURE X.
           02  B108003H    PICTURE X.
           02  B108003V    PICTURE X.
           02  B108003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B108004C    PICTURE X.
           02  B108004P    PICTURE X.
           02  B108004H    PICTURE X.
           02  B108004V    PICTURE X.
           02  B108004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B108005C    PICTURE X.
           02  B108005P    PICTURE X.
           02  B108005H    PICTURE X.
           02  B108005V    PICTURE X.
           02  B108005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B108006C    PICTURE X.
           02  B108006P    PICTURE X.
           02  B108006H    PICTURE X.
           02  B108006V    PICTURE X.
           02  B108006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS03C    PICTURE X.
           02  IMPFS03P    PICTURE X.
           02  IMPFS03H    PICTURE X.
           02  IMPFS03V    PICTURE X.
           02  IMPFS03O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR03C    PICTURE X.
           02  IMERR03P    PICTURE X.
           02  IMERR03H    PICTURE X.
           02  IMERR03V    PICTURE X.
           02  IMERR03O  PIC X(79).
       01  IMB1M04I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN03L    COMP  PIC  S9(4).
           02  IMTRN03F    PICTURE X.
           02  FILLER REDEFINES IMTRN03F.
             03 IMTRN03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN03I  PIC X(4).
           02  BDATE02L    COMP  PIC  S9(4).
           02  BDATE02F    PICTURE X.
           02  FILLER REDEFINES BDATE02F.
             03 BDATE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE02I  PIC X(8).
           02  BTIME02L    COMP  PIC  S9(4).
           02  BTIME02F    PICTURE X.
           02  FILLER REDEFINES BTIME02F.
             03 BTIME02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME02I  PIC X(8).
           02  IMPGE02L    COMP  PIC  S9(4).
           02  IMPGE02F    PICTURE X.
           02  FILLER REDEFINES IMPGE02F.
             03 IMPGE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE02I  PIC X(2).
           02  CTL1002L    COMP  PIC  S9(4).
           02  CTL1002F    PICTURE X.
           02  FILLER REDEFINES CTL1002F.
             03 CTL1002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1002I  PIC X(2).
           02  CTL2002L    COMP  PIC  S9(4).
           02  CTL2002F    PICTURE X.
           02  FILLER REDEFINES CTL2002F.
             03 CTL2002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2002I  PIC X(3).
           02  CTL3002L    COMP  PIC  S9(4).
           02  CTL3002F    PICTURE X.
           02  FILLER REDEFINES CTL3002F.
             03 CTL3002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3002I  PIC X(3).
           02  B129801L    COMP  PIC  S9(4).
           02  B129801F    PICTURE X.
           02  FILLER REDEFINES B129801F.
             03 B129801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129801I  PIC X(6).
           02  B127301L    COMP  PIC  S9(4).
           02  B127301F    PICTURE X.
           02  FILLER REDEFINES B127301F.
             03 B127301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127301I  PIC X(1).
           02  E127301L    COMP  PIC  S9(4).
           02  E127301F    PICTURE X.
           02  FILLER REDEFINES E127301F.
             03 E127301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127301I  PIC X(16).
           02  B129802L    COMP  PIC  S9(4).
           02  B129802F    PICTURE X.
           02  FILLER REDEFINES B129802F.
             03 B129802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129802I  PIC X(6).
           02  B127302L    COMP  PIC  S9(4).
           02  B127302F    PICTURE X.
           02  FILLER REDEFINES B127302F.
             03 B127302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127302I  PIC X(1).
           02  E127302L    COMP  PIC  S9(4).
           02  E127302F    PICTURE X.
           02  FILLER REDEFINES E127302F.
             03 E127302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127302I  PIC X(16).
           02  B129803L    COMP  PIC  S9(4).
           02  B129803F    PICTURE X.
           02  FILLER REDEFINES B129803F.
             03 B129803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129803I  PIC X(6).
           02  B127303L    COMP  PIC  S9(4).
           02  B127303F    PICTURE X.
           02  FILLER REDEFINES B127303F.
             03 B127303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127303I  PIC X(1).
           02  E127303L    COMP  PIC  S9(4).
           02  E127303F    PICTURE X.
           02  FILLER REDEFINES E127303F.
             03 E127303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127303I  PIC X(16).
           02  B129804L    COMP  PIC  S9(4).
           02  B129804F    PICTURE X.
           02  FILLER REDEFINES B129804F.
             03 B129804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129804I  PIC X(6).
           02  B127304L    COMP  PIC  S9(4).
           02  B127304F    PICTURE X.
           02  FILLER REDEFINES B127304F.
             03 B127304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127304I  PIC X(1).
           02  E127304L    COMP  PIC  S9(4).
           02  E127304F    PICTURE X.
           02  FILLER REDEFINES E127304F.
             03 E127304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127304I  PIC X(16).
           02  B129805L    COMP  PIC  S9(4).
           02  B129805F    PICTURE X.
           02  FILLER REDEFINES B129805F.
             03 B129805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129805I  PIC X(6).
           02  B127305L    COMP  PIC  S9(4).
           02  B127305F    PICTURE X.
           02  FILLER REDEFINES B127305F.
             03 B127305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127305I  PIC X(1).
           02  E127305L    COMP  PIC  S9(4).
           02  E127305F    PICTURE X.
           02  FILLER REDEFINES E127305F.
             03 E127305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127305I  PIC X(16).
           02  B129806L    COMP  PIC  S9(4).
           02  B129806F    PICTURE X.
           02  FILLER REDEFINES B129806F.
             03 B129806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129806I  PIC X(6).
           02  B127306L    COMP  PIC  S9(4).
           02  B127306F    PICTURE X.
           02  FILLER REDEFINES B127306F.
             03 B127306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127306I  PIC X(1).
           02  E127306L    COMP  PIC  S9(4).
           02  E127306F    PICTURE X.
           02  FILLER REDEFINES E127306F.
             03 E127306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127306I  PIC X(16).
           02  B129807L    COMP  PIC  S9(4).
           02  B129807F    PICTURE X.
           02  FILLER REDEFINES B129807F.
             03 B129807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129807I  PIC X(6).
           02  B127307L    COMP  PIC  S9(4).
           02  B127307F    PICTURE X.
           02  FILLER REDEFINES B127307F.
             03 B127307A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127307I  PIC X(1).
           02  E127307L    COMP  PIC  S9(4).
           02  E127307F    PICTURE X.
           02  FILLER REDEFINES E127307F.
             03 E127307A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127307I  PIC X(16).
           02  B129808L    COMP  PIC  S9(4).
           02  B129808F    PICTURE X.
           02  FILLER REDEFINES B129808F.
             03 B129808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129808I  PIC X(6).
           02  B127308L    COMP  PIC  S9(4).
           02  B127308F    PICTURE X.
           02  FILLER REDEFINES B127308F.
             03 B127308A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127308I  PIC X(1).
           02  E127308L    COMP  PIC  S9(4).
           02  E127308F    PICTURE X.
           02  FILLER REDEFINES E127308F.
             03 E127308A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127308I  PIC X(16).
           02  B129809L    COMP  PIC  S9(4).
           02  B129809F    PICTURE X.
           02  FILLER REDEFINES B129809F.
             03 B129809A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129809I  PIC X(6).
           02  B127309L    COMP  PIC  S9(4).
           02  B127309F    PICTURE X.
           02  FILLER REDEFINES B127309F.
             03 B127309A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127309I  PIC X(1).
           02  E127309L    COMP  PIC  S9(4).
           02  E127309F    PICTURE X.
           02  FILLER REDEFINES E127309F.
             03 E127309A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127309I  PIC X(16).
           02  B129810L    COMP  PIC  S9(4).
           02  B129810F    PICTURE X.
           02  FILLER REDEFINES B129810F.
             03 B129810A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129810I  PIC X(6).
           02  B127310L    COMP  PIC  S9(4).
           02  B127310F    PICTURE X.
           02  FILLER REDEFINES B127310F.
             03 B127310A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127310I  PIC X(1).
           02  E127310L    COMP  PIC  S9(4).
           02  E127310F    PICTURE X.
           02  FILLER REDEFINES E127310F.
             03 E127310A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127310I  PIC X(16).
           02  B129811L    COMP  PIC  S9(4).
           02  B129811F    PICTURE X.
           02  FILLER REDEFINES B129811F.
             03 B129811A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129811I  PIC X(6).
           02  B127311L    COMP  PIC  S9(4).
           02  B127311F    PICTURE X.
           02  FILLER REDEFINES B127311F.
             03 B127311A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127311I  PIC X(1).
           02  E127311L    COMP  PIC  S9(4).
           02  E127311F    PICTURE X.
           02  FILLER REDEFINES E127311F.
             03 E127311A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127311I  PIC X(16).
           02  B129812L    COMP  PIC  S9(4).
           02  B129812F    PICTURE X.
           02  FILLER REDEFINES B129812F.
             03 B129812A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129812I  PIC X(6).
           02  B127312L    COMP  PIC  S9(4).
           02  B127312F    PICTURE X.
           02  FILLER REDEFINES B127312F.
             03 B127312A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127312I  PIC X(1).
           02  E127312L    COMP  PIC  S9(4).
           02  E127312F    PICTURE X.
           02  FILLER REDEFINES E127312F.
             03 E127312A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127312I  PIC X(16).
           02  B129813L    COMP  PIC  S9(4).
           02  B129813F    PICTURE X.
           02  FILLER REDEFINES B129813F.
             03 B129813A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129813I  PIC X(6).
           02  B127313L    COMP  PIC  S9(4).
           02  B127313F    PICTURE X.
           02  FILLER REDEFINES B127313F.
             03 B127313A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127313I  PIC X(1).
           02  E127313L    COMP  PIC  S9(4).
           02  E127313F    PICTURE X.
           02  FILLER REDEFINES E127313F.
             03 E127313A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127313I  PIC X(16).
           02  B129814L    COMP  PIC  S9(4).
           02  B129814F    PICTURE X.
           02  FILLER REDEFINES B129814F.
             03 B129814A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129814I  PIC X(6).
           02  B127314L    COMP  PIC  S9(4).
           02  B127314F    PICTURE X.
           02  FILLER REDEFINES B127314F.
             03 B127314A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127314I  PIC X(1).
           02  E127314L    COMP  PIC  S9(4).
           02  E127314F    PICTURE X.
           02  FILLER REDEFINES E127314F.
             03 E127314A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127314I  PIC X(16).
           02  B129815L    COMP  PIC  S9(4).
           02  B129815F    PICTURE X.
           02  FILLER REDEFINES B129815F.
             03 B129815A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B129815I  PIC X(6).
           02  B127315L    COMP  PIC  S9(4).
           02  B127315F    PICTURE X.
           02  FILLER REDEFINES B127315F.
             03 B127315A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B127315I  PIC X(1).
           02  E127315L    COMP  PIC  S9(4).
           02  E127315F    PICTURE X.
           02  FILLER REDEFINES E127315F.
             03 E127315A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E127315I  PIC X(16).
           02  IMPFS04L    COMP  PIC  S9(4).
           02  IMPFS04F    PICTURE X.
           02  FILLER REDEFINES IMPFS04F.
             03 IMPFS04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS04I  PIC X(79).
           02  IMERR04L    COMP  PIC  S9(4).
           02  IMERR04F    PICTURE X.
           02  FILLER REDEFINES IMERR04F.
             03 IMERR04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR04I  PIC X(79).
       01  IMB1M04O REDEFINES IMB1M04I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN03C    PICTURE X.
           02  IMTRN03P    PICTURE X.
           02  IMTRN03H    PICTURE X.
           02  IMTRN03V    PICTURE X.
           02  IMTRN03O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE02C    PICTURE X.
           02  BDATE02P    PICTURE X.
           02  BDATE02H    PICTURE X.
           02  BDATE02V    PICTURE X.
           02  BDATE02O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME02C    PICTURE X.
           02  BTIME02P    PICTURE X.
           02  BTIME02H    PICTURE X.
           02  BTIME02V    PICTURE X.
           02  BTIME02O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE02C    PICTURE X.
           02  IMPGE02P    PICTURE X.
           02  IMPGE02H    PICTURE X.
           02  IMPGE02V    PICTURE X.
           02  IMPGE02O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1002C    PICTURE X.
           02  CTL1002P    PICTURE X.
           02  CTL1002H    PICTURE X.
           02  CTL1002V    PICTURE X.
           02  CTL1002O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2002C    PICTURE X.
           02  CTL2002P    PICTURE X.
           02  CTL2002H    PICTURE X.
           02  CTL2002V    PICTURE X.
           02  CTL2002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3002C    PICTURE X.
           02  CTL3002P    PICTURE X.
           02  CTL3002H    PICTURE X.
           02  CTL3002V    PICTURE X.
           02  CTL3002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B129801C    PICTURE X.
           02  B129801P    PICTURE X.
           02  B129801H    PICTURE X.
           02  B129801V    PICTURE X.
           02  B129801O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127301C    PICTURE X.
           02  B127301P    PICTURE X.
           02  B127301H    PICTURE X.
           02  B127301V    PICTURE X.
           02  B127301O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127301C    PICTURE X.
           02  E127301P    PICTURE X.
           02  E127301H    PICTURE X.
           02  E127301V    PICTURE X.
           02  E127301O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129802C    PICTURE X.
           02  B129802P    PICTURE X.
           02  B129802H    PICTURE X.
           02  B129802V    PICTURE X.
           02  B129802O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127302C    PICTURE X.
           02  B127302P    PICTURE X.
           02  B127302H    PICTURE X.
           02  B127302V    PICTURE X.
           02  B127302O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127302C    PICTURE X.
           02  E127302P    PICTURE X.
           02  E127302H    PICTURE X.
           02  E127302V    PICTURE X.
           02  E127302O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129803C    PICTURE X.
           02  B129803P    PICTURE X.
           02  B129803H    PICTURE X.
           02  B129803V    PICTURE X.
           02  B129803O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127303C    PICTURE X.
           02  B127303P    PICTURE X.
           02  B127303H    PICTURE X.
           02  B127303V    PICTURE X.
           02  B127303O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127303C    PICTURE X.
           02  E127303P    PICTURE X.
           02  E127303H    PICTURE X.
           02  E127303V    PICTURE X.
           02  E127303O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129804C    PICTURE X.
           02  B129804P    PICTURE X.
           02  B129804H    PICTURE X.
           02  B129804V    PICTURE X.
           02  B129804O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127304C    PICTURE X.
           02  B127304P    PICTURE X.
           02  B127304H    PICTURE X.
           02  B127304V    PICTURE X.
           02  B127304O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127304C    PICTURE X.
           02  E127304P    PICTURE X.
           02  E127304H    PICTURE X.
           02  E127304V    PICTURE X.
           02  E127304O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129805C    PICTURE X.
           02  B129805P    PICTURE X.
           02  B129805H    PICTURE X.
           02  B129805V    PICTURE X.
           02  B129805O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127305C    PICTURE X.
           02  B127305P    PICTURE X.
           02  B127305H    PICTURE X.
           02  B127305V    PICTURE X.
           02  B127305O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127305C    PICTURE X.
           02  E127305P    PICTURE X.
           02  E127305H    PICTURE X.
           02  E127305V    PICTURE X.
           02  E127305O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129806C    PICTURE X.
           02  B129806P    PICTURE X.
           02  B129806H    PICTURE X.
           02  B129806V    PICTURE X.
           02  B129806O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127306C    PICTURE X.
           02  B127306P    PICTURE X.
           02  B127306H    PICTURE X.
           02  B127306V    PICTURE X.
           02  B127306O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127306C    PICTURE X.
           02  E127306P    PICTURE X.
           02  E127306H    PICTURE X.
           02  E127306V    PICTURE X.
           02  E127306O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129807C    PICTURE X.
           02  B129807P    PICTURE X.
           02  B129807H    PICTURE X.
           02  B129807V    PICTURE X.
           02  B129807O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127307C    PICTURE X.
           02  B127307P    PICTURE X.
           02  B127307H    PICTURE X.
           02  B127307V    PICTURE X.
           02  B127307O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127307C    PICTURE X.
           02  E127307P    PICTURE X.
           02  E127307H    PICTURE X.
           02  E127307V    PICTURE X.
           02  E127307O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129808C    PICTURE X.
           02  B129808P    PICTURE X.
           02  B129808H    PICTURE X.
           02  B129808V    PICTURE X.
           02  B129808O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127308C    PICTURE X.
           02  B127308P    PICTURE X.
           02  B127308H    PICTURE X.
           02  B127308V    PICTURE X.
           02  B127308O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127308C    PICTURE X.
           02  E127308P    PICTURE X.
           02  E127308H    PICTURE X.
           02  E127308V    PICTURE X.
           02  E127308O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129809C    PICTURE X.
           02  B129809P    PICTURE X.
           02  B129809H    PICTURE X.
           02  B129809V    PICTURE X.
           02  B129809O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127309C    PICTURE X.
           02  B127309P    PICTURE X.
           02  B127309H    PICTURE X.
           02  B127309V    PICTURE X.
           02  B127309O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127309C    PICTURE X.
           02  E127309P    PICTURE X.
           02  E127309H    PICTURE X.
           02  E127309V    PICTURE X.
           02  E127309O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129810C    PICTURE X.
           02  B129810P    PICTURE X.
           02  B129810H    PICTURE X.
           02  B129810V    PICTURE X.
           02  B129810O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127310C    PICTURE X.
           02  B127310P    PICTURE X.
           02  B127310H    PICTURE X.
           02  B127310V    PICTURE X.
           02  B127310O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127310C    PICTURE X.
           02  E127310P    PICTURE X.
           02  E127310H    PICTURE X.
           02  E127310V    PICTURE X.
           02  E127310O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129811C    PICTURE X.
           02  B129811P    PICTURE X.
           02  B129811H    PICTURE X.
           02  B129811V    PICTURE X.
           02  B129811O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127311C    PICTURE X.
           02  B127311P    PICTURE X.
           02  B127311H    PICTURE X.
           02  B127311V    PICTURE X.
           02  B127311O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127311C    PICTURE X.
           02  E127311P    PICTURE X.
           02  E127311H    PICTURE X.
           02  E127311V    PICTURE X.
           02  E127311O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129812C    PICTURE X.
           02  B129812P    PICTURE X.
           02  B129812H    PICTURE X.
           02  B129812V    PICTURE X.
           02  B129812O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127312C    PICTURE X.
           02  B127312P    PICTURE X.
           02  B127312H    PICTURE X.
           02  B127312V    PICTURE X.
           02  B127312O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127312C    PICTURE X.
           02  E127312P    PICTURE X.
           02  E127312H    PICTURE X.
           02  E127312V    PICTURE X.
           02  E127312O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129813C    PICTURE X.
           02  B129813P    PICTURE X.
           02  B129813H    PICTURE X.
           02  B129813V    PICTURE X.
           02  B129813O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127313C    PICTURE X.
           02  B127313P    PICTURE X.
           02  B127313H    PICTURE X.
           02  B127313V    PICTURE X.
           02  B127313O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127313C    PICTURE X.
           02  E127313P    PICTURE X.
           02  E127313H    PICTURE X.
           02  E127313V    PICTURE X.
           02  E127313O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129814C    PICTURE X.
           02  B129814P    PICTURE X.
           02  B129814H    PICTURE X.
           02  B129814V    PICTURE X.
           02  B129814O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127314C    PICTURE X.
           02  B127314P    PICTURE X.
           02  B127314H    PICTURE X.
           02  B127314V    PICTURE X.
           02  B127314O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127314C    PICTURE X.
           02  E127314P    PICTURE X.
           02  E127314H    PICTURE X.
           02  E127314V    PICTURE X.
           02  E127314O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B129815C    PICTURE X.
           02  B129815P    PICTURE X.
           02  B129815H    PICTURE X.
           02  B129815V    PICTURE X.
           02  B129815O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B127315C    PICTURE X.
           02  B127315P    PICTURE X.
           02  B127315H    PICTURE X.
           02  B127315V    PICTURE X.
           02  B127315O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E127315C    PICTURE X.
           02  E127315P    PICTURE X.
           02  E127315H    PICTURE X.
           02  E127315V    PICTURE X.
           02  E127315O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMPFS04C    PICTURE X.
           02  IMPFS04P    PICTURE X.
           02  IMPFS04H    PICTURE X.
           02  IMPFS04V    PICTURE X.
           02  IMPFS04O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR04C    PICTURE X.
           02  IMERR04P    PICTURE X.
           02  IMERR04H    PICTURE X.
           02  IMERR04V    PICTURE X.
           02  IMERR04O  PIC X(79).
       01  IMB1M05I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN04L    COMP  PIC  S9(4).
           02  IMTRN04F    PICTURE X.
           02  FILLER REDEFINES IMTRN04F.
             03 IMTRN04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN04I  PIC X(4).
           02  BDATE03L    COMP  PIC  S9(4).
           02  BDATE03F    PICTURE X.
           02  FILLER REDEFINES BDATE03F.
             03 BDATE03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE03I  PIC X(8).
           02  BTIME03L    COMP  PIC  S9(4).
           02  BTIME03F    PICTURE X.
           02  FILLER REDEFINES BTIME03F.
             03 BTIME03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME03I  PIC X(8).
           02  IMPGE03L    COMP  PIC  S9(4).
           02  IMPGE03F    PICTURE X.
           02  FILLER REDEFINES IMPGE03F.
             03 IMPGE03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE03I  PIC X(2).
           02  CTL1003L    COMP  PIC  S9(4).
           02  CTL1003F    PICTURE X.
           02  FILLER REDEFINES CTL1003F.
             03 CTL1003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1003I  PIC X(2).
           02  CTL2003L    COMP  PIC  S9(4).
           02  CTL2003F    PICTURE X.
           02  FILLER REDEFINES CTL2003F.
             03 CTL2003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2003I  PIC X(3).
           02  CTL3003L    COMP  PIC  S9(4).
           02  CTL3003F    PICTURE X.
           02  FILLER REDEFINES CTL3003F.
             03 CTL3003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3003I  PIC X(3).
           02  IMB1161L    COMP  PIC  S9(4).
           02  IMB1161F    PICTURE X.
           02  FILLER REDEFINES IMB1161F.
             03 IMB1161A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1161I  PIC X(2).
           02  IMB1163L    COMP  PIC  S9(4).
           02  IMB1163F    PICTURE X.
           02  FILLER REDEFINES IMB1163F.
             03 IMB1163A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1163I  PIC X(6).
           02  IMB1165L    COMP  PIC  S9(4).
           02  IMB1165F    PICTURE X.
           02  FILLER REDEFINES IMB1165F.
             03 IMB1165A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1165I  PIC X(4).
           02  IMB1162L    COMP  PIC  S9(4).
           02  IMB1162F    PICTURE X.
           02  FILLER REDEFINES IMB1162F.
             03 IMB1162A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1162I  PIC X(10).
           02  IMB1170L    COMP  PIC  S9(4).
           02  IMB1170F    PICTURE X.
           02  FILLER REDEFINES IMB1170F.
             03 IMB1170A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1170I  PIC X(6).
           02  IMB1166L    COMP  PIC  S9(4).
           02  IMB1166F    PICTURE X.
           02  FILLER REDEFINES IMB1166F.
             03 IMB1166A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1166I  PIC X(4).
           02  IMB1169L    COMP  PIC  S9(4).
           02  IMB1169F    PICTURE X.
           02  FILLER REDEFINES IMB1169F.
             03 IMB1169A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1169I  PIC X(10).
           02  IMB1172L    COMP  PIC  S9(4).
           02  IMB1172F    PICTURE X.
           02  FILLER REDEFINES IMB1172F.
             03 IMB1172A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1172I  PIC X(4).
           02  IMB1167L    COMP  PIC  S9(4).
           02  IMB1167F    PICTURE X.
           02  FILLER REDEFINES IMB1167F.
             03 IMB1167A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1167I  PIC X(4).
           02  IMB1171L    COMP  PIC  S9(4).
           02  IMB1171F    PICTURE X.
           02  FILLER REDEFINES IMB1171F.
             03 IMB1171A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1171I  PIC X(10).
           02  IMB1178L    COMP  PIC  S9(4).
           02  IMB1178F    PICTURE X.
           02  FILLER REDEFINES IMB1178F.
             03 IMB1178A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1178I  PIC X(1).
           02  IMB1164L    COMP  PIC  S9(4).
           02  IMB1164F    PICTURE X.
           02  FILLER REDEFINES IMB1164F.
             03 IMB1164A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1164I  PIC X(4).
           02  IMB1168L    COMP  PIC  S9(4).
           02  IMB1168F    PICTURE X.
           02  FILLER REDEFINES IMB1168F.
             03 IMB1168A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1168I  PIC X(4).
           02  B117301L    COMP  PIC  S9(4).
           02  B117301F    PICTURE X.
           02  FILLER REDEFINES B117301F.
             03 B117301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117301I  PIC X(4).
           02  B117302L    COMP  PIC  S9(4).
           02  B117302F    PICTURE X.
           02  FILLER REDEFINES B117302F.
             03 B117302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117302I  PIC X(4).
           02  B117303L    COMP  PIC  S9(4).
           02  B117303F    PICTURE X.
           02  FILLER REDEFINES B117303F.
             03 B117303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117303I  PIC X(4).
           02  B117304L    COMP  PIC  S9(4).
           02  B117304F    PICTURE X.
           02  FILLER REDEFINES B117304F.
             03 B117304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117304I  PIC X(4).
           02  B117305L    COMP  PIC  S9(4).
           02  B117305F    PICTURE X.
           02  FILLER REDEFINES B117305F.
             03 B117305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117305I  PIC X(4).
           02  B117306L    COMP  PIC  S9(4).
           02  B117306F    PICTURE X.
           02  FILLER REDEFINES B117306F.
             03 B117306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117306I  PIC X(4).
           02  B117307L    COMP  PIC  S9(4).
           02  B117307F    PICTURE X.
           02  FILLER REDEFINES B117307F.
             03 B117307A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117307I  PIC X(4).
           02  B117308L    COMP  PIC  S9(4).
           02  B117308F    PICTURE X.
           02  FILLER REDEFINES B117308F.
             03 B117308A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117308I  PIC X(4).
           02  B117309L    COMP  PIC  S9(4).
           02  B117309F    PICTURE X.
           02  FILLER REDEFINES B117309F.
             03 B117309A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117309I  PIC X(4).
           02  B117310L    COMP  PIC  S9(4).
           02  B117310F    PICTURE X.
           02  FILLER REDEFINES B117310F.
             03 B117310A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117310I  PIC X(4).
           02  B117311L    COMP  PIC  S9(4).
           02  B117311F    PICTURE X.
           02  FILLER REDEFINES B117311F.
             03 B117311A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117311I  PIC X(4).
           02  B117312L    COMP  PIC  S9(4).
           02  B117312F    PICTURE X.
           02  FILLER REDEFINES B117312F.
             03 B117312A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117312I  PIC X(4).
           02  B117313L    COMP  PIC  S9(4).
           02  B117313F    PICTURE X.
           02  FILLER REDEFINES B117313F.
             03 B117313A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117313I  PIC X(4).
           02  B117314L    COMP  PIC  S9(4).
           02  B117314F    PICTURE X.
           02  FILLER REDEFINES B117314F.
             03 B117314A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117314I  PIC X(4).
           02  B117315L    COMP  PIC  S9(4).
           02  B117315F    PICTURE X.
           02  FILLER REDEFINES B117315F.
             03 B117315A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117315I  PIC X(4).
           02  B117316L    COMP  PIC  S9(4).
           02  B117316F    PICTURE X.
           02  FILLER REDEFINES B117316F.
             03 B117316A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117316I  PIC X(4).
           02  B117317L    COMP  PIC  S9(4).
           02  B117317F    PICTURE X.
           02  FILLER REDEFINES B117317F.
             03 B117317A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117317I  PIC X(4).
           02  B117318L    COMP  PIC  S9(4).
           02  B117318F    PICTURE X.
           02  FILLER REDEFINES B117318F.
             03 B117318A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117318I  PIC X(4).
           02  B117319L    COMP  PIC  S9(4).
           02  B117319F    PICTURE X.
           02  FILLER REDEFINES B117319F.
             03 B117319A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117319I  PIC X(4).
           02  B117320L    COMP  PIC  S9(4).
           02  B117320F    PICTURE X.
           02  FILLER REDEFINES B117320F.
             03 B117320A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117320I  PIC X(4).
           02  B117321L    COMP  PIC  S9(4).
           02  B117321F    PICTURE X.
           02  FILLER REDEFINES B117321F.
             03 B117321A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117321I  PIC X(4).
           02  B117322L    COMP  PIC  S9(4).
           02  B117322F    PICTURE X.
           02  FILLER REDEFINES B117322F.
             03 B117322A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117322I  PIC X(4).
           02  B117323L    COMP  PIC  S9(4).
           02  B117323F    PICTURE X.
           02  FILLER REDEFINES B117323F.
             03 B117323A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117323I  PIC X(4).
           02  B117324L    COMP  PIC  S9(4).
           02  B117324F    PICTURE X.
           02  FILLER REDEFINES B117324F.
             03 B117324A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117324I  PIC X(4).
           02  B117325L    COMP  PIC  S9(4).
           02  B117325F    PICTURE X.
           02  FILLER REDEFINES B117325F.
             03 B117325A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B117325I  PIC X(4).
           02  IMB1179L    COMP  PIC  S9(4).
           02  IMB1179F    PICTURE X.
           02  FILLER REDEFINES IMB1179F.
             03 IMB1179A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1179I  PIC X(8).
           02  IMB1180L    COMP  PIC  S9(4).
           02  IMB1180F    PICTURE X.
           02  FILLER REDEFINES IMB1180F.
             03 IMB1180A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1180I  PIC X(8).
           02  IMPFS05L    COMP  PIC  S9(4).
           02  IMPFS05F    PICTURE X.
           02  FILLER REDEFINES IMPFS05F.
             03 IMPFS05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS05I  PIC X(79).
           02  IMERR05L    COMP  PIC  S9(4).
           02  IMERR05F    PICTURE X.
           02  FILLER REDEFINES IMERR05F.
             03 IMERR05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR05I  PIC X(79).
       01  IMB1M05O REDEFINES IMB1M05I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN04C    PICTURE X.
           02  IMTRN04P    PICTURE X.
           02  IMTRN04H    PICTURE X.
           02  IMTRN04V    PICTURE X.
           02  IMTRN04O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE03C    PICTURE X.
           02  BDATE03P    PICTURE X.
           02  BDATE03H    PICTURE X.
           02  BDATE03V    PICTURE X.
           02  BDATE03O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME03C    PICTURE X.
           02  BTIME03P    PICTURE X.
           02  BTIME03H    PICTURE X.
           02  BTIME03V    PICTURE X.
           02  BTIME03O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE03C    PICTURE X.
           02  IMPGE03P    PICTURE X.
           02  IMPGE03H    PICTURE X.
           02  IMPGE03V    PICTURE X.
           02  IMPGE03O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1003C    PICTURE X.
           02  CTL1003P    PICTURE X.
           02  CTL1003H    PICTURE X.
           02  CTL1003V    PICTURE X.
           02  CTL1003O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2003C    PICTURE X.
           02  CTL2003P    PICTURE X.
           02  CTL2003H    PICTURE X.
           02  CTL2003V    PICTURE X.
           02  CTL2003O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3003C    PICTURE X.
           02  CTL3003P    PICTURE X.
           02  CTL3003H    PICTURE X.
           02  CTL3003V    PICTURE X.
           02  CTL3003O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1161C    PICTURE X.
           02  IMB1161P    PICTURE X.
           02  IMB1161H    PICTURE X.
           02  IMB1161V    PICTURE X.
           02  IMB1161O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB1163C    PICTURE X.
           02  IMB1163P    PICTURE X.
           02  IMB1163H    PICTURE X.
           02  IMB1163V    PICTURE X.
           02  IMB1163O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB1165C    PICTURE X.
           02  IMB1165P    PICTURE X.
           02  IMB1165H    PICTURE X.
           02  IMB1165V    PICTURE X.
           02  IMB1165O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1162C    PICTURE X.
           02  IMB1162P    PICTURE X.
           02  IMB1162H    PICTURE X.
           02  IMB1162V    PICTURE X.
           02  IMB1162O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB1170C    PICTURE X.
           02  IMB1170P    PICTURE X.
           02  IMB1170H    PICTURE X.
           02  IMB1170V    PICTURE X.
           02  IMB1170O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB1166C    PICTURE X.
           02  IMB1166P    PICTURE X.
           02  IMB1166H    PICTURE X.
           02  IMB1166V    PICTURE X.
           02  IMB1166O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1169C    PICTURE X.
           02  IMB1169P    PICTURE X.
           02  IMB1169H    PICTURE X.
           02  IMB1169V    PICTURE X.
           02  IMB1169O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB1172C    PICTURE X.
           02  IMB1172P    PICTURE X.
           02  IMB1172H    PICTURE X.
           02  IMB1172V    PICTURE X.
           02  IMB1172O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1167C    PICTURE X.
           02  IMB1167P    PICTURE X.
           02  IMB1167H    PICTURE X.
           02  IMB1167V    PICTURE X.
           02  IMB1167O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1171C    PICTURE X.
           02  IMB1171P    PICTURE X.
           02  IMB1171H    PICTURE X.
           02  IMB1171V    PICTURE X.
           02  IMB1171O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB1178C    PICTURE X.
           02  IMB1178P    PICTURE X.
           02  IMB1178H    PICTURE X.
           02  IMB1178V    PICTURE X.
           02  IMB1178O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1164C    PICTURE X.
           02  IMB1164P    PICTURE X.
           02  IMB1164H    PICTURE X.
           02  IMB1164V    PICTURE X.
           02  IMB1164O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1168C    PICTURE X.
           02  IMB1168P    PICTURE X.
           02  IMB1168H    PICTURE X.
           02  IMB1168V    PICTURE X.
           02  IMB1168O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117301C    PICTURE X.
           02  B117301P    PICTURE X.
           02  B117301H    PICTURE X.
           02  B117301V    PICTURE X.
           02  B117301O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117302C    PICTURE X.
           02  B117302P    PICTURE X.
           02  B117302H    PICTURE X.
           02  B117302V    PICTURE X.
           02  B117302O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117303C    PICTURE X.
           02  B117303P    PICTURE X.
           02  B117303H    PICTURE X.
           02  B117303V    PICTURE X.
           02  B117303O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117304C    PICTURE X.
           02  B117304P    PICTURE X.
           02  B117304H    PICTURE X.
           02  B117304V    PICTURE X.
           02  B117304O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117305C    PICTURE X.
           02  B117305P    PICTURE X.
           02  B117305H    PICTURE X.
           02  B117305V    PICTURE X.
           02  B117305O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117306C    PICTURE X.
           02  B117306P    PICTURE X.
           02  B117306H    PICTURE X.
           02  B117306V    PICTURE X.
           02  B117306O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117307C    PICTURE X.
           02  B117307P    PICTURE X.
           02  B117307H    PICTURE X.
           02  B117307V    PICTURE X.
           02  B117307O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117308C    PICTURE X.
           02  B117308P    PICTURE X.
           02  B117308H    PICTURE X.
           02  B117308V    PICTURE X.
           02  B117308O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117309C    PICTURE X.
           02  B117309P    PICTURE X.
           02  B117309H    PICTURE X.
           02  B117309V    PICTURE X.
           02  B117309O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117310C    PICTURE X.
           02  B117310P    PICTURE X.
           02  B117310H    PICTURE X.
           02  B117310V    PICTURE X.
           02  B117310O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117311C    PICTURE X.
           02  B117311P    PICTURE X.
           02  B117311H    PICTURE X.
           02  B117311V    PICTURE X.
           02  B117311O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117312C    PICTURE X.
           02  B117312P    PICTURE X.
           02  B117312H    PICTURE X.
           02  B117312V    PICTURE X.
           02  B117312O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117313C    PICTURE X.
           02  B117313P    PICTURE X.
           02  B117313H    PICTURE X.
           02  B117313V    PICTURE X.
           02  B117313O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117314C    PICTURE X.
           02  B117314P    PICTURE X.
           02  B117314H    PICTURE X.
           02  B117314V    PICTURE X.
           02  B117314O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117315C    PICTURE X.
           02  B117315P    PICTURE X.
           02  B117315H    PICTURE X.
           02  B117315V    PICTURE X.
           02  B117315O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117316C    PICTURE X.
           02  B117316P    PICTURE X.
           02  B117316H    PICTURE X.
           02  B117316V    PICTURE X.
           02  B117316O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117317C    PICTURE X.
           02  B117317P    PICTURE X.
           02  B117317H    PICTURE X.
           02  B117317V    PICTURE X.
           02  B117317O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117318C    PICTURE X.
           02  B117318P    PICTURE X.
           02  B117318H    PICTURE X.
           02  B117318V    PICTURE X.
           02  B117318O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117319C    PICTURE X.
           02  B117319P    PICTURE X.
           02  B117319H    PICTURE X.
           02  B117319V    PICTURE X.
           02  B117319O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117320C    PICTURE X.
           02  B117320P    PICTURE X.
           02  B117320H    PICTURE X.
           02  B117320V    PICTURE X.
           02  B117320O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117321C    PICTURE X.
           02  B117321P    PICTURE X.
           02  B117321H    PICTURE X.
           02  B117321V    PICTURE X.
           02  B117321O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117322C    PICTURE X.
           02  B117322P    PICTURE X.
           02  B117322H    PICTURE X.
           02  B117322V    PICTURE X.
           02  B117322O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117323C    PICTURE X.
           02  B117323P    PICTURE X.
           02  B117323H    PICTURE X.
           02  B117323V    PICTURE X.
           02  B117323O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117324C    PICTURE X.
           02  B117324P    PICTURE X.
           02  B117324H    PICTURE X.
           02  B117324V    PICTURE X.
           02  B117324O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B117325C    PICTURE X.
           02  B117325P    PICTURE X.
           02  B117325H    PICTURE X.
           02  B117325V    PICTURE X.
           02  B117325O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1179C    PICTURE X.
           02  IMB1179P    PICTURE X.
           02  IMB1179H    PICTURE X.
           02  IMB1179V    PICTURE X.
           02  IMB1179O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMB1180C    PICTURE X.
           02  IMB1180P    PICTURE X.
           02  IMB1180H    PICTURE X.
           02  IMB1180V    PICTURE X.
           02  IMB1180O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPFS05C    PICTURE X.
           02  IMPFS05P    PICTURE X.
           02  IMPFS05H    PICTURE X.
           02  IMPFS05V    PICTURE X.
           02  IMPFS05O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR05C    PICTURE X.
           02  IMERR05P    PICTURE X.
           02  IMERR05H    PICTURE X.
           02  IMERR05V    PICTURE X.
           02  IMERR05O  PIC X(79).
       01  IMB1M06I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN05L    COMP  PIC  S9(4).
           02  IMTRN05F    PICTURE X.
           02  FILLER REDEFINES IMTRN05F.
             03 IMTRN05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN05I  PIC X(4).
           02  BDATE04L    COMP  PIC  S9(4).
           02  BDATE04F    PICTURE X.
           02  FILLER REDEFINES BDATE04F.
             03 BDATE04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE04I  PIC X(8).
           02  BTIME04L    COMP  PIC  S9(4).
           02  BTIME04F    PICTURE X.
           02  FILLER REDEFINES BTIME04F.
             03 BTIME04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME04I  PIC X(8).
           02  IMPGE04L    COMP  PIC  S9(4).
           02  IMPGE04F    PICTURE X.
           02  FILLER REDEFINES IMPGE04F.
             03 IMPGE04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE04I  PIC X(2).
           02  CTL1004L    COMP  PIC  S9(4).
           02  CTL1004F    PICTURE X.
           02  FILLER REDEFINES CTL1004F.
             03 CTL1004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1004I  PIC X(2).
           02  CTL2004L    COMP  PIC  S9(4).
           02  CTL2004F    PICTURE X.
           02  FILLER REDEFINES CTL2004F.
             03 CTL2004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2004I  PIC X(3).
           02  CTL3004L    COMP  PIC  S9(4).
           02  CTL3004F    PICTURE X.
           02  FILLER REDEFINES CTL3004F.
             03 CTL3004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3004I  PIC X(3).
           02  IMB1134L    COMP  PIC  S9(4).
           02  IMB1134F    PICTURE X.
           02  FILLER REDEFINES IMB1134F.
             03 IMB1134A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1134I  PIC X(1).
           02  IME1134L    COMP  PIC  S9(4).
           02  IME1134F    PICTURE X.
           02  FILLER REDEFINES IME1134F.
             03 IME1134A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1134I  PIC X(16).
           02  IMB1131L    COMP  PIC  S9(4).
           02  IMB1131F    PICTURE X.
           02  FILLER REDEFINES IMB1131F.
             03 IMB1131A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1131I  PIC X(1).
           02  IME1131L    COMP  PIC  S9(4).
           02  IME1131F    PICTURE X.
           02  FILLER REDEFINES IME1131F.
             03 IME1131A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1131I  PIC X(16).
           02  IMB4068L    COMP  PIC  S9(4).
           02  IMB4068F    PICTURE X.
           02  FILLER REDEFINES IMB4068F.
             03 IMB4068A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4068I  PIC X(1).
           02  IME4068L    COMP  PIC  S9(4).
           02  IME4068F    PICTURE X.
           02  FILLER REDEFINES IME4068F.
             03 IME4068A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4068I  PIC X(16).
           02  IMB1130L    COMP  PIC  S9(4).
           02  IMB1130F    PICTURE X.
           02  FILLER REDEFINES IMB1130F.
             03 IMB1130A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1130I  PIC X(1).
           02  IME1130L    COMP  PIC  S9(4).
           02  IME1130F    PICTURE X.
           02  FILLER REDEFINES IME1130F.
             03 IME1130A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1130I  PIC X(16).
           02  IMB1269L    COMP  PIC  S9(4).
           02  IMB1269F    PICTURE X.
           02  FILLER REDEFINES IMB1269F.
             03 IMB1269A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1269I  PIC X(1).
           02  IME1269L    COMP  PIC  S9(4).
           02  IME1269F    PICTURE X.
           02  FILLER REDEFINES IME1269F.
             03 IME1269A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1269I  PIC X(16).
           02  IMB4062L    COMP  PIC  S9(4).
           02  IMB4062F    PICTURE X.
           02  FILLER REDEFINES IMB4062F.
             03 IMB4062A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4062I  PIC X(1).
           02  IME4062L    COMP  PIC  S9(4).
           02  IME4062F    PICTURE X.
           02  FILLER REDEFINES IME4062F.
             03 IME4062A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4062I  PIC X(16).
           02  IMB4009L    COMP  PIC  S9(4).
           02  IMB4009F    PICTURE X.
           02  FILLER REDEFINES IMB4009F.
             03 IMB4009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4009I  PIC X(1).
           02  IME4009L    COMP  PIC  S9(4).
           02  IME4009F    PICTURE X.
           02  FILLER REDEFINES IME4009F.
             03 IME4009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4009I  PIC X(16).
           02  IMB4056L    COMP  PIC  S9(4).
           02  IMB4056F    PICTURE X.
           02  FILLER REDEFINES IMB4056F.
             03 IMB4056A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4056I  PIC X(1).
           02  IME4056L    COMP  PIC  S9(4).
           02  IME4056F    PICTURE X.
           02  FILLER REDEFINES IME4056F.
             03 IME4056A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4056I  PIC X(16).
           02  IMB1129L    COMP  PIC  S9(4).
           02  IMB1129F    PICTURE X.
           02  FILLER REDEFINES IMB1129F.
             03 IMB1129A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1129I  PIC X(1).
           02  IME1129L    COMP  PIC  S9(4).
           02  IME1129F    PICTURE X.
           02  FILLER REDEFINES IME1129F.
             03 IME1129A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1129I  PIC X(16).
           02  IMB4065L    COMP  PIC  S9(4).
           02  IMB4065F    PICTURE X.
           02  FILLER REDEFINES IMB4065F.
             03 IMB4065A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4065I  PIC X(1).
           02  IME4065L    COMP  PIC  S9(4).
           02  IME4065F    PICTURE X.
           02  FILLER REDEFINES IME4065F.
             03 IME4065A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4065I  PIC X(16).
           02  IMB1183L    COMP  PIC  S9(4).
           02  IMB1183F    PICTURE X.
           02  FILLER REDEFINES IMB1183F.
             03 IMB1183A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1183I  PIC X(1).
           02  IME1183L    COMP  PIC  S9(4).
           02  IME1183F    PICTURE X.
           02  FILLER REDEFINES IME1183F.
             03 IME1183A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1183I  PIC X(16).
           02  IMB1101L    COMP  PIC  S9(4).
           02  IMB1101F    PICTURE X.
           02  FILLER REDEFINES IMB1101F.
             03 IMB1101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1101I  PIC X(1).
           02  IME1101L    COMP  PIC  S9(4).
           02  IME1101F    PICTURE X.
           02  FILLER REDEFINES IME1101F.
             03 IME1101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1101I  PIC X(16).
           02  IMB1103L    COMP  PIC  S9(4).
           02  IMB1103F    PICTURE X.
           02  FILLER REDEFINES IMB1103F.
             03 IMB1103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1103I  PIC X(1).
           02  IME1103L    COMP  PIC  S9(4).
           02  IME1103F    PICTURE X.
           02  FILLER REDEFINES IME1103F.
             03 IME1103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1103I  PIC X(16).
           02  IMB1104L    COMP  PIC  S9(4).
           02  IMB1104F    PICTURE X.
           02  FILLER REDEFINES IMB1104F.
             03 IMB1104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1104I  PIC X(1).
           02  IME1104L    COMP  PIC  S9(4).
           02  IME1104F    PICTURE X.
           02  FILLER REDEFINES IME1104F.
             03 IME1104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1104I  PIC X(16).
           02  IMB1227L    COMP  PIC  S9(4).
           02  IMB1227F    PICTURE X.
           02  FILLER REDEFINES IMB1227F.
             03 IMB1227A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1227I  PIC X(1).
           02  IME1227L    COMP  PIC  S9(4).
           02  IME1227F    PICTURE X.
           02  FILLER REDEFINES IME1227F.
             03 IME1227A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1227I  PIC X(16).
           02  IMB1133L    COMP  PIC  S9(4).
           02  IMB1133F    PICTURE X.
           02  FILLER REDEFINES IMB1133F.
             03 IMB1133A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1133I  PIC X(1).
           02  IME1133L    COMP  PIC  S9(4).
           02  IME1133F    PICTURE X.
           02  FILLER REDEFINES IME1133F.
             03 IME1133A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1133I  PIC X(16).
           02  IMB4060L    COMP  PIC  S9(4).
           02  IMB4060F    PICTURE X.
           02  FILLER REDEFINES IMB4060F.
             03 IMB4060A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4060I  PIC X(1).
           02  IME4060L    COMP  PIC  S9(4).
           02  IME4060F    PICTURE X.
           02  FILLER REDEFINES IME4060F.
             03 IME4060A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4060I  PIC X(16).
           02  IMB1127L    COMP  PIC  S9(4).
           02  IMB1127F    PICTURE X.
           02  FILLER REDEFINES IMB1127F.
             03 IMB1127A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1127I  PIC X(1).
           02  IME1127L    COMP  PIC  S9(4).
           02  IME1127F    PICTURE X.
           02  FILLER REDEFINES IME1127F.
             03 IME1127A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1127I  PIC X(16).
           02  IMB4008L    COMP  PIC  S9(4).
           02  IMB4008F    PICTURE X.
           02  FILLER REDEFINES IMB4008F.
             03 IMB4008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4008I  PIC X(1).
           02  IME4008L    COMP  PIC  S9(4).
           02  IME4008F    PICTURE X.
           02  FILLER REDEFINES IME4008F.
             03 IME4008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4008I  PIC X(16).
           02  IMB4076L    COMP  PIC  S9(4).
           02  IMB4076F    PICTURE X.
           02  FILLER REDEFINES IMB4076F.
             03 IMB4076A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4076I  PIC X(1).
           02  IME4076L    COMP  PIC  S9(4).
           02  IME4076F    PICTURE X.
           02  FILLER REDEFINES IME4076F.
             03 IME4076A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4076I  PIC X(16).
           02  IMB2014L    COMP  PIC  S9(4).
           02  IMB2014F    PICTURE X.
           02  FILLER REDEFINES IMB2014F.
             03 IMB2014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2014I  PIC X(1).
           02  IME2014L    COMP  PIC  S9(4).
           02  IME2014F    PICTURE X.
           02  FILLER REDEFINES IME2014F.
             03 IME2014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME2014I  PIC X(16).
           02  IMB4077L    COMP  PIC  S9(4).
           02  IMB4077F    PICTURE X.
           02  FILLER REDEFINES IMB4077F.
             03 IMB4077A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4077I  PIC X(1).
           02  IME4077L    COMP  PIC  S9(4).
           02  IME4077F    PICTURE X.
           02  FILLER REDEFINES IME4077F.
             03 IME4077A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4077I  PIC X(16).
           02  IMB2015L    COMP  PIC  S9(4).
           02  IMB2015F    PICTURE X.
           02  FILLER REDEFINES IMB2015F.
             03 IMB2015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2015I  PIC X(1).
           02  IME2015L    COMP  PIC  S9(4).
           02  IME2015F    PICTURE X.
           02  FILLER REDEFINES IME2015F.
             03 IME2015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME2015I  PIC X(16).
           02  IMB2026L    COMP  PIC  S9(4).
           02  IMB2026F    PICTURE X.
           02  FILLER REDEFINES IMB2026F.
             03 IMB2026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2026I  PIC X(1).
           02  IME2026L    COMP  PIC  S9(4).
           02  IME2026F    PICTURE X.
           02  FILLER REDEFINES IME2026F.
             03 IME2026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME2026I  PIC X(16).
           02  IMB4145L    COMP  PIC  S9(4).
           02  IMB4145F    PICTURE X.
           02  FILLER REDEFINES IMB4145F.
             03 IMB4145A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4145I  PIC X(1).
           02  IME4145L    COMP  PIC  S9(4).
           02  IME4145F    PICTURE X.
           02  FILLER REDEFINES IME4145F.
             03 IME4145A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4145I  PIC X(16).
           02  IMB1334L    COMP  PIC  S9(4).
           02  IMB1334F    PICTURE X.
           02  FILLER REDEFINES IMB1334F.
             03 IMB1334A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1334I  PIC X(1).
           02  IME1334L    COMP  PIC  S9(4).
           02  IME1334F    PICTURE X.
           02  FILLER REDEFINES IME1334F.
             03 IME1334A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1334I  PIC X(16).
           02  IMB1268L    COMP  PIC  S9(4).
           02  IMB1268F    PICTURE X.
           02  FILLER REDEFINES IMB1268F.
             03 IMB1268A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1268I  PIC X(1).
           02  IME1268L    COMP  PIC  S9(4).
           02  IME1268F    PICTURE X.
           02  FILLER REDEFINES IME1268F.
             03 IME1268A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1268I  PIC X(16).
           02  IMB4067L    COMP  PIC  S9(4).
           02  IMB4067F    PICTURE X.
           02  FILLER REDEFINES IMB4067F.
             03 IMB4067A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4067I  PIC X(1).
           02  IME4067L    COMP  PIC  S9(4).
           02  IME4067F    PICTURE X.
           02  FILLER REDEFINES IME4067F.
             03 IME4067A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4067I  PIC X(16).
           02  IMB7049L    COMP  PIC  S9(4).
           02  IMB7049F    PICTURE X.
           02  FILLER REDEFINES IMB7049F.
             03 IMB7049A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7049I  PIC X(1).
           02  IME7049L    COMP  PIC  S9(4).
           02  IME7049F    PICTURE X.
           02  FILLER REDEFINES IME7049F.
             03 IME7049A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME7049I  PIC X(16).
           02  IMPFS06L    COMP  PIC  S9(4).
           02  IMPFS06F    PICTURE X.
           02  FILLER REDEFINES IMPFS06F.
             03 IMPFS06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS06I  PIC X(79).
           02  IMERR06L    COMP  PIC  S9(4).
           02  IMERR06F    PICTURE X.
           02  FILLER REDEFINES IMERR06F.
             03 IMERR06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR06I  PIC X(79).
       01  IMB1M06O REDEFINES IMB1M06I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN05C    PICTURE X.
           02  IMTRN05P    PICTURE X.
           02  IMTRN05H    PICTURE X.
           02  IMTRN05V    PICTURE X.
           02  IMTRN05O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE04C    PICTURE X.
           02  BDATE04P    PICTURE X.
           02  BDATE04H    PICTURE X.
           02  BDATE04V    PICTURE X.
           02  BDATE04O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME04C    PICTURE X.
           02  BTIME04P    PICTURE X.
           02  BTIME04H    PICTURE X.
           02  BTIME04V    PICTURE X.
           02  BTIME04O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE04C    PICTURE X.
           02  IMPGE04P    PICTURE X.
           02  IMPGE04H    PICTURE X.
           02  IMPGE04V    PICTURE X.
           02  IMPGE04O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1004C    PICTURE X.
           02  CTL1004P    PICTURE X.
           02  CTL1004H    PICTURE X.
           02  CTL1004V    PICTURE X.
           02  CTL1004O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2004C    PICTURE X.
           02  CTL2004P    PICTURE X.
           02  CTL2004H    PICTURE X.
           02  CTL2004V    PICTURE X.
           02  CTL2004O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3004C    PICTURE X.
           02  CTL3004P    PICTURE X.
           02  CTL3004H    PICTURE X.
           02  CTL3004V    PICTURE X.
           02  CTL3004O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1134C    PICTURE X.
           02  IMB1134P    PICTURE X.
           02  IMB1134H    PICTURE X.
           02  IMB1134V    PICTURE X.
           02  IMB1134O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1134C    PICTURE X.
           02  IME1134P    PICTURE X.
           02  IME1134H    PICTURE X.
           02  IME1134V    PICTURE X.
           02  IME1134O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1131C    PICTURE X.
           02  IMB1131P    PICTURE X.
           02  IMB1131H    PICTURE X.
           02  IMB1131V    PICTURE X.
           02  IMB1131O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1131C    PICTURE X.
           02  IME1131P    PICTURE X.
           02  IME1131H    PICTURE X.
           02  IME1131V    PICTURE X.
           02  IME1131O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4068C    PICTURE X.
           02  IMB4068P    PICTURE X.
           02  IMB4068H    PICTURE X.
           02  IMB4068V    PICTURE X.
           02  IMB4068O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4068C    PICTURE X.
           02  IME4068P    PICTURE X.
           02  IME4068H    PICTURE X.
           02  IME4068V    PICTURE X.
           02  IME4068O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1130C    PICTURE X.
           02  IMB1130P    PICTURE X.
           02  IMB1130H    PICTURE X.
           02  IMB1130V    PICTURE X.
           02  IMB1130O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1130C    PICTURE X.
           02  IME1130P    PICTURE X.
           02  IME1130H    PICTURE X.
           02  IME1130V    PICTURE X.
           02  IME1130O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1269C    PICTURE X.
           02  IMB1269P    PICTURE X.
           02  IMB1269H    PICTURE X.
           02  IMB1269V    PICTURE X.
           02  IMB1269O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1269C    PICTURE X.
           02  IME1269P    PICTURE X.
           02  IME1269H    PICTURE X.
           02  IME1269V    PICTURE X.
           02  IME1269O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4062C    PICTURE X.
           02  IMB4062P    PICTURE X.
           02  IMB4062H    PICTURE X.
           02  IMB4062V    PICTURE X.
           02  IMB4062O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4062C    PICTURE X.
           02  IME4062P    PICTURE X.
           02  IME4062H    PICTURE X.
           02  IME4062V    PICTURE X.
           02  IME4062O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4009C    PICTURE X.
           02  IMB4009P    PICTURE X.
           02  IMB4009H    PICTURE X.
           02  IMB4009V    PICTURE X.
           02  IMB4009O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4009C    PICTURE X.
           02  IME4009P    PICTURE X.
           02  IME4009H    PICTURE X.
           02  IME4009V    PICTURE X.
           02  IME4009O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4056C    PICTURE X.
           02  IMB4056P    PICTURE X.
           02  IMB4056H    PICTURE X.
           02  IMB4056V    PICTURE X.
           02  IMB4056O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4056C    PICTURE X.
           02  IME4056P    PICTURE X.
           02  IME4056H    PICTURE X.
           02  IME4056V    PICTURE X.
           02  IME4056O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1129C    PICTURE X.
           02  IMB1129P    PICTURE X.
           02  IMB1129H    PICTURE X.
           02  IMB1129V    PICTURE X.
           02  IMB1129O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1129C    PICTURE X.
           02  IME1129P    PICTURE X.
           02  IME1129H    PICTURE X.
           02  IME1129V    PICTURE X.
           02  IME1129O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4065C    PICTURE X.
           02  IMB4065P    PICTURE X.
           02  IMB4065H    PICTURE X.
           02  IMB4065V    PICTURE X.
           02  IMB4065O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4065C    PICTURE X.
           02  IME4065P    PICTURE X.
           02  IME4065H    PICTURE X.
           02  IME4065V    PICTURE X.
           02  IME4065O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1183C    PICTURE X.
           02  IMB1183P    PICTURE X.
           02  IMB1183H    PICTURE X.
           02  IMB1183V    PICTURE X.
           02  IMB1183O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1183C    PICTURE X.
           02  IME1183P    PICTURE X.
           02  IME1183H    PICTURE X.
           02  IME1183V    PICTURE X.
           02  IME1183O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1101C    PICTURE X.
           02  IMB1101P    PICTURE X.
           02  IMB1101H    PICTURE X.
           02  IMB1101V    PICTURE X.
           02  IMB1101O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1101C    PICTURE X.
           02  IME1101P    PICTURE X.
           02  IME1101H    PICTURE X.
           02  IME1101V    PICTURE X.
           02  IME1101O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1103C    PICTURE X.
           02  IMB1103P    PICTURE X.
           02  IMB1103H    PICTURE X.
           02  IMB1103V    PICTURE X.
           02  IMB1103O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1103C    PICTURE X.
           02  IME1103P    PICTURE X.
           02  IME1103H    PICTURE X.
           02  IME1103V    PICTURE X.
           02  IME1103O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1104C    PICTURE X.
           02  IMB1104P    PICTURE X.
           02  IMB1104H    PICTURE X.
           02  IMB1104V    PICTURE X.
           02  IMB1104O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1104C    PICTURE X.
           02  IME1104P    PICTURE X.
           02  IME1104H    PICTURE X.
           02  IME1104V    PICTURE X.
           02  IME1104O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1227C    PICTURE X.
           02  IMB1227P    PICTURE X.
           02  IMB1227H    PICTURE X.
           02  IMB1227V    PICTURE X.
           02  IMB1227O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1227C    PICTURE X.
           02  IME1227P    PICTURE X.
           02  IME1227H    PICTURE X.
           02  IME1227V    PICTURE X.
           02  IME1227O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1133C    PICTURE X.
           02  IMB1133P    PICTURE X.
           02  IMB1133H    PICTURE X.
           02  IMB1133V    PICTURE X.
           02  IMB1133O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1133C    PICTURE X.
           02  IME1133P    PICTURE X.
           02  IME1133H    PICTURE X.
           02  IME1133V    PICTURE X.
           02  IME1133O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4060C    PICTURE X.
           02  IMB4060P    PICTURE X.
           02  IMB4060H    PICTURE X.
           02  IMB4060V    PICTURE X.
           02  IMB4060O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4060C    PICTURE X.
           02  IME4060P    PICTURE X.
           02  IME4060H    PICTURE X.
           02  IME4060V    PICTURE X.
           02  IME4060O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1127C    PICTURE X.
           02  IMB1127P    PICTURE X.
           02  IMB1127H    PICTURE X.
           02  IMB1127V    PICTURE X.
           02  IMB1127O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1127C    PICTURE X.
           02  IME1127P    PICTURE X.
           02  IME1127H    PICTURE X.
           02  IME1127V    PICTURE X.
           02  IME1127O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4008C    PICTURE X.
           02  IMB4008P    PICTURE X.
           02  IMB4008H    PICTURE X.
           02  IMB4008V    PICTURE X.
           02  IMB4008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4008C    PICTURE X.
           02  IME4008P    PICTURE X.
           02  IME4008H    PICTURE X.
           02  IME4008V    PICTURE X.
           02  IME4008O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4076C    PICTURE X.
           02  IMB4076P    PICTURE X.
           02  IMB4076H    PICTURE X.
           02  IMB4076V    PICTURE X.
           02  IMB4076O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4076C    PICTURE X.
           02  IME4076P    PICTURE X.
           02  IME4076H    PICTURE X.
           02  IME4076V    PICTURE X.
           02  IME4076O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB2014C    PICTURE X.
           02  IMB2014P    PICTURE X.
           02  IMB2014H    PICTURE X.
           02  IMB2014V    PICTURE X.
           02  IMB2014O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME2014C    PICTURE X.
           02  IME2014P    PICTURE X.
           02  IME2014H    PICTURE X.
           02  IME2014V    PICTURE X.
           02  IME2014O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4077C    PICTURE X.
           02  IMB4077P    PICTURE X.
           02  IMB4077H    PICTURE X.
           02  IMB4077V    PICTURE X.
           02  IMB4077O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4077C    PICTURE X.
           02  IME4077P    PICTURE X.
           02  IME4077H    PICTURE X.
           02  IME4077V    PICTURE X.
           02  IME4077O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB2015C    PICTURE X.
           02  IMB2015P    PICTURE X.
           02  IMB2015H    PICTURE X.
           02  IMB2015V    PICTURE X.
           02  IMB2015O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME2015C    PICTURE X.
           02  IME2015P    PICTURE X.
           02  IME2015H    PICTURE X.
           02  IME2015V    PICTURE X.
           02  IME2015O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB2026C    PICTURE X.
           02  IMB2026P    PICTURE X.
           02  IMB2026H    PICTURE X.
           02  IMB2026V    PICTURE X.
           02  IMB2026O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME2026C    PICTURE X.
           02  IME2026P    PICTURE X.
           02  IME2026H    PICTURE X.
           02  IME2026V    PICTURE X.
           02  IME2026O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4145C    PICTURE X.
           02  IMB4145P    PICTURE X.
           02  IMB4145H    PICTURE X.
           02  IMB4145V    PICTURE X.
           02  IMB4145O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4145C    PICTURE X.
           02  IME4145P    PICTURE X.
           02  IME4145H    PICTURE X.
           02  IME4145V    PICTURE X.
           02  IME4145O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1334C    PICTURE X.
           02  IMB1334P    PICTURE X.
           02  IMB1334H    PICTURE X.
           02  IMB1334V    PICTURE X.
           02  IMB1334O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1334C    PICTURE X.
           02  IME1334P    PICTURE X.
           02  IME1334H    PICTURE X.
           02  IME1334V    PICTURE X.
           02  IME1334O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1268C    PICTURE X.
           02  IMB1268P    PICTURE X.
           02  IMB1268H    PICTURE X.
           02  IMB1268V    PICTURE X.
           02  IMB1268O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1268C    PICTURE X.
           02  IME1268P    PICTURE X.
           02  IME1268H    PICTURE X.
           02  IME1268V    PICTURE X.
           02  IME1268O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4067C    PICTURE X.
           02  IMB4067P    PICTURE X.
           02  IMB4067H    PICTURE X.
           02  IMB4067V    PICTURE X.
           02  IMB4067O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4067C    PICTURE X.
           02  IME4067P    PICTURE X.
           02  IME4067H    PICTURE X.
           02  IME4067V    PICTURE X.
           02  IME4067O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7049C    PICTURE X.
           02  IMB7049P    PICTURE X.
           02  IMB7049H    PICTURE X.
           02  IMB7049V    PICTURE X.
           02  IMB7049O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME7049C    PICTURE X.
           02  IME7049P    PICTURE X.
           02  IME7049H    PICTURE X.
           02  IME7049V    PICTURE X.
           02  IME7049O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMPFS06C    PICTURE X.
           02  IMPFS06P    PICTURE X.
           02  IMPFS06H    PICTURE X.
           02  IMPFS06V    PICTURE X.
           02  IMPFS06O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR06C    PICTURE X.
           02  IMERR06P    PICTURE X.
           02  IMERR06H    PICTURE X.
           02  IMERR06V    PICTURE X.
           02  IMERR06O  PIC X(79).
       01  IMB1M07I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN06L    COMP  PIC  S9(4).
           02  IMTRN06F    PICTURE X.
           02  FILLER REDEFINES IMTRN06F.
             03 IMTRN06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN06I  PIC X(4).
           02  BDATE05L    COMP  PIC  S9(4).
           02  BDATE05F    PICTURE X.
           02  FILLER REDEFINES BDATE05F.
             03 BDATE05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE05I  PIC X(8).
           02  BTIME05L    COMP  PIC  S9(4).
           02  BTIME05F    PICTURE X.
           02  FILLER REDEFINES BTIME05F.
             03 BTIME05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME05I  PIC X(8).
           02  IMPGE05L    COMP  PIC  S9(4).
           02  IMPGE05F    PICTURE X.
           02  FILLER REDEFINES IMPGE05F.
             03 IMPGE05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE05I  PIC X(2).
           02  CTL1005L    COMP  PIC  S9(4).
           02  CTL1005F    PICTURE X.
           02  FILLER REDEFINES CTL1005F.
             03 CTL1005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1005I  PIC X(2).
           02  CTL2005L    COMP  PIC  S9(4).
           02  CTL2005F    PICTURE X.
           02  FILLER REDEFINES CTL2005F.
             03 CTL2005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2005I  PIC X(3).
           02  CTL3005L    COMP  PIC  S9(4).
           02  CTL3005F    PICTURE X.
           02  FILLER REDEFINES CTL3005F.
             03 CTL3005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3005I  PIC X(3).
           02  IMB1265L    COMP  PIC  S9(4).
           02  IMB1265F    PICTURE X.
           02  FILLER REDEFINES IMB1265F.
             03 IMB1265A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1265I  PIC X(1).
           02  IME1265L    COMP  PIC  S9(4).
           02  IME1265F    PICTURE X.
           02  FILLER REDEFINES IME1265F.
             03 IME1265A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1265I  PIC X(16).
           02  IMB1184L    COMP  PIC  S9(4).
           02  IMB1184F    PICTURE X.
           02  FILLER REDEFINES IMB1184F.
             03 IMB1184A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1184I  PIC X(1).
           02  IME1184L    COMP  PIC  S9(4).
           02  IME1184F    PICTURE X.
           02  FILLER REDEFINES IME1184F.
             03 IME1184A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1184I  PIC X(16).
           02  IMB1264L    COMP  PIC  S9(4).
           02  IMB1264F    PICTURE X.
           02  FILLER REDEFINES IMB1264F.
             03 IMB1264A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1264I  PIC X(1).
           02  IME1264L    COMP  PIC  S9(4).
           02  IME1264F    PICTURE X.
           02  FILLER REDEFINES IME1264F.
             03 IME1264A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1264I  PIC X(16).
           02  IMB1016L    COMP  PIC  S9(4).
           02  IMB1016F    PICTURE X.
           02  FILLER REDEFINES IMB1016F.
             03 IMB1016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1016I  PIC X(1).
           02  IME1016L    COMP  PIC  S9(4).
           02  IME1016F    PICTURE X.
           02  FILLER REDEFINES IME1016F.
             03 IME1016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1016I  PIC X(16).
           02  IMB1263L    COMP  PIC  S9(4).
           02  IMB1263F    PICTURE X.
           02  FILLER REDEFINES IMB1263F.
             03 IMB1263A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1263I  PIC X(1).
           02  IME1263L    COMP  PIC  S9(4).
           02  IME1263F    PICTURE X.
           02  FILLER REDEFINES IME1263F.
             03 IME1263A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1263I  PIC X(16).
           02  IMB1092L    COMP  PIC  S9(4).
           02  IMB1092F    PICTURE X.
           02  FILLER REDEFINES IMB1092F.
             03 IMB1092A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1092I  PIC X(1).
           02  IME1092L    COMP  PIC  S9(4).
           02  IME1092F    PICTURE X.
           02  FILLER REDEFINES IME1092F.
             03 IME1092A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1092I  PIC X(16).
           02  IMB1267L    COMP  PIC  S9(4).
           02  IMB1267F    PICTURE X.
           02  FILLER REDEFINES IMB1267F.
             03 IMB1267A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1267I  PIC X(1).
           02  IME1267L    COMP  PIC  S9(4).
           02  IME1267F    PICTURE X.
           02  FILLER REDEFINES IME1267F.
             03 IME1267A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1267I  PIC X(16).
           02  IMB1099L    COMP  PIC  S9(4).
           02  IMB1099F    PICTURE X.
           02  FILLER REDEFINES IMB1099F.
             03 IMB1099A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1099I  PIC X(1).
           02  IME1099L    COMP  PIC  S9(4).
           02  IME1099F    PICTURE X.
           02  FILLER REDEFINES IME1099F.
             03 IME1099A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1099I  PIC X(16).
           02  IMB1108L    COMP  PIC  S9(4).
           02  IMB1108F    PICTURE X.
           02  FILLER REDEFINES IMB1108F.
             03 IMB1108A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1108I  PIC X(1).
           02  IME1108L    COMP  PIC  S9(4).
           02  IME1108F    PICTURE X.
           02  FILLER REDEFINES IME1108F.
             03 IME1108A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1108I  PIC X(16).
           02  IMB5038L    COMP  PIC  S9(4).
           02  IMB5038F    PICTURE X.
           02  FILLER REDEFINES IMB5038F.
             03 IMB5038A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5038I  PIC X(1).
           02  IME5038L    COMP  PIC  S9(4).
           02  IME5038F    PICTURE X.
           02  FILLER REDEFINES IME5038F.
             03 IME5038A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME5038I  PIC X(16).
           02  IMB4006L    COMP  PIC  S9(4).
           02  IMB4006F    PICTURE X.
           02  FILLER REDEFINES IMB4006F.
             03 IMB4006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4006I  PIC X(1).
           02  IME4006L    COMP  PIC  S9(4).
           02  IME4006F    PICTURE X.
           02  FILLER REDEFINES IME4006F.
             03 IME4006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4006I  PIC X(16).
           02  IMB5041L    COMP  PIC  S9(4).
           02  IMB5041F    PICTURE X.
           02  FILLER REDEFINES IMB5041F.
             03 IMB5041A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5041I  PIC X(1).
           02  IME5041L    COMP  PIC  S9(4).
           02  IME5041F    PICTURE X.
           02  FILLER REDEFINES IME5041F.
             03 IME5041A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME5041I  PIC X(16).
           02  IMB4007L    COMP  PIC  S9(4).
           02  IMB4007F    PICTURE X.
           02  FILLER REDEFINES IMB4007F.
             03 IMB4007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4007I  PIC X(1).
           02  IME4007L    COMP  PIC  S9(4).
           02  IME4007F    PICTURE X.
           02  FILLER REDEFINES IME4007F.
             03 IME4007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4007I  PIC X(16).
           02  IMB4053L    COMP  PIC  S9(4).
           02  IMB4053F    PICTURE X.
           02  FILLER REDEFINES IMB4053F.
             03 IMB4053A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4053I  PIC X(1).
           02  IME4053L    COMP  PIC  S9(4).
           02  IME4053F    PICTURE X.
           02  FILLER REDEFINES IME4053F.
             03 IME4053A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4053I  PIC X(16).
           02  IMB1015L    COMP  PIC  S9(4).
           02  IMB1015F    PICTURE X.
           02  FILLER REDEFINES IMB1015F.
             03 IMB1015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1015I  PIC X(1).
           02  IME1015L    COMP  PIC  S9(4).
           02  IME1015F    PICTURE X.
           02  FILLER REDEFINES IME1015F.
             03 IME1015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1015I  PIC X(16).
           02  IMB4051L    COMP  PIC  S9(4).
           02  IMB4051F    PICTURE X.
           02  FILLER REDEFINES IMB4051F.
             03 IMB4051A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4051I  PIC X(1).
           02  IMB1139L    COMP  PIC  S9(4).
           02  IMB1139F    PICTURE X.
           02  FILLER REDEFINES IMB1139F.
             03 IMB1139A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1139I  PIC X(1).
           02  IME1139L    COMP  PIC  S9(4).
           02  IME1139F    PICTURE X.
           02  FILLER REDEFINES IME1139F.
             03 IME1139A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1139I  PIC X(16).
           02  IMB1132L    COMP  PIC  S9(4).
           02  IMB1132F    PICTURE X.
           02  FILLER REDEFINES IMB1132F.
             03 IMB1132A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1132I  PIC X(1).
           02  IME1132L    COMP  PIC  S9(4).
           02  IME1132F    PICTURE X.
           02  FILLER REDEFINES IME1132F.
             03 IME1132A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1132I  PIC X(16).
           02  IMB4066L    COMP  PIC  S9(4).
           02  IMB4066F    PICTURE X.
           02  FILLER REDEFINES IMB4066F.
             03 IMB4066A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4066I  PIC X(1).
           02  IME4066L    COMP  PIC  S9(4).
           02  IME4066F    PICTURE X.
           02  FILLER REDEFINES IME4066F.
             03 IME4066A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4066I  PIC X(16).
           02  IMB1224L    COMP  PIC  S9(4).
           02  IMB1224F    PICTURE X.
           02  FILLER REDEFINES IMB1224F.
             03 IMB1224A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1224I  PIC X(1).
           02  IME1224L    COMP  PIC  S9(4).
           02  IME1224F    PICTURE X.
           02  FILLER REDEFINES IME1224F.
             03 IME1224A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1224I  PIC X(16).
           02  IMB1128L    COMP  PIC  S9(4).
           02  IMB1128F    PICTURE X.
           02  FILLER REDEFINES IMB1128F.
             03 IMB1128A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1128I  PIC X(1).
           02  IME1128L    COMP  PIC  S9(4).
           02  IME1128F    PICTURE X.
           02  FILLER REDEFINES IME1128F.
             03 IME1128A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1128I  PIC X(16).
           02  IMPFS07L    COMP  PIC  S9(4).
           02  IMPFS07F    PICTURE X.
           02  FILLER REDEFINES IMPFS07F.
             03 IMPFS07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS07I  PIC X(79).
           02  IMERR07L    COMP  PIC  S9(4).
           02  IMERR07F    PICTURE X.
           02  FILLER REDEFINES IMERR07F.
             03 IMERR07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR07I  PIC X(79).
       01  IMB1M07O REDEFINES IMB1M07I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN06C    PICTURE X.
           02  IMTRN06P    PICTURE X.
           02  IMTRN06H    PICTURE X.
           02  IMTRN06V    PICTURE X.
           02  IMTRN06O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE05C    PICTURE X.
           02  BDATE05P    PICTURE X.
           02  BDATE05H    PICTURE X.
           02  BDATE05V    PICTURE X.
           02  BDATE05O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME05C    PICTURE X.
           02  BTIME05P    PICTURE X.
           02  BTIME05H    PICTURE X.
           02  BTIME05V    PICTURE X.
           02  BTIME05O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE05C    PICTURE X.
           02  IMPGE05P    PICTURE X.
           02  IMPGE05H    PICTURE X.
           02  IMPGE05V    PICTURE X.
           02  IMPGE05O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1005C    PICTURE X.
           02  CTL1005P    PICTURE X.
           02  CTL1005H    PICTURE X.
           02  CTL1005V    PICTURE X.
           02  CTL1005O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2005C    PICTURE X.
           02  CTL2005P    PICTURE X.
           02  CTL2005H    PICTURE X.
           02  CTL2005V    PICTURE X.
           02  CTL2005O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3005C    PICTURE X.
           02  CTL3005P    PICTURE X.
           02  CTL3005H    PICTURE X.
           02  CTL3005V    PICTURE X.
           02  CTL3005O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1265C    PICTURE X.
           02  IMB1265P    PICTURE X.
           02  IMB1265H    PICTURE X.
           02  IMB1265V    PICTURE X.
           02  IMB1265O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1265C    PICTURE X.
           02  IME1265P    PICTURE X.
           02  IME1265H    PICTURE X.
           02  IME1265V    PICTURE X.
           02  IME1265O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1184C    PICTURE X.
           02  IMB1184P    PICTURE X.
           02  IMB1184H    PICTURE X.
           02  IMB1184V    PICTURE X.
           02  IMB1184O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1184C    PICTURE X.
           02  IME1184P    PICTURE X.
           02  IME1184H    PICTURE X.
           02  IME1184V    PICTURE X.
           02  IME1184O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1264C    PICTURE X.
           02  IMB1264P    PICTURE X.
           02  IMB1264H    PICTURE X.
           02  IMB1264V    PICTURE X.
           02  IMB1264O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1264C    PICTURE X.
           02  IME1264P    PICTURE X.
           02  IME1264H    PICTURE X.
           02  IME1264V    PICTURE X.
           02  IME1264O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1016C    PICTURE X.
           02  IMB1016P    PICTURE X.
           02  IMB1016H    PICTURE X.
           02  IMB1016V    PICTURE X.
           02  IMB1016O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1016C    PICTURE X.
           02  IME1016P    PICTURE X.
           02  IME1016H    PICTURE X.
           02  IME1016V    PICTURE X.
           02  IME1016O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1263C    PICTURE X.
           02  IMB1263P    PICTURE X.
           02  IMB1263H    PICTURE X.
           02  IMB1263V    PICTURE X.
           02  IMB1263O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1263C    PICTURE X.
           02  IME1263P    PICTURE X.
           02  IME1263H    PICTURE X.
           02  IME1263V    PICTURE X.
           02  IME1263O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1092C    PICTURE X.
           02  IMB1092P    PICTURE X.
           02  IMB1092H    PICTURE X.
           02  IMB1092V    PICTURE X.
           02  IMB1092O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1092C    PICTURE X.
           02  IME1092P    PICTURE X.
           02  IME1092H    PICTURE X.
           02  IME1092V    PICTURE X.
           02  IME1092O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1267C    PICTURE X.
           02  IMB1267P    PICTURE X.
           02  IMB1267H    PICTURE X.
           02  IMB1267V    PICTURE X.
           02  IMB1267O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1267C    PICTURE X.
           02  IME1267P    PICTURE X.
           02  IME1267H    PICTURE X.
           02  IME1267V    PICTURE X.
           02  IME1267O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1099C    PICTURE X.
           02  IMB1099P    PICTURE X.
           02  IMB1099H    PICTURE X.
           02  IMB1099V    PICTURE X.
           02  IMB1099O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1099C    PICTURE X.
           02  IME1099P    PICTURE X.
           02  IME1099H    PICTURE X.
           02  IME1099V    PICTURE X.
           02  IME1099O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1108C    PICTURE X.
           02  IMB1108P    PICTURE X.
           02  IMB1108H    PICTURE X.
           02  IMB1108V    PICTURE X.
           02  IMB1108O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1108C    PICTURE X.
           02  IME1108P    PICTURE X.
           02  IME1108H    PICTURE X.
           02  IME1108V    PICTURE X.
           02  IME1108O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB5038C    PICTURE X.
           02  IMB5038P    PICTURE X.
           02  IMB5038H    PICTURE X.
           02  IMB5038V    PICTURE X.
           02  IMB5038O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME5038C    PICTURE X.
           02  IME5038P    PICTURE X.
           02  IME5038H    PICTURE X.
           02  IME5038V    PICTURE X.
           02  IME5038O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4006C    PICTURE X.
           02  IMB4006P    PICTURE X.
           02  IMB4006H    PICTURE X.
           02  IMB4006V    PICTURE X.
           02  IMB4006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4006C    PICTURE X.
           02  IME4006P    PICTURE X.
           02  IME4006H    PICTURE X.
           02  IME4006V    PICTURE X.
           02  IME4006O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB5041C    PICTURE X.
           02  IMB5041P    PICTURE X.
           02  IMB5041H    PICTURE X.
           02  IMB5041V    PICTURE X.
           02  IMB5041O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME5041C    PICTURE X.
           02  IME5041P    PICTURE X.
           02  IME5041H    PICTURE X.
           02  IME5041V    PICTURE X.
           02  IME5041O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4007C    PICTURE X.
           02  IMB4007P    PICTURE X.
           02  IMB4007H    PICTURE X.
           02  IMB4007V    PICTURE X.
           02  IMB4007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4007C    PICTURE X.
           02  IME4007P    PICTURE X.
           02  IME4007H    PICTURE X.
           02  IME4007V    PICTURE X.
           02  IME4007O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4053C    PICTURE X.
           02  IMB4053P    PICTURE X.
           02  IMB4053H    PICTURE X.
           02  IMB4053V    PICTURE X.
           02  IMB4053O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4053C    PICTURE X.
           02  IME4053P    PICTURE X.
           02  IME4053H    PICTURE X.
           02  IME4053V    PICTURE X.
           02  IME4053O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1015C    PICTURE X.
           02  IMB1015P    PICTURE X.
           02  IMB1015H    PICTURE X.
           02  IMB1015V    PICTURE X.
           02  IMB1015O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1015C    PICTURE X.
           02  IME1015P    PICTURE X.
           02  IME1015H    PICTURE X.
           02  IME1015V    PICTURE X.
           02  IME1015O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4051C    PICTURE X.
           02  IMB4051P    PICTURE X.
           02  IMB4051H    PICTURE X.
           02  IMB4051V    PICTURE X.
           02  IMB4051O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1139C    PICTURE X.
           02  IMB1139P    PICTURE X.
           02  IMB1139H    PICTURE X.
           02  IMB1139V    PICTURE X.
           02  IMB1139O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1139C    PICTURE X.
           02  IME1139P    PICTURE X.
           02  IME1139H    PICTURE X.
           02  IME1139V    PICTURE X.
           02  IME1139O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1132C    PICTURE X.
           02  IMB1132P    PICTURE X.
           02  IMB1132H    PICTURE X.
           02  IMB1132V    PICTURE X.
           02  IMB1132O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1132C    PICTURE X.
           02  IME1132P    PICTURE X.
           02  IME1132H    PICTURE X.
           02  IME1132V    PICTURE X.
           02  IME1132O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4066C    PICTURE X.
           02  IMB4066P    PICTURE X.
           02  IMB4066H    PICTURE X.
           02  IMB4066V    PICTURE X.
           02  IMB4066O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4066C    PICTURE X.
           02  IME4066P    PICTURE X.
           02  IME4066H    PICTURE X.
           02  IME4066V    PICTURE X.
           02  IME4066O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1224C    PICTURE X.
           02  IMB1224P    PICTURE X.
           02  IMB1224H    PICTURE X.
           02  IMB1224V    PICTURE X.
           02  IMB1224O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1224C    PICTURE X.
           02  IME1224P    PICTURE X.
           02  IME1224H    PICTURE X.
           02  IME1224V    PICTURE X.
           02  IME1224O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1128C    PICTURE X.
           02  IMB1128P    PICTURE X.
           02  IMB1128H    PICTURE X.
           02  IMB1128V    PICTURE X.
           02  IMB1128O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1128C    PICTURE X.
           02  IME1128P    PICTURE X.
           02  IME1128H    PICTURE X.
           02  IME1128V    PICTURE X.
           02  IME1128O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMPFS07C    PICTURE X.
           02  IMPFS07P    PICTURE X.
           02  IMPFS07H    PICTURE X.
           02  IMPFS07V    PICTURE X.
           02  IMPFS07O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR07C    PICTURE X.
           02  IMERR07P    PICTURE X.
           02  IMERR07H    PICTURE X.
           02  IMERR07V    PICTURE X.
           02  IMERR07O  PIC X(79).
       01  IMB1M08I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN07L    COMP  PIC  S9(4).
           02  IMTRN07F    PICTURE X.
           02  FILLER REDEFINES IMTRN07F.
             03 IMTRN07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN07I  PIC X(4).
           02  BDATE06L    COMP  PIC  S9(4).
           02  BDATE06F    PICTURE X.
           02  FILLER REDEFINES BDATE06F.
             03 BDATE06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE06I  PIC X(8).
           02  BTIME06L    COMP  PIC  S9(4).
           02  BTIME06F    PICTURE X.
           02  FILLER REDEFINES BTIME06F.
             03 BTIME06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME06I  PIC X(8).
           02  IMPGE06L    COMP  PIC  S9(4).
           02  IMPGE06F    PICTURE X.
           02  FILLER REDEFINES IMPGE06F.
             03 IMPGE06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE06I  PIC X(2).
           02  CTL1006L    COMP  PIC  S9(4).
           02  CTL1006F    PICTURE X.
           02  FILLER REDEFINES CTL1006F.
             03 CTL1006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1006I  PIC X(2).
           02  CTL2006L    COMP  PIC  S9(4).
           02  CTL2006F    PICTURE X.
           02  FILLER REDEFINES CTL2006F.
             03 CTL2006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2006I  PIC X(3).
           02  CTL3006L    COMP  PIC  S9(4).
           02  CTL3006F    PICTURE X.
           02  FILLER REDEFINES CTL3006F.
             03 CTL3006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3006I  PIC X(3).
           02  IMB1120L    COMP  PIC  S9(4).
           02  IMB1120F    PICTURE X.
           02  FILLER REDEFINES IMB1120F.
             03 IMB1120A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1120I  PIC X(3).
           02  IMB1124L    COMP  PIC  S9(4).
           02  IMB1124F    PICTURE X.
           02  FILLER REDEFINES IMB1124F.
             03 IMB1124A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1124I  PIC X(3).
           02  IMB1126L    COMP  PIC  S9(4).
           02  IMB1126F    PICTURE X.
           02  FILLER REDEFINES IMB1126F.
             03 IMB1126A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1126I  PIC X(1).
           02  IMB4017L    COMP  PIC  S9(4).
           02  IMB4017F    PICTURE X.
           02  FILLER REDEFINES IMB4017F.
             03 IMB4017A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4017I  PIC X(8).
           02  IMB4018L    COMP  PIC  S9(4).
           02  IMB4018F    PICTURE X.
           02  FILLER REDEFINES IMB4018F.
             03 IMB4018A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4018I  PIC X(3).
           02  IMB7007L    COMP  PIC  S9(4).
           02  IMB7007F    PICTURE X.
           02  FILLER REDEFINES IMB7007F.
             03 IMB7007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7007I  PIC X(4).
           02  IMB4146L    COMP  PIC  S9(4).
           02  IMB4146F    PICTURE X.
           02  FILLER REDEFINES IMB4146F.
             03 IMB4146A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4146I  PIC X(3).
           02  IMB4016L    COMP  PIC  S9(4).
           02  IMB4016F    PICTURE X.
           02  FILLER REDEFINES IMB4016F.
             03 IMB4016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4016I  PIC X(13).
           02  IMB1122L    COMP  PIC  S9(4).
           02  IMB1122F    PICTURE X.
           02  FILLER REDEFINES IMB1122F.
             03 IMB1122A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1122I  PIC X(1).
           02  IMB1329L    COMP  PIC  S9(4).
           02  IMB1329F    PICTURE X.
           02  FILLER REDEFINES IMB1329F.
             03 IMB1329A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1329I  PIC X(1).
           02  IMB1123L    COMP  PIC  S9(4).
           02  IMB1123F    PICTURE X.
           02  FILLER REDEFINES IMB1123F.
             03 IMB1123A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1123I  PIC X(1).
           02  IMB4075L    COMP  PIC  S9(4).
           02  IMB4075F    PICTURE X.
           02  FILLER REDEFINES IMB4075F.
             03 IMB4075A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4075I  PIC X(2).
           02  IMB4132L    COMP  PIC  S9(4).
           02  IMB4132F    PICTURE X.
           02  FILLER REDEFINES IMB4132F.
             03 IMB4132A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4132I  PIC X(14).
           02  IMB1125L    COMP  PIC  S9(4).
           02  IMB1125F    PICTURE X.
           02  FILLER REDEFINES IMB1125F.
             03 IMB1125A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1125I  PIC X(3).
           02  IMB1100L    COMP  PIC  S9(4).
           02  IMB1100F    PICTURE X.
           02  FILLER REDEFINES IMB1100F.
             03 IMB1100A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1100I  PIC X(3).
           02  IMB1160L    COMP  PIC  S9(4).
           02  IMB1160F    PICTURE X.
           02  FILLER REDEFINES IMB1160F.
             03 IMB1160A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1160I  PIC X(4).
           02  IMB1158L    COMP  PIC  S9(4).
           02  IMB1158F    PICTURE X.
           02  FILLER REDEFINES IMB1158F.
             03 IMB1158A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1158I  PIC X(4).
           02  IMB1159L    COMP  PIC  S9(4).
           02  IMB1159F    PICTURE X.
           02  FILLER REDEFINES IMB1159F.
             03 IMB1159A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1159I  PIC X(4).
           02  IMPFS08L    COMP  PIC  S9(4).
           02  IMPFS08F    PICTURE X.
           02  FILLER REDEFINES IMPFS08F.
             03 IMPFS08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS08I  PIC X(79).
           02  IMERR08L    COMP  PIC  S9(4).
           02  IMERR08F    PICTURE X.
           02  FILLER REDEFINES IMERR08F.
             03 IMERR08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR08I  PIC X(79).
       01  IMB1M08O REDEFINES IMB1M08I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN07C    PICTURE X.
           02  IMTRN07P    PICTURE X.
           02  IMTRN07H    PICTURE X.
           02  IMTRN07V    PICTURE X.
           02  IMTRN07O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE06C    PICTURE X.
           02  BDATE06P    PICTURE X.
           02  BDATE06H    PICTURE X.
           02  BDATE06V    PICTURE X.
           02  BDATE06O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME06C    PICTURE X.
           02  BTIME06P    PICTURE X.
           02  BTIME06H    PICTURE X.
           02  BTIME06V    PICTURE X.
           02  BTIME06O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE06C    PICTURE X.
           02  IMPGE06P    PICTURE X.
           02  IMPGE06H    PICTURE X.
           02  IMPGE06V    PICTURE X.
           02  IMPGE06O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1006C    PICTURE X.
           02  CTL1006P    PICTURE X.
           02  CTL1006H    PICTURE X.
           02  CTL1006V    PICTURE X.
           02  CTL1006O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2006C    PICTURE X.
           02  CTL2006P    PICTURE X.
           02  CTL2006H    PICTURE X.
           02  CTL2006V    PICTURE X.
           02  CTL2006O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3006C    PICTURE X.
           02  CTL3006P    PICTURE X.
           02  CTL3006H    PICTURE X.
           02  CTL3006V    PICTURE X.
           02  CTL3006O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1120C    PICTURE X.
           02  IMB1120P    PICTURE X.
           02  IMB1120H    PICTURE X.
           02  IMB1120V    PICTURE X.
           02  IMB1120O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1124C    PICTURE X.
           02  IMB1124P    PICTURE X.
           02  IMB1124H    PICTURE X.
           02  IMB1124V    PICTURE X.
           02  IMB1124O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1126C    PICTURE X.
           02  IMB1126P    PICTURE X.
           02  IMB1126H    PICTURE X.
           02  IMB1126V    PICTURE X.
           02  IMB1126O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB4017C    PICTURE X.
           02  IMB4017P    PICTURE X.
           02  IMB4017H    PICTURE X.
           02  IMB4017V    PICTURE X.
           02  IMB4017O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMB4018C    PICTURE X.
           02  IMB4018P    PICTURE X.
           02  IMB4018H    PICTURE X.
           02  IMB4018V    PICTURE X.
           02  IMB4018O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB7007C    PICTURE X.
           02  IMB7007P    PICTURE X.
           02  IMB7007H    PICTURE X.
           02  IMB7007V    PICTURE X.
           02  IMB7007O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4146C    PICTURE X.
           02  IMB4146P    PICTURE X.
           02  IMB4146H    PICTURE X.
           02  IMB4146V    PICTURE X.
           02  IMB4146O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB4016C    PICTURE X.
           02  IMB4016P    PICTURE X.
           02  IMB4016H    PICTURE X.
           02  IMB4016V    PICTURE X.
           02  IMB4016O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMB1122C    PICTURE X.
           02  IMB1122P    PICTURE X.
           02  IMB1122H    PICTURE X.
           02  IMB1122V    PICTURE X.
           02  IMB1122O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1329C    PICTURE X.
           02  IMB1329P    PICTURE X.
           02  IMB1329H    PICTURE X.
           02  IMB1329V    PICTURE X.
           02  IMB1329O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1123C    PICTURE X.
           02  IMB1123P    PICTURE X.
           02  IMB1123H    PICTURE X.
           02  IMB1123V    PICTURE X.
           02  IMB1123O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB4075C    PICTURE X.
           02  IMB4075P    PICTURE X.
           02  IMB4075H    PICTURE X.
           02  IMB4075V    PICTURE X.
           02  IMB4075O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB4132C    PICTURE X.
           02  IMB4132P    PICTURE X.
           02  IMB4132H    PICTURE X.
           02  IMB4132V    PICTURE X.
           02  IMB4132O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  IMB1125C    PICTURE X.
           02  IMB1125P    PICTURE X.
           02  IMB1125H    PICTURE X.
           02  IMB1125V    PICTURE X.
           02  IMB1125O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1100C    PICTURE X.
           02  IMB1100P    PICTURE X.
           02  IMB1100H    PICTURE X.
           02  IMB1100V    PICTURE X.
           02  IMB1100O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1160C    PICTURE X.
           02  IMB1160P    PICTURE X.
           02  IMB1160H    PICTURE X.
           02  IMB1160V    PICTURE X.
           02  IMB1160O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1158C    PICTURE X.
           02  IMB1158P    PICTURE X.
           02  IMB1158H    PICTURE X.
           02  IMB1158V    PICTURE X.
           02  IMB1158O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1159C    PICTURE X.
           02  IMB1159P    PICTURE X.
           02  IMB1159H    PICTURE X.
           02  IMB1159V    PICTURE X.
           02  IMB1159O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMPFS08C    PICTURE X.
           02  IMPFS08P    PICTURE X.
           02  IMPFS08H    PICTURE X.
           02  IMPFS08V    PICTURE X.
           02  IMPFS08O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR08C    PICTURE X.
           02  IMERR08P    PICTURE X.
           02  IMERR08H    PICTURE X.
           02  IMERR08V    PICTURE X.
           02  IMERR08O  PIC X(79).
       01  IMB1M09I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN08L    COMP  PIC  S9(4).
           02  IMTRN08F    PICTURE X.
           02  FILLER REDEFINES IMTRN08F.
             03 IMTRN08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN08I  PIC X(4).
           02  BDATE07L    COMP  PIC  S9(4).
           02  BDATE07F    PICTURE X.
           02  FILLER REDEFINES BDATE07F.
             03 BDATE07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE07I  PIC X(8).
           02  BTIME07L    COMP  PIC  S9(4).
           02  BTIME07F    PICTURE X.
           02  FILLER REDEFINES BTIME07F.
             03 BTIME07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME07I  PIC X(8).
           02  IMPGE07L    COMP  PIC  S9(4).
           02  IMPGE07F    PICTURE X.
           02  FILLER REDEFINES IMPGE07F.
             03 IMPGE07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE07I  PIC X(2).
           02  CTL1007L    COMP  PIC  S9(4).
           02  CTL1007F    PICTURE X.
           02  FILLER REDEFINES CTL1007F.
             03 CTL1007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1007I  PIC X(2).
           02  CTL2007L    COMP  PIC  S9(4).
           02  CTL2007F    PICTURE X.
           02  FILLER REDEFINES CTL2007F.
             03 CTL2007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2007I  PIC X(3).
           02  CTL3007L    COMP  PIC  S9(4).
           02  CTL3007F    PICTURE X.
           02  FILLER REDEFINES CTL3007F.
             03 CTL3007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3007I  PIC X(3).
           02  IMB5060L    COMP  PIC  S9(4).
           02  IMB5060F    PICTURE X.
           02  FILLER REDEFINES IMB5060F.
             03 IMB5060A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5060I  PIC X(1).
           02  IME5060L    COMP  PIC  S9(4).
           02  IME5060F    PICTURE X.
           02  FILLER REDEFINES IME5060F.
             03 IME5060A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME5060I  PIC X(16).
           02  IMB5061L    COMP  PIC  S9(4).
           02  IMB5061F    PICTURE X.
           02  FILLER REDEFINES IMB5061F.
             03 IMB5061A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5061I  PIC X(1).
           02  IME5061L    COMP  PIC  S9(4).
           02  IME5061F    PICTURE X.
           02  FILLER REDEFINES IME5061F.
             03 IME5061A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME5061I  PIC X(16).
           02  IMB9505L    COMP  PIC  S9(4).
           02  IMB9505F    PICTURE X.
           02  FILLER REDEFINES IMB9505F.
             03 IMB9505A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB9505I  PIC X(6).
           02  B506201L    COMP  PIC  S9(4).
           02  B506201F    PICTURE X.
           02  FILLER REDEFINES B506201F.
             03 B506201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506201I  PIC X(13).
           02  B506202L    COMP  PIC  S9(4).
           02  B506202F    PICTURE X.
           02  FILLER REDEFINES B506202F.
             03 B506202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506202I  PIC X(13).
           02  B506203L    COMP  PIC  S9(4).
           02  B506203F    PICTURE X.
           02  FILLER REDEFINES B506203F.
             03 B506203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506203I  PIC X(13).
           02  B506204L    COMP  PIC  S9(4).
           02  B506204F    PICTURE X.
           02  FILLER REDEFINES B506204F.
             03 B506204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506204I  PIC X(13).
           02  B506205L    COMP  PIC  S9(4).
           02  B506205F    PICTURE X.
           02  FILLER REDEFINES B506205F.
             03 B506205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506205I  PIC X(13).
           02  B506206L    COMP  PIC  S9(4).
           02  B506206F    PICTURE X.
           02  FILLER REDEFINES B506206F.
             03 B506206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506206I  PIC X(13).
           02  B506207L    COMP  PIC  S9(4).
           02  B506207F    PICTURE X.
           02  FILLER REDEFINES B506207F.
             03 B506207A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506207I  PIC X(13).
           02  B506208L    COMP  PIC  S9(4).
           02  B506208F    PICTURE X.
           02  FILLER REDEFINES B506208F.
             03 B506208A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506208I  PIC X(13).
           02  B506209L    COMP  PIC  S9(4).
           02  B506209F    PICTURE X.
           02  FILLER REDEFINES B506209F.
             03 B506209A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506209I  PIC X(13).
           02  B506301L    COMP  PIC  S9(4).
           02  B506301F    PICTURE X.
           02  FILLER REDEFINES B506301F.
             03 B506301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506301I  PIC X(13).
           02  B506302L    COMP  PIC  S9(4).
           02  B506302F    PICTURE X.
           02  FILLER REDEFINES B506302F.
             03 B506302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506302I  PIC X(13).
           02  B506303L    COMP  PIC  S9(4).
           02  B506303F    PICTURE X.
           02  FILLER REDEFINES B506303F.
             03 B506303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506303I  PIC X(13).
           02  B506304L    COMP  PIC  S9(4).
           02  B506304F    PICTURE X.
           02  FILLER REDEFINES B506304F.
             03 B506304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506304I  PIC X(13).
           02  B506305L    COMP  PIC  S9(4).
           02  B506305F    PICTURE X.
           02  FILLER REDEFINES B506305F.
             03 B506305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506305I  PIC X(13).
           02  B506306L    COMP  PIC  S9(4).
           02  B506306F    PICTURE X.
           02  FILLER REDEFINES B506306F.
             03 B506306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506306I  PIC X(13).
           02  B506307L    COMP  PIC  S9(4).
           02  B506307F    PICTURE X.
           02  FILLER REDEFINES B506307F.
             03 B506307A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506307I  PIC X(13).
           02  B506308L    COMP  PIC  S9(4).
           02  B506308F    PICTURE X.
           02  FILLER REDEFINES B506308F.
             03 B506308A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506308I  PIC X(13).
           02  B506309L    COMP  PIC  S9(4).
           02  B506309F    PICTURE X.
           02  FILLER REDEFINES B506309F.
             03 B506309A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B506309I  PIC X(13).
           02  IMB5064L    COMP  PIC  S9(4).
           02  IMB5064F    PICTURE X.
           02  FILLER REDEFINES IMB5064F.
             03 IMB5064A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5064I  PIC X(1).
           02  IMB5065L    COMP  PIC  S9(4).
           02  IMB5065F    PICTURE X.
           02  FILLER REDEFINES IMB5065F.
             03 IMB5065A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5065I  PIC X(1).
           02  IMB5066L    COMP  PIC  S9(4).
           02  IMB5066F    PICTURE X.
           02  FILLER REDEFINES IMB5066F.
             03 IMB5066A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5066I  PIC X(1).
           02  IMB5071L    COMP  PIC  S9(4).
           02  IMB5071F    PICTURE X.
           02  FILLER REDEFINES IMB5071F.
             03 IMB5071A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5071I  PIC X(1).
           02  IMB5069L    COMP  PIC  S9(4).
           02  IMB5069F    PICTURE X.
           02  FILLER REDEFINES IMB5069F.
             03 IMB5069A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5069I  PIC X(1).
           02  IMB5067L    COMP  PIC  S9(4).
           02  IMB5067F    PICTURE X.
           02  FILLER REDEFINES IMB5067F.
             03 IMB5067A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5067I  PIC X(1).
           02  IMB5068L    COMP  PIC  S9(4).
           02  IMB5068F    PICTURE X.
           02  FILLER REDEFINES IMB5068F.
             03 IMB5068A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5068I  PIC X(1).
           02  IMB5070L    COMP  PIC  S9(4).
           02  IMB5070F    PICTURE X.
           02  FILLER REDEFINES IMB5070F.
             03 IMB5070A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5070I  PIC X(1).
           02  IMPFS09L    COMP  PIC  S9(4).
           02  IMPFS09F    PICTURE X.
           02  FILLER REDEFINES IMPFS09F.
             03 IMPFS09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS09I  PIC X(79).
           02  IMERR09L    COMP  PIC  S9(4).
           02  IMERR09F    PICTURE X.
           02  FILLER REDEFINES IMERR09F.
             03 IMERR09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR09I  PIC X(79).
       01  IMB1M09O REDEFINES IMB1M09I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN08C    PICTURE X.
           02  IMTRN08P    PICTURE X.
           02  IMTRN08H    PICTURE X.
           02  IMTRN08V    PICTURE X.
           02  IMTRN08O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE07C    PICTURE X.
           02  BDATE07P    PICTURE X.
           02  BDATE07H    PICTURE X.
           02  BDATE07V    PICTURE X.
           02  BDATE07O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME07C    PICTURE X.
           02  BTIME07P    PICTURE X.
           02  BTIME07H    PICTURE X.
           02  BTIME07V    PICTURE X.
           02  BTIME07O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE07C    PICTURE X.
           02  IMPGE07P    PICTURE X.
           02  IMPGE07H    PICTURE X.
           02  IMPGE07V    PICTURE X.
           02  IMPGE07O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1007C    PICTURE X.
           02  CTL1007P    PICTURE X.
           02  CTL1007H    PICTURE X.
           02  CTL1007V    PICTURE X.
           02  CTL1007O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2007C    PICTURE X.
           02  CTL2007P    PICTURE X.
           02  CTL2007H    PICTURE X.
           02  CTL2007V    PICTURE X.
           02  CTL2007O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3007C    PICTURE X.
           02  CTL3007P    PICTURE X.
           02  CTL3007H    PICTURE X.
           02  CTL3007V    PICTURE X.
           02  CTL3007O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB5060C    PICTURE X.
           02  IMB5060P    PICTURE X.
           02  IMB5060H    PICTURE X.
           02  IMB5060V    PICTURE X.
           02  IMB5060O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME5060C    PICTURE X.
           02  IME5060P    PICTURE X.
           02  IME5060H    PICTURE X.
           02  IME5060V    PICTURE X.
           02  IME5060O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB5061C    PICTURE X.
           02  IMB5061P    PICTURE X.
           02  IMB5061H    PICTURE X.
           02  IMB5061V    PICTURE X.
           02  IMB5061O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME5061C    PICTURE X.
           02  IME5061P    PICTURE X.
           02  IME5061H    PICTURE X.
           02  IME5061V    PICTURE X.
           02  IME5061O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB9505C    PICTURE X.
           02  IMB9505P    PICTURE X.
           02  IMB9505H    PICTURE X.
           02  IMB9505V    PICTURE X.
           02  IMB9505O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B506201C    PICTURE X.
           02  B506201P    PICTURE X.
           02  B506201H    PICTURE X.
           02  B506201V    PICTURE X.
           02  B506201O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506202C    PICTURE X.
           02  B506202P    PICTURE X.
           02  B506202H    PICTURE X.
           02  B506202V    PICTURE X.
           02  B506202O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506203C    PICTURE X.
           02  B506203P    PICTURE X.
           02  B506203H    PICTURE X.
           02  B506203V    PICTURE X.
           02  B506203O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506204C    PICTURE X.
           02  B506204P    PICTURE X.
           02  B506204H    PICTURE X.
           02  B506204V    PICTURE X.
           02  B506204O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506205C    PICTURE X.
           02  B506205P    PICTURE X.
           02  B506205H    PICTURE X.
           02  B506205V    PICTURE X.
           02  B506205O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506206C    PICTURE X.
           02  B506206P    PICTURE X.
           02  B506206H    PICTURE X.
           02  B506206V    PICTURE X.
           02  B506206O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506207C    PICTURE X.
           02  B506207P    PICTURE X.
           02  B506207H    PICTURE X.
           02  B506207V    PICTURE X.
           02  B506207O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506208C    PICTURE X.
           02  B506208P    PICTURE X.
           02  B506208H    PICTURE X.
           02  B506208V    PICTURE X.
           02  B506208O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506209C    PICTURE X.
           02  B506209P    PICTURE X.
           02  B506209H    PICTURE X.
           02  B506209V    PICTURE X.
           02  B506209O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506301C    PICTURE X.
           02  B506301P    PICTURE X.
           02  B506301H    PICTURE X.
           02  B506301V    PICTURE X.
           02  B506301O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506302C    PICTURE X.
           02  B506302P    PICTURE X.
           02  B506302H    PICTURE X.
           02  B506302V    PICTURE X.
           02  B506302O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506303C    PICTURE X.
           02  B506303P    PICTURE X.
           02  B506303H    PICTURE X.
           02  B506303V    PICTURE X.
           02  B506303O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506304C    PICTURE X.
           02  B506304P    PICTURE X.
           02  B506304H    PICTURE X.
           02  B506304V    PICTURE X.
           02  B506304O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506305C    PICTURE X.
           02  B506305P    PICTURE X.
           02  B506305H    PICTURE X.
           02  B506305V    PICTURE X.
           02  B506305O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506306C    PICTURE X.
           02  B506306P    PICTURE X.
           02  B506306H    PICTURE X.
           02  B506306V    PICTURE X.
           02  B506306O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506307C    PICTURE X.
           02  B506307P    PICTURE X.
           02  B506307H    PICTURE X.
           02  B506307V    PICTURE X.
           02  B506307O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506308C    PICTURE X.
           02  B506308P    PICTURE X.
           02  B506308H    PICTURE X.
           02  B506308V    PICTURE X.
           02  B506308O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B506309C    PICTURE X.
           02  B506309P    PICTURE X.
           02  B506309H    PICTURE X.
           02  B506309V    PICTURE X.
           02  B506309O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMB5064C    PICTURE X.
           02  IMB5064P    PICTURE X.
           02  IMB5064H    PICTURE X.
           02  IMB5064V    PICTURE X.
           02  IMB5064O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5065C    PICTURE X.
           02  IMB5065P    PICTURE X.
           02  IMB5065H    PICTURE X.
           02  IMB5065V    PICTURE X.
           02  IMB5065O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5066C    PICTURE X.
           02  IMB5066P    PICTURE X.
           02  IMB5066H    PICTURE X.
           02  IMB5066V    PICTURE X.
           02  IMB5066O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5071C    PICTURE X.
           02  IMB5071P    PICTURE X.
           02  IMB5071H    PICTURE X.
           02  IMB5071V    PICTURE X.
           02  IMB5071O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5069C    PICTURE X.
           02  IMB5069P    PICTURE X.
           02  IMB5069H    PICTURE X.
           02  IMB5069V    PICTURE X.
           02  IMB5069O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5067C    PICTURE X.
           02  IMB5067P    PICTURE X.
           02  IMB5067H    PICTURE X.
           02  IMB5067V    PICTURE X.
           02  IMB5067O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5068C    PICTURE X.
           02  IMB5068P    PICTURE X.
           02  IMB5068H    PICTURE X.
           02  IMB5068V    PICTURE X.
           02  IMB5068O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5070C    PICTURE X.
           02  IMB5070P    PICTURE X.
           02  IMB5070H    PICTURE X.
           02  IMB5070V    PICTURE X.
           02  IMB5070O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS09C    PICTURE X.
           02  IMPFS09P    PICTURE X.
           02  IMPFS09H    PICTURE X.
           02  IMPFS09V    PICTURE X.
           02  IMPFS09O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR09C    PICTURE X.
           02  IMERR09P    PICTURE X.
           02  IMERR09H    PICTURE X.
           02  IMERR09V    PICTURE X.
           02  IMERR09O  PIC X(79).
       01  IMB1M10I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN09L    COMP  PIC  S9(4).
           02  IMTRN09F    PICTURE X.
           02  FILLER REDEFINES IMTRN09F.
             03 IMTRN09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN09I  PIC X(4).
           02  BDATE08L    COMP  PIC  S9(4).
           02  BDATE08F    PICTURE X.
           02  FILLER REDEFINES BDATE08F.
             03 BDATE08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE08I  PIC X(8).
           02  BTIME08L    COMP  PIC  S9(4).
           02  BTIME08F    PICTURE X.
           02  FILLER REDEFINES BTIME08F.
             03 BTIME08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME08I  PIC X(8).
           02  IMPGE08L    COMP  PIC  S9(4).
           02  IMPGE08F    PICTURE X.
           02  FILLER REDEFINES IMPGE08F.
             03 IMPGE08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE08I  PIC X(2).
           02  CTL1008L    COMP  PIC  S9(4).
           02  CTL1008F    PICTURE X.
           02  FILLER REDEFINES CTL1008F.
             03 CTL1008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1008I  PIC X(2).
           02  CTL2008L    COMP  PIC  S9(4).
           02  CTL2008F    PICTURE X.
           02  FILLER REDEFINES CTL2008F.
             03 CTL2008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2008I  PIC X(3).
           02  CTL3008L    COMP  PIC  S9(4).
           02  CTL3008F    PICTURE X.
           02  FILLER REDEFINES CTL3008F.
             03 CTL3008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3008I  PIC X(3).
           02  IMB5054L    COMP  PIC  S9(4).
           02  IMB5054F    PICTURE X.
           02  FILLER REDEFINES IMB5054F.
             03 IMB5054A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5054I  PIC X(1).
           02  IMB5056L    COMP  PIC  S9(4).
           02  IMB5056F    PICTURE X.
           02  FILLER REDEFINES IMB5056F.
             03 IMB5056A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5056I  PIC X(4).
           02  IMB5058L    COMP  PIC  S9(4).
           02  IMB5058F    PICTURE X.
           02  FILLER REDEFINES IMB5058F.
             03 IMB5058A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5058I  PIC X(4).
           02  IMB5057L    COMP  PIC  S9(4).
           02  IMB5057F    PICTURE X.
           02  FILLER REDEFINES IMB5057F.
             03 IMB5057A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5057I  PIC X(4).
           02  IMPFS10L    COMP  PIC  S9(4).
           02  IMPFS10F    PICTURE X.
           02  FILLER REDEFINES IMPFS10F.
             03 IMPFS10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS10I  PIC X(79).
           02  IMERR10L    COMP  PIC  S9(4).
           02  IMERR10F    PICTURE X.
           02  FILLER REDEFINES IMERR10F.
             03 IMERR10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR10I  PIC X(79).
       01  IMB1M10O REDEFINES IMB1M10I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN09C    PICTURE X.
           02  IMTRN09P    PICTURE X.
           02  IMTRN09H    PICTURE X.
           02  IMTRN09V    PICTURE X.
           02  IMTRN09O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE08C    PICTURE X.
           02  BDATE08P    PICTURE X.
           02  BDATE08H    PICTURE X.
           02  BDATE08V    PICTURE X.
           02  BDATE08O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME08C    PICTURE X.
           02  BTIME08P    PICTURE X.
           02  BTIME08H    PICTURE X.
           02  BTIME08V    PICTURE X.
           02  BTIME08O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE08C    PICTURE X.
           02  IMPGE08P    PICTURE X.
           02  IMPGE08H    PICTURE X.
           02  IMPGE08V    PICTURE X.
           02  IMPGE08O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1008C    PICTURE X.
           02  CTL1008P    PICTURE X.
           02  CTL1008H    PICTURE X.
           02  CTL1008V    PICTURE X.
           02  CTL1008O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2008C    PICTURE X.
           02  CTL2008P    PICTURE X.
           02  CTL2008H    PICTURE X.
           02  CTL2008V    PICTURE X.
           02  CTL2008O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3008C    PICTURE X.
           02  CTL3008P    PICTURE X.
           02  CTL3008H    PICTURE X.
           02  CTL3008V    PICTURE X.
           02  CTL3008O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB5054C    PICTURE X.
           02  IMB5054P    PICTURE X.
           02  IMB5054H    PICTURE X.
           02  IMB5054V    PICTURE X.
           02  IMB5054O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5056C    PICTURE X.
           02  IMB5056P    PICTURE X.
           02  IMB5056H    PICTURE X.
           02  IMB5056V    PICTURE X.
           02  IMB5056O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5058C    PICTURE X.
           02  IMB5058P    PICTURE X.
           02  IMB5058H    PICTURE X.
           02  IMB5058V    PICTURE X.
           02  IMB5058O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5057C    PICTURE X.
           02  IMB5057P    PICTURE X.
           02  IMB5057H    PICTURE X.
           02  IMB5057V    PICTURE X.
           02  IMB5057O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMPFS10C    PICTURE X.
           02  IMPFS10P    PICTURE X.
           02  IMPFS10H    PICTURE X.
           02  IMPFS10V    PICTURE X.
           02  IMPFS10O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR10C    PICTURE X.
           02  IMERR10P    PICTURE X.
           02  IMERR10H    PICTURE X.
           02  IMERR10V    PICTURE X.
           02  IMERR10O  PIC X(79).
       01  IMB1M11I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN10L    COMP  PIC  S9(4).
           02  IMTRN10F    PICTURE X.
           02  FILLER REDEFINES IMTRN10F.
             03 IMTRN10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN10I  PIC X(4).
           02  BDATE09L    COMP  PIC  S9(4).
           02  BDATE09F    PICTURE X.
           02  FILLER REDEFINES BDATE09F.
             03 BDATE09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE09I  PIC X(8).
           02  BTIME09L    COMP  PIC  S9(4).
           02  BTIME09F    PICTURE X.
           02  FILLER REDEFINES BTIME09F.
             03 BTIME09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME09I  PIC X(8).
           02  IMPGE09L    COMP  PIC  S9(4).
           02  IMPGE09F    PICTURE X.
           02  FILLER REDEFINES IMPGE09F.
             03 IMPGE09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE09I  PIC X(2).
           02  CTL1009L    COMP  PIC  S9(4).
           02  CTL1009F    PICTURE X.
           02  FILLER REDEFINES CTL1009F.
             03 CTL1009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1009I  PIC X(2).
           02  CTL2009L    COMP  PIC  S9(4).
           02  CTL2009F    PICTURE X.
           02  FILLER REDEFINES CTL2009F.
             03 CTL2009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2009I  PIC X(3).
           02  CTL3009L    COMP  PIC  S9(4).
           02  CTL3009F    PICTURE X.
           02  FILLER REDEFINES CTL3009F.
             03 CTL3009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3009I  PIC X(3).
           02  IMB1232L    COMP  PIC  S9(4).
           02  IMB1232F    PICTURE X.
           02  FILLER REDEFINES IMB1232F.
             03 IMB1232A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1232I  PIC X(26).
           02  IMPFS11L    COMP  PIC  S9(4).
           02  IMPFS11F    PICTURE X.
           02  FILLER REDEFINES IMPFS11F.
             03 IMPFS11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS11I  PIC X(79).
           02  IMERR11L    COMP  PIC  S9(4).
           02  IMERR11F    PICTURE X.
           02  FILLER REDEFINES IMERR11F.
             03 IMERR11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR11I  PIC X(79).
       01  IMB1M11O REDEFINES IMB1M11I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN10C    PICTURE X.
           02  IMTRN10P    PICTURE X.
           02  IMTRN10H    PICTURE X.
           02  IMTRN10V    PICTURE X.
           02  IMTRN10O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE09C    PICTURE X.
           02  BDATE09P    PICTURE X.
           02  BDATE09H    PICTURE X.
           02  BDATE09V    PICTURE X.
           02  BDATE09O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME09C    PICTURE X.
           02  BTIME09P    PICTURE X.
           02  BTIME09H    PICTURE X.
           02  BTIME09V    PICTURE X.
           02  BTIME09O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE09C    PICTURE X.
           02  IMPGE09P    PICTURE X.
           02  IMPGE09H    PICTURE X.
           02  IMPGE09V    PICTURE X.
           02  IMPGE09O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1009C    PICTURE X.
           02  CTL1009P    PICTURE X.
           02  CTL1009H    PICTURE X.
           02  CTL1009V    PICTURE X.
           02  CTL1009O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2009C    PICTURE X.
           02  CTL2009P    PICTURE X.
           02  CTL2009H    PICTURE X.
           02  CTL2009V    PICTURE X.
           02  CTL2009O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3009C    PICTURE X.
           02  CTL3009P    PICTURE X.
           02  CTL3009H    PICTURE X.
           02  CTL3009V    PICTURE X.
           02  CTL3009O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1232C    PICTURE X.
           02  IMB1232P    PICTURE X.
           02  IMB1232H    PICTURE X.
           02  IMB1232V    PICTURE X.
           02  IMB1232O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  IMPFS11C    PICTURE X.
           02  IMPFS11P    PICTURE X.
           02  IMPFS11H    PICTURE X.
           02  IMPFS11V    PICTURE X.
           02  IMPFS11O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR11C    PICTURE X.
           02  IMERR11P    PICTURE X.
           02  IMERR11H    PICTURE X.
           02  IMERR11V    PICTURE X.
           02  IMERR11O  PIC X(79).
       01  IMB1M12I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN11L    COMP  PIC  S9(4).
           02  IMTRN11F    PICTURE X.
           02  FILLER REDEFINES IMTRN11F.
             03 IMTRN11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN11I  PIC X(4).
           02  BDATE10L    COMP  PIC  S9(4).
           02  BDATE10F    PICTURE X.
           02  FILLER REDEFINES BDATE10F.
             03 BDATE10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE10I  PIC X(8).
           02  BTIME10L    COMP  PIC  S9(4).
           02  BTIME10F    PICTURE X.
           02  FILLER REDEFINES BTIME10F.
             03 BTIME10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME10I  PIC X(8).
           02  IMPGE10L    COMP  PIC  S9(4).
           02  IMPGE10F    PICTURE X.
           02  FILLER REDEFINES IMPGE10F.
             03 IMPGE10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE10I  PIC X(2).
           02  CTL1010L    COMP  PIC  S9(4).
           02  CTL1010F    PICTURE X.
           02  FILLER REDEFINES CTL1010F.
             03 CTL1010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1010I  PIC X(2).
           02  CTL2010L    COMP  PIC  S9(4).
           02  CTL2010F    PICTURE X.
           02  FILLER REDEFINES CTL2010F.
             03 CTL2010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2010I  PIC X(3).
           02  CTL3010L    COMP  PIC  S9(4).
           02  CTL3010F    PICTURE X.
           02  FILLER REDEFINES CTL3010F.
             03 CTL3010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3010I  PIC X(3).
           02  IMB1081L    COMP  PIC  S9(4).
           02  IMB1081F    PICTURE X.
           02  FILLER REDEFINES IMB1081F.
             03 IMB1081A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1081I  PIC X(5).
           02  IMB1082L    COMP  PIC  S9(4).
           02  IMB1082F    PICTURE X.
           02  FILLER REDEFINES IMB1082F.
             03 IMB1082A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1082I  PIC X(5).
           02  IMB1277L    COMP  PIC  S9(4).
           02  IMB1277F    PICTURE X.
           02  FILLER REDEFINES IMB1277F.
             03 IMB1277A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1277I  PIC X(1).
           02  IME1277L    COMP  PIC  S9(4).
           02  IME1277F    PICTURE X.
           02  FILLER REDEFINES IME1277F.
             03 IME1277A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1277I  PIC X(13).
           02  IMB1290L    COMP  PIC  S9(4).
           02  IMB1290F    PICTURE X.
           02  FILLER REDEFINES IMB1290F.
             03 IMB1290A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1290I  PIC X(1).
           02  IMB1284L    COMP  PIC  S9(4).
           02  IMB1284F    PICTURE X.
           02  FILLER REDEFINES IMB1284F.
             03 IMB1284A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1284I  PIC X(1).
           02  IME1284L    COMP  PIC  S9(4).
           02  IME1284F    PICTURE X.
           02  FILLER REDEFINES IME1284F.
             03 IME1284A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1284I  PIC X(16).
           02  IMB1278L    COMP  PIC  S9(4).
           02  IMB1278F    PICTURE X.
           02  FILLER REDEFINES IMB1278F.
             03 IMB1278A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1278I  PIC X(1).
           02  IME1278L    COMP  PIC  S9(4).
           02  IME1278F    PICTURE X.
           02  FILLER REDEFINES IME1278F.
             03 IME1278A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1278I  PIC X(13).
           02  IMB1291L    COMP  PIC  S9(4).
           02  IMB1291F    PICTURE X.
           02  FILLER REDEFINES IMB1291F.
             03 IMB1291A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1291I  PIC X(1).
           02  IMB1285L    COMP  PIC  S9(4).
           02  IMB1285F    PICTURE X.
           02  FILLER REDEFINES IMB1285F.
             03 IMB1285A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1285I  PIC X(1).
           02  IME1285L    COMP  PIC  S9(4).
           02  IME1285F    PICTURE X.
           02  FILLER REDEFINES IME1285F.
             03 IME1285A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1285I  PIC X(16).
           02  IMB1279L    COMP  PIC  S9(4).
           02  IMB1279F    PICTURE X.
           02  FILLER REDEFINES IMB1279F.
             03 IMB1279A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1279I  PIC X(1).
           02  IME1279L    COMP  PIC  S9(4).
           02  IME1279F    PICTURE X.
           02  FILLER REDEFINES IME1279F.
             03 IME1279A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1279I  PIC X(13).
           02  IMB1292L    COMP  PIC  S9(4).
           02  IMB1292F    PICTURE X.
           02  FILLER REDEFINES IMB1292F.
             03 IMB1292A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1292I  PIC X(1).
           02  IMB1286L    COMP  PIC  S9(4).
           02  IMB1286F    PICTURE X.
           02  FILLER REDEFINES IMB1286F.
             03 IMB1286A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1286I  PIC X(1).
           02  IME1286L    COMP  PIC  S9(4).
           02  IME1286F    PICTURE X.
           02  FILLER REDEFINES IME1286F.
             03 IME1286A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1286I  PIC X(16).
           02  IMB1280L    COMP  PIC  S9(4).
           02  IMB1280F    PICTURE X.
           02  FILLER REDEFINES IMB1280F.
             03 IMB1280A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1280I  PIC X(1).
           02  IME1280L    COMP  PIC  S9(4).
           02  IME1280F    PICTURE X.
           02  FILLER REDEFINES IME1280F.
             03 IME1280A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1280I  PIC X(13).
           02  IMB1293L    COMP  PIC  S9(4).
           02  IMB1293F    PICTURE X.
           02  FILLER REDEFINES IMB1293F.
             03 IMB1293A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1293I  PIC X(1).
           02  IMB1287L    COMP  PIC  S9(4).
           02  IMB1287F    PICTURE X.
           02  FILLER REDEFINES IMB1287F.
             03 IMB1287A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1287I  PIC X(1).
           02  IME1287L    COMP  PIC  S9(4).
           02  IME1287F    PICTURE X.
           02  FILLER REDEFINES IME1287F.
             03 IME1287A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1287I  PIC X(16).
           02  IMB1281L    COMP  PIC  S9(4).
           02  IMB1281F    PICTURE X.
           02  FILLER REDEFINES IMB1281F.
             03 IMB1281A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1281I  PIC X(1).
           02  IME1281L    COMP  PIC  S9(4).
           02  IME1281F    PICTURE X.
           02  FILLER REDEFINES IME1281F.
             03 IME1281A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1281I  PIC X(13).
           02  IMB1294L    COMP  PIC  S9(4).
           02  IMB1294F    PICTURE X.
           02  FILLER REDEFINES IMB1294F.
             03 IMB1294A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1294I  PIC X(1).
           02  IMB1288L    COMP  PIC  S9(4).
           02  IMB1288F    PICTURE X.
           02  FILLER REDEFINES IMB1288F.
             03 IMB1288A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1288I  PIC X(1).
           02  IME1288L    COMP  PIC  S9(4).
           02  IME1288F    PICTURE X.
           02  FILLER REDEFINES IME1288F.
             03 IME1288A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1288I  PIC X(16).
           02  IMB1282L    COMP  PIC  S9(4).
           02  IMB1282F    PICTURE X.
           02  FILLER REDEFINES IMB1282F.
             03 IMB1282A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1282I  PIC X(1).
           02  IME1282L    COMP  PIC  S9(4).
           02  IME1282F    PICTURE X.
           02  FILLER REDEFINES IME1282F.
             03 IME1282A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1282I  PIC X(13).
           02  IMB1295L    COMP  PIC  S9(4).
           02  IMB1295F    PICTURE X.
           02  FILLER REDEFINES IMB1295F.
             03 IMB1295A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1295I  PIC X(1).
           02  IMB1289L    COMP  PIC  S9(4).
           02  IMB1289F    PICTURE X.
           02  FILLER REDEFINES IMB1289F.
             03 IMB1289A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1289I  PIC X(1).
           02  IME1289L    COMP  PIC  S9(4).
           02  IME1289F    PICTURE X.
           02  FILLER REDEFINES IME1289F.
             03 IME1289A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1289I  PIC X(16).
           02  IMPFS12L    COMP  PIC  S9(4).
           02  IMPFS12F    PICTURE X.
           02  FILLER REDEFINES IMPFS12F.
             03 IMPFS12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS12I  PIC X(79).
           02  IMERR12L    COMP  PIC  S9(4).
           02  IMERR12F    PICTURE X.
           02  FILLER REDEFINES IMERR12F.
             03 IMERR12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR12I  PIC X(79).
       01  IMB1M12O REDEFINES IMB1M12I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN11C    PICTURE X.
           02  IMTRN11P    PICTURE X.
           02  IMTRN11H    PICTURE X.
           02  IMTRN11V    PICTURE X.
           02  IMTRN11O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE10C    PICTURE X.
           02  BDATE10P    PICTURE X.
           02  BDATE10H    PICTURE X.
           02  BDATE10V    PICTURE X.
           02  BDATE10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME10C    PICTURE X.
           02  BTIME10P    PICTURE X.
           02  BTIME10H    PICTURE X.
           02  BTIME10V    PICTURE X.
           02  BTIME10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE10C    PICTURE X.
           02  IMPGE10P    PICTURE X.
           02  IMPGE10H    PICTURE X.
           02  IMPGE10V    PICTURE X.
           02  IMPGE10O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1010C    PICTURE X.
           02  CTL1010P    PICTURE X.
           02  CTL1010H    PICTURE X.
           02  CTL1010V    PICTURE X.
           02  CTL1010O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2010C    PICTURE X.
           02  CTL2010P    PICTURE X.
           02  CTL2010H    PICTURE X.
           02  CTL2010V    PICTURE X.
           02  CTL2010O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3010C    PICTURE X.
           02  CTL3010P    PICTURE X.
           02  CTL3010H    PICTURE X.
           02  CTL3010V    PICTURE X.
           02  CTL3010O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1081C    PICTURE X.
           02  IMB1081P    PICTURE X.
           02  IMB1081H    PICTURE X.
           02  IMB1081V    PICTURE X.
           02  IMB1081O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB1082C    PICTURE X.
           02  IMB1082P    PICTURE X.
           02  IMB1082H    PICTURE X.
           02  IMB1082V    PICTURE X.
           02  IMB1082O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB1277C    PICTURE X.
           02  IMB1277P    PICTURE X.
           02  IMB1277H    PICTURE X.
           02  IMB1277V    PICTURE X.
           02  IMB1277O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1277C    PICTURE X.
           02  IME1277P    PICTURE X.
           02  IME1277H    PICTURE X.
           02  IME1277V    PICTURE X.
           02  IME1277O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMB1290C    PICTURE X.
           02  IMB1290P    PICTURE X.
           02  IMB1290H    PICTURE X.
           02  IMB1290V    PICTURE X.
           02  IMB1290O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1284C    PICTURE X.
           02  IMB1284P    PICTURE X.
           02  IMB1284H    PICTURE X.
           02  IMB1284V    PICTURE X.
           02  IMB1284O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1284C    PICTURE X.
           02  IME1284P    PICTURE X.
           02  IME1284H    PICTURE X.
           02  IME1284V    PICTURE X.
           02  IME1284O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1278C    PICTURE X.
           02  IMB1278P    PICTURE X.
           02  IMB1278H    PICTURE X.
           02  IMB1278V    PICTURE X.
           02  IMB1278O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1278C    PICTURE X.
           02  IME1278P    PICTURE X.
           02  IME1278H    PICTURE X.
           02  IME1278V    PICTURE X.
           02  IME1278O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMB1291C    PICTURE X.
           02  IMB1291P    PICTURE X.
           02  IMB1291H    PICTURE X.
           02  IMB1291V    PICTURE X.
           02  IMB1291O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1285C    PICTURE X.
           02  IMB1285P    PICTURE X.
           02  IMB1285H    PICTURE X.
           02  IMB1285V    PICTURE X.
           02  IMB1285O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1285C    PICTURE X.
           02  IME1285P    PICTURE X.
           02  IME1285H    PICTURE X.
           02  IME1285V    PICTURE X.
           02  IME1285O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1279C    PICTURE X.
           02  IMB1279P    PICTURE X.
           02  IMB1279H    PICTURE X.
           02  IMB1279V    PICTURE X.
           02  IMB1279O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1279C    PICTURE X.
           02  IME1279P    PICTURE X.
           02  IME1279H    PICTURE X.
           02  IME1279V    PICTURE X.
           02  IME1279O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMB1292C    PICTURE X.
           02  IMB1292P    PICTURE X.
           02  IMB1292H    PICTURE X.
           02  IMB1292V    PICTURE X.
           02  IMB1292O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1286C    PICTURE X.
           02  IMB1286P    PICTURE X.
           02  IMB1286H    PICTURE X.
           02  IMB1286V    PICTURE X.
           02  IMB1286O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1286C    PICTURE X.
           02  IME1286P    PICTURE X.
           02  IME1286H    PICTURE X.
           02  IME1286V    PICTURE X.
           02  IME1286O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1280C    PICTURE X.
           02  IMB1280P    PICTURE X.
           02  IMB1280H    PICTURE X.
           02  IMB1280V    PICTURE X.
           02  IMB1280O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1280C    PICTURE X.
           02  IME1280P    PICTURE X.
           02  IME1280H    PICTURE X.
           02  IME1280V    PICTURE X.
           02  IME1280O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMB1293C    PICTURE X.
           02  IMB1293P    PICTURE X.
           02  IMB1293H    PICTURE X.
           02  IMB1293V    PICTURE X.
           02  IMB1293O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1287C    PICTURE X.
           02  IMB1287P    PICTURE X.
           02  IMB1287H    PICTURE X.
           02  IMB1287V    PICTURE X.
           02  IMB1287O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1287C    PICTURE X.
           02  IME1287P    PICTURE X.
           02  IME1287H    PICTURE X.
           02  IME1287V    PICTURE X.
           02  IME1287O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1281C    PICTURE X.
           02  IMB1281P    PICTURE X.
           02  IMB1281H    PICTURE X.
           02  IMB1281V    PICTURE X.
           02  IMB1281O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1281C    PICTURE X.
           02  IME1281P    PICTURE X.
           02  IME1281H    PICTURE X.
           02  IME1281V    PICTURE X.
           02  IME1281O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMB1294C    PICTURE X.
           02  IMB1294P    PICTURE X.
           02  IMB1294H    PICTURE X.
           02  IMB1294V    PICTURE X.
           02  IMB1294O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1288C    PICTURE X.
           02  IMB1288P    PICTURE X.
           02  IMB1288H    PICTURE X.
           02  IMB1288V    PICTURE X.
           02  IMB1288O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1288C    PICTURE X.
           02  IME1288P    PICTURE X.
           02  IME1288H    PICTURE X.
           02  IME1288V    PICTURE X.
           02  IME1288O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1282C    PICTURE X.
           02  IMB1282P    PICTURE X.
           02  IMB1282H    PICTURE X.
           02  IMB1282V    PICTURE X.
           02  IMB1282O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1282C    PICTURE X.
           02  IME1282P    PICTURE X.
           02  IME1282H    PICTURE X.
           02  IME1282V    PICTURE X.
           02  IME1282O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMB1295C    PICTURE X.
           02  IMB1295P    PICTURE X.
           02  IMB1295H    PICTURE X.
           02  IMB1295V    PICTURE X.
           02  IMB1295O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1289C    PICTURE X.
           02  IMB1289P    PICTURE X.
           02  IMB1289H    PICTURE X.
           02  IMB1289V    PICTURE X.
           02  IMB1289O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1289C    PICTURE X.
           02  IME1289P    PICTURE X.
           02  IME1289H    PICTURE X.
           02  IME1289V    PICTURE X.
           02  IME1289O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMPFS12C    PICTURE X.
           02  IMPFS12P    PICTURE X.
           02  IMPFS12H    PICTURE X.
           02  IMPFS12V    PICTURE X.
           02  IMPFS12O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR12C    PICTURE X.
           02  IMERR12P    PICTURE X.
           02  IMERR12H    PICTURE X.
           02  IMERR12V    PICTURE X.
           02  IMERR12O  PIC X(79).
       01  IMB1M13I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN12L    COMP  PIC  S9(4).
           02  IMTRN12F    PICTURE X.
           02  FILLER REDEFINES IMTRN12F.
             03 IMTRN12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN12I  PIC X(4).
           02  BDATE11L    COMP  PIC  S9(4).
           02  BDATE11F    PICTURE X.
           02  FILLER REDEFINES BDATE11F.
             03 BDATE11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE11I  PIC X(8).
           02  BTIME11L    COMP  PIC  S9(4).
           02  BTIME11F    PICTURE X.
           02  FILLER REDEFINES BTIME11F.
             03 BTIME11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME11I  PIC X(8).
           02  IMPGE11L    COMP  PIC  S9(4).
           02  IMPGE11F    PICTURE X.
           02  FILLER REDEFINES IMPGE11F.
             03 IMPGE11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE11I  PIC X(2).
           02  CTL1011L    COMP  PIC  S9(4).
           02  CTL1011F    PICTURE X.
           02  FILLER REDEFINES CTL1011F.
             03 CTL1011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1011I  PIC X(2).
           02  CTL2011L    COMP  PIC  S9(4).
           02  CTL2011F    PICTURE X.
           02  FILLER REDEFINES CTL2011F.
             03 CTL2011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2011I  PIC X(3).
           02  CTL3011L    COMP  PIC  S9(4).
           02  CTL3011F    PICTURE X.
           02  FILLER REDEFINES CTL3011F.
             03 CTL3011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3011I  PIC X(3).
           02  B304401L    COMP  PIC  S9(4).
           02  B304401F    PICTURE X.
           02  FILLER REDEFINES B304401F.
             03 B304401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304401I  PIC X(2).
           02  B304501L    COMP  PIC  S9(4).
           02  B304501F    PICTURE X.
           02  FILLER REDEFINES B304501F.
             03 B304501A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304501I  PIC X(2).
           02  B304801L    COMP  PIC  S9(4).
           02  B304801F    PICTURE X.
           02  FILLER REDEFINES B304801F.
             03 B304801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304801I  PIC X(1).
           02  B304601L    COMP  PIC  S9(4).
           02  B304601F    PICTURE X.
           02  FILLER REDEFINES B304601F.
             03 B304601A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304601I  PIC X(2).
           02  B304701L    COMP  PIC  S9(4).
           02  B304701F    PICTURE X.
           02  FILLER REDEFINES B304701F.
             03 B304701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304701I  PIC X(2).
           02  B304901L    COMP  PIC  S9(4).
           02  B304901F    PICTURE X.
           02  FILLER REDEFINES B304901F.
             03 B304901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304901I  PIC X(1).
           02  B305001L    COMP  PIC  S9(4).
           02  B305001F    PICTURE X.
           02  FILLER REDEFINES B305001F.
             03 B305001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305001I  PIC X(1).
           02  B305101L    COMP  PIC  S9(4).
           02  B305101F    PICTURE X.
           02  FILLER REDEFINES B305101F.
             03 B305101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305101I  PIC X(1).
           02  B305201L    COMP  PIC  S9(4).
           02  B305201F    PICTURE X.
           02  FILLER REDEFINES B305201F.
             03 B305201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305201I  PIC X(1).
           02  B305301L    COMP  PIC  S9(4).
           02  B305301F    PICTURE X.
           02  FILLER REDEFINES B305301F.
             03 B305301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305301I  PIC X(1).
           02  B304402L    COMP  PIC  S9(4).
           02  B304402F    PICTURE X.
           02  FILLER REDEFINES B304402F.
             03 B304402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304402I  PIC X(2).
           02  B304502L    COMP  PIC  S9(4).
           02  B304502F    PICTURE X.
           02  FILLER REDEFINES B304502F.
             03 B304502A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304502I  PIC X(2).
           02  B304802L    COMP  PIC  S9(4).
           02  B304802F    PICTURE X.
           02  FILLER REDEFINES B304802F.
             03 B304802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304802I  PIC X(1).
           02  B304602L    COMP  PIC  S9(4).
           02  B304602F    PICTURE X.
           02  FILLER REDEFINES B304602F.
             03 B304602A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304602I  PIC X(2).
           02  B304702L    COMP  PIC  S9(4).
           02  B304702F    PICTURE X.
           02  FILLER REDEFINES B304702F.
             03 B304702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304702I  PIC X(2).
           02  B304902L    COMP  PIC  S9(4).
           02  B304902F    PICTURE X.
           02  FILLER REDEFINES B304902F.
             03 B304902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304902I  PIC X(1).
           02  B305002L    COMP  PIC  S9(4).
           02  B305002F    PICTURE X.
           02  FILLER REDEFINES B305002F.
             03 B305002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305002I  PIC X(1).
           02  B305102L    COMP  PIC  S9(4).
           02  B305102F    PICTURE X.
           02  FILLER REDEFINES B305102F.
             03 B305102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305102I  PIC X(1).
           02  B305202L    COMP  PIC  S9(4).
           02  B305202F    PICTURE X.
           02  FILLER REDEFINES B305202F.
             03 B305202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305202I  PIC X(1).
           02  B305302L    COMP  PIC  S9(4).
           02  B305302F    PICTURE X.
           02  FILLER REDEFINES B305302F.
             03 B305302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305302I  PIC X(1).
           02  B304403L    COMP  PIC  S9(4).
           02  B304403F    PICTURE X.
           02  FILLER REDEFINES B304403F.
             03 B304403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304403I  PIC X(2).
           02  B304503L    COMP  PIC  S9(4).
           02  B304503F    PICTURE X.
           02  FILLER REDEFINES B304503F.
             03 B304503A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304503I  PIC X(2).
           02  B304803L    COMP  PIC  S9(4).
           02  B304803F    PICTURE X.
           02  FILLER REDEFINES B304803F.
             03 B304803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304803I  PIC X(1).
           02  B304603L    COMP  PIC  S9(4).
           02  B304603F    PICTURE X.
           02  FILLER REDEFINES B304603F.
             03 B304603A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304603I  PIC X(2).
           02  B304703L    COMP  PIC  S9(4).
           02  B304703F    PICTURE X.
           02  FILLER REDEFINES B304703F.
             03 B304703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304703I  PIC X(2).
           02  B304903L    COMP  PIC  S9(4).
           02  B304903F    PICTURE X.
           02  FILLER REDEFINES B304903F.
             03 B304903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304903I  PIC X(1).
           02  B305003L    COMP  PIC  S9(4).
           02  B305003F    PICTURE X.
           02  FILLER REDEFINES B305003F.
             03 B305003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305003I  PIC X(1).
           02  B305103L    COMP  PIC  S9(4).
           02  B305103F    PICTURE X.
           02  FILLER REDEFINES B305103F.
             03 B305103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305103I  PIC X(1).
           02  B305203L    COMP  PIC  S9(4).
           02  B305203F    PICTURE X.
           02  FILLER REDEFINES B305203F.
             03 B305203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305203I  PIC X(1).
           02  B305303L    COMP  PIC  S9(4).
           02  B305303F    PICTURE X.
           02  FILLER REDEFINES B305303F.
             03 B305303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305303I  PIC X(1).
           02  B304404L    COMP  PIC  S9(4).
           02  B304404F    PICTURE X.
           02  FILLER REDEFINES B304404F.
             03 B304404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304404I  PIC X(2).
           02  B304504L    COMP  PIC  S9(4).
           02  B304504F    PICTURE X.
           02  FILLER REDEFINES B304504F.
             03 B304504A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304504I  PIC X(2).
           02  B304804L    COMP  PIC  S9(4).
           02  B304804F    PICTURE X.
           02  FILLER REDEFINES B304804F.
             03 B304804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304804I  PIC X(1).
           02  B304604L    COMP  PIC  S9(4).
           02  B304604F    PICTURE X.
           02  FILLER REDEFINES B304604F.
             03 B304604A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304604I  PIC X(2).
           02  B304704L    COMP  PIC  S9(4).
           02  B304704F    PICTURE X.
           02  FILLER REDEFINES B304704F.
             03 B304704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304704I  PIC X(2).
           02  B304904L    COMP  PIC  S9(4).
           02  B304904F    PICTURE X.
           02  FILLER REDEFINES B304904F.
             03 B304904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304904I  PIC X(1).
           02  B305004L    COMP  PIC  S9(4).
           02  B305004F    PICTURE X.
           02  FILLER REDEFINES B305004F.
             03 B305004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305004I  PIC X(1).
           02  B305104L    COMP  PIC  S9(4).
           02  B305104F    PICTURE X.
           02  FILLER REDEFINES B305104F.
             03 B305104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305104I  PIC X(1).
           02  B305204L    COMP  PIC  S9(4).
           02  B305204F    PICTURE X.
           02  FILLER REDEFINES B305204F.
             03 B305204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305204I  PIC X(1).
           02  B305304L    COMP  PIC  S9(4).
           02  B305304F    PICTURE X.
           02  FILLER REDEFINES B305304F.
             03 B305304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305304I  PIC X(1).
           02  B304405L    COMP  PIC  S9(4).
           02  B304405F    PICTURE X.
           02  FILLER REDEFINES B304405F.
             03 B304405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304405I  PIC X(2).
           02  B304505L    COMP  PIC  S9(4).
           02  B304505F    PICTURE X.
           02  FILLER REDEFINES B304505F.
             03 B304505A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304505I  PIC X(2).
           02  B304805L    COMP  PIC  S9(4).
           02  B304805F    PICTURE X.
           02  FILLER REDEFINES B304805F.
             03 B304805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304805I  PIC X(1).
           02  B304605L    COMP  PIC  S9(4).
           02  B304605F    PICTURE X.
           02  FILLER REDEFINES B304605F.
             03 B304605A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304605I  PIC X(2).
           02  B304705L    COMP  PIC  S9(4).
           02  B304705F    PICTURE X.
           02  FILLER REDEFINES B304705F.
             03 B304705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304705I  PIC X(2).
           02  B304905L    COMP  PIC  S9(4).
           02  B304905F    PICTURE X.
           02  FILLER REDEFINES B304905F.
             03 B304905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304905I  PIC X(1).
           02  B305005L    COMP  PIC  S9(4).
           02  B305005F    PICTURE X.
           02  FILLER REDEFINES B305005F.
             03 B305005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305005I  PIC X(1).
           02  B305105L    COMP  PIC  S9(4).
           02  B305105F    PICTURE X.
           02  FILLER REDEFINES B305105F.
             03 B305105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305105I  PIC X(1).
           02  B305205L    COMP  PIC  S9(4).
           02  B305205F    PICTURE X.
           02  FILLER REDEFINES B305205F.
             03 B305205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305205I  PIC X(1).
           02  B305305L    COMP  PIC  S9(4).
           02  B305305F    PICTURE X.
           02  FILLER REDEFINES B305305F.
             03 B305305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305305I  PIC X(1).
           02  B304406L    COMP  PIC  S9(4).
           02  B304406F    PICTURE X.
           02  FILLER REDEFINES B304406F.
             03 B304406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304406I  PIC X(2).
           02  B304506L    COMP  PIC  S9(4).
           02  B304506F    PICTURE X.
           02  FILLER REDEFINES B304506F.
             03 B304506A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304506I  PIC X(2).
           02  B304806L    COMP  PIC  S9(4).
           02  B304806F    PICTURE X.
           02  FILLER REDEFINES B304806F.
             03 B304806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304806I  PIC X(1).
           02  B304606L    COMP  PIC  S9(4).
           02  B304606F    PICTURE X.
           02  FILLER REDEFINES B304606F.
             03 B304606A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304606I  PIC X(2).
           02  B304706L    COMP  PIC  S9(4).
           02  B304706F    PICTURE X.
           02  FILLER REDEFINES B304706F.
             03 B304706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304706I  PIC X(2).
           02  B304906L    COMP  PIC  S9(4).
           02  B304906F    PICTURE X.
           02  FILLER REDEFINES B304906F.
             03 B304906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304906I  PIC X(1).
           02  B305006L    COMP  PIC  S9(4).
           02  B305006F    PICTURE X.
           02  FILLER REDEFINES B305006F.
             03 B305006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305006I  PIC X(1).
           02  B305106L    COMP  PIC  S9(4).
           02  B305106F    PICTURE X.
           02  FILLER REDEFINES B305106F.
             03 B305106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305106I  PIC X(1).
           02  B305206L    COMP  PIC  S9(4).
           02  B305206F    PICTURE X.
           02  FILLER REDEFINES B305206F.
             03 B305206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305206I  PIC X(1).
           02  B305306L    COMP  PIC  S9(4).
           02  B305306F    PICTURE X.
           02  FILLER REDEFINES B305306F.
             03 B305306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305306I  PIC X(1).
           02  B304407L    COMP  PIC  S9(4).
           02  B304407F    PICTURE X.
           02  FILLER REDEFINES B304407F.
             03 B304407A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304407I  PIC X(2).
           02  B304507L    COMP  PIC  S9(4).
           02  B304507F    PICTURE X.
           02  FILLER REDEFINES B304507F.
             03 B304507A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304507I  PIC X(2).
           02  B304807L    COMP  PIC  S9(4).
           02  B304807F    PICTURE X.
           02  FILLER REDEFINES B304807F.
             03 B304807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304807I  PIC X(1).
           02  B304607L    COMP  PIC  S9(4).
           02  B304607F    PICTURE X.
           02  FILLER REDEFINES B304607F.
             03 B304607A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304607I  PIC X(2).
           02  B304707L    COMP  PIC  S9(4).
           02  B304707F    PICTURE X.
           02  FILLER REDEFINES B304707F.
             03 B304707A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304707I  PIC X(2).
           02  B304907L    COMP  PIC  S9(4).
           02  B304907F    PICTURE X.
           02  FILLER REDEFINES B304907F.
             03 B304907A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304907I  PIC X(1).
           02  B305007L    COMP  PIC  S9(4).
           02  B305007F    PICTURE X.
           02  FILLER REDEFINES B305007F.
             03 B305007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305007I  PIC X(1).
           02  B305107L    COMP  PIC  S9(4).
           02  B305107F    PICTURE X.
           02  FILLER REDEFINES B305107F.
             03 B305107A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305107I  PIC X(1).
           02  B305207L    COMP  PIC  S9(4).
           02  B305207F    PICTURE X.
           02  FILLER REDEFINES B305207F.
             03 B305207A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305207I  PIC X(1).
           02  B305307L    COMP  PIC  S9(4).
           02  B305307F    PICTURE X.
           02  FILLER REDEFINES B305307F.
             03 B305307A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305307I  PIC X(1).
           02  B304408L    COMP  PIC  S9(4).
           02  B304408F    PICTURE X.
           02  FILLER REDEFINES B304408F.
             03 B304408A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304408I  PIC X(2).
           02  B304508L    COMP  PIC  S9(4).
           02  B304508F    PICTURE X.
           02  FILLER REDEFINES B304508F.
             03 B304508A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304508I  PIC X(2).
           02  B304808L    COMP  PIC  S9(4).
           02  B304808F    PICTURE X.
           02  FILLER REDEFINES B304808F.
             03 B304808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304808I  PIC X(1).
           02  B304608L    COMP  PIC  S9(4).
           02  B304608F    PICTURE X.
           02  FILLER REDEFINES B304608F.
             03 B304608A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304608I  PIC X(2).
           02  B304708L    COMP  PIC  S9(4).
           02  B304708F    PICTURE X.
           02  FILLER REDEFINES B304708F.
             03 B304708A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304708I  PIC X(2).
           02  B304908L    COMP  PIC  S9(4).
           02  B304908F    PICTURE X.
           02  FILLER REDEFINES B304908F.
             03 B304908A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304908I  PIC X(1).
           02  B305008L    COMP  PIC  S9(4).
           02  B305008F    PICTURE X.
           02  FILLER REDEFINES B305008F.
             03 B305008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305008I  PIC X(1).
           02  B305108L    COMP  PIC  S9(4).
           02  B305108F    PICTURE X.
           02  FILLER REDEFINES B305108F.
             03 B305108A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305108I  PIC X(1).
           02  B305208L    COMP  PIC  S9(4).
           02  B305208F    PICTURE X.
           02  FILLER REDEFINES B305208F.
             03 B305208A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305208I  PIC X(1).
           02  B305308L    COMP  PIC  S9(4).
           02  B305308F    PICTURE X.
           02  FILLER REDEFINES B305308F.
             03 B305308A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305308I  PIC X(1).
           02  B304409L    COMP  PIC  S9(4).
           02  B304409F    PICTURE X.
           02  FILLER REDEFINES B304409F.
             03 B304409A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304409I  PIC X(2).
           02  B304509L    COMP  PIC  S9(4).
           02  B304509F    PICTURE X.
           02  FILLER REDEFINES B304509F.
             03 B304509A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304509I  PIC X(2).
           02  B304809L    COMP  PIC  S9(4).
           02  B304809F    PICTURE X.
           02  FILLER REDEFINES B304809F.
             03 B304809A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304809I  PIC X(1).
           02  B304609L    COMP  PIC  S9(4).
           02  B304609F    PICTURE X.
           02  FILLER REDEFINES B304609F.
             03 B304609A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304609I  PIC X(2).
           02  B304709L    COMP  PIC  S9(4).
           02  B304709F    PICTURE X.
           02  FILLER REDEFINES B304709F.
             03 B304709A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304709I  PIC X(2).
           02  B304909L    COMP  PIC  S9(4).
           02  B304909F    PICTURE X.
           02  FILLER REDEFINES B304909F.
             03 B304909A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304909I  PIC X(1).
           02  B305009L    COMP  PIC  S9(4).
           02  B305009F    PICTURE X.
           02  FILLER REDEFINES B305009F.
             03 B305009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305009I  PIC X(1).
           02  B305109L    COMP  PIC  S9(4).
           02  B305109F    PICTURE X.
           02  FILLER REDEFINES B305109F.
             03 B305109A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305109I  PIC X(1).
           02  B305209L    COMP  PIC  S9(4).
           02  B305209F    PICTURE X.
           02  FILLER REDEFINES B305209F.
             03 B305209A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305209I  PIC X(1).
           02  B305309L    COMP  PIC  S9(4).
           02  B305309F    PICTURE X.
           02  FILLER REDEFINES B305309F.
             03 B305309A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305309I  PIC X(1).
           02  B304410L    COMP  PIC  S9(4).
           02  B304410F    PICTURE X.
           02  FILLER REDEFINES B304410F.
             03 B304410A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304410I  PIC X(2).
           02  B304510L    COMP  PIC  S9(4).
           02  B304510F    PICTURE X.
           02  FILLER REDEFINES B304510F.
             03 B304510A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304510I  PIC X(2).
           02  B304810L    COMP  PIC  S9(4).
           02  B304810F    PICTURE X.
           02  FILLER REDEFINES B304810F.
             03 B304810A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304810I  PIC X(1).
           02  B304610L    COMP  PIC  S9(4).
           02  B304610F    PICTURE X.
           02  FILLER REDEFINES B304610F.
             03 B304610A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304610I  PIC X(2).
           02  B304710L    COMP  PIC  S9(4).
           02  B304710F    PICTURE X.
           02  FILLER REDEFINES B304710F.
             03 B304710A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304710I  PIC X(2).
           02  B304910L    COMP  PIC  S9(4).
           02  B304910F    PICTURE X.
           02  FILLER REDEFINES B304910F.
             03 B304910A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304910I  PIC X(1).
           02  B305010L    COMP  PIC  S9(4).
           02  B305010F    PICTURE X.
           02  FILLER REDEFINES B305010F.
             03 B305010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305010I  PIC X(1).
           02  B305110L    COMP  PIC  S9(4).
           02  B305110F    PICTURE X.
           02  FILLER REDEFINES B305110F.
             03 B305110A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305110I  PIC X(1).
           02  B305210L    COMP  PIC  S9(4).
           02  B305210F    PICTURE X.
           02  FILLER REDEFINES B305210F.
             03 B305210A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305210I  PIC X(1).
           02  B305310L    COMP  PIC  S9(4).
           02  B305310F    PICTURE X.
           02  FILLER REDEFINES B305310F.
             03 B305310A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305310I  PIC X(1).
           02  B304411L    COMP  PIC  S9(4).
           02  B304411F    PICTURE X.
           02  FILLER REDEFINES B304411F.
             03 B304411A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304411I  PIC X(2).
           02  B304511L    COMP  PIC  S9(4).
           02  B304511F    PICTURE X.
           02  FILLER REDEFINES B304511F.
             03 B304511A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304511I  PIC X(2).
           02  B304811L    COMP  PIC  S9(4).
           02  B304811F    PICTURE X.
           02  FILLER REDEFINES B304811F.
             03 B304811A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304811I  PIC X(1).
           02  B304611L    COMP  PIC  S9(4).
           02  B304611F    PICTURE X.
           02  FILLER REDEFINES B304611F.
             03 B304611A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304611I  PIC X(2).
           02  B304711L    COMP  PIC  S9(4).
           02  B304711F    PICTURE X.
           02  FILLER REDEFINES B304711F.
             03 B304711A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304711I  PIC X(2).
           02  B304911L    COMP  PIC  S9(4).
           02  B304911F    PICTURE X.
           02  FILLER REDEFINES B304911F.
             03 B304911A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304911I  PIC X(1).
           02  B305011L    COMP  PIC  S9(4).
           02  B305011F    PICTURE X.
           02  FILLER REDEFINES B305011F.
             03 B305011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305011I  PIC X(1).
           02  B305111L    COMP  PIC  S9(4).
           02  B305111F    PICTURE X.
           02  FILLER REDEFINES B305111F.
             03 B305111A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305111I  PIC X(1).
           02  B305211L    COMP  PIC  S9(4).
           02  B305211F    PICTURE X.
           02  FILLER REDEFINES B305211F.
             03 B305211A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305211I  PIC X(1).
           02  B305311L    COMP  PIC  S9(4).
           02  B305311F    PICTURE X.
           02  FILLER REDEFINES B305311F.
             03 B305311A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305311I  PIC X(1).
           02  B304412L    COMP  PIC  S9(4).
           02  B304412F    PICTURE X.
           02  FILLER REDEFINES B304412F.
             03 B304412A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304412I  PIC X(2).
           02  B304512L    COMP  PIC  S9(4).
           02  B304512F    PICTURE X.
           02  FILLER REDEFINES B304512F.
             03 B304512A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304512I  PIC X(2).
           02  B304812L    COMP  PIC  S9(4).
           02  B304812F    PICTURE X.
           02  FILLER REDEFINES B304812F.
             03 B304812A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304812I  PIC X(1).
           02  B304612L    COMP  PIC  S9(4).
           02  B304612F    PICTURE X.
           02  FILLER REDEFINES B304612F.
             03 B304612A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304612I  PIC X(2).
           02  B304712L    COMP  PIC  S9(4).
           02  B304712F    PICTURE X.
           02  FILLER REDEFINES B304712F.
             03 B304712A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304712I  PIC X(2).
           02  B304912L    COMP  PIC  S9(4).
           02  B304912F    PICTURE X.
           02  FILLER REDEFINES B304912F.
             03 B304912A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304912I  PIC X(1).
           02  B305012L    COMP  PIC  S9(4).
           02  B305012F    PICTURE X.
           02  FILLER REDEFINES B305012F.
             03 B305012A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305012I  PIC X(1).
           02  B305112L    COMP  PIC  S9(4).
           02  B305112F    PICTURE X.
           02  FILLER REDEFINES B305112F.
             03 B305112A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305112I  PIC X(1).
           02  B305212L    COMP  PIC  S9(4).
           02  B305212F    PICTURE X.
           02  FILLER REDEFINES B305212F.
             03 B305212A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305212I  PIC X(1).
           02  B305312L    COMP  PIC  S9(4).
           02  B305312F    PICTURE X.
           02  FILLER REDEFINES B305312F.
             03 B305312A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305312I  PIC X(1).
           02  B304413L    COMP  PIC  S9(4).
           02  B304413F    PICTURE X.
           02  FILLER REDEFINES B304413F.
             03 B304413A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304413I  PIC X(2).
           02  B304513L    COMP  PIC  S9(4).
           02  B304513F    PICTURE X.
           02  FILLER REDEFINES B304513F.
             03 B304513A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304513I  PIC X(2).
           02  B304813L    COMP  PIC  S9(4).
           02  B304813F    PICTURE X.
           02  FILLER REDEFINES B304813F.
             03 B304813A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304813I  PIC X(1).
           02  B304613L    COMP  PIC  S9(4).
           02  B304613F    PICTURE X.
           02  FILLER REDEFINES B304613F.
             03 B304613A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304613I  PIC X(2).
           02  B304713L    COMP  PIC  S9(4).
           02  B304713F    PICTURE X.
           02  FILLER REDEFINES B304713F.
             03 B304713A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304713I  PIC X(2).
           02  B304913L    COMP  PIC  S9(4).
           02  B304913F    PICTURE X.
           02  FILLER REDEFINES B304913F.
             03 B304913A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304913I  PIC X(1).
           02  B305013L    COMP  PIC  S9(4).
           02  B305013F    PICTURE X.
           02  FILLER REDEFINES B305013F.
             03 B305013A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305013I  PIC X(1).
           02  B305113L    COMP  PIC  S9(4).
           02  B305113F    PICTURE X.
           02  FILLER REDEFINES B305113F.
             03 B305113A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305113I  PIC X(1).
           02  B305213L    COMP  PIC  S9(4).
           02  B305213F    PICTURE X.
           02  FILLER REDEFINES B305213F.
             03 B305213A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305213I  PIC X(1).
           02  B305313L    COMP  PIC  S9(4).
           02  B305313F    PICTURE X.
           02  FILLER REDEFINES B305313F.
             03 B305313A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305313I  PIC X(1).
           02  B304414L    COMP  PIC  S9(4).
           02  B304414F    PICTURE X.
           02  FILLER REDEFINES B304414F.
             03 B304414A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304414I  PIC X(2).
           02  B304514L    COMP  PIC  S9(4).
           02  B304514F    PICTURE X.
           02  FILLER REDEFINES B304514F.
             03 B304514A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304514I  PIC X(2).
           02  B304814L    COMP  PIC  S9(4).
           02  B304814F    PICTURE X.
           02  FILLER REDEFINES B304814F.
             03 B304814A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304814I  PIC X(1).
           02  B304614L    COMP  PIC  S9(4).
           02  B304614F    PICTURE X.
           02  FILLER REDEFINES B304614F.
             03 B304614A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304614I  PIC X(2).
           02  B304714L    COMP  PIC  S9(4).
           02  B304714F    PICTURE X.
           02  FILLER REDEFINES B304714F.
             03 B304714A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304714I  PIC X(2).
           02  B304914L    COMP  PIC  S9(4).
           02  B304914F    PICTURE X.
           02  FILLER REDEFINES B304914F.
             03 B304914A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304914I  PIC X(1).
           02  B305014L    COMP  PIC  S9(4).
           02  B305014F    PICTURE X.
           02  FILLER REDEFINES B305014F.
             03 B305014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305014I  PIC X(1).
           02  B305114L    COMP  PIC  S9(4).
           02  B305114F    PICTURE X.
           02  FILLER REDEFINES B305114F.
             03 B305114A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305114I  PIC X(1).
           02  B305214L    COMP  PIC  S9(4).
           02  B305214F    PICTURE X.
           02  FILLER REDEFINES B305214F.
             03 B305214A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305214I  PIC X(1).
           02  B305314L    COMP  PIC  S9(4).
           02  B305314F    PICTURE X.
           02  FILLER REDEFINES B305314F.
             03 B305314A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305314I  PIC X(1).
           02  IMPFS13L    COMP  PIC  S9(4).
           02  IMPFS13F    PICTURE X.
           02  FILLER REDEFINES IMPFS13F.
             03 IMPFS13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS13I  PIC X(79).
           02  IMERR13L    COMP  PIC  S9(4).
           02  IMERR13F    PICTURE X.
           02  FILLER REDEFINES IMERR13F.
             03 IMERR13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR13I  PIC X(79).
       01  IMB1M13O REDEFINES IMB1M13I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN12C    PICTURE X.
           02  IMTRN12P    PICTURE X.
           02  IMTRN12H    PICTURE X.
           02  IMTRN12V    PICTURE X.
           02  IMTRN12O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE11C    PICTURE X.
           02  BDATE11P    PICTURE X.
           02  BDATE11H    PICTURE X.
           02  BDATE11V    PICTURE X.
           02  BDATE11O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME11C    PICTURE X.
           02  BTIME11P    PICTURE X.
           02  BTIME11H    PICTURE X.
           02  BTIME11V    PICTURE X.
           02  BTIME11O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE11C    PICTURE X.
           02  IMPGE11P    PICTURE X.
           02  IMPGE11H    PICTURE X.
           02  IMPGE11V    PICTURE X.
           02  IMPGE11O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1011C    PICTURE X.
           02  CTL1011P    PICTURE X.
           02  CTL1011H    PICTURE X.
           02  CTL1011V    PICTURE X.
           02  CTL1011O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2011C    PICTURE X.
           02  CTL2011P    PICTURE X.
           02  CTL2011H    PICTURE X.
           02  CTL2011V    PICTURE X.
           02  CTL2011O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3011C    PICTURE X.
           02  CTL3011P    PICTURE X.
           02  CTL3011H    PICTURE X.
           02  CTL3011V    PICTURE X.
           02  CTL3011O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B304401C    PICTURE X.
           02  B304401P    PICTURE X.
           02  B304401H    PICTURE X.
           02  B304401V    PICTURE X.
           02  B304401O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304501C    PICTURE X.
           02  B304501P    PICTURE X.
           02  B304501H    PICTURE X.
           02  B304501V    PICTURE X.
           02  B304501O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304801C    PICTURE X.
           02  B304801P    PICTURE X.
           02  B304801H    PICTURE X.
           02  B304801V    PICTURE X.
           02  B304801O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304601C    PICTURE X.
           02  B304601P    PICTURE X.
           02  B304601H    PICTURE X.
           02  B304601V    PICTURE X.
           02  B304601O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304701C    PICTURE X.
           02  B304701P    PICTURE X.
           02  B304701H    PICTURE X.
           02  B304701V    PICTURE X.
           02  B304701O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304901C    PICTURE X.
           02  B304901P    PICTURE X.
           02  B304901H    PICTURE X.
           02  B304901V    PICTURE X.
           02  B304901O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305001C    PICTURE X.
           02  B305001P    PICTURE X.
           02  B305001H    PICTURE X.
           02  B305001V    PICTURE X.
           02  B305001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305101C    PICTURE X.
           02  B305101P    PICTURE X.
           02  B305101H    PICTURE X.
           02  B305101V    PICTURE X.
           02  B305101O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305201C    PICTURE X.
           02  B305201P    PICTURE X.
           02  B305201H    PICTURE X.
           02  B305201V    PICTURE X.
           02  B305201O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305301C    PICTURE X.
           02  B305301P    PICTURE X.
           02  B305301H    PICTURE X.
           02  B305301V    PICTURE X.
           02  B305301O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304402C    PICTURE X.
           02  B304402P    PICTURE X.
           02  B304402H    PICTURE X.
           02  B304402V    PICTURE X.
           02  B304402O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304502C    PICTURE X.
           02  B304502P    PICTURE X.
           02  B304502H    PICTURE X.
           02  B304502V    PICTURE X.
           02  B304502O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304802C    PICTURE X.
           02  B304802P    PICTURE X.
           02  B304802H    PICTURE X.
           02  B304802V    PICTURE X.
           02  B304802O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304602C    PICTURE X.
           02  B304602P    PICTURE X.
           02  B304602H    PICTURE X.
           02  B304602V    PICTURE X.
           02  B304602O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304702C    PICTURE X.
           02  B304702P    PICTURE X.
           02  B304702H    PICTURE X.
           02  B304702V    PICTURE X.
           02  B304702O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304902C    PICTURE X.
           02  B304902P    PICTURE X.
           02  B304902H    PICTURE X.
           02  B304902V    PICTURE X.
           02  B304902O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305002C    PICTURE X.
           02  B305002P    PICTURE X.
           02  B305002H    PICTURE X.
           02  B305002V    PICTURE X.
           02  B305002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305102C    PICTURE X.
           02  B305102P    PICTURE X.
           02  B305102H    PICTURE X.
           02  B305102V    PICTURE X.
           02  B305102O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305202C    PICTURE X.
           02  B305202P    PICTURE X.
           02  B305202H    PICTURE X.
           02  B305202V    PICTURE X.
           02  B305202O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305302C    PICTURE X.
           02  B305302P    PICTURE X.
           02  B305302H    PICTURE X.
           02  B305302V    PICTURE X.
           02  B305302O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304403C    PICTURE X.
           02  B304403P    PICTURE X.
           02  B304403H    PICTURE X.
           02  B304403V    PICTURE X.
           02  B304403O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304503C    PICTURE X.
           02  B304503P    PICTURE X.
           02  B304503H    PICTURE X.
           02  B304503V    PICTURE X.
           02  B304503O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304803C    PICTURE X.
           02  B304803P    PICTURE X.
           02  B304803H    PICTURE X.
           02  B304803V    PICTURE X.
           02  B304803O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304603C    PICTURE X.
           02  B304603P    PICTURE X.
           02  B304603H    PICTURE X.
           02  B304603V    PICTURE X.
           02  B304603O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304703C    PICTURE X.
           02  B304703P    PICTURE X.
           02  B304703H    PICTURE X.
           02  B304703V    PICTURE X.
           02  B304703O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304903C    PICTURE X.
           02  B304903P    PICTURE X.
           02  B304903H    PICTURE X.
           02  B304903V    PICTURE X.
           02  B304903O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305003C    PICTURE X.
           02  B305003P    PICTURE X.
           02  B305003H    PICTURE X.
           02  B305003V    PICTURE X.
           02  B305003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305103C    PICTURE X.
           02  B305103P    PICTURE X.
           02  B305103H    PICTURE X.
           02  B305103V    PICTURE X.
           02  B305103O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305203C    PICTURE X.
           02  B305203P    PICTURE X.
           02  B305203H    PICTURE X.
           02  B305203V    PICTURE X.
           02  B305203O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305303C    PICTURE X.
           02  B305303P    PICTURE X.
           02  B305303H    PICTURE X.
           02  B305303V    PICTURE X.
           02  B305303O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304404C    PICTURE X.
           02  B304404P    PICTURE X.
           02  B304404H    PICTURE X.
           02  B304404V    PICTURE X.
           02  B304404O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304504C    PICTURE X.
           02  B304504P    PICTURE X.
           02  B304504H    PICTURE X.
           02  B304504V    PICTURE X.
           02  B304504O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304804C    PICTURE X.
           02  B304804P    PICTURE X.
           02  B304804H    PICTURE X.
           02  B304804V    PICTURE X.
           02  B304804O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304604C    PICTURE X.
           02  B304604P    PICTURE X.
           02  B304604H    PICTURE X.
           02  B304604V    PICTURE X.
           02  B304604O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304704C    PICTURE X.
           02  B304704P    PICTURE X.
           02  B304704H    PICTURE X.
           02  B304704V    PICTURE X.
           02  B304704O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304904C    PICTURE X.
           02  B304904P    PICTURE X.
           02  B304904H    PICTURE X.
           02  B304904V    PICTURE X.
           02  B304904O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305004C    PICTURE X.
           02  B305004P    PICTURE X.
           02  B305004H    PICTURE X.
           02  B305004V    PICTURE X.
           02  B305004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305104C    PICTURE X.
           02  B305104P    PICTURE X.
           02  B305104H    PICTURE X.
           02  B305104V    PICTURE X.
           02  B305104O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305204C    PICTURE X.
           02  B305204P    PICTURE X.
           02  B305204H    PICTURE X.
           02  B305204V    PICTURE X.
           02  B305204O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305304C    PICTURE X.
           02  B305304P    PICTURE X.
           02  B305304H    PICTURE X.
           02  B305304V    PICTURE X.
           02  B305304O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304405C    PICTURE X.
           02  B304405P    PICTURE X.
           02  B304405H    PICTURE X.
           02  B304405V    PICTURE X.
           02  B304405O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304505C    PICTURE X.
           02  B304505P    PICTURE X.
           02  B304505H    PICTURE X.
           02  B304505V    PICTURE X.
           02  B304505O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304805C    PICTURE X.
           02  B304805P    PICTURE X.
           02  B304805H    PICTURE X.
           02  B304805V    PICTURE X.
           02  B304805O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304605C    PICTURE X.
           02  B304605P    PICTURE X.
           02  B304605H    PICTURE X.
           02  B304605V    PICTURE X.
           02  B304605O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304705C    PICTURE X.
           02  B304705P    PICTURE X.
           02  B304705H    PICTURE X.
           02  B304705V    PICTURE X.
           02  B304705O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304905C    PICTURE X.
           02  B304905P    PICTURE X.
           02  B304905H    PICTURE X.
           02  B304905V    PICTURE X.
           02  B304905O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305005C    PICTURE X.
           02  B305005P    PICTURE X.
           02  B305005H    PICTURE X.
           02  B305005V    PICTURE X.
           02  B305005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305105C    PICTURE X.
           02  B305105P    PICTURE X.
           02  B305105H    PICTURE X.
           02  B305105V    PICTURE X.
           02  B305105O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305205C    PICTURE X.
           02  B305205P    PICTURE X.
           02  B305205H    PICTURE X.
           02  B305205V    PICTURE X.
           02  B305205O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305305C    PICTURE X.
           02  B305305P    PICTURE X.
           02  B305305H    PICTURE X.
           02  B305305V    PICTURE X.
           02  B305305O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304406C    PICTURE X.
           02  B304406P    PICTURE X.
           02  B304406H    PICTURE X.
           02  B304406V    PICTURE X.
           02  B304406O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304506C    PICTURE X.
           02  B304506P    PICTURE X.
           02  B304506H    PICTURE X.
           02  B304506V    PICTURE X.
           02  B304506O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304806C    PICTURE X.
           02  B304806P    PICTURE X.
           02  B304806H    PICTURE X.
           02  B304806V    PICTURE X.
           02  B304806O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304606C    PICTURE X.
           02  B304606P    PICTURE X.
           02  B304606H    PICTURE X.
           02  B304606V    PICTURE X.
           02  B304606O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304706C    PICTURE X.
           02  B304706P    PICTURE X.
           02  B304706H    PICTURE X.
           02  B304706V    PICTURE X.
           02  B304706O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304906C    PICTURE X.
           02  B304906P    PICTURE X.
           02  B304906H    PICTURE X.
           02  B304906V    PICTURE X.
           02  B304906O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305006C    PICTURE X.
           02  B305006P    PICTURE X.
           02  B305006H    PICTURE X.
           02  B305006V    PICTURE X.
           02  B305006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305106C    PICTURE X.
           02  B305106P    PICTURE X.
           02  B305106H    PICTURE X.
           02  B305106V    PICTURE X.
           02  B305106O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305206C    PICTURE X.
           02  B305206P    PICTURE X.
           02  B305206H    PICTURE X.
           02  B305206V    PICTURE X.
           02  B305206O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305306C    PICTURE X.
           02  B305306P    PICTURE X.
           02  B305306H    PICTURE X.
           02  B305306V    PICTURE X.
           02  B305306O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304407C    PICTURE X.
           02  B304407P    PICTURE X.
           02  B304407H    PICTURE X.
           02  B304407V    PICTURE X.
           02  B304407O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304507C    PICTURE X.
           02  B304507P    PICTURE X.
           02  B304507H    PICTURE X.
           02  B304507V    PICTURE X.
           02  B304507O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304807C    PICTURE X.
           02  B304807P    PICTURE X.
           02  B304807H    PICTURE X.
           02  B304807V    PICTURE X.
           02  B304807O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304607C    PICTURE X.
           02  B304607P    PICTURE X.
           02  B304607H    PICTURE X.
           02  B304607V    PICTURE X.
           02  B304607O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304707C    PICTURE X.
           02  B304707P    PICTURE X.
           02  B304707H    PICTURE X.
           02  B304707V    PICTURE X.
           02  B304707O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304907C    PICTURE X.
           02  B304907P    PICTURE X.
           02  B304907H    PICTURE X.
           02  B304907V    PICTURE X.
           02  B304907O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305007C    PICTURE X.
           02  B305007P    PICTURE X.
           02  B305007H    PICTURE X.
           02  B305007V    PICTURE X.
           02  B305007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305107C    PICTURE X.
           02  B305107P    PICTURE X.
           02  B305107H    PICTURE X.
           02  B305107V    PICTURE X.
           02  B305107O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305207C    PICTURE X.
           02  B305207P    PICTURE X.
           02  B305207H    PICTURE X.
           02  B305207V    PICTURE X.
           02  B305207O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305307C    PICTURE X.
           02  B305307P    PICTURE X.
           02  B305307H    PICTURE X.
           02  B305307V    PICTURE X.
           02  B305307O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304408C    PICTURE X.
           02  B304408P    PICTURE X.
           02  B304408H    PICTURE X.
           02  B304408V    PICTURE X.
           02  B304408O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304508C    PICTURE X.
           02  B304508P    PICTURE X.
           02  B304508H    PICTURE X.
           02  B304508V    PICTURE X.
           02  B304508O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304808C    PICTURE X.
           02  B304808P    PICTURE X.
           02  B304808H    PICTURE X.
           02  B304808V    PICTURE X.
           02  B304808O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304608C    PICTURE X.
           02  B304608P    PICTURE X.
           02  B304608H    PICTURE X.
           02  B304608V    PICTURE X.
           02  B304608O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304708C    PICTURE X.
           02  B304708P    PICTURE X.
           02  B304708H    PICTURE X.
           02  B304708V    PICTURE X.
           02  B304708O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304908C    PICTURE X.
           02  B304908P    PICTURE X.
           02  B304908H    PICTURE X.
           02  B304908V    PICTURE X.
           02  B304908O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305008C    PICTURE X.
           02  B305008P    PICTURE X.
           02  B305008H    PICTURE X.
           02  B305008V    PICTURE X.
           02  B305008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305108C    PICTURE X.
           02  B305108P    PICTURE X.
           02  B305108H    PICTURE X.
           02  B305108V    PICTURE X.
           02  B305108O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305208C    PICTURE X.
           02  B305208P    PICTURE X.
           02  B305208H    PICTURE X.
           02  B305208V    PICTURE X.
           02  B305208O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305308C    PICTURE X.
           02  B305308P    PICTURE X.
           02  B305308H    PICTURE X.
           02  B305308V    PICTURE X.
           02  B305308O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304409C    PICTURE X.
           02  B304409P    PICTURE X.
           02  B304409H    PICTURE X.
           02  B304409V    PICTURE X.
           02  B304409O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304509C    PICTURE X.
           02  B304509P    PICTURE X.
           02  B304509H    PICTURE X.
           02  B304509V    PICTURE X.
           02  B304509O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304809C    PICTURE X.
           02  B304809P    PICTURE X.
           02  B304809H    PICTURE X.
           02  B304809V    PICTURE X.
           02  B304809O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304609C    PICTURE X.
           02  B304609P    PICTURE X.
           02  B304609H    PICTURE X.
           02  B304609V    PICTURE X.
           02  B304609O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304709C    PICTURE X.
           02  B304709P    PICTURE X.
           02  B304709H    PICTURE X.
           02  B304709V    PICTURE X.
           02  B304709O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304909C    PICTURE X.
           02  B304909P    PICTURE X.
           02  B304909H    PICTURE X.
           02  B304909V    PICTURE X.
           02  B304909O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305009C    PICTURE X.
           02  B305009P    PICTURE X.
           02  B305009H    PICTURE X.
           02  B305009V    PICTURE X.
           02  B305009O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305109C    PICTURE X.
           02  B305109P    PICTURE X.
           02  B305109H    PICTURE X.
           02  B305109V    PICTURE X.
           02  B305109O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305209C    PICTURE X.
           02  B305209P    PICTURE X.
           02  B305209H    PICTURE X.
           02  B305209V    PICTURE X.
           02  B305209O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305309C    PICTURE X.
           02  B305309P    PICTURE X.
           02  B305309H    PICTURE X.
           02  B305309V    PICTURE X.
           02  B305309O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304410C    PICTURE X.
           02  B304410P    PICTURE X.
           02  B304410H    PICTURE X.
           02  B304410V    PICTURE X.
           02  B304410O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304510C    PICTURE X.
           02  B304510P    PICTURE X.
           02  B304510H    PICTURE X.
           02  B304510V    PICTURE X.
           02  B304510O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304810C    PICTURE X.
           02  B304810P    PICTURE X.
           02  B304810H    PICTURE X.
           02  B304810V    PICTURE X.
           02  B304810O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304610C    PICTURE X.
           02  B304610P    PICTURE X.
           02  B304610H    PICTURE X.
           02  B304610V    PICTURE X.
           02  B304610O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304710C    PICTURE X.
           02  B304710P    PICTURE X.
           02  B304710H    PICTURE X.
           02  B304710V    PICTURE X.
           02  B304710O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304910C    PICTURE X.
           02  B304910P    PICTURE X.
           02  B304910H    PICTURE X.
           02  B304910V    PICTURE X.
           02  B304910O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305010C    PICTURE X.
           02  B305010P    PICTURE X.
           02  B305010H    PICTURE X.
           02  B305010V    PICTURE X.
           02  B305010O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305110C    PICTURE X.
           02  B305110P    PICTURE X.
           02  B305110H    PICTURE X.
           02  B305110V    PICTURE X.
           02  B305110O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305210C    PICTURE X.
           02  B305210P    PICTURE X.
           02  B305210H    PICTURE X.
           02  B305210V    PICTURE X.
           02  B305210O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305310C    PICTURE X.
           02  B305310P    PICTURE X.
           02  B305310H    PICTURE X.
           02  B305310V    PICTURE X.
           02  B305310O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304411C    PICTURE X.
           02  B304411P    PICTURE X.
           02  B304411H    PICTURE X.
           02  B304411V    PICTURE X.
           02  B304411O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304511C    PICTURE X.
           02  B304511P    PICTURE X.
           02  B304511H    PICTURE X.
           02  B304511V    PICTURE X.
           02  B304511O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304811C    PICTURE X.
           02  B304811P    PICTURE X.
           02  B304811H    PICTURE X.
           02  B304811V    PICTURE X.
           02  B304811O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304611C    PICTURE X.
           02  B304611P    PICTURE X.
           02  B304611H    PICTURE X.
           02  B304611V    PICTURE X.
           02  B304611O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304711C    PICTURE X.
           02  B304711P    PICTURE X.
           02  B304711H    PICTURE X.
           02  B304711V    PICTURE X.
           02  B304711O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304911C    PICTURE X.
           02  B304911P    PICTURE X.
           02  B304911H    PICTURE X.
           02  B304911V    PICTURE X.
           02  B304911O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305011C    PICTURE X.
           02  B305011P    PICTURE X.
           02  B305011H    PICTURE X.
           02  B305011V    PICTURE X.
           02  B305011O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305111C    PICTURE X.
           02  B305111P    PICTURE X.
           02  B305111H    PICTURE X.
           02  B305111V    PICTURE X.
           02  B305111O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305211C    PICTURE X.
           02  B305211P    PICTURE X.
           02  B305211H    PICTURE X.
           02  B305211V    PICTURE X.
           02  B305211O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305311C    PICTURE X.
           02  B305311P    PICTURE X.
           02  B305311H    PICTURE X.
           02  B305311V    PICTURE X.
           02  B305311O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304412C    PICTURE X.
           02  B304412P    PICTURE X.
           02  B304412H    PICTURE X.
           02  B304412V    PICTURE X.
           02  B304412O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304512C    PICTURE X.
           02  B304512P    PICTURE X.
           02  B304512H    PICTURE X.
           02  B304512V    PICTURE X.
           02  B304512O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304812C    PICTURE X.
           02  B304812P    PICTURE X.
           02  B304812H    PICTURE X.
           02  B304812V    PICTURE X.
           02  B304812O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304612C    PICTURE X.
           02  B304612P    PICTURE X.
           02  B304612H    PICTURE X.
           02  B304612V    PICTURE X.
           02  B304612O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304712C    PICTURE X.
           02  B304712P    PICTURE X.
           02  B304712H    PICTURE X.
           02  B304712V    PICTURE X.
           02  B304712O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304912C    PICTURE X.
           02  B304912P    PICTURE X.
           02  B304912H    PICTURE X.
           02  B304912V    PICTURE X.
           02  B304912O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305012C    PICTURE X.
           02  B305012P    PICTURE X.
           02  B305012H    PICTURE X.
           02  B305012V    PICTURE X.
           02  B305012O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305112C    PICTURE X.
           02  B305112P    PICTURE X.
           02  B305112H    PICTURE X.
           02  B305112V    PICTURE X.
           02  B305112O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305212C    PICTURE X.
           02  B305212P    PICTURE X.
           02  B305212H    PICTURE X.
           02  B305212V    PICTURE X.
           02  B305212O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305312C    PICTURE X.
           02  B305312P    PICTURE X.
           02  B305312H    PICTURE X.
           02  B305312V    PICTURE X.
           02  B305312O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304413C    PICTURE X.
           02  B304413P    PICTURE X.
           02  B304413H    PICTURE X.
           02  B304413V    PICTURE X.
           02  B304413O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304513C    PICTURE X.
           02  B304513P    PICTURE X.
           02  B304513H    PICTURE X.
           02  B304513V    PICTURE X.
           02  B304513O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304813C    PICTURE X.
           02  B304813P    PICTURE X.
           02  B304813H    PICTURE X.
           02  B304813V    PICTURE X.
           02  B304813O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304613C    PICTURE X.
           02  B304613P    PICTURE X.
           02  B304613H    PICTURE X.
           02  B304613V    PICTURE X.
           02  B304613O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304713C    PICTURE X.
           02  B304713P    PICTURE X.
           02  B304713H    PICTURE X.
           02  B304713V    PICTURE X.
           02  B304713O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304913C    PICTURE X.
           02  B304913P    PICTURE X.
           02  B304913H    PICTURE X.
           02  B304913V    PICTURE X.
           02  B304913O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305013C    PICTURE X.
           02  B305013P    PICTURE X.
           02  B305013H    PICTURE X.
           02  B305013V    PICTURE X.
           02  B305013O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305113C    PICTURE X.
           02  B305113P    PICTURE X.
           02  B305113H    PICTURE X.
           02  B305113V    PICTURE X.
           02  B305113O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305213C    PICTURE X.
           02  B305213P    PICTURE X.
           02  B305213H    PICTURE X.
           02  B305213V    PICTURE X.
           02  B305213O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305313C    PICTURE X.
           02  B305313P    PICTURE X.
           02  B305313H    PICTURE X.
           02  B305313V    PICTURE X.
           02  B305313O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304414C    PICTURE X.
           02  B304414P    PICTURE X.
           02  B304414H    PICTURE X.
           02  B304414V    PICTURE X.
           02  B304414O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304514C    PICTURE X.
           02  B304514P    PICTURE X.
           02  B304514H    PICTURE X.
           02  B304514V    PICTURE X.
           02  B304514O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304814C    PICTURE X.
           02  B304814P    PICTURE X.
           02  B304814H    PICTURE X.
           02  B304814V    PICTURE X.
           02  B304814O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304614C    PICTURE X.
           02  B304614P    PICTURE X.
           02  B304614H    PICTURE X.
           02  B304614V    PICTURE X.
           02  B304614O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304714C    PICTURE X.
           02  B304714P    PICTURE X.
           02  B304714H    PICTURE X.
           02  B304714V    PICTURE X.
           02  B304714O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304914C    PICTURE X.
           02  B304914P    PICTURE X.
           02  B304914H    PICTURE X.
           02  B304914V    PICTURE X.
           02  B304914O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305014C    PICTURE X.
           02  B305014P    PICTURE X.
           02  B305014H    PICTURE X.
           02  B305014V    PICTURE X.
           02  B305014O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305114C    PICTURE X.
           02  B305114P    PICTURE X.
           02  B305114H    PICTURE X.
           02  B305114V    PICTURE X.
           02  B305114O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305214C    PICTURE X.
           02  B305214P    PICTURE X.
           02  B305214H    PICTURE X.
           02  B305214V    PICTURE X.
           02  B305214O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305314C    PICTURE X.
           02  B305314P    PICTURE X.
           02  B305314H    PICTURE X.
           02  B305314V    PICTURE X.
           02  B305314O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS13C    PICTURE X.
           02  IMPFS13P    PICTURE X.
           02  IMPFS13H    PICTURE X.
           02  IMPFS13V    PICTURE X.
           02  IMPFS13O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR13C    PICTURE X.
           02  IMERR13P    PICTURE X.
           02  IMERR13H    PICTURE X.
           02  IMERR13V    PICTURE X.
           02  IMERR13O  PIC X(79).
       01  IMB1M14I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN13L    COMP  PIC  S9(4).
           02  IMTRN13F    PICTURE X.
           02  FILLER REDEFINES IMTRN13F.
             03 IMTRN13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN13I  PIC X(4).
           02  BDATE12L    COMP  PIC  S9(4).
           02  BDATE12F    PICTURE X.
           02  FILLER REDEFINES BDATE12F.
             03 BDATE12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE12I  PIC X(8).
           02  BTIME12L    COMP  PIC  S9(4).
           02  BTIME12F    PICTURE X.
           02  FILLER REDEFINES BTIME12F.
             03 BTIME12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME12I  PIC X(8).
           02  IMPGE12L    COMP  PIC  S9(4).
           02  IMPGE12F    PICTURE X.
           02  FILLER REDEFINES IMPGE12F.
             03 IMPGE12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE12I  PIC X(2).
           02  CTL1012L    COMP  PIC  S9(4).
           02  CTL1012F    PICTURE X.
           02  FILLER REDEFINES CTL1012F.
             03 CTL1012A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1012I  PIC X(2).
           02  CTL2012L    COMP  PIC  S9(4).
           02  CTL2012F    PICTURE X.
           02  FILLER REDEFINES CTL2012F.
             03 CTL2012A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2012I  PIC X(3).
           02  CTL3012L    COMP  PIC  S9(4).
           02  CTL3012F    PICTURE X.
           02  FILLER REDEFINES CTL3012F.
             03 CTL3012A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3012I  PIC X(3).
           02  B304415L    COMP  PIC  S9(4).
           02  B304415F    PICTURE X.
           02  FILLER REDEFINES B304415F.
             03 B304415A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304415I  PIC X(2).
           02  B304515L    COMP  PIC  S9(4).
           02  B304515F    PICTURE X.
           02  FILLER REDEFINES B304515F.
             03 B304515A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304515I  PIC X(2).
           02  B304815L    COMP  PIC  S9(4).
           02  B304815F    PICTURE X.
           02  FILLER REDEFINES B304815F.
             03 B304815A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304815I  PIC X(1).
           02  B304615L    COMP  PIC  S9(4).
           02  B304615F    PICTURE X.
           02  FILLER REDEFINES B304615F.
             03 B304615A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304615I  PIC X(2).
           02  B304715L    COMP  PIC  S9(4).
           02  B304715F    PICTURE X.
           02  FILLER REDEFINES B304715F.
             03 B304715A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304715I  PIC X(2).
           02  B304915L    COMP  PIC  S9(4).
           02  B304915F    PICTURE X.
           02  FILLER REDEFINES B304915F.
             03 B304915A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304915I  PIC X(1).
           02  B305015L    COMP  PIC  S9(4).
           02  B305015F    PICTURE X.
           02  FILLER REDEFINES B305015F.
             03 B305015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305015I  PIC X(1).
           02  B305115L    COMP  PIC  S9(4).
           02  B305115F    PICTURE X.
           02  FILLER REDEFINES B305115F.
             03 B305115A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305115I  PIC X(1).
           02  B305215L    COMP  PIC  S9(4).
           02  B305215F    PICTURE X.
           02  FILLER REDEFINES B305215F.
             03 B305215A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305215I  PIC X(1).
           02  B305315L    COMP  PIC  S9(4).
           02  B305315F    PICTURE X.
           02  FILLER REDEFINES B305315F.
             03 B305315A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305315I  PIC X(1).
           02  B304416L    COMP  PIC  S9(4).
           02  B304416F    PICTURE X.
           02  FILLER REDEFINES B304416F.
             03 B304416A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304416I  PIC X(2).
           02  B304516L    COMP  PIC  S9(4).
           02  B304516F    PICTURE X.
           02  FILLER REDEFINES B304516F.
             03 B304516A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304516I  PIC X(2).
           02  B304816L    COMP  PIC  S9(4).
           02  B304816F    PICTURE X.
           02  FILLER REDEFINES B304816F.
             03 B304816A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304816I  PIC X(1).
           02  B304616L    COMP  PIC  S9(4).
           02  B304616F    PICTURE X.
           02  FILLER REDEFINES B304616F.
             03 B304616A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304616I  PIC X(2).
           02  B304716L    COMP  PIC  S9(4).
           02  B304716F    PICTURE X.
           02  FILLER REDEFINES B304716F.
             03 B304716A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304716I  PIC X(2).
           02  B304916L    COMP  PIC  S9(4).
           02  B304916F    PICTURE X.
           02  FILLER REDEFINES B304916F.
             03 B304916A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304916I  PIC X(1).
           02  B305016L    COMP  PIC  S9(4).
           02  B305016F    PICTURE X.
           02  FILLER REDEFINES B305016F.
             03 B305016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305016I  PIC X(1).
           02  B305116L    COMP  PIC  S9(4).
           02  B305116F    PICTURE X.
           02  FILLER REDEFINES B305116F.
             03 B305116A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305116I  PIC X(1).
           02  B305216L    COMP  PIC  S9(4).
           02  B305216F    PICTURE X.
           02  FILLER REDEFINES B305216F.
             03 B305216A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305216I  PIC X(1).
           02  B305316L    COMP  PIC  S9(4).
           02  B305316F    PICTURE X.
           02  FILLER REDEFINES B305316F.
             03 B305316A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305316I  PIC X(1).
           02  B304417L    COMP  PIC  S9(4).
           02  B304417F    PICTURE X.
           02  FILLER REDEFINES B304417F.
             03 B304417A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304417I  PIC X(2).
           02  B304517L    COMP  PIC  S9(4).
           02  B304517F    PICTURE X.
           02  FILLER REDEFINES B304517F.
             03 B304517A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304517I  PIC X(2).
           02  B304817L    COMP  PIC  S9(4).
           02  B304817F    PICTURE X.
           02  FILLER REDEFINES B304817F.
             03 B304817A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304817I  PIC X(1).
           02  B304617L    COMP  PIC  S9(4).
           02  B304617F    PICTURE X.
           02  FILLER REDEFINES B304617F.
             03 B304617A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304617I  PIC X(2).
           02  B304717L    COMP  PIC  S9(4).
           02  B304717F    PICTURE X.
           02  FILLER REDEFINES B304717F.
             03 B304717A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304717I  PIC X(2).
           02  B304917L    COMP  PIC  S9(4).
           02  B304917F    PICTURE X.
           02  FILLER REDEFINES B304917F.
             03 B304917A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304917I  PIC X(1).
           02  B305017L    COMP  PIC  S9(4).
           02  B305017F    PICTURE X.
           02  FILLER REDEFINES B305017F.
             03 B305017A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305017I  PIC X(1).
           02  B305117L    COMP  PIC  S9(4).
           02  B305117F    PICTURE X.
           02  FILLER REDEFINES B305117F.
             03 B305117A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305117I  PIC X(1).
           02  B305217L    COMP  PIC  S9(4).
           02  B305217F    PICTURE X.
           02  FILLER REDEFINES B305217F.
             03 B305217A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305217I  PIC X(1).
           02  B305317L    COMP  PIC  S9(4).
           02  B305317F    PICTURE X.
           02  FILLER REDEFINES B305317F.
             03 B305317A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305317I  PIC X(1).
           02  B304418L    COMP  PIC  S9(4).
           02  B304418F    PICTURE X.
           02  FILLER REDEFINES B304418F.
             03 B304418A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304418I  PIC X(2).
           02  B304518L    COMP  PIC  S9(4).
           02  B304518F    PICTURE X.
           02  FILLER REDEFINES B304518F.
             03 B304518A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304518I  PIC X(2).
           02  B304818L    COMP  PIC  S9(4).
           02  B304818F    PICTURE X.
           02  FILLER REDEFINES B304818F.
             03 B304818A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304818I  PIC X(1).
           02  B304618L    COMP  PIC  S9(4).
           02  B304618F    PICTURE X.
           02  FILLER REDEFINES B304618F.
             03 B304618A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304618I  PIC X(2).
           02  B304718L    COMP  PIC  S9(4).
           02  B304718F    PICTURE X.
           02  FILLER REDEFINES B304718F.
             03 B304718A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304718I  PIC X(2).
           02  B304918L    COMP  PIC  S9(4).
           02  B304918F    PICTURE X.
           02  FILLER REDEFINES B304918F.
             03 B304918A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304918I  PIC X(1).
           02  B305018L    COMP  PIC  S9(4).
           02  B305018F    PICTURE X.
           02  FILLER REDEFINES B305018F.
             03 B305018A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305018I  PIC X(1).
           02  B305118L    COMP  PIC  S9(4).
           02  B305118F    PICTURE X.
           02  FILLER REDEFINES B305118F.
             03 B305118A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305118I  PIC X(1).
           02  B305218L    COMP  PIC  S9(4).
           02  B305218F    PICTURE X.
           02  FILLER REDEFINES B305218F.
             03 B305218A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305218I  PIC X(1).
           02  B305318L    COMP  PIC  S9(4).
           02  B305318F    PICTURE X.
           02  FILLER REDEFINES B305318F.
             03 B305318A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305318I  PIC X(1).
           02  B304419L    COMP  PIC  S9(4).
           02  B304419F    PICTURE X.
           02  FILLER REDEFINES B304419F.
             03 B304419A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304419I  PIC X(2).
           02  B304519L    COMP  PIC  S9(4).
           02  B304519F    PICTURE X.
           02  FILLER REDEFINES B304519F.
             03 B304519A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304519I  PIC X(2).
           02  B304819L    COMP  PIC  S9(4).
           02  B304819F    PICTURE X.
           02  FILLER REDEFINES B304819F.
             03 B304819A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304819I  PIC X(1).
           02  B304619L    COMP  PIC  S9(4).
           02  B304619F    PICTURE X.
           02  FILLER REDEFINES B304619F.
             03 B304619A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304619I  PIC X(2).
           02  B304719L    COMP  PIC  S9(4).
           02  B304719F    PICTURE X.
           02  FILLER REDEFINES B304719F.
             03 B304719A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304719I  PIC X(2).
           02  B304919L    COMP  PIC  S9(4).
           02  B304919F    PICTURE X.
           02  FILLER REDEFINES B304919F.
             03 B304919A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304919I  PIC X(1).
           02  B305019L    COMP  PIC  S9(4).
           02  B305019F    PICTURE X.
           02  FILLER REDEFINES B305019F.
             03 B305019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305019I  PIC X(1).
           02  B305119L    COMP  PIC  S9(4).
           02  B305119F    PICTURE X.
           02  FILLER REDEFINES B305119F.
             03 B305119A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305119I  PIC X(1).
           02  B305219L    COMP  PIC  S9(4).
           02  B305219F    PICTURE X.
           02  FILLER REDEFINES B305219F.
             03 B305219A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305219I  PIC X(1).
           02  B305319L    COMP  PIC  S9(4).
           02  B305319F    PICTURE X.
           02  FILLER REDEFINES B305319F.
             03 B305319A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305319I  PIC X(1).
           02  B304420L    COMP  PIC  S9(4).
           02  B304420F    PICTURE X.
           02  FILLER REDEFINES B304420F.
             03 B304420A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304420I  PIC X(2).
           02  B304520L    COMP  PIC  S9(4).
           02  B304520F    PICTURE X.
           02  FILLER REDEFINES B304520F.
             03 B304520A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304520I  PIC X(2).
           02  B304820L    COMP  PIC  S9(4).
           02  B304820F    PICTURE X.
           02  FILLER REDEFINES B304820F.
             03 B304820A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304820I  PIC X(1).
           02  B304620L    COMP  PIC  S9(4).
           02  B304620F    PICTURE X.
           02  FILLER REDEFINES B304620F.
             03 B304620A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304620I  PIC X(2).
           02  B304720L    COMP  PIC  S9(4).
           02  B304720F    PICTURE X.
           02  FILLER REDEFINES B304720F.
             03 B304720A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304720I  PIC X(2).
           02  B304920L    COMP  PIC  S9(4).
           02  B304920F    PICTURE X.
           02  FILLER REDEFINES B304920F.
             03 B304920A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304920I  PIC X(1).
           02  B305020L    COMP  PIC  S9(4).
           02  B305020F    PICTURE X.
           02  FILLER REDEFINES B305020F.
             03 B305020A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305020I  PIC X(1).
           02  B305120L    COMP  PIC  S9(4).
           02  B305120F    PICTURE X.
           02  FILLER REDEFINES B305120F.
             03 B305120A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305120I  PIC X(1).
           02  B305220L    COMP  PIC  S9(4).
           02  B305220F    PICTURE X.
           02  FILLER REDEFINES B305220F.
             03 B305220A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305220I  PIC X(1).
           02  B305320L    COMP  PIC  S9(4).
           02  B305320F    PICTURE X.
           02  FILLER REDEFINES B305320F.
             03 B305320A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305320I  PIC X(1).
           02  B304421L    COMP  PIC  S9(4).
           02  B304421F    PICTURE X.
           02  FILLER REDEFINES B304421F.
             03 B304421A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304421I  PIC X(2).
           02  B304521L    COMP  PIC  S9(4).
           02  B304521F    PICTURE X.
           02  FILLER REDEFINES B304521F.
             03 B304521A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304521I  PIC X(2).
           02  B304821L    COMP  PIC  S9(4).
           02  B304821F    PICTURE X.
           02  FILLER REDEFINES B304821F.
             03 B304821A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304821I  PIC X(1).
           02  B304621L    COMP  PIC  S9(4).
           02  B304621F    PICTURE X.
           02  FILLER REDEFINES B304621F.
             03 B304621A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304621I  PIC X(2).
           02  B304721L    COMP  PIC  S9(4).
           02  B304721F    PICTURE X.
           02  FILLER REDEFINES B304721F.
             03 B304721A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304721I  PIC X(2).
           02  B304921L    COMP  PIC  S9(4).
           02  B304921F    PICTURE X.
           02  FILLER REDEFINES B304921F.
             03 B304921A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304921I  PIC X(1).
           02  B305021L    COMP  PIC  S9(4).
           02  B305021F    PICTURE X.
           02  FILLER REDEFINES B305021F.
             03 B305021A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305021I  PIC X(1).
           02  B305121L    COMP  PIC  S9(4).
           02  B305121F    PICTURE X.
           02  FILLER REDEFINES B305121F.
             03 B305121A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305121I  PIC X(1).
           02  B305221L    COMP  PIC  S9(4).
           02  B305221F    PICTURE X.
           02  FILLER REDEFINES B305221F.
             03 B305221A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305221I  PIC X(1).
           02  B305321L    COMP  PIC  S9(4).
           02  B305321F    PICTURE X.
           02  FILLER REDEFINES B305321F.
             03 B305321A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305321I  PIC X(1).
           02  B304422L    COMP  PIC  S9(4).
           02  B304422F    PICTURE X.
           02  FILLER REDEFINES B304422F.
             03 B304422A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304422I  PIC X(2).
           02  B304522L    COMP  PIC  S9(4).
           02  B304522F    PICTURE X.
           02  FILLER REDEFINES B304522F.
             03 B304522A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304522I  PIC X(2).
           02  B304822L    COMP  PIC  S9(4).
           02  B304822F    PICTURE X.
           02  FILLER REDEFINES B304822F.
             03 B304822A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304822I  PIC X(1).
           02  B304622L    COMP  PIC  S9(4).
           02  B304622F    PICTURE X.
           02  FILLER REDEFINES B304622F.
             03 B304622A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304622I  PIC X(2).
           02  B304722L    COMP  PIC  S9(4).
           02  B304722F    PICTURE X.
           02  FILLER REDEFINES B304722F.
             03 B304722A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304722I  PIC X(2).
           02  B304922L    COMP  PIC  S9(4).
           02  B304922F    PICTURE X.
           02  FILLER REDEFINES B304922F.
             03 B304922A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304922I  PIC X(1).
           02  B305022L    COMP  PIC  S9(4).
           02  B305022F    PICTURE X.
           02  FILLER REDEFINES B305022F.
             03 B305022A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305022I  PIC X(1).
           02  B305122L    COMP  PIC  S9(4).
           02  B305122F    PICTURE X.
           02  FILLER REDEFINES B305122F.
             03 B305122A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305122I  PIC X(1).
           02  B305222L    COMP  PIC  S9(4).
           02  B305222F    PICTURE X.
           02  FILLER REDEFINES B305222F.
             03 B305222A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305222I  PIC X(1).
           02  B305322L    COMP  PIC  S9(4).
           02  B305322F    PICTURE X.
           02  FILLER REDEFINES B305322F.
             03 B305322A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305322I  PIC X(1).
           02  B304423L    COMP  PIC  S9(4).
           02  B304423F    PICTURE X.
           02  FILLER REDEFINES B304423F.
             03 B304423A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304423I  PIC X(2).
           02  B304523L    COMP  PIC  S9(4).
           02  B304523F    PICTURE X.
           02  FILLER REDEFINES B304523F.
             03 B304523A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304523I  PIC X(2).
           02  B304823L    COMP  PIC  S9(4).
           02  B304823F    PICTURE X.
           02  FILLER REDEFINES B304823F.
             03 B304823A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304823I  PIC X(1).
           02  B304623L    COMP  PIC  S9(4).
           02  B304623F    PICTURE X.
           02  FILLER REDEFINES B304623F.
             03 B304623A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304623I  PIC X(2).
           02  B304723L    COMP  PIC  S9(4).
           02  B304723F    PICTURE X.
           02  FILLER REDEFINES B304723F.
             03 B304723A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304723I  PIC X(2).
           02  B304923L    COMP  PIC  S9(4).
           02  B304923F    PICTURE X.
           02  FILLER REDEFINES B304923F.
             03 B304923A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304923I  PIC X(1).
           02  B305023L    COMP  PIC  S9(4).
           02  B305023F    PICTURE X.
           02  FILLER REDEFINES B305023F.
             03 B305023A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305023I  PIC X(1).
           02  B305123L    COMP  PIC  S9(4).
           02  B305123F    PICTURE X.
           02  FILLER REDEFINES B305123F.
             03 B305123A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305123I  PIC X(1).
           02  B305223L    COMP  PIC  S9(4).
           02  B305223F    PICTURE X.
           02  FILLER REDEFINES B305223F.
             03 B305223A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305223I  PIC X(1).
           02  B305323L    COMP  PIC  S9(4).
           02  B305323F    PICTURE X.
           02  FILLER REDEFINES B305323F.
             03 B305323A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305323I  PIC X(1).
           02  B304424L    COMP  PIC  S9(4).
           02  B304424F    PICTURE X.
           02  FILLER REDEFINES B304424F.
             03 B304424A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304424I  PIC X(2).
           02  B304524L    COMP  PIC  S9(4).
           02  B304524F    PICTURE X.
           02  FILLER REDEFINES B304524F.
             03 B304524A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304524I  PIC X(2).
           02  B304824L    COMP  PIC  S9(4).
           02  B304824F    PICTURE X.
           02  FILLER REDEFINES B304824F.
             03 B304824A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304824I  PIC X(1).
           02  B304624L    COMP  PIC  S9(4).
           02  B304624F    PICTURE X.
           02  FILLER REDEFINES B304624F.
             03 B304624A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304624I  PIC X(2).
           02  B304724L    COMP  PIC  S9(4).
           02  B304724F    PICTURE X.
           02  FILLER REDEFINES B304724F.
             03 B304724A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304724I  PIC X(2).
           02  B304924L    COMP  PIC  S9(4).
           02  B304924F    PICTURE X.
           02  FILLER REDEFINES B304924F.
             03 B304924A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304924I  PIC X(1).
           02  B305024L    COMP  PIC  S9(4).
           02  B305024F    PICTURE X.
           02  FILLER REDEFINES B305024F.
             03 B305024A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305024I  PIC X(1).
           02  B305124L    COMP  PIC  S9(4).
           02  B305124F    PICTURE X.
           02  FILLER REDEFINES B305124F.
             03 B305124A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305124I  PIC X(1).
           02  B305224L    COMP  PIC  S9(4).
           02  B305224F    PICTURE X.
           02  FILLER REDEFINES B305224F.
             03 B305224A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305224I  PIC X(1).
           02  B305324L    COMP  PIC  S9(4).
           02  B305324F    PICTURE X.
           02  FILLER REDEFINES B305324F.
             03 B305324A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305324I  PIC X(1).
           02  B304425L    COMP  PIC  S9(4).
           02  B304425F    PICTURE X.
           02  FILLER REDEFINES B304425F.
             03 B304425A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304425I  PIC X(2).
           02  B304525L    COMP  PIC  S9(4).
           02  B304525F    PICTURE X.
           02  FILLER REDEFINES B304525F.
             03 B304525A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304525I  PIC X(2).
           02  B304825L    COMP  PIC  S9(4).
           02  B304825F    PICTURE X.
           02  FILLER REDEFINES B304825F.
             03 B304825A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304825I  PIC X(1).
           02  B304625L    COMP  PIC  S9(4).
           02  B304625F    PICTURE X.
           02  FILLER REDEFINES B304625F.
             03 B304625A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304625I  PIC X(2).
           02  B304725L    COMP  PIC  S9(4).
           02  B304725F    PICTURE X.
           02  FILLER REDEFINES B304725F.
             03 B304725A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304725I  PIC X(2).
           02  B304925L    COMP  PIC  S9(4).
           02  B304925F    PICTURE X.
           02  FILLER REDEFINES B304925F.
             03 B304925A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304925I  PIC X(1).
           02  B305025L    COMP  PIC  S9(4).
           02  B305025F    PICTURE X.
           02  FILLER REDEFINES B305025F.
             03 B305025A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305025I  PIC X(1).
           02  B305125L    COMP  PIC  S9(4).
           02  B305125F    PICTURE X.
           02  FILLER REDEFINES B305125F.
             03 B305125A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305125I  PIC X(1).
           02  B305225L    COMP  PIC  S9(4).
           02  B305225F    PICTURE X.
           02  FILLER REDEFINES B305225F.
             03 B305225A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305225I  PIC X(1).
           02  B305325L    COMP  PIC  S9(4).
           02  B305325F    PICTURE X.
           02  FILLER REDEFINES B305325F.
             03 B305325A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305325I  PIC X(1).
           02  B304427L    COMP  PIC  S9(4).
           02  B304427F    PICTURE X.
           02  FILLER REDEFINES B304427F.
             03 B304427A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304427I  PIC X(2).
           02  B304527L    COMP  PIC  S9(4).
           02  B304527F    PICTURE X.
           02  FILLER REDEFINES B304527F.
             03 B304527A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304527I  PIC X(2).
           02  B304827L    COMP  PIC  S9(4).
           02  B304827F    PICTURE X.
           02  FILLER REDEFINES B304827F.
             03 B304827A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304827I  PIC X(1).
           02  B304627L    COMP  PIC  S9(4).
           02  B304627F    PICTURE X.
           02  FILLER REDEFINES B304627F.
             03 B304627A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304627I  PIC X(2).
           02  B304727L    COMP  PIC  S9(4).
           02  B304727F    PICTURE X.
           02  FILLER REDEFINES B304727F.
             03 B304727A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304727I  PIC X(2).
           02  B304927L    COMP  PIC  S9(4).
           02  B304927F    PICTURE X.
           02  FILLER REDEFINES B304927F.
             03 B304927A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304927I  PIC X(1).
           02  B305027L    COMP  PIC  S9(4).
           02  B305027F    PICTURE X.
           02  FILLER REDEFINES B305027F.
             03 B305027A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305027I  PIC X(1).
           02  B305127L    COMP  PIC  S9(4).
           02  B305127F    PICTURE X.
           02  FILLER REDEFINES B305127F.
             03 B305127A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305127I  PIC X(1).
           02  B305227L    COMP  PIC  S9(4).
           02  B305227F    PICTURE X.
           02  FILLER REDEFINES B305227F.
             03 B305227A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305227I  PIC X(1).
           02  B305327L    COMP  PIC  S9(4).
           02  B305327F    PICTURE X.
           02  FILLER REDEFINES B305327F.
             03 B305327A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305327I  PIC X(1).
           02  IMPFS14L    COMP  PIC  S9(4).
           02  IMPFS14F    PICTURE X.
           02  FILLER REDEFINES IMPFS14F.
             03 IMPFS14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS14I  PIC X(79).
           02  IMERR14L    COMP  PIC  S9(4).
           02  IMERR14F    PICTURE X.
           02  FILLER REDEFINES IMERR14F.
             03 IMERR14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR14I  PIC X(79).
       01  IMB1M14O REDEFINES IMB1M14I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN13C    PICTURE X.
           02  IMTRN13P    PICTURE X.
           02  IMTRN13H    PICTURE X.
           02  IMTRN13V    PICTURE X.
           02  IMTRN13O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE12C    PICTURE X.
           02  BDATE12P    PICTURE X.
           02  BDATE12H    PICTURE X.
           02  BDATE12V    PICTURE X.
           02  BDATE12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME12C    PICTURE X.
           02  BTIME12P    PICTURE X.
           02  BTIME12H    PICTURE X.
           02  BTIME12V    PICTURE X.
           02  BTIME12O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE12C    PICTURE X.
           02  IMPGE12P    PICTURE X.
           02  IMPGE12H    PICTURE X.
           02  IMPGE12V    PICTURE X.
           02  IMPGE12O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1012C    PICTURE X.
           02  CTL1012P    PICTURE X.
           02  CTL1012H    PICTURE X.
           02  CTL1012V    PICTURE X.
           02  CTL1012O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2012C    PICTURE X.
           02  CTL2012P    PICTURE X.
           02  CTL2012H    PICTURE X.
           02  CTL2012V    PICTURE X.
           02  CTL2012O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3012C    PICTURE X.
           02  CTL3012P    PICTURE X.
           02  CTL3012H    PICTURE X.
           02  CTL3012V    PICTURE X.
           02  CTL3012O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B304415C    PICTURE X.
           02  B304415P    PICTURE X.
           02  B304415H    PICTURE X.
           02  B304415V    PICTURE X.
           02  B304415O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304515C    PICTURE X.
           02  B304515P    PICTURE X.
           02  B304515H    PICTURE X.
           02  B304515V    PICTURE X.
           02  B304515O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304815C    PICTURE X.
           02  B304815P    PICTURE X.
           02  B304815H    PICTURE X.
           02  B304815V    PICTURE X.
           02  B304815O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304615C    PICTURE X.
           02  B304615P    PICTURE X.
           02  B304615H    PICTURE X.
           02  B304615V    PICTURE X.
           02  B304615O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304715C    PICTURE X.
           02  B304715P    PICTURE X.
           02  B304715H    PICTURE X.
           02  B304715V    PICTURE X.
           02  B304715O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304915C    PICTURE X.
           02  B304915P    PICTURE X.
           02  B304915H    PICTURE X.
           02  B304915V    PICTURE X.
           02  B304915O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305015C    PICTURE X.
           02  B305015P    PICTURE X.
           02  B305015H    PICTURE X.
           02  B305015V    PICTURE X.
           02  B305015O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305115C    PICTURE X.
           02  B305115P    PICTURE X.
           02  B305115H    PICTURE X.
           02  B305115V    PICTURE X.
           02  B305115O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305215C    PICTURE X.
           02  B305215P    PICTURE X.
           02  B305215H    PICTURE X.
           02  B305215V    PICTURE X.
           02  B305215O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305315C    PICTURE X.
           02  B305315P    PICTURE X.
           02  B305315H    PICTURE X.
           02  B305315V    PICTURE X.
           02  B305315O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304416C    PICTURE X.
           02  B304416P    PICTURE X.
           02  B304416H    PICTURE X.
           02  B304416V    PICTURE X.
           02  B304416O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304516C    PICTURE X.
           02  B304516P    PICTURE X.
           02  B304516H    PICTURE X.
           02  B304516V    PICTURE X.
           02  B304516O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304816C    PICTURE X.
           02  B304816P    PICTURE X.
           02  B304816H    PICTURE X.
           02  B304816V    PICTURE X.
           02  B304816O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304616C    PICTURE X.
           02  B304616P    PICTURE X.
           02  B304616H    PICTURE X.
           02  B304616V    PICTURE X.
           02  B304616O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304716C    PICTURE X.
           02  B304716P    PICTURE X.
           02  B304716H    PICTURE X.
           02  B304716V    PICTURE X.
           02  B304716O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304916C    PICTURE X.
           02  B304916P    PICTURE X.
           02  B304916H    PICTURE X.
           02  B304916V    PICTURE X.
           02  B304916O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305016C    PICTURE X.
           02  B305016P    PICTURE X.
           02  B305016H    PICTURE X.
           02  B305016V    PICTURE X.
           02  B305016O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305116C    PICTURE X.
           02  B305116P    PICTURE X.
           02  B305116H    PICTURE X.
           02  B305116V    PICTURE X.
           02  B305116O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305216C    PICTURE X.
           02  B305216P    PICTURE X.
           02  B305216H    PICTURE X.
           02  B305216V    PICTURE X.
           02  B305216O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305316C    PICTURE X.
           02  B305316P    PICTURE X.
           02  B305316H    PICTURE X.
           02  B305316V    PICTURE X.
           02  B305316O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304417C    PICTURE X.
           02  B304417P    PICTURE X.
           02  B304417H    PICTURE X.
           02  B304417V    PICTURE X.
           02  B304417O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304517C    PICTURE X.
           02  B304517P    PICTURE X.
           02  B304517H    PICTURE X.
           02  B304517V    PICTURE X.
           02  B304517O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304817C    PICTURE X.
           02  B304817P    PICTURE X.
           02  B304817H    PICTURE X.
           02  B304817V    PICTURE X.
           02  B304817O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304617C    PICTURE X.
           02  B304617P    PICTURE X.
           02  B304617H    PICTURE X.
           02  B304617V    PICTURE X.
           02  B304617O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304717C    PICTURE X.
           02  B304717P    PICTURE X.
           02  B304717H    PICTURE X.
           02  B304717V    PICTURE X.
           02  B304717O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304917C    PICTURE X.
           02  B304917P    PICTURE X.
           02  B304917H    PICTURE X.
           02  B304917V    PICTURE X.
           02  B304917O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305017C    PICTURE X.
           02  B305017P    PICTURE X.
           02  B305017H    PICTURE X.
           02  B305017V    PICTURE X.
           02  B305017O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305117C    PICTURE X.
           02  B305117P    PICTURE X.
           02  B305117H    PICTURE X.
           02  B305117V    PICTURE X.
           02  B305117O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305217C    PICTURE X.
           02  B305217P    PICTURE X.
           02  B305217H    PICTURE X.
           02  B305217V    PICTURE X.
           02  B305217O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305317C    PICTURE X.
           02  B305317P    PICTURE X.
           02  B305317H    PICTURE X.
           02  B305317V    PICTURE X.
           02  B305317O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304418C    PICTURE X.
           02  B304418P    PICTURE X.
           02  B304418H    PICTURE X.
           02  B304418V    PICTURE X.
           02  B304418O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304518C    PICTURE X.
           02  B304518P    PICTURE X.
           02  B304518H    PICTURE X.
           02  B304518V    PICTURE X.
           02  B304518O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304818C    PICTURE X.
           02  B304818P    PICTURE X.
           02  B304818H    PICTURE X.
           02  B304818V    PICTURE X.
           02  B304818O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304618C    PICTURE X.
           02  B304618P    PICTURE X.
           02  B304618H    PICTURE X.
           02  B304618V    PICTURE X.
           02  B304618O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304718C    PICTURE X.
           02  B304718P    PICTURE X.
           02  B304718H    PICTURE X.
           02  B304718V    PICTURE X.
           02  B304718O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304918C    PICTURE X.
           02  B304918P    PICTURE X.
           02  B304918H    PICTURE X.
           02  B304918V    PICTURE X.
           02  B304918O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305018C    PICTURE X.
           02  B305018P    PICTURE X.
           02  B305018H    PICTURE X.
           02  B305018V    PICTURE X.
           02  B305018O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305118C    PICTURE X.
           02  B305118P    PICTURE X.
           02  B305118H    PICTURE X.
           02  B305118V    PICTURE X.
           02  B305118O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305218C    PICTURE X.
           02  B305218P    PICTURE X.
           02  B305218H    PICTURE X.
           02  B305218V    PICTURE X.
           02  B305218O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305318C    PICTURE X.
           02  B305318P    PICTURE X.
           02  B305318H    PICTURE X.
           02  B305318V    PICTURE X.
           02  B305318O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304419C    PICTURE X.
           02  B304419P    PICTURE X.
           02  B304419H    PICTURE X.
           02  B304419V    PICTURE X.
           02  B304419O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304519C    PICTURE X.
           02  B304519P    PICTURE X.
           02  B304519H    PICTURE X.
           02  B304519V    PICTURE X.
           02  B304519O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304819C    PICTURE X.
           02  B304819P    PICTURE X.
           02  B304819H    PICTURE X.
           02  B304819V    PICTURE X.
           02  B304819O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304619C    PICTURE X.
           02  B304619P    PICTURE X.
           02  B304619H    PICTURE X.
           02  B304619V    PICTURE X.
           02  B304619O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304719C    PICTURE X.
           02  B304719P    PICTURE X.
           02  B304719H    PICTURE X.
           02  B304719V    PICTURE X.
           02  B304719O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304919C    PICTURE X.
           02  B304919P    PICTURE X.
           02  B304919H    PICTURE X.
           02  B304919V    PICTURE X.
           02  B304919O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305019C    PICTURE X.
           02  B305019P    PICTURE X.
           02  B305019H    PICTURE X.
           02  B305019V    PICTURE X.
           02  B305019O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305119C    PICTURE X.
           02  B305119P    PICTURE X.
           02  B305119H    PICTURE X.
           02  B305119V    PICTURE X.
           02  B305119O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305219C    PICTURE X.
           02  B305219P    PICTURE X.
           02  B305219H    PICTURE X.
           02  B305219V    PICTURE X.
           02  B305219O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305319C    PICTURE X.
           02  B305319P    PICTURE X.
           02  B305319H    PICTURE X.
           02  B305319V    PICTURE X.
           02  B305319O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304420C    PICTURE X.
           02  B304420P    PICTURE X.
           02  B304420H    PICTURE X.
           02  B304420V    PICTURE X.
           02  B304420O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304520C    PICTURE X.
           02  B304520P    PICTURE X.
           02  B304520H    PICTURE X.
           02  B304520V    PICTURE X.
           02  B304520O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304820C    PICTURE X.
           02  B304820P    PICTURE X.
           02  B304820H    PICTURE X.
           02  B304820V    PICTURE X.
           02  B304820O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304620C    PICTURE X.
           02  B304620P    PICTURE X.
           02  B304620H    PICTURE X.
           02  B304620V    PICTURE X.
           02  B304620O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304720C    PICTURE X.
           02  B304720P    PICTURE X.
           02  B304720H    PICTURE X.
           02  B304720V    PICTURE X.
           02  B304720O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304920C    PICTURE X.
           02  B304920P    PICTURE X.
           02  B304920H    PICTURE X.
           02  B304920V    PICTURE X.
           02  B304920O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305020C    PICTURE X.
           02  B305020P    PICTURE X.
           02  B305020H    PICTURE X.
           02  B305020V    PICTURE X.
           02  B305020O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305120C    PICTURE X.
           02  B305120P    PICTURE X.
           02  B305120H    PICTURE X.
           02  B305120V    PICTURE X.
           02  B305120O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305220C    PICTURE X.
           02  B305220P    PICTURE X.
           02  B305220H    PICTURE X.
           02  B305220V    PICTURE X.
           02  B305220O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305320C    PICTURE X.
           02  B305320P    PICTURE X.
           02  B305320H    PICTURE X.
           02  B305320V    PICTURE X.
           02  B305320O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304421C    PICTURE X.
           02  B304421P    PICTURE X.
           02  B304421H    PICTURE X.
           02  B304421V    PICTURE X.
           02  B304421O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304521C    PICTURE X.
           02  B304521P    PICTURE X.
           02  B304521H    PICTURE X.
           02  B304521V    PICTURE X.
           02  B304521O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304821C    PICTURE X.
           02  B304821P    PICTURE X.
           02  B304821H    PICTURE X.
           02  B304821V    PICTURE X.
           02  B304821O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304621C    PICTURE X.
           02  B304621P    PICTURE X.
           02  B304621H    PICTURE X.
           02  B304621V    PICTURE X.
           02  B304621O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304721C    PICTURE X.
           02  B304721P    PICTURE X.
           02  B304721H    PICTURE X.
           02  B304721V    PICTURE X.
           02  B304721O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304921C    PICTURE X.
           02  B304921P    PICTURE X.
           02  B304921H    PICTURE X.
           02  B304921V    PICTURE X.
           02  B304921O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305021C    PICTURE X.
           02  B305021P    PICTURE X.
           02  B305021H    PICTURE X.
           02  B305021V    PICTURE X.
           02  B305021O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305121C    PICTURE X.
           02  B305121P    PICTURE X.
           02  B305121H    PICTURE X.
           02  B305121V    PICTURE X.
           02  B305121O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305221C    PICTURE X.
           02  B305221P    PICTURE X.
           02  B305221H    PICTURE X.
           02  B305221V    PICTURE X.
           02  B305221O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305321C    PICTURE X.
           02  B305321P    PICTURE X.
           02  B305321H    PICTURE X.
           02  B305321V    PICTURE X.
           02  B305321O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304422C    PICTURE X.
           02  B304422P    PICTURE X.
           02  B304422H    PICTURE X.
           02  B304422V    PICTURE X.
           02  B304422O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304522C    PICTURE X.
           02  B304522P    PICTURE X.
           02  B304522H    PICTURE X.
           02  B304522V    PICTURE X.
           02  B304522O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304822C    PICTURE X.
           02  B304822P    PICTURE X.
           02  B304822H    PICTURE X.
           02  B304822V    PICTURE X.
           02  B304822O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304622C    PICTURE X.
           02  B304622P    PICTURE X.
           02  B304622H    PICTURE X.
           02  B304622V    PICTURE X.
           02  B304622O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304722C    PICTURE X.
           02  B304722P    PICTURE X.
           02  B304722H    PICTURE X.
           02  B304722V    PICTURE X.
           02  B304722O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304922C    PICTURE X.
           02  B304922P    PICTURE X.
           02  B304922H    PICTURE X.
           02  B304922V    PICTURE X.
           02  B304922O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305022C    PICTURE X.
           02  B305022P    PICTURE X.
           02  B305022H    PICTURE X.
           02  B305022V    PICTURE X.
           02  B305022O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305122C    PICTURE X.
           02  B305122P    PICTURE X.
           02  B305122H    PICTURE X.
           02  B305122V    PICTURE X.
           02  B305122O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305222C    PICTURE X.
           02  B305222P    PICTURE X.
           02  B305222H    PICTURE X.
           02  B305222V    PICTURE X.
           02  B305222O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305322C    PICTURE X.
           02  B305322P    PICTURE X.
           02  B305322H    PICTURE X.
           02  B305322V    PICTURE X.
           02  B305322O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304423C    PICTURE X.
           02  B304423P    PICTURE X.
           02  B304423H    PICTURE X.
           02  B304423V    PICTURE X.
           02  B304423O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304523C    PICTURE X.
           02  B304523P    PICTURE X.
           02  B304523H    PICTURE X.
           02  B304523V    PICTURE X.
           02  B304523O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304823C    PICTURE X.
           02  B304823P    PICTURE X.
           02  B304823H    PICTURE X.
           02  B304823V    PICTURE X.
           02  B304823O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304623C    PICTURE X.
           02  B304623P    PICTURE X.
           02  B304623H    PICTURE X.
           02  B304623V    PICTURE X.
           02  B304623O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304723C    PICTURE X.
           02  B304723P    PICTURE X.
           02  B304723H    PICTURE X.
           02  B304723V    PICTURE X.
           02  B304723O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304923C    PICTURE X.
           02  B304923P    PICTURE X.
           02  B304923H    PICTURE X.
           02  B304923V    PICTURE X.
           02  B304923O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305023C    PICTURE X.
           02  B305023P    PICTURE X.
           02  B305023H    PICTURE X.
           02  B305023V    PICTURE X.
           02  B305023O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305123C    PICTURE X.
           02  B305123P    PICTURE X.
           02  B305123H    PICTURE X.
           02  B305123V    PICTURE X.
           02  B305123O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305223C    PICTURE X.
           02  B305223P    PICTURE X.
           02  B305223H    PICTURE X.
           02  B305223V    PICTURE X.
           02  B305223O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305323C    PICTURE X.
           02  B305323P    PICTURE X.
           02  B305323H    PICTURE X.
           02  B305323V    PICTURE X.
           02  B305323O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304424C    PICTURE X.
           02  B304424P    PICTURE X.
           02  B304424H    PICTURE X.
           02  B304424V    PICTURE X.
           02  B304424O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304524C    PICTURE X.
           02  B304524P    PICTURE X.
           02  B304524H    PICTURE X.
           02  B304524V    PICTURE X.
           02  B304524O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304824C    PICTURE X.
           02  B304824P    PICTURE X.
           02  B304824H    PICTURE X.
           02  B304824V    PICTURE X.
           02  B304824O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304624C    PICTURE X.
           02  B304624P    PICTURE X.
           02  B304624H    PICTURE X.
           02  B304624V    PICTURE X.
           02  B304624O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304724C    PICTURE X.
           02  B304724P    PICTURE X.
           02  B304724H    PICTURE X.
           02  B304724V    PICTURE X.
           02  B304724O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304924C    PICTURE X.
           02  B304924P    PICTURE X.
           02  B304924H    PICTURE X.
           02  B304924V    PICTURE X.
           02  B304924O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305024C    PICTURE X.
           02  B305024P    PICTURE X.
           02  B305024H    PICTURE X.
           02  B305024V    PICTURE X.
           02  B305024O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305124C    PICTURE X.
           02  B305124P    PICTURE X.
           02  B305124H    PICTURE X.
           02  B305124V    PICTURE X.
           02  B305124O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305224C    PICTURE X.
           02  B305224P    PICTURE X.
           02  B305224H    PICTURE X.
           02  B305224V    PICTURE X.
           02  B305224O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305324C    PICTURE X.
           02  B305324P    PICTURE X.
           02  B305324H    PICTURE X.
           02  B305324V    PICTURE X.
           02  B305324O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304425C    PICTURE X.
           02  B304425P    PICTURE X.
           02  B304425H    PICTURE X.
           02  B304425V    PICTURE X.
           02  B304425O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304525C    PICTURE X.
           02  B304525P    PICTURE X.
           02  B304525H    PICTURE X.
           02  B304525V    PICTURE X.
           02  B304525O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304825C    PICTURE X.
           02  B304825P    PICTURE X.
           02  B304825H    PICTURE X.
           02  B304825V    PICTURE X.
           02  B304825O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304625C    PICTURE X.
           02  B304625P    PICTURE X.
           02  B304625H    PICTURE X.
           02  B304625V    PICTURE X.
           02  B304625O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304725C    PICTURE X.
           02  B304725P    PICTURE X.
           02  B304725H    PICTURE X.
           02  B304725V    PICTURE X.
           02  B304725O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304925C    PICTURE X.
           02  B304925P    PICTURE X.
           02  B304925H    PICTURE X.
           02  B304925V    PICTURE X.
           02  B304925O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305025C    PICTURE X.
           02  B305025P    PICTURE X.
           02  B305025H    PICTURE X.
           02  B305025V    PICTURE X.
           02  B305025O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305125C    PICTURE X.
           02  B305125P    PICTURE X.
           02  B305125H    PICTURE X.
           02  B305125V    PICTURE X.
           02  B305125O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305225C    PICTURE X.
           02  B305225P    PICTURE X.
           02  B305225H    PICTURE X.
           02  B305225V    PICTURE X.
           02  B305225O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305325C    PICTURE X.
           02  B305325P    PICTURE X.
           02  B305325H    PICTURE X.
           02  B305325V    PICTURE X.
           02  B305325O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304427C    PICTURE X.
           02  B304427P    PICTURE X.
           02  B304427H    PICTURE X.
           02  B304427V    PICTURE X.
           02  B304427O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304527C    PICTURE X.
           02  B304527P    PICTURE X.
           02  B304527H    PICTURE X.
           02  B304527V    PICTURE X.
           02  B304527O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304827C    PICTURE X.
           02  B304827P    PICTURE X.
           02  B304827H    PICTURE X.
           02  B304827V    PICTURE X.
           02  B304827O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B304627C    PICTURE X.
           02  B304627P    PICTURE X.
           02  B304627H    PICTURE X.
           02  B304627V    PICTURE X.
           02  B304627O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304727C    PICTURE X.
           02  B304727P    PICTURE X.
           02  B304727H    PICTURE X.
           02  B304727V    PICTURE X.
           02  B304727O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B304927C    PICTURE X.
           02  B304927P    PICTURE X.
           02  B304927H    PICTURE X.
           02  B304927V    PICTURE X.
           02  B304927O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305027C    PICTURE X.
           02  B305027P    PICTURE X.
           02  B305027H    PICTURE X.
           02  B305027V    PICTURE X.
           02  B305027O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305127C    PICTURE X.
           02  B305127P    PICTURE X.
           02  B305127H    PICTURE X.
           02  B305127V    PICTURE X.
           02  B305127O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305227C    PICTURE X.
           02  B305227P    PICTURE X.
           02  B305227H    PICTURE X.
           02  B305227V    PICTURE X.
           02  B305227O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B305327C    PICTURE X.
           02  B305327P    PICTURE X.
           02  B305327H    PICTURE X.
           02  B305327V    PICTURE X.
           02  B305327O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS14C    PICTURE X.
           02  IMPFS14P    PICTURE X.
           02  IMPFS14H    PICTURE X.
           02  IMPFS14V    PICTURE X.
           02  IMPFS14O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR14C    PICTURE X.
           02  IMERR14P    PICTURE X.
           02  IMERR14H    PICTURE X.
           02  IMERR14V    PICTURE X.
           02  IMERR14O  PIC X(79).
       01  IMB1M15I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN14L    COMP  PIC  S9(4).
           02  IMTRN14F    PICTURE X.
           02  FILLER REDEFINES IMTRN14F.
             03 IMTRN14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN14I  PIC X(4).
           02  BDATE13L    COMP  PIC  S9(4).
           02  BDATE13F    PICTURE X.
           02  FILLER REDEFINES BDATE13F.
             03 BDATE13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE13I  PIC X(8).
           02  BTIME13L    COMP  PIC  S9(4).
           02  BTIME13F    PICTURE X.
           02  FILLER REDEFINES BTIME13F.
             03 BTIME13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME13I  PIC X(8).
           02  IMPGE13L    COMP  PIC  S9(4).
           02  IMPGE13F    PICTURE X.
           02  FILLER REDEFINES IMPGE13F.
             03 IMPGE13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE13I  PIC X(2).
           02  CTL1013L    COMP  PIC  S9(4).
           02  CTL1013F    PICTURE X.
           02  FILLER REDEFINES CTL1013F.
             03 CTL1013A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1013I  PIC X(2).
           02  CTL2013L    COMP  PIC  S9(4).
           02  CTL2013F    PICTURE X.
           02  FILLER REDEFINES CTL2013F.
             03 CTL2013A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2013I  PIC X(3).
           02  CTL3013L    COMP  PIC  S9(4).
           02  CTL3013F    PICTURE X.
           02  FILLER REDEFINES CTL3013F.
             03 CTL3013A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3013I  PIC X(3).
           02  B401201L    COMP  PIC  S9(4).
           02  B401201F    PICTURE X.
           02  FILLER REDEFINES B401201F.
             03 B401201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401201I  PIC X(13).
           02  B401301L    COMP  PIC  S9(4).
           02  B401301F    PICTURE X.
           02  FILLER REDEFINES B401301F.
             03 B401301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401301I  PIC X(13).
           02  B401401L    COMP  PIC  S9(4).
           02  B401401F    PICTURE X.
           02  FILLER REDEFINES B401401F.
             03 B401401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401401I  PIC X(13).
           02  B401202L    COMP  PIC  S9(4).
           02  B401202F    PICTURE X.
           02  FILLER REDEFINES B401202F.
             03 B401202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401202I  PIC X(13).
           02  B401302L    COMP  PIC  S9(4).
           02  B401302F    PICTURE X.
           02  FILLER REDEFINES B401302F.
             03 B401302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401302I  PIC X(13).
           02  B401402L    COMP  PIC  S9(4).
           02  B401402F    PICTURE X.
           02  FILLER REDEFINES B401402F.
             03 B401402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401402I  PIC X(13).
           02  B401203L    COMP  PIC  S9(4).
           02  B401203F    PICTURE X.
           02  FILLER REDEFINES B401203F.
             03 B401203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401203I  PIC X(13).
           02  B401303L    COMP  PIC  S9(4).
           02  B401303F    PICTURE X.
           02  FILLER REDEFINES B401303F.
             03 B401303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401303I  PIC X(13).
           02  B401403L    COMP  PIC  S9(4).
           02  B401403F    PICTURE X.
           02  FILLER REDEFINES B401403F.
             03 B401403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401403I  PIC X(13).
           02  B401204L    COMP  PIC  S9(4).
           02  B401204F    PICTURE X.
           02  FILLER REDEFINES B401204F.
             03 B401204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401204I  PIC X(13).
           02  B401304L    COMP  PIC  S9(4).
           02  B401304F    PICTURE X.
           02  FILLER REDEFINES B401304F.
             03 B401304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401304I  PIC X(13).
           02  B401404L    COMP  PIC  S9(4).
           02  B401404F    PICTURE X.
           02  FILLER REDEFINES B401404F.
             03 B401404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401404I  PIC X(13).
           02  B401205L    COMP  PIC  S9(4).
           02  B401205F    PICTURE X.
           02  FILLER REDEFINES B401205F.
             03 B401205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401205I  PIC X(13).
           02  B401305L    COMP  PIC  S9(4).
           02  B401305F    PICTURE X.
           02  FILLER REDEFINES B401305F.
             03 B401305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401305I  PIC X(13).
           02  B401405L    COMP  PIC  S9(4).
           02  B401405F    PICTURE X.
           02  FILLER REDEFINES B401405F.
             03 B401405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401405I  PIC X(13).
           02  B401206L    COMP  PIC  S9(4).
           02  B401206F    PICTURE X.
           02  FILLER REDEFINES B401206F.
             03 B401206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401206I  PIC X(13).
           02  B401306L    COMP  PIC  S9(4).
           02  B401306F    PICTURE X.
           02  FILLER REDEFINES B401306F.
             03 B401306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401306I  PIC X(13).
           02  B401406L    COMP  PIC  S9(4).
           02  B401406F    PICTURE X.
           02  FILLER REDEFINES B401406F.
             03 B401406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401406I  PIC X(13).
           02  B401207L    COMP  PIC  S9(4).
           02  B401207F    PICTURE X.
           02  FILLER REDEFINES B401207F.
             03 B401207A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401207I  PIC X(13).
           02  B401307L    COMP  PIC  S9(4).
           02  B401307F    PICTURE X.
           02  FILLER REDEFINES B401307F.
             03 B401307A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401307I  PIC X(13).
           02  B401407L    COMP  PIC  S9(4).
           02  B401407F    PICTURE X.
           02  FILLER REDEFINES B401407F.
             03 B401407A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401407I  PIC X(13).
           02  B401208L    COMP  PIC  S9(4).
           02  B401208F    PICTURE X.
           02  FILLER REDEFINES B401208F.
             03 B401208A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401208I  PIC X(13).
           02  B401308L    COMP  PIC  S9(4).
           02  B401308F    PICTURE X.
           02  FILLER REDEFINES B401308F.
             03 B401308A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401308I  PIC X(13).
           02  B401408L    COMP  PIC  S9(4).
           02  B401408F    PICTURE X.
           02  FILLER REDEFINES B401408F.
             03 B401408A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401408I  PIC X(13).
           02  B401209L    COMP  PIC  S9(4).
           02  B401209F    PICTURE X.
           02  FILLER REDEFINES B401209F.
             03 B401209A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401209I  PIC X(13).
           02  B401309L    COMP  PIC  S9(4).
           02  B401309F    PICTURE X.
           02  FILLER REDEFINES B401309F.
             03 B401309A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401309I  PIC X(13).
           02  B401409L    COMP  PIC  S9(4).
           02  B401409F    PICTURE X.
           02  FILLER REDEFINES B401409F.
             03 B401409A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B401409I  PIC X(13).
           02  B402701L    COMP  PIC  S9(4).
           02  B402701F    PICTURE X.
           02  FILLER REDEFINES B402701F.
             03 B402701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402701I  PIC X(13).
           02  B405901L    COMP  PIC  S9(4).
           02  B405901F    PICTURE X.
           02  FILLER REDEFINES B405901F.
             03 B405901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B405901I  PIC X(9).
           02  B402901L    COMP  PIC  S9(4).
           02  B402901F    PICTURE X.
           02  FILLER REDEFINES B402901F.
             03 B402901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402901I  PIC X(9).
           02  B414201L    COMP  PIC  S9(4).
           02  B414201F    PICTURE X.
           02  FILLER REDEFINES B414201F.
             03 B414201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B414201I  PIC X(9).
           02  B402702L    COMP  PIC  S9(4).
           02  B402702F    PICTURE X.
           02  FILLER REDEFINES B402702F.
             03 B402702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402702I  PIC X(13).
           02  B405902L    COMP  PIC  S9(4).
           02  B405902F    PICTURE X.
           02  FILLER REDEFINES B405902F.
             03 B405902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B405902I  PIC X(9).
           02  B402902L    COMP  PIC  S9(4).
           02  B402902F    PICTURE X.
           02  FILLER REDEFINES B402902F.
             03 B402902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402902I  PIC X(9).
           02  B414202L    COMP  PIC  S9(4).
           02  B414202F    PICTURE X.
           02  FILLER REDEFINES B414202F.
             03 B414202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B414202I  PIC X(9).
           02  B402703L    COMP  PIC  S9(4).
           02  B402703F    PICTURE X.
           02  FILLER REDEFINES B402703F.
             03 B402703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402703I  PIC X(13).
           02  B405903L    COMP  PIC  S9(4).
           02  B405903F    PICTURE X.
           02  FILLER REDEFINES B405903F.
             03 B405903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B405903I  PIC X(9).
           02  B402903L    COMP  PIC  S9(4).
           02  B402903F    PICTURE X.
           02  FILLER REDEFINES B402903F.
             03 B402903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402903I  PIC X(9).
           02  B414203L    COMP  PIC  S9(4).
           02  B414203F    PICTURE X.
           02  FILLER REDEFINES B414203F.
             03 B414203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B414203I  PIC X(9).
           02  B402704L    COMP  PIC  S9(4).
           02  B402704F    PICTURE X.
           02  FILLER REDEFINES B402704F.
             03 B402704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402704I  PIC X(13).
           02  B405904L    COMP  PIC  S9(4).
           02  B405904F    PICTURE X.
           02  FILLER REDEFINES B405904F.
             03 B405904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B405904I  PIC X(9).
           02  B402904L    COMP  PIC  S9(4).
           02  B402904F    PICTURE X.
           02  FILLER REDEFINES B402904F.
             03 B402904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402904I  PIC X(9).
           02  B414204L    COMP  PIC  S9(4).
           02  B414204F    PICTURE X.
           02  FILLER REDEFINES B414204F.
             03 B414204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B414204I  PIC X(9).
           02  B402705L    COMP  PIC  S9(4).
           02  B402705F    PICTURE X.
           02  FILLER REDEFINES B402705F.
             03 B402705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402705I  PIC X(13).
           02  B405905L    COMP  PIC  S9(4).
           02  B405905F    PICTURE X.
           02  FILLER REDEFINES B405905F.
             03 B405905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B405905I  PIC X(9).
           02  B402905L    COMP  PIC  S9(4).
           02  B402905F    PICTURE X.
           02  FILLER REDEFINES B402905F.
             03 B402905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B402905I  PIC X(9).
           02  B414205L    COMP  PIC  S9(4).
           02  B414205F    PICTURE X.
           02  FILLER REDEFINES B414205F.
             03 B414205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B414205I  PIC X(9).
           02  IMPFS15L    COMP  PIC  S9(4).
           02  IMPFS15F    PICTURE X.
           02  FILLER REDEFINES IMPFS15F.
             03 IMPFS15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS15I  PIC X(79).
           02  IMERR15L    COMP  PIC  S9(4).
           02  IMERR15F    PICTURE X.
           02  FILLER REDEFINES IMERR15F.
             03 IMERR15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR15I  PIC X(79).
       01  IMB1M15O REDEFINES IMB1M15I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN14C    PICTURE X.
           02  IMTRN14P    PICTURE X.
           02  IMTRN14H    PICTURE X.
           02  IMTRN14V    PICTURE X.
           02  IMTRN14O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE13C    PICTURE X.
           02  BDATE13P    PICTURE X.
           02  BDATE13H    PICTURE X.
           02  BDATE13V    PICTURE X.
           02  BDATE13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME13C    PICTURE X.
           02  BTIME13P    PICTURE X.
           02  BTIME13H    PICTURE X.
           02  BTIME13V    PICTURE X.
           02  BTIME13O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE13C    PICTURE X.
           02  IMPGE13P    PICTURE X.
           02  IMPGE13H    PICTURE X.
           02  IMPGE13V    PICTURE X.
           02  IMPGE13O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1013C    PICTURE X.
           02  CTL1013P    PICTURE X.
           02  CTL1013H    PICTURE X.
           02  CTL1013V    PICTURE X.
           02  CTL1013O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2013C    PICTURE X.
           02  CTL2013P    PICTURE X.
           02  CTL2013H    PICTURE X.
           02  CTL2013V    PICTURE X.
           02  CTL2013O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3013C    PICTURE X.
           02  CTL3013P    PICTURE X.
           02  CTL3013H    PICTURE X.
           02  CTL3013V    PICTURE X.
           02  CTL3013O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B401201C    PICTURE X.
           02  B401201P    PICTURE X.
           02  B401201H    PICTURE X.
           02  B401201V    PICTURE X.
           02  B401201O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401301C    PICTURE X.
           02  B401301P    PICTURE X.
           02  B401301H    PICTURE X.
           02  B401301V    PICTURE X.
           02  B401301O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401401C    PICTURE X.
           02  B401401P    PICTURE X.
           02  B401401H    PICTURE X.
           02  B401401V    PICTURE X.
           02  B401401O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401202C    PICTURE X.
           02  B401202P    PICTURE X.
           02  B401202H    PICTURE X.
           02  B401202V    PICTURE X.
           02  B401202O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401302C    PICTURE X.
           02  B401302P    PICTURE X.
           02  B401302H    PICTURE X.
           02  B401302V    PICTURE X.
           02  B401302O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401402C    PICTURE X.
           02  B401402P    PICTURE X.
           02  B401402H    PICTURE X.
           02  B401402V    PICTURE X.
           02  B401402O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401203C    PICTURE X.
           02  B401203P    PICTURE X.
           02  B401203H    PICTURE X.
           02  B401203V    PICTURE X.
           02  B401203O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401303C    PICTURE X.
           02  B401303P    PICTURE X.
           02  B401303H    PICTURE X.
           02  B401303V    PICTURE X.
           02  B401303O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401403C    PICTURE X.
           02  B401403P    PICTURE X.
           02  B401403H    PICTURE X.
           02  B401403V    PICTURE X.
           02  B401403O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401204C    PICTURE X.
           02  B401204P    PICTURE X.
           02  B401204H    PICTURE X.
           02  B401204V    PICTURE X.
           02  B401204O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401304C    PICTURE X.
           02  B401304P    PICTURE X.
           02  B401304H    PICTURE X.
           02  B401304V    PICTURE X.
           02  B401304O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401404C    PICTURE X.
           02  B401404P    PICTURE X.
           02  B401404H    PICTURE X.
           02  B401404V    PICTURE X.
           02  B401404O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401205C    PICTURE X.
           02  B401205P    PICTURE X.
           02  B401205H    PICTURE X.
           02  B401205V    PICTURE X.
           02  B401205O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401305C    PICTURE X.
           02  B401305P    PICTURE X.
           02  B401305H    PICTURE X.
           02  B401305V    PICTURE X.
           02  B401305O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401405C    PICTURE X.
           02  B401405P    PICTURE X.
           02  B401405H    PICTURE X.
           02  B401405V    PICTURE X.
           02  B401405O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401206C    PICTURE X.
           02  B401206P    PICTURE X.
           02  B401206H    PICTURE X.
           02  B401206V    PICTURE X.
           02  B401206O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401306C    PICTURE X.
           02  B401306P    PICTURE X.
           02  B401306H    PICTURE X.
           02  B401306V    PICTURE X.
           02  B401306O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401406C    PICTURE X.
           02  B401406P    PICTURE X.
           02  B401406H    PICTURE X.
           02  B401406V    PICTURE X.
           02  B401406O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401207C    PICTURE X.
           02  B401207P    PICTURE X.
           02  B401207H    PICTURE X.
           02  B401207V    PICTURE X.
           02  B401207O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401307C    PICTURE X.
           02  B401307P    PICTURE X.
           02  B401307H    PICTURE X.
           02  B401307V    PICTURE X.
           02  B401307O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401407C    PICTURE X.
           02  B401407P    PICTURE X.
           02  B401407H    PICTURE X.
           02  B401407V    PICTURE X.
           02  B401407O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401208C    PICTURE X.
           02  B401208P    PICTURE X.
           02  B401208H    PICTURE X.
           02  B401208V    PICTURE X.
           02  B401208O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401308C    PICTURE X.
           02  B401308P    PICTURE X.
           02  B401308H    PICTURE X.
           02  B401308V    PICTURE X.
           02  B401308O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401408C    PICTURE X.
           02  B401408P    PICTURE X.
           02  B401408H    PICTURE X.
           02  B401408V    PICTURE X.
           02  B401408O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401209C    PICTURE X.
           02  B401209P    PICTURE X.
           02  B401209H    PICTURE X.
           02  B401209V    PICTURE X.
           02  B401209O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401309C    PICTURE X.
           02  B401309P    PICTURE X.
           02  B401309H    PICTURE X.
           02  B401309V    PICTURE X.
           02  B401309O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B401409C    PICTURE X.
           02  B401409P    PICTURE X.
           02  B401409H    PICTURE X.
           02  B401409V    PICTURE X.
           02  B401409O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B402701C    PICTURE X.
           02  B402701P    PICTURE X.
           02  B402701H    PICTURE X.
           02  B402701V    PICTURE X.
           02  B402701O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B405901C    PICTURE X.
           02  B405901P    PICTURE X.
           02  B405901H    PICTURE X.
           02  B405901V    PICTURE X.
           02  B405901O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B402901C    PICTURE X.
           02  B402901P    PICTURE X.
           02  B402901H    PICTURE X.
           02  B402901V    PICTURE X.
           02  B402901O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B414201C    PICTURE X.
           02  B414201P    PICTURE X.
           02  B414201H    PICTURE X.
           02  B414201V    PICTURE X.
           02  B414201O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B402702C    PICTURE X.
           02  B402702P    PICTURE X.
           02  B402702H    PICTURE X.
           02  B402702V    PICTURE X.
           02  B402702O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B405902C    PICTURE X.
           02  B405902P    PICTURE X.
           02  B405902H    PICTURE X.
           02  B405902V    PICTURE X.
           02  B405902O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B402902C    PICTURE X.
           02  B402902P    PICTURE X.
           02  B402902H    PICTURE X.
           02  B402902V    PICTURE X.
           02  B402902O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B414202C    PICTURE X.
           02  B414202P    PICTURE X.
           02  B414202H    PICTURE X.
           02  B414202V    PICTURE X.
           02  B414202O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B402703C    PICTURE X.
           02  B402703P    PICTURE X.
           02  B402703H    PICTURE X.
           02  B402703V    PICTURE X.
           02  B402703O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B405903C    PICTURE X.
           02  B405903P    PICTURE X.
           02  B405903H    PICTURE X.
           02  B405903V    PICTURE X.
           02  B405903O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B402903C    PICTURE X.
           02  B402903P    PICTURE X.
           02  B402903H    PICTURE X.
           02  B402903V    PICTURE X.
           02  B402903O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B414203C    PICTURE X.
           02  B414203P    PICTURE X.
           02  B414203H    PICTURE X.
           02  B414203V    PICTURE X.
           02  B414203O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B402704C    PICTURE X.
           02  B402704P    PICTURE X.
           02  B402704H    PICTURE X.
           02  B402704V    PICTURE X.
           02  B402704O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B405904C    PICTURE X.
           02  B405904P    PICTURE X.
           02  B405904H    PICTURE X.
           02  B405904V    PICTURE X.
           02  B405904O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B402904C    PICTURE X.
           02  B402904P    PICTURE X.
           02  B402904H    PICTURE X.
           02  B402904V    PICTURE X.
           02  B402904O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B414204C    PICTURE X.
           02  B414204P    PICTURE X.
           02  B414204H    PICTURE X.
           02  B414204V    PICTURE X.
           02  B414204O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B402705C    PICTURE X.
           02  B402705P    PICTURE X.
           02  B402705H    PICTURE X.
           02  B402705V    PICTURE X.
           02  B402705O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B405905C    PICTURE X.
           02  B405905P    PICTURE X.
           02  B405905H    PICTURE X.
           02  B405905V    PICTURE X.
           02  B405905O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B402905C    PICTURE X.
           02  B402905P    PICTURE X.
           02  B402905H    PICTURE X.
           02  B402905V    PICTURE X.
           02  B402905O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B414205C    PICTURE X.
           02  B414205P    PICTURE X.
           02  B414205H    PICTURE X.
           02  B414205V    PICTURE X.
           02  B414205O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  IMPFS15C    PICTURE X.
           02  IMPFS15P    PICTURE X.
           02  IMPFS15H    PICTURE X.
           02  IMPFS15V    PICTURE X.
           02  IMPFS15O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR15C    PICTURE X.
           02  IMERR15P    PICTURE X.
           02  IMERR15H    PICTURE X.
           02  IMERR15V    PICTURE X.
           02  IMERR15O  PIC X(79).
       01  IMB1M16I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN15L    COMP  PIC  S9(4).
           02  IMTRN15F    PICTURE X.
           02  FILLER REDEFINES IMTRN15F.
             03 IMTRN15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN15I  PIC X(4).
           02  BDATE14L    COMP  PIC  S9(4).
           02  BDATE14F    PICTURE X.
           02  FILLER REDEFINES BDATE14F.
             03 BDATE14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE14I  PIC X(8).
           02  BTIME14L    COMP  PIC  S9(4).
           02  BTIME14F    PICTURE X.
           02  FILLER REDEFINES BTIME14F.
             03 BTIME14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME14I  PIC X(8).
           02  IMPGE14L    COMP  PIC  S9(4).
           02  IMPGE14F    PICTURE X.
           02  FILLER REDEFINES IMPGE14F.
             03 IMPGE14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE14I  PIC X(2).
           02  CTL1014L    COMP  PIC  S9(4).
           02  CTL1014F    PICTURE X.
           02  FILLER REDEFINES CTL1014F.
             03 CTL1014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1014I  PIC X(2).
           02  CTL2014L    COMP  PIC  S9(4).
           02  CTL2014F    PICTURE X.
           02  FILLER REDEFINES CTL2014F.
             03 CTL2014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2014I  PIC X(3).
           02  CTL3014L    COMP  PIC  S9(4).
           02  CTL3014F    PICTURE X.
           02  FILLER REDEFINES CTL3014F.
             03 CTL3014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3014I  PIC X(3).
           02  IMB5034L    COMP  PIC  S9(4).
           02  IMB5034F    PICTURE X.
           02  FILLER REDEFINES IMB5034F.
             03 IMB5034A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5034I  PIC X(2).
           02  IMB5036L    COMP  PIC  S9(4).
           02  IMB5036F    PICTURE X.
           02  FILLER REDEFINES IMB5036F.
             03 IMB5036A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5036I  PIC X(1).
           02  IMB1114L    COMP  PIC  S9(4).
           02  IMB1114F    PICTURE X.
           02  FILLER REDEFINES IMB1114F.
             03 IMB1114A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1114I  PIC X(1).
           02  IMB1115L    COMP  PIC  S9(4).
           02  IMB1115F    PICTURE X.
           02  FILLER REDEFINES IMB1115F.
             03 IMB1115A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1115I  PIC X(1).
           02  IMB1107L    COMP  PIC  S9(4).
           02  IMB1107F    PICTURE X.
           02  FILLER REDEFINES IMB1107F.
             03 IMB1107A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1107I  PIC X(3).
           02  B503701L    COMP  PIC  S9(4).
           02  B503701F    PICTURE X.
           02  FILLER REDEFINES B503701F.
             03 B503701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B503701I  PIC X(1).
           02  B503702L    COMP  PIC  S9(4).
           02  B503702F    PICTURE X.
           02  FILLER REDEFINES B503702F.
             03 B503702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B503702I  PIC X(1).
           02  B503703L    COMP  PIC  S9(4).
           02  B503703F    PICTURE X.
           02  FILLER REDEFINES B503703F.
             03 B503703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B503703I  PIC X(1).
           02  B503704L    COMP  PIC  S9(4).
           02  B503704F    PICTURE X.
           02  FILLER REDEFINES B503704F.
             03 B503704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B503704I  PIC X(1).
           02  B503705L    COMP  PIC  S9(4).
           02  B503705F    PICTURE X.
           02  FILLER REDEFINES B503705F.
             03 B503705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B503705I  PIC X(1).
           02  B503706L    COMP  PIC  S9(4).
           02  B503706F    PICTURE X.
           02  FILLER REDEFINES B503706F.
             03 B503706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B503706I  PIC X(1).
           02  B503707L    COMP  PIC  S9(4).
           02  B503707F    PICTURE X.
           02  FILLER REDEFINES B503707F.
             03 B503707A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B503707I  PIC X(1).
           02  B503708L    COMP  PIC  S9(4).
           02  B503708F    PICTURE X.
           02  FILLER REDEFINES B503708F.
             03 B503708A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B503708I  PIC X(1).
           02  B503709L    COMP  PIC  S9(4).
           02  B503709F    PICTURE X.
           02  FILLER REDEFINES B503709F.
             03 B503709A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B503709I  PIC X(1).
           02  IMPFS16L    COMP  PIC  S9(4).
           02  IMPFS16F    PICTURE X.
           02  FILLER REDEFINES IMPFS16F.
             03 IMPFS16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS16I  PIC X(79).
           02  IMERR16L    COMP  PIC  S9(4).
           02  IMERR16F    PICTURE X.
           02  FILLER REDEFINES IMERR16F.
             03 IMERR16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR16I  PIC X(79).
       01  IMB1M16O REDEFINES IMB1M16I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN15C    PICTURE X.
           02  IMTRN15P    PICTURE X.
           02  IMTRN15H    PICTURE X.
           02  IMTRN15V    PICTURE X.
           02  IMTRN15O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE14C    PICTURE X.
           02  BDATE14P    PICTURE X.
           02  BDATE14H    PICTURE X.
           02  BDATE14V    PICTURE X.
           02  BDATE14O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME14C    PICTURE X.
           02  BTIME14P    PICTURE X.
           02  BTIME14H    PICTURE X.
           02  BTIME14V    PICTURE X.
           02  BTIME14O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE14C    PICTURE X.
           02  IMPGE14P    PICTURE X.
           02  IMPGE14H    PICTURE X.
           02  IMPGE14V    PICTURE X.
           02  IMPGE14O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1014C    PICTURE X.
           02  CTL1014P    PICTURE X.
           02  CTL1014H    PICTURE X.
           02  CTL1014V    PICTURE X.
           02  CTL1014O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2014C    PICTURE X.
           02  CTL2014P    PICTURE X.
           02  CTL2014H    PICTURE X.
           02  CTL2014V    PICTURE X.
           02  CTL2014O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3014C    PICTURE X.
           02  CTL3014P    PICTURE X.
           02  CTL3014H    PICTURE X.
           02  CTL3014V    PICTURE X.
           02  CTL3014O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB5034C    PICTURE X.
           02  IMB5034P    PICTURE X.
           02  IMB5034H    PICTURE X.
           02  IMB5034V    PICTURE X.
           02  IMB5034O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB5036C    PICTURE X.
           02  IMB5036P    PICTURE X.
           02  IMB5036H    PICTURE X.
           02  IMB5036V    PICTURE X.
           02  IMB5036O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1114C    PICTURE X.
           02  IMB1114P    PICTURE X.
           02  IMB1114H    PICTURE X.
           02  IMB1114V    PICTURE X.
           02  IMB1114O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1115C    PICTURE X.
           02  IMB1115P    PICTURE X.
           02  IMB1115H    PICTURE X.
           02  IMB1115V    PICTURE X.
           02  IMB1115O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1107C    PICTURE X.
           02  IMB1107P    PICTURE X.
           02  IMB1107H    PICTURE X.
           02  IMB1107V    PICTURE X.
           02  IMB1107O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B503701C    PICTURE X.
           02  B503701P    PICTURE X.
           02  B503701H    PICTURE X.
           02  B503701V    PICTURE X.
           02  B503701O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B503702C    PICTURE X.
           02  B503702P    PICTURE X.
           02  B503702H    PICTURE X.
           02  B503702V    PICTURE X.
           02  B503702O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B503703C    PICTURE X.
           02  B503703P    PICTURE X.
           02  B503703H    PICTURE X.
           02  B503703V    PICTURE X.
           02  B503703O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B503704C    PICTURE X.
           02  B503704P    PICTURE X.
           02  B503704H    PICTURE X.
           02  B503704V    PICTURE X.
           02  B503704O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B503705C    PICTURE X.
           02  B503705P    PICTURE X.
           02  B503705H    PICTURE X.
           02  B503705V    PICTURE X.
           02  B503705O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B503706C    PICTURE X.
           02  B503706P    PICTURE X.
           02  B503706H    PICTURE X.
           02  B503706V    PICTURE X.
           02  B503706O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B503707C    PICTURE X.
           02  B503707P    PICTURE X.
           02  B503707H    PICTURE X.
           02  B503707V    PICTURE X.
           02  B503707O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B503708C    PICTURE X.
           02  B503708P    PICTURE X.
           02  B503708H    PICTURE X.
           02  B503708V    PICTURE X.
           02  B503708O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B503709C    PICTURE X.
           02  B503709P    PICTURE X.
           02  B503709H    PICTURE X.
           02  B503709V    PICTURE X.
           02  B503709O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS16C    PICTURE X.
           02  IMPFS16P    PICTURE X.
           02  IMPFS16H    PICTURE X.
           02  IMPFS16V    PICTURE X.
           02  IMPFS16O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR16C    PICTURE X.
           02  IMERR16P    PICTURE X.
           02  IMERR16H    PICTURE X.
           02  IMERR16V    PICTURE X.
           02  IMERR16O  PIC X(79).
       01  IMB1M17I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN16L    COMP  PIC  S9(4).
           02  IMTRN16F    PICTURE X.
           02  FILLER REDEFINES IMTRN16F.
             03 IMTRN16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN16I  PIC X(4).
           02  BDATE15L    COMP  PIC  S9(4).
           02  BDATE15F    PICTURE X.
           02  FILLER REDEFINES BDATE15F.
             03 BDATE15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE15I  PIC X(8).
           02  BTIME15L    COMP  PIC  S9(4).
           02  BTIME15F    PICTURE X.
           02  FILLER REDEFINES BTIME15F.
             03 BTIME15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME15I  PIC X(8).
           02  IMPGE15L    COMP  PIC  S9(4).
           02  IMPGE15F    PICTURE X.
           02  FILLER REDEFINES IMPGE15F.
             03 IMPGE15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE15I  PIC X(2).
           02  CTL1015L    COMP  PIC  S9(4).
           02  CTL1015F    PICTURE X.
           02  FILLER REDEFINES CTL1015F.
             03 CTL1015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1015I  PIC X(2).
           02  CTL2015L    COMP  PIC  S9(4).
           02  CTL2015F    PICTURE X.
           02  FILLER REDEFINES CTL2015F.
             03 CTL2015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2015I  PIC X(3).
           02  CTL3015L    COMP  PIC  S9(4).
           02  CTL3015F    PICTURE X.
           02  FILLER REDEFINES CTL3015F.
             03 CTL3015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3015I  PIC X(3).
           02  IMB1102L    COMP  PIC  S9(4).
           02  IMB1102F    PICTURE X.
           02  FILLER REDEFINES IMB1102F.
             03 IMB1102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1102I  PIC X(30).
           02  IMB4022L    COMP  PIC  S9(4).
           02  IMB4022F    PICTURE X.
           02  FILLER REDEFINES IMB4022F.
             03 IMB4022A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4022I  PIC X(1).
           02  IME4022L    COMP  PIC  S9(4).
           02  IME4022F    PICTURE X.
           02  FILLER REDEFINES IME4022F.
             03 IME4022A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4022I  PIC X(16).
           02  IMB4048L    COMP  PIC  S9(4).
           02  IMB4048F    PICTURE X.
           02  FILLER REDEFINES IMB4048F.
             03 IMB4048A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4048I  PIC X(1).
           02  IME4048L    COMP  PIC  S9(4).
           02  IME4048F    PICTURE X.
           02  FILLER REDEFINES IME4048F.
             03 IME4048A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4048I  PIC X(16).
           02  IMB4078L    COMP  PIC  S9(4).
           02  IMB4078F    PICTURE X.
           02  FILLER REDEFINES IMB4078F.
             03 IMB4078A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4078I  PIC X(1).
           02  IME4078L    COMP  PIC  S9(4).
           02  IME4078F    PICTURE X.
           02  FILLER REDEFINES IME4078F.
             03 IME4078A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4078I  PIC X(16).
           02  IMB4024L    COMP  PIC  S9(4).
           02  IMB4024F    PICTURE X.
           02  FILLER REDEFINES IMB4024F.
             03 IMB4024A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4024I  PIC X(1).
           02  IME4024L    COMP  PIC  S9(4).
           02  IME4024F    PICTURE X.
           02  FILLER REDEFINES IME4024F.
             03 IME4024A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4024I  PIC X(16).
           02  IMB4081L    COMP  PIC  S9(4).
           02  IMB4081F    PICTURE X.
           02  FILLER REDEFINES IMB4081F.
             03 IMB4081A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4081I  PIC X(1).
           02  IME4081L    COMP  PIC  S9(4).
           02  IME4081F    PICTURE X.
           02  FILLER REDEFINES IME4081F.
             03 IME4081A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4081I  PIC X(16).
           02  IMB4080L    COMP  PIC  S9(4).
           02  IMB4080F    PICTURE X.
           02  FILLER REDEFINES IMB4080F.
             03 IMB4080A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4080I  PIC X(1).
           02  IME4080L    COMP  PIC  S9(4).
           02  IME4080F    PICTURE X.
           02  FILLER REDEFINES IME4080F.
             03 IME4080A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4080I  PIC X(16).
           02  IMB4023L    COMP  PIC  S9(4).
           02  IMB4023F    PICTURE X.
           02  FILLER REDEFINES IMB4023F.
             03 IMB4023A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4023I  PIC X(1).
           02  IME4023L    COMP  PIC  S9(4).
           02  IME4023F    PICTURE X.
           02  FILLER REDEFINES IME4023F.
             03 IME4023A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4023I  PIC X(16).
           02  IMB4021L    COMP  PIC  S9(4).
           02  IMB4021F    PICTURE X.
           02  FILLER REDEFINES IMB4021F.
             03 IMB4021A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4021I  PIC X(3).
           02  IMB4019L    COMP  PIC  S9(4).
           02  IMB4019F    PICTURE X.
           02  FILLER REDEFINES IMB4019F.
             03 IMB4019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4019I  PIC X(1).
           02  IME4019L    COMP  PIC  S9(4).
           02  IME4019F    PICTURE X.
           02  FILLER REDEFINES IME4019F.
             03 IME4019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME4019I  PIC X(16).
           02  IMB4020L    COMP  PIC  S9(4).
           02  IMB4020F    PICTURE X.
           02  FILLER REDEFINES IMB4020F.
             03 IMB4020A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4020I  PIC X(6).
           02  IMB4143L    COMP  PIC  S9(4).
           02  IMB4143F    PICTURE X.
           02  FILLER REDEFINES IMB4143F.
             03 IMB4143A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4143I  PIC X(4).
           02  IMPFS17L    COMP  PIC  S9(4).
           02  IMPFS17F    PICTURE X.
           02  FILLER REDEFINES IMPFS17F.
             03 IMPFS17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS17I  PIC X(79).
           02  IMERR17L    COMP  PIC  S9(4).
           02  IMERR17F    PICTURE X.
           02  FILLER REDEFINES IMERR17F.
             03 IMERR17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR17I  PIC X(79).
       01  IMB1M17O REDEFINES IMB1M17I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN16C    PICTURE X.
           02  IMTRN16P    PICTURE X.
           02  IMTRN16H    PICTURE X.
           02  IMTRN16V    PICTURE X.
           02  IMTRN16O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE15C    PICTURE X.
           02  BDATE15P    PICTURE X.
           02  BDATE15H    PICTURE X.
           02  BDATE15V    PICTURE X.
           02  BDATE15O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME15C    PICTURE X.
           02  BTIME15P    PICTURE X.
           02  BTIME15H    PICTURE X.
           02  BTIME15V    PICTURE X.
           02  BTIME15O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE15C    PICTURE X.
           02  IMPGE15P    PICTURE X.
           02  IMPGE15H    PICTURE X.
           02  IMPGE15V    PICTURE X.
           02  IMPGE15O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1015C    PICTURE X.
           02  CTL1015P    PICTURE X.
           02  CTL1015H    PICTURE X.
           02  CTL1015V    PICTURE X.
           02  CTL1015O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2015C    PICTURE X.
           02  CTL2015P    PICTURE X.
           02  CTL2015H    PICTURE X.
           02  CTL2015V    PICTURE X.
           02  CTL2015O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3015C    PICTURE X.
           02  CTL3015P    PICTURE X.
           02  CTL3015H    PICTURE X.
           02  CTL3015V    PICTURE X.
           02  CTL3015O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1102C    PICTURE X.
           02  IMB1102P    PICTURE X.
           02  IMB1102H    PICTURE X.
           02  IMB1102V    PICTURE X.
           02  IMB1102O  PIC X(30).
           02  FILLER PICTURE X(3).
           02  IMB4022C    PICTURE X.
           02  IMB4022P    PICTURE X.
           02  IMB4022H    PICTURE X.
           02  IMB4022V    PICTURE X.
           02  IMB4022O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4022C    PICTURE X.
           02  IME4022P    PICTURE X.
           02  IME4022H    PICTURE X.
           02  IME4022V    PICTURE X.
           02  IME4022O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4048C    PICTURE X.
           02  IMB4048P    PICTURE X.
           02  IMB4048H    PICTURE X.
           02  IMB4048V    PICTURE X.
           02  IMB4048O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4048C    PICTURE X.
           02  IME4048P    PICTURE X.
           02  IME4048H    PICTURE X.
           02  IME4048V    PICTURE X.
           02  IME4048O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4078C    PICTURE X.
           02  IMB4078P    PICTURE X.
           02  IMB4078H    PICTURE X.
           02  IMB4078V    PICTURE X.
           02  IMB4078O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4078C    PICTURE X.
           02  IME4078P    PICTURE X.
           02  IME4078H    PICTURE X.
           02  IME4078V    PICTURE X.
           02  IME4078O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4024C    PICTURE X.
           02  IMB4024P    PICTURE X.
           02  IMB4024H    PICTURE X.
           02  IMB4024V    PICTURE X.
           02  IMB4024O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4024C    PICTURE X.
           02  IME4024P    PICTURE X.
           02  IME4024H    PICTURE X.
           02  IME4024V    PICTURE X.
           02  IME4024O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4081C    PICTURE X.
           02  IMB4081P    PICTURE X.
           02  IMB4081H    PICTURE X.
           02  IMB4081V    PICTURE X.
           02  IMB4081O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4081C    PICTURE X.
           02  IME4081P    PICTURE X.
           02  IME4081H    PICTURE X.
           02  IME4081V    PICTURE X.
           02  IME4081O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4080C    PICTURE X.
           02  IMB4080P    PICTURE X.
           02  IMB4080H    PICTURE X.
           02  IMB4080V    PICTURE X.
           02  IMB4080O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4080C    PICTURE X.
           02  IME4080P    PICTURE X.
           02  IME4080H    PICTURE X.
           02  IME4080V    PICTURE X.
           02  IME4080O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4023C    PICTURE X.
           02  IMB4023P    PICTURE X.
           02  IMB4023H    PICTURE X.
           02  IMB4023V    PICTURE X.
           02  IMB4023O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4023C    PICTURE X.
           02  IME4023P    PICTURE X.
           02  IME4023H    PICTURE X.
           02  IME4023V    PICTURE X.
           02  IME4023O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4021C    PICTURE X.
           02  IMB4021P    PICTURE X.
           02  IMB4021H    PICTURE X.
           02  IMB4021V    PICTURE X.
           02  IMB4021O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB4019C    PICTURE X.
           02  IMB4019P    PICTURE X.
           02  IMB4019H    PICTURE X.
           02  IMB4019V    PICTURE X.
           02  IMB4019O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME4019C    PICTURE X.
           02  IME4019P    PICTURE X.
           02  IME4019H    PICTURE X.
           02  IME4019V    PICTURE X.
           02  IME4019O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB4020C    PICTURE X.
           02  IMB4020P    PICTURE X.
           02  IMB4020H    PICTURE X.
           02  IMB4020V    PICTURE X.
           02  IMB4020O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMB4143C    PICTURE X.
           02  IMB4143P    PICTURE X.
           02  IMB4143H    PICTURE X.
           02  IMB4143V    PICTURE X.
           02  IMB4143O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMPFS17C    PICTURE X.
           02  IMPFS17P    PICTURE X.
           02  IMPFS17H    PICTURE X.
           02  IMPFS17V    PICTURE X.
           02  IMPFS17O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR17C    PICTURE X.
           02  IMERR17P    PICTURE X.
           02  IMERR17H    PICTURE X.
           02  IMERR17V    PICTURE X.
           02  IMERR17O  PIC X(79).
       01  IMB1M18I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN17L    COMP  PIC  S9(4).
           02  IMTRN17F    PICTURE X.
           02  FILLER REDEFINES IMTRN17F.
             03 IMTRN17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN17I  PIC X(4).
           02  BDATE16L    COMP  PIC  S9(4).
           02  BDATE16F    PICTURE X.
           02  FILLER REDEFINES BDATE16F.
             03 BDATE16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE16I  PIC X(8).
           02  BTIME16L    COMP  PIC  S9(4).
           02  BTIME16F    PICTURE X.
           02  FILLER REDEFINES BTIME16F.
             03 BTIME16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME16I  PIC X(8).
           02  IMPGE16L    COMP  PIC  S9(4).
           02  IMPGE16F    PICTURE X.
           02  FILLER REDEFINES IMPGE16F.
             03 IMPGE16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE16I  PIC X(2).
           02  CTL1016L    COMP  PIC  S9(4).
           02  CTL1016F    PICTURE X.
           02  FILLER REDEFINES CTL1016F.
             03 CTL1016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1016I  PIC X(2).
           02  CTL2016L    COMP  PIC  S9(4).
           02  CTL2016F    PICTURE X.
           02  FILLER REDEFINES CTL2016F.
             03 CTL2016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2016I  PIC X(3).
           02  CTL3016L    COMP  PIC  S9(4).
           02  CTL3016F    PICTURE X.
           02  FILLER REDEFINES CTL3016F.
             03 CTL3016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3016I  PIC X(3).
           02  IMB4139L    COMP  PIC  S9(4).
           02  IMB4139F    PICTURE X.
           02  FILLER REDEFINES IMB4139F.
             03 IMB4139A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4139I  PIC X(10).
           02  IMB4138L    COMP  PIC  S9(4).
           02  IMB4138F    PICTURE X.
           02  FILLER REDEFINES IMB4138F.
             03 IMB4138A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4138I  PIC X(10).
           02  IMB4137L    COMP  PIC  S9(4).
           02  IMB4137F    PICTURE X.
           02  FILLER REDEFINES IMB4137F.
             03 IMB4137A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4137I  PIC X(10).
           02  IMB4136L    COMP  PIC  S9(4).
           02  IMB4136F    PICTURE X.
           02  FILLER REDEFINES IMB4136F.
             03 IMB4136A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4136I  PIC X(10).
           02  IMB4135L    COMP  PIC  S9(4).
           02  IMB4135F    PICTURE X.
           02  FILLER REDEFINES IMB4135F.
             03 IMB4135A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4135I  PIC X(10).
           02  IMB4134L    COMP  PIC  S9(4).
           02  IMB4134F    PICTURE X.
           02  FILLER REDEFINES IMB4134F.
             03 IMB4134A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4134I  PIC X(10).
           02  IMB4141L    COMP  PIC  S9(4).
           02  IMB4141F    PICTURE X.
           02  FILLER REDEFINES IMB4141F.
             03 IMB4141A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4141I  PIC X(10).
           02  IMB4140L    COMP  PIC  S9(4).
           02  IMB4140F    PICTURE X.
           02  FILLER REDEFINES IMB4140F.
             03 IMB4140A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4140I  PIC X(10).
           02  B413301L    COMP  PIC  S9(4).
           02  B413301F    PICTURE X.
           02  FILLER REDEFINES B413301F.
             03 B413301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B413301I  PIC X(10).
           02  B413302L    COMP  PIC  S9(4).
           02  B413302F    PICTURE X.
           02  FILLER REDEFINES B413302F.
             03 B413302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B413302I  PIC X(10).
           02  B413303L    COMP  PIC  S9(4).
           02  B413303F    PICTURE X.
           02  FILLER REDEFINES B413303F.
             03 B413303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B413303I  PIC X(10).
           02  B413304L    COMP  PIC  S9(4).
           02  B413304F    PICTURE X.
           02  FILLER REDEFINES B413304F.
             03 B413304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B413304I  PIC X(10).
           02  B413305L    COMP  PIC  S9(4).
           02  B413305F    PICTURE X.
           02  FILLER REDEFINES B413305F.
             03 B413305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B413305I  PIC X(10).
           02  IMPFS18L    COMP  PIC  S9(4).
           02  IMPFS18F    PICTURE X.
           02  FILLER REDEFINES IMPFS18F.
             03 IMPFS18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS18I  PIC X(79).
           02  IMERR18L    COMP  PIC  S9(4).
           02  IMERR18F    PICTURE X.
           02  FILLER REDEFINES IMERR18F.
             03 IMERR18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR18I  PIC X(79).
       01  IMB1M18O REDEFINES IMB1M18I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN17C    PICTURE X.
           02  IMTRN17P    PICTURE X.
           02  IMTRN17H    PICTURE X.
           02  IMTRN17V    PICTURE X.
           02  IMTRN17O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE16C    PICTURE X.
           02  BDATE16P    PICTURE X.
           02  BDATE16H    PICTURE X.
           02  BDATE16V    PICTURE X.
           02  BDATE16O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME16C    PICTURE X.
           02  BTIME16P    PICTURE X.
           02  BTIME16H    PICTURE X.
           02  BTIME16V    PICTURE X.
           02  BTIME16O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE16C    PICTURE X.
           02  IMPGE16P    PICTURE X.
           02  IMPGE16H    PICTURE X.
           02  IMPGE16V    PICTURE X.
           02  IMPGE16O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1016C    PICTURE X.
           02  CTL1016P    PICTURE X.
           02  CTL1016H    PICTURE X.
           02  CTL1016V    PICTURE X.
           02  CTL1016O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2016C    PICTURE X.
           02  CTL2016P    PICTURE X.
           02  CTL2016H    PICTURE X.
           02  CTL2016V    PICTURE X.
           02  CTL2016O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3016C    PICTURE X.
           02  CTL3016P    PICTURE X.
           02  CTL3016H    PICTURE X.
           02  CTL3016V    PICTURE X.
           02  CTL3016O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB4139C    PICTURE X.
           02  IMB4139P    PICTURE X.
           02  IMB4139H    PICTURE X.
           02  IMB4139V    PICTURE X.
           02  IMB4139O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB4138C    PICTURE X.
           02  IMB4138P    PICTURE X.
           02  IMB4138H    PICTURE X.
           02  IMB4138V    PICTURE X.
           02  IMB4138O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB4137C    PICTURE X.
           02  IMB4137P    PICTURE X.
           02  IMB4137H    PICTURE X.
           02  IMB4137V    PICTURE X.
           02  IMB4137O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB4136C    PICTURE X.
           02  IMB4136P    PICTURE X.
           02  IMB4136H    PICTURE X.
           02  IMB4136V    PICTURE X.
           02  IMB4136O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB4135C    PICTURE X.
           02  IMB4135P    PICTURE X.
           02  IMB4135H    PICTURE X.
           02  IMB4135V    PICTURE X.
           02  IMB4135O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB4134C    PICTURE X.
           02  IMB4134P    PICTURE X.
           02  IMB4134H    PICTURE X.
           02  IMB4134V    PICTURE X.
           02  IMB4134O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB4141C    PICTURE X.
           02  IMB4141P    PICTURE X.
           02  IMB4141H    PICTURE X.
           02  IMB4141V    PICTURE X.
           02  IMB4141O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB4140C    PICTURE X.
           02  IMB4140P    PICTURE X.
           02  IMB4140H    PICTURE X.
           02  IMB4140V    PICTURE X.
           02  IMB4140O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  B413301C    PICTURE X.
           02  B413301P    PICTURE X.
           02  B413301H    PICTURE X.
           02  B413301V    PICTURE X.
           02  B413301O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  B413302C    PICTURE X.
           02  B413302P    PICTURE X.
           02  B413302H    PICTURE X.
           02  B413302V    PICTURE X.
           02  B413302O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  B413303C    PICTURE X.
           02  B413303P    PICTURE X.
           02  B413303H    PICTURE X.
           02  B413303V    PICTURE X.
           02  B413303O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  B413304C    PICTURE X.
           02  B413304P    PICTURE X.
           02  B413304H    PICTURE X.
           02  B413304V    PICTURE X.
           02  B413304O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  B413305C    PICTURE X.
           02  B413305P    PICTURE X.
           02  B413305H    PICTURE X.
           02  B413305V    PICTURE X.
           02  B413305O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMPFS18C    PICTURE X.
           02  IMPFS18P    PICTURE X.
           02  IMPFS18H    PICTURE X.
           02  IMPFS18V    PICTURE X.
           02  IMPFS18O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR18C    PICTURE X.
           02  IMERR18P    PICTURE X.
           02  IMERR18H    PICTURE X.
           02  IMERR18V    PICTURE X.
           02  IMERR18O  PIC X(79).
       01  IMB1M19I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN18L    COMP  PIC  S9(4).
           02  IMTRN18F    PICTURE X.
           02  FILLER REDEFINES IMTRN18F.
             03 IMTRN18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN18I  PIC X(4).
           02  BDATE18L    COMP  PIC  S9(4).
           02  BDATE18F    PICTURE X.
           02  FILLER REDEFINES BDATE18F.
             03 BDATE18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE18I  PIC X(8).
           02  BTIME18L    COMP  PIC  S9(4).
           02  BTIME18F    PICTURE X.
           02  FILLER REDEFINES BTIME18F.
             03 BTIME18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME18I  PIC X(8).
           02  IMPGE18L    COMP  PIC  S9(4).
           02  IMPGE18F    PICTURE X.
           02  FILLER REDEFINES IMPGE18F.
             03 IMPGE18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE18I  PIC X(2).
           02  CTL1018L    COMP  PIC  S9(4).
           02  CTL1018F    PICTURE X.
           02  FILLER REDEFINES CTL1018F.
             03 CTL1018A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1018I  PIC X(2).
           02  CTL2018L    COMP  PIC  S9(4).
           02  CTL2018F    PICTURE X.
           02  FILLER REDEFINES CTL2018F.
             03 CTL2018A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2018I  PIC X(3).
           02  CTL3018L    COMP  PIC  S9(4).
           02  CTL3018F    PICTURE X.
           02  FILLER REDEFINES CTL3018F.
             03 CTL3018A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3018I  PIC X(3).
           02  IMB4061L    COMP  PIC  S9(4).
           02  IMB4061F    PICTURE X.
           02  FILLER REDEFINES IMB4061F.
             03 IMB4061A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4061I  PIC X(4).
           02  B406403L    COMP  PIC  S9(4).
           02  B406403F    PICTURE X.
           02  FILLER REDEFINES B406403F.
             03 B406403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B406403I  PIC X(4).
           02  B203702L    COMP  PIC  S9(4).
           02  B203702F    PICTURE X.
           02  FILLER REDEFINES B203702F.
             03 B203702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B203702I  PIC X(4).
           02  IMB2035L    COMP  PIC  S9(4).
           02  IMB2035F    PICTURE X.
           02  FILLER REDEFINES IMB2035F.
             03 IMB2035A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2035I  PIC X(4).
           02  IMB4155L    COMP  PIC  S9(4).
           02  IMB4155F    PICTURE X.
           02  FILLER REDEFINES IMB4155F.
             03 IMB4155A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4155I  PIC X(4).
           02  B203703L    COMP  PIC  S9(4).
           02  B203703F    PICTURE X.
           02  FILLER REDEFINES B203703F.
             03 B203703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B203703I  PIC X(4).
           02  IMB1112L    COMP  PIC  S9(4).
           02  IMB1112F    PICTURE X.
           02  FILLER REDEFINES IMB1112F.
             03 IMB1112A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1112I  PIC X(4).
           02  IMB5072L    COMP  PIC  S9(4).
           02  IMB5072F    PICTURE X.
           02  FILLER REDEFINES IMB5072F.
             03 IMB5072A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5072I  PIC X(4).
           02  IMB4055L    COMP  PIC  S9(4).
           02  IMB4055F    PICTURE X.
           02  FILLER REDEFINES IMB4055F.
             03 IMB4055A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4055I  PIC X(4).
           02  IMB2036L    COMP  PIC  S9(4).
           02  IMB2036F    PICTURE X.
           02  FILLER REDEFINES IMB2036F.
             03 IMB2036A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2036I  PIC X(4).
           02  IMB7005L    COMP  PIC  S9(4).
           02  IMB7005F    PICTURE X.
           02  FILLER REDEFINES IMB7005F.
             03 IMB7005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7005I  PIC X(4).
           02  IMB4025L    COMP  PIC  S9(4).
           02  IMB4025F    PICTURE X.
           02  FILLER REDEFINES IMB4025F.
             03 IMB4025A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4025I  PIC X(4).
           02  IMB2039L    COMP  PIC  S9(4).
           02  IMB2039F    PICTURE X.
           02  FILLER REDEFINES IMB2039F.
             03 IMB2039A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2039I  PIC X(4).
           02  IMB7048L    COMP  PIC  S9(4).
           02  IMB7048F    PICTURE X.
           02  FILLER REDEFINES IMB7048F.
             03 IMB7048A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7048I  PIC X(4).
           02  IMB5022L    COMP  PIC  S9(4).
           02  IMB5022F    PICTURE X.
           02  FILLER REDEFINES IMB5022F.
             03 IMB5022A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5022I  PIC X(4).
           02  IMB1110L    COMP  PIC  S9(4).
           02  IMB1110F    PICTURE X.
           02  FILLER REDEFINES IMB1110F.
             03 IMB1110A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1110I  PIC X(4).
           02  IMB5059L    COMP  PIC  S9(4).
           02  IMB5059F    PICTURE X.
           02  FILLER REDEFINES IMB5059F.
             03 IMB5059A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5059I  PIC X(4).
           02  IMB4010L    COMP  PIC  S9(4).
           02  IMB4010F    PICTURE X.
           02  FILLER REDEFINES IMB4010F.
             03 IMB4010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4010I  PIC X(4).
           02  IMB4151L    COMP  PIC  S9(4).
           02  IMB4151F    PICTURE X.
           02  FILLER REDEFINES IMB4151F.
             03 IMB4151A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4151I  PIC X(4).
           02  IMB4026L    COMP  PIC  S9(4).
           02  IMB4026F    PICTURE X.
           02  FILLER REDEFINES IMB4026F.
             03 IMB4026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4026I  PIC X(4).
           02  IMB6023L    COMP  PIC  S9(4).
           02  IMB6023F    PICTURE X.
           02  FILLER REDEFINES IMB6023F.
             03 IMB6023A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6023I  PIC X(4).
           02  IMB5044L    COMP  PIC  S9(4).
           02  IMB5044F    PICTURE X.
           02  FILLER REDEFINES IMB5044F.
             03 IMB5044A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5044I  PIC X(4).
           02  B404901L    COMP  PIC  S9(4).
           02  B404901F    PICTURE X.
           02  FILLER REDEFINES B404901F.
             03 B404901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B404901I  PIC X(4).
           02  IMB6024L    COMP  PIC  S9(4).
           02  IMB6024F    PICTURE X.
           02  FILLER REDEFINES IMB6024F.
             03 IMB6024A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6024I  PIC X(4).
           02  IMB4152L    COMP  PIC  S9(4).
           02  IMB4152F    PICTURE X.
           02  FILLER REDEFINES IMB4152F.
             03 IMB4152A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4152I  PIC X(4).
           02  B404902L    COMP  PIC  S9(4).
           02  B404902F    PICTURE X.
           02  FILLER REDEFINES B404902F.
             03 B404902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B404902I  PIC X(4).
           02  IMB4144L    COMP  PIC  S9(4).
           02  IMB4144F    PICTURE X.
           02  FILLER REDEFINES IMB4144F.
             03 IMB4144A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4144I  PIC X(4).
           02  IMB4153L    COMP  PIC  S9(4).
           02  IMB4153F    PICTURE X.
           02  FILLER REDEFINES IMB4153F.
             03 IMB4153A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4153I  PIC X(4).
           02  B404903L    COMP  PIC  S9(4).
           02  B404903F    PICTURE X.
           02  FILLER REDEFINES B404903F.
             03 B404903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B404903I  PIC X(4).
           02  IMB6022L    COMP  PIC  S9(4).
           02  IMB6022F    PICTURE X.
           02  FILLER REDEFINES IMB6022F.
             03 IMB6022A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6022I  PIC X(4).
           02  IMB4154L    COMP  PIC  S9(4).
           02  IMB4154F    PICTURE X.
           02  FILLER REDEFINES IMB4154F.
             03 IMB4154A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4154I  PIC X(4).
           02  IMB4126L    COMP  PIC  S9(4).
           02  IMB4126F    PICTURE X.
           02  FILLER REDEFINES IMB4126F.
             03 IMB4126A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4126I  PIC X(4).
           02  IMB5032L    COMP  PIC  S9(4).
           02  IMB5032F    PICTURE X.
           02  FILLER REDEFINES IMB5032F.
             03 IMB5032A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5032I  PIC X(4).
           02  B406401L    COMP  PIC  S9(4).
           02  B406401F    PICTURE X.
           02  FILLER REDEFINES B406401F.
             03 B406401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B406401I  PIC X(4).
           02  IMB4063L    COMP  PIC  S9(4).
           02  IMB4063F    PICTURE X.
           02  FILLER REDEFINES IMB4063F.
             03 IMB4063A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4063I  PIC X(4).
           02  IMB1109L    COMP  PIC  S9(4).
           02  IMB1109F    PICTURE X.
           02  FILLER REDEFINES IMB1109F.
             03 IMB1109A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1109I  PIC X(4).
           02  B406402L    COMP  PIC  S9(4).
           02  B406402F    PICTURE X.
           02  FILLER REDEFINES B406402F.
             03 B406402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B406402I  PIC X(4).
           02  B203701L    COMP  PIC  S9(4).
           02  B203701F    PICTURE X.
           02  FILLER REDEFINES B203701F.
             03 B203701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B203701I  PIC X(4).
           02  IMB1116L    COMP  PIC  S9(4).
           02  IMB1116F    PICTURE X.
           02  FILLER REDEFINES IMB1116F.
             03 IMB1116A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1116I  PIC X(8).
           02  IMB1119L    COMP  PIC  S9(4).
           02  IMB1119F    PICTURE X.
           02  FILLER REDEFINES IMB1119F.
             03 IMB1119A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1119I  PIC X(8).
           02  IMB1117L    COMP  PIC  S9(4).
           02  IMB1117F    PICTURE X.
           02  FILLER REDEFINES IMB1117F.
             03 IMB1117A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1117I  PIC X(8).
           02  IMB1118L    COMP  PIC  S9(4).
           02  IMB1118F    PICTURE X.
           02  FILLER REDEFINES IMB1118F.
             03 IMB1118A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1118I  PIC X(8).
           02  IMPFS19L    COMP  PIC  S9(4).
           02  IMPFS19F    PICTURE X.
           02  FILLER REDEFINES IMPFS19F.
             03 IMPFS19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS19I  PIC X(79).
           02  IMERR19L    COMP  PIC  S9(4).
           02  IMERR19F    PICTURE X.
           02  FILLER REDEFINES IMERR19F.
             03 IMERR19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR19I  PIC X(79).
       01  IMB1M19O REDEFINES IMB1M19I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN18C    PICTURE X.
           02  IMTRN18P    PICTURE X.
           02  IMTRN18H    PICTURE X.
           02  IMTRN18V    PICTURE X.
           02  IMTRN18O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE18C    PICTURE X.
           02  BDATE18P    PICTURE X.
           02  BDATE18H    PICTURE X.
           02  BDATE18V    PICTURE X.
           02  BDATE18O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME18C    PICTURE X.
           02  BTIME18P    PICTURE X.
           02  BTIME18H    PICTURE X.
           02  BTIME18V    PICTURE X.
           02  BTIME18O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE18C    PICTURE X.
           02  IMPGE18P    PICTURE X.
           02  IMPGE18H    PICTURE X.
           02  IMPGE18V    PICTURE X.
           02  IMPGE18O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1018C    PICTURE X.
           02  CTL1018P    PICTURE X.
           02  CTL1018H    PICTURE X.
           02  CTL1018V    PICTURE X.
           02  CTL1018O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2018C    PICTURE X.
           02  CTL2018P    PICTURE X.
           02  CTL2018H    PICTURE X.
           02  CTL2018V    PICTURE X.
           02  CTL2018O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3018C    PICTURE X.
           02  CTL3018P    PICTURE X.
           02  CTL3018H    PICTURE X.
           02  CTL3018V    PICTURE X.
           02  CTL3018O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB4061C    PICTURE X.
           02  IMB4061P    PICTURE X.
           02  IMB4061H    PICTURE X.
           02  IMB4061V    PICTURE X.
           02  IMB4061O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B406403C    PICTURE X.
           02  B406403P    PICTURE X.
           02  B406403H    PICTURE X.
           02  B406403V    PICTURE X.
           02  B406403O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B203702C    PICTURE X.
           02  B203702P    PICTURE X.
           02  B203702H    PICTURE X.
           02  B203702V    PICTURE X.
           02  B203702O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB2035C    PICTURE X.
           02  IMB2035P    PICTURE X.
           02  IMB2035H    PICTURE X.
           02  IMB2035V    PICTURE X.
           02  IMB2035O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4155C    PICTURE X.
           02  IMB4155P    PICTURE X.
           02  IMB4155H    PICTURE X.
           02  IMB4155V    PICTURE X.
           02  IMB4155O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B203703C    PICTURE X.
           02  B203703P    PICTURE X.
           02  B203703H    PICTURE X.
           02  B203703V    PICTURE X.
           02  B203703O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1112C    PICTURE X.
           02  IMB1112P    PICTURE X.
           02  IMB1112H    PICTURE X.
           02  IMB1112V    PICTURE X.
           02  IMB1112O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5072C    PICTURE X.
           02  IMB5072P    PICTURE X.
           02  IMB5072H    PICTURE X.
           02  IMB5072V    PICTURE X.
           02  IMB5072O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4055C    PICTURE X.
           02  IMB4055P    PICTURE X.
           02  IMB4055H    PICTURE X.
           02  IMB4055V    PICTURE X.
           02  IMB4055O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB2036C    PICTURE X.
           02  IMB2036P    PICTURE X.
           02  IMB2036H    PICTURE X.
           02  IMB2036V    PICTURE X.
           02  IMB2036O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB7005C    PICTURE X.
           02  IMB7005P    PICTURE X.
           02  IMB7005H    PICTURE X.
           02  IMB7005V    PICTURE X.
           02  IMB7005O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4025C    PICTURE X.
           02  IMB4025P    PICTURE X.
           02  IMB4025H    PICTURE X.
           02  IMB4025V    PICTURE X.
           02  IMB4025O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB2039C    PICTURE X.
           02  IMB2039P    PICTURE X.
           02  IMB2039H    PICTURE X.
           02  IMB2039V    PICTURE X.
           02  IMB2039O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB7048C    PICTURE X.
           02  IMB7048P    PICTURE X.
           02  IMB7048H    PICTURE X.
           02  IMB7048V    PICTURE X.
           02  IMB7048O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5022C    PICTURE X.
           02  IMB5022P    PICTURE X.
           02  IMB5022H    PICTURE X.
           02  IMB5022V    PICTURE X.
           02  IMB5022O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1110C    PICTURE X.
           02  IMB1110P    PICTURE X.
           02  IMB1110H    PICTURE X.
           02  IMB1110V    PICTURE X.
           02  IMB1110O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5059C    PICTURE X.
           02  IMB5059P    PICTURE X.
           02  IMB5059H    PICTURE X.
           02  IMB5059V    PICTURE X.
           02  IMB5059O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4010C    PICTURE X.
           02  IMB4010P    PICTURE X.
           02  IMB4010H    PICTURE X.
           02  IMB4010V    PICTURE X.
           02  IMB4010O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4151C    PICTURE X.
           02  IMB4151P    PICTURE X.
           02  IMB4151H    PICTURE X.
           02  IMB4151V    PICTURE X.
           02  IMB4151O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4026C    PICTURE X.
           02  IMB4026P    PICTURE X.
           02  IMB4026H    PICTURE X.
           02  IMB4026V    PICTURE X.
           02  IMB4026O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB6023C    PICTURE X.
           02  IMB6023P    PICTURE X.
           02  IMB6023H    PICTURE X.
           02  IMB6023V    PICTURE X.
           02  IMB6023O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5044C    PICTURE X.
           02  IMB5044P    PICTURE X.
           02  IMB5044H    PICTURE X.
           02  IMB5044V    PICTURE X.
           02  IMB5044O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B404901C    PICTURE X.
           02  B404901P    PICTURE X.
           02  B404901H    PICTURE X.
           02  B404901V    PICTURE X.
           02  B404901O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB6024C    PICTURE X.
           02  IMB6024P    PICTURE X.
           02  IMB6024H    PICTURE X.
           02  IMB6024V    PICTURE X.
           02  IMB6024O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4152C    PICTURE X.
           02  IMB4152P    PICTURE X.
           02  IMB4152H    PICTURE X.
           02  IMB4152V    PICTURE X.
           02  IMB4152O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B404902C    PICTURE X.
           02  B404902P    PICTURE X.
           02  B404902H    PICTURE X.
           02  B404902V    PICTURE X.
           02  B404902O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4144C    PICTURE X.
           02  IMB4144P    PICTURE X.
           02  IMB4144H    PICTURE X.
           02  IMB4144V    PICTURE X.
           02  IMB4144O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4153C    PICTURE X.
           02  IMB4153P    PICTURE X.
           02  IMB4153H    PICTURE X.
           02  IMB4153V    PICTURE X.
           02  IMB4153O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B404903C    PICTURE X.
           02  B404903P    PICTURE X.
           02  B404903H    PICTURE X.
           02  B404903V    PICTURE X.
           02  B404903O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB6022C    PICTURE X.
           02  IMB6022P    PICTURE X.
           02  IMB6022H    PICTURE X.
           02  IMB6022V    PICTURE X.
           02  IMB6022O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4154C    PICTURE X.
           02  IMB4154P    PICTURE X.
           02  IMB4154H    PICTURE X.
           02  IMB4154V    PICTURE X.
           02  IMB4154O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4126C    PICTURE X.
           02  IMB4126P    PICTURE X.
           02  IMB4126H    PICTURE X.
           02  IMB4126V    PICTURE X.
           02  IMB4126O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5032C    PICTURE X.
           02  IMB5032P    PICTURE X.
           02  IMB5032H    PICTURE X.
           02  IMB5032V    PICTURE X.
           02  IMB5032O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B406401C    PICTURE X.
           02  B406401P    PICTURE X.
           02  B406401H    PICTURE X.
           02  B406401V    PICTURE X.
           02  B406401O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4063C    PICTURE X.
           02  IMB4063P    PICTURE X.
           02  IMB4063H    PICTURE X.
           02  IMB4063V    PICTURE X.
           02  IMB4063O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1109C    PICTURE X.
           02  IMB1109P    PICTURE X.
           02  IMB1109H    PICTURE X.
           02  IMB1109V    PICTURE X.
           02  IMB1109O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B406402C    PICTURE X.
           02  B406402P    PICTURE X.
           02  B406402H    PICTURE X.
           02  B406402V    PICTURE X.
           02  B406402O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B203701C    PICTURE X.
           02  B203701P    PICTURE X.
           02  B203701H    PICTURE X.
           02  B203701V    PICTURE X.
           02  B203701O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1116C    PICTURE X.
           02  IMB1116P    PICTURE X.
           02  IMB1116H    PICTURE X.
           02  IMB1116V    PICTURE X.
           02  IMB1116O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMB1119C    PICTURE X.
           02  IMB1119P    PICTURE X.
           02  IMB1119H    PICTURE X.
           02  IMB1119V    PICTURE X.
           02  IMB1119O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMB1117C    PICTURE X.
           02  IMB1117P    PICTURE X.
           02  IMB1117H    PICTURE X.
           02  IMB1117V    PICTURE X.
           02  IMB1117O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMB1118C    PICTURE X.
           02  IMB1118P    PICTURE X.
           02  IMB1118H    PICTURE X.
           02  IMB1118V    PICTURE X.
           02  IMB1118O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPFS19C    PICTURE X.
           02  IMPFS19P    PICTURE X.
           02  IMPFS19H    PICTURE X.
           02  IMPFS19V    PICTURE X.
           02  IMPFS19O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR19C    PICTURE X.
           02  IMERR19P    PICTURE X.
           02  IMERR19H    PICTURE X.
           02  IMERR19V    PICTURE X.
           02  IMERR19O  PIC X(79).
       01  IMB1M20I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN19L    COMP  PIC  S9(4).
           02  IMTRN19F    PICTURE X.
           02  FILLER REDEFINES IMTRN19F.
             03 IMTRN19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN19I  PIC X(4).
           02  BDATE19L    COMP  PIC  S9(4).
           02  BDATE19F    PICTURE X.
           02  FILLER REDEFINES BDATE19F.
             03 BDATE19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE19I  PIC X(8).
           02  BTIME19L    COMP  PIC  S9(4).
           02  BTIME19F    PICTURE X.
           02  FILLER REDEFINES BTIME19F.
             03 BTIME19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME19I  PIC X(8).
           02  IMPGE19L    COMP  PIC  S9(4).
           02  IMPGE19F    PICTURE X.
           02  FILLER REDEFINES IMPGE19F.
             03 IMPGE19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE19I  PIC X(2).
           02  CTL1019L    COMP  PIC  S9(4).
           02  CTL1019F    PICTURE X.
           02  FILLER REDEFINES CTL1019F.
             03 CTL1019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1019I  PIC X(2).
           02  CTL2019L    COMP  PIC  S9(4).
           02  CTL2019F    PICTURE X.
           02  FILLER REDEFINES CTL2019F.
             03 CTL2019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2019I  PIC X(3).
           02  CTL3019L    COMP  PIC  S9(4).
           02  CTL3019F    PICTURE X.
           02  FILLER REDEFINES CTL3019F.
             03 CTL3019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3019I  PIC X(3).
           02  IMB1140L    COMP  PIC  S9(4).
           02  IMB1140F    PICTURE X.
           02  FILLER REDEFINES IMB1140F.
             03 IMB1140A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1140I  PIC X(1).
           02  IMB1141L    COMP  PIC  S9(4).
           02  IMB1141F    PICTURE X.
           02  FILLER REDEFINES IMB1141F.
             03 IMB1141A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1141I  PIC X(1).
           02  IMB1142L    COMP  PIC  S9(4).
           02  IMB1142F    PICTURE X.
           02  FILLER REDEFINES IMB1142F.
             03 IMB1142A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1142I  PIC X(1).
           02  IMB1143L    COMP  PIC  S9(4).
           02  IMB1143F    PICTURE X.
           02  FILLER REDEFINES IMB1143F.
             03 IMB1143A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1143I  PIC X(1).
           02  IMB1144L    COMP  PIC  S9(4).
           02  IMB1144F    PICTURE X.
           02  FILLER REDEFINES IMB1144F.
             03 IMB1144A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1144I  PIC X(1).
           02  IMB1145L    COMP  PIC  S9(4).
           02  IMB1145F    PICTURE X.
           02  FILLER REDEFINES IMB1145F.
             03 IMB1145A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1145I  PIC X(1).
           02  IMB1146L    COMP  PIC  S9(4).
           02  IMB1146F    PICTURE X.
           02  FILLER REDEFINES IMB1146F.
             03 IMB1146A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1146I  PIC X(1).
           02  IMB1147L    COMP  PIC  S9(4).
           02  IMB1147F    PICTURE X.
           02  FILLER REDEFINES IMB1147F.
             03 IMB1147A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1147I  PIC X(1).
           02  IMB1148L    COMP  PIC  S9(4).
           02  IMB1148F    PICTURE X.
           02  FILLER REDEFINES IMB1148F.
             03 IMB1148A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1148I  PIC X(1).
           02  IMB1149L    COMP  PIC  S9(4).
           02  IMB1149F    PICTURE X.
           02  FILLER REDEFINES IMB1149F.
             03 IMB1149A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1149I  PIC X(1).
           02  IMB1150L    COMP  PIC  S9(4).
           02  IMB1150F    PICTURE X.
           02  FILLER REDEFINES IMB1150F.
             03 IMB1150A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1150I  PIC X(1).
           02  IMB1151L    COMP  PIC  S9(4).
           02  IMB1151F    PICTURE X.
           02  FILLER REDEFINES IMB1151F.
             03 IMB1151A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1151I  PIC X(1).
           02  IMB1152L    COMP  PIC  S9(4).
           02  IMB1152F    PICTURE X.
           02  FILLER REDEFINES IMB1152F.
             03 IMB1152A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1152I  PIC X(1).
           02  IMB1153L    COMP  PIC  S9(4).
           02  IMB1153F    PICTURE X.
           02  FILLER REDEFINES IMB1153F.
             03 IMB1153A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1153I  PIC X(1).
           02  IMB1154L    COMP  PIC  S9(4).
           02  IMB1154F    PICTURE X.
           02  FILLER REDEFINES IMB1154F.
             03 IMB1154A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1154I  PIC X(1).
           02  IMB1155L    COMP  PIC  S9(4).
           02  IMB1155F    PICTURE X.
           02  FILLER REDEFINES IMB1155F.
             03 IMB1155A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1155I  PIC X(1).
           02  IMB1156L    COMP  PIC  S9(4).
           02  IMB1156F    PICTURE X.
           02  FILLER REDEFINES IMB1156F.
             03 IMB1156A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1156I  PIC X(1).
           02  IMB1157L    COMP  PIC  S9(4).
           02  IMB1157F    PICTURE X.
           02  FILLER REDEFINES IMB1157F.
             03 IMB1157A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1157I  PIC X(1).
           02  IMB5005L    COMP  PIC  S9(4).
           02  IMB5005F    PICTURE X.
           02  FILLER REDEFINES IMB5005F.
             03 IMB5005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5005I  PIC X(1).
           02  IMB5006L    COMP  PIC  S9(4).
           02  IMB5006F    PICTURE X.
           02  FILLER REDEFINES IMB5006F.
             03 IMB5006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5006I  PIC X(1).
           02  IMB6005L    COMP  PIC  S9(4).
           02  IMB6005F    PICTURE X.
           02  FILLER REDEFINES IMB6005F.
             03 IMB6005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6005I  PIC X(1).
           02  IME6005L    COMP  PIC  S9(4).
           02  IME6005F    PICTURE X.
           02  FILLER REDEFINES IME6005F.
             03 IME6005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME6005I  PIC X(16).
           02  IMB5007L    COMP  PIC  S9(4).
           02  IMB5007F    PICTURE X.
           02  FILLER REDEFINES IMB5007F.
             03 IMB5007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5007I  PIC X(1).
           02  IMB5008L    COMP  PIC  S9(4).
           02  IMB5008F    PICTURE X.
           02  FILLER REDEFINES IMB5008F.
             03 IMB5008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5008I  PIC X(1).
           02  IMB5009L    COMP  PIC  S9(4).
           02  IMB5009F    PICTURE X.
           02  FILLER REDEFINES IMB5009F.
             03 IMB5009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5009I  PIC X(1).
           02  IMPFS20L    COMP  PIC  S9(4).
           02  IMPFS20F    PICTURE X.
           02  FILLER REDEFINES IMPFS20F.
             03 IMPFS20A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS20I  PIC X(79).
           02  IMERR20L    COMP  PIC  S9(4).
           02  IMERR20F    PICTURE X.
           02  FILLER REDEFINES IMERR20F.
             03 IMERR20A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR20I  PIC X(79).
       01  IMB1M20O REDEFINES IMB1M20I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN19C    PICTURE X.
           02  IMTRN19P    PICTURE X.
           02  IMTRN19H    PICTURE X.
           02  IMTRN19V    PICTURE X.
           02  IMTRN19O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE19C    PICTURE X.
           02  BDATE19P    PICTURE X.
           02  BDATE19H    PICTURE X.
           02  BDATE19V    PICTURE X.
           02  BDATE19O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME19C    PICTURE X.
           02  BTIME19P    PICTURE X.
           02  BTIME19H    PICTURE X.
           02  BTIME19V    PICTURE X.
           02  BTIME19O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE19C    PICTURE X.
           02  IMPGE19P    PICTURE X.
           02  IMPGE19H    PICTURE X.
           02  IMPGE19V    PICTURE X.
           02  IMPGE19O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1019C    PICTURE X.
           02  CTL1019P    PICTURE X.
           02  CTL1019H    PICTURE X.
           02  CTL1019V    PICTURE X.
           02  CTL1019O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2019C    PICTURE X.
           02  CTL2019P    PICTURE X.
           02  CTL2019H    PICTURE X.
           02  CTL2019V    PICTURE X.
           02  CTL2019O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3019C    PICTURE X.
           02  CTL3019P    PICTURE X.
           02  CTL3019H    PICTURE X.
           02  CTL3019V    PICTURE X.
           02  CTL3019O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1140C    PICTURE X.
           02  IMB1140P    PICTURE X.
           02  IMB1140H    PICTURE X.
           02  IMB1140V    PICTURE X.
           02  IMB1140O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1141C    PICTURE X.
           02  IMB1141P    PICTURE X.
           02  IMB1141H    PICTURE X.
           02  IMB1141V    PICTURE X.
           02  IMB1141O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1142C    PICTURE X.
           02  IMB1142P    PICTURE X.
           02  IMB1142H    PICTURE X.
           02  IMB1142V    PICTURE X.
           02  IMB1142O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1143C    PICTURE X.
           02  IMB1143P    PICTURE X.
           02  IMB1143H    PICTURE X.
           02  IMB1143V    PICTURE X.
           02  IMB1143O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1144C    PICTURE X.
           02  IMB1144P    PICTURE X.
           02  IMB1144H    PICTURE X.
           02  IMB1144V    PICTURE X.
           02  IMB1144O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1145C    PICTURE X.
           02  IMB1145P    PICTURE X.
           02  IMB1145H    PICTURE X.
           02  IMB1145V    PICTURE X.
           02  IMB1145O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1146C    PICTURE X.
           02  IMB1146P    PICTURE X.
           02  IMB1146H    PICTURE X.
           02  IMB1146V    PICTURE X.
           02  IMB1146O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1147C    PICTURE X.
           02  IMB1147P    PICTURE X.
           02  IMB1147H    PICTURE X.
           02  IMB1147V    PICTURE X.
           02  IMB1147O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1148C    PICTURE X.
           02  IMB1148P    PICTURE X.
           02  IMB1148H    PICTURE X.
           02  IMB1148V    PICTURE X.
           02  IMB1148O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1149C    PICTURE X.
           02  IMB1149P    PICTURE X.
           02  IMB1149H    PICTURE X.
           02  IMB1149V    PICTURE X.
           02  IMB1149O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1150C    PICTURE X.
           02  IMB1150P    PICTURE X.
           02  IMB1150H    PICTURE X.
           02  IMB1150V    PICTURE X.
           02  IMB1150O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1151C    PICTURE X.
           02  IMB1151P    PICTURE X.
           02  IMB1151H    PICTURE X.
           02  IMB1151V    PICTURE X.
           02  IMB1151O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1152C    PICTURE X.
           02  IMB1152P    PICTURE X.
           02  IMB1152H    PICTURE X.
           02  IMB1152V    PICTURE X.
           02  IMB1152O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1153C    PICTURE X.
           02  IMB1153P    PICTURE X.
           02  IMB1153H    PICTURE X.
           02  IMB1153V    PICTURE X.
           02  IMB1153O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1154C    PICTURE X.
           02  IMB1154P    PICTURE X.
           02  IMB1154H    PICTURE X.
           02  IMB1154V    PICTURE X.
           02  IMB1154O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1155C    PICTURE X.
           02  IMB1155P    PICTURE X.
           02  IMB1155H    PICTURE X.
           02  IMB1155V    PICTURE X.
           02  IMB1155O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1156C    PICTURE X.
           02  IMB1156P    PICTURE X.
           02  IMB1156H    PICTURE X.
           02  IMB1156V    PICTURE X.
           02  IMB1156O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1157C    PICTURE X.
           02  IMB1157P    PICTURE X.
           02  IMB1157H    PICTURE X.
           02  IMB1157V    PICTURE X.
           02  IMB1157O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5005C    PICTURE X.
           02  IMB5005P    PICTURE X.
           02  IMB5005H    PICTURE X.
           02  IMB5005V    PICTURE X.
           02  IMB5005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5006C    PICTURE X.
           02  IMB5006P    PICTURE X.
           02  IMB5006H    PICTURE X.
           02  IMB5006V    PICTURE X.
           02  IMB5006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB6005C    PICTURE X.
           02  IMB6005P    PICTURE X.
           02  IMB6005H    PICTURE X.
           02  IMB6005V    PICTURE X.
           02  IMB6005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME6005C    PICTURE X.
           02  IME6005P    PICTURE X.
           02  IME6005H    PICTURE X.
           02  IME6005V    PICTURE X.
           02  IME6005O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB5007C    PICTURE X.
           02  IMB5007P    PICTURE X.
           02  IMB5007H    PICTURE X.
           02  IMB5007V    PICTURE X.
           02  IMB5007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5008C    PICTURE X.
           02  IMB5008P    PICTURE X.
           02  IMB5008H    PICTURE X.
           02  IMB5008V    PICTURE X.
           02  IMB5008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5009C    PICTURE X.
           02  IMB5009P    PICTURE X.
           02  IMB5009H    PICTURE X.
           02  IMB5009V    PICTURE X.
           02  IMB5009O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS20C    PICTURE X.
           02  IMPFS20P    PICTURE X.
           02  IMPFS20H    PICTURE X.
           02  IMPFS20V    PICTURE X.
           02  IMPFS20O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR20C    PICTURE X.
           02  IMERR20P    PICTURE X.
           02  IMERR20H    PICTURE X.
           02  IMERR20V    PICTURE X.
           02  IMERR20O  PIC X(79).
       01  IMB1M21I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN20L    COMP  PIC  S9(4).
           02  IMTRN20F    PICTURE X.
           02  FILLER REDEFINES IMTRN20F.
             03 IMTRN20A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN20I  PIC X(4).
           02  BDATE21L    COMP  PIC  S9(4).
           02  BDATE21F    PICTURE X.
           02  FILLER REDEFINES BDATE21F.
             03 BDATE21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE21I  PIC X(8).
           02  BTIME21L    COMP  PIC  S9(4).
           02  BTIME21F    PICTURE X.
           02  FILLER REDEFINES BTIME21F.
             03 BTIME21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME21I  PIC X(8).
           02  IMPGE21L    COMP  PIC  S9(4).
           02  IMPGE21F    PICTURE X.
           02  FILLER REDEFINES IMPGE21F.
             03 IMPGE21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE21I  PIC X(2).
           02  CTL1021L    COMP  PIC  S9(4).
           02  CTL1021F    PICTURE X.
           02  FILLER REDEFINES CTL1021F.
             03 CTL1021A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1021I  PIC X(2).
           02  CTL2021L    COMP  PIC  S9(4).
           02  CTL2021F    PICTURE X.
           02  FILLER REDEFINES CTL2021F.
             03 CTL2021A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2021I  PIC X(3).
           02  CTL3021L    COMP  PIC  S9(4).
           02  CTL3021F    PICTURE X.
           02  FILLER REDEFINES CTL3021F.
             03 CTL3021A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3021I  PIC X(3).
           02  IMB1308L    COMP  PIC  S9(4).
           02  IMB1308F    PICTURE X.
           02  FILLER REDEFINES IMB1308F.
             03 IMB1308A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1308I  PIC X(1).
           02  IMB1296L    COMP  PIC  S9(4).
           02  IMB1296F    PICTURE X.
           02  FILLER REDEFINES IMB1296F.
             03 IMB1296A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1296I  PIC X(1).
           02  IME1296L    COMP  PIC  S9(4).
           02  IME1296F    PICTURE X.
           02  FILLER REDEFINES IME1296F.
             03 IME1296A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1296I  PIC X(16).
           02  IMB1309L    COMP  PIC  S9(4).
           02  IMB1309F    PICTURE X.
           02  FILLER REDEFINES IMB1309F.
             03 IMB1309A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1309I  PIC X(1).
           02  IMB1297L    COMP  PIC  S9(4).
           02  IMB1297F    PICTURE X.
           02  FILLER REDEFINES IMB1297F.
             03 IMB1297A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1297I  PIC X(1).
           02  IME1297L    COMP  PIC  S9(4).
           02  IME1297F    PICTURE X.
           02  FILLER REDEFINES IME1297F.
             03 IME1297A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1297I  PIC X(16).
           02  IMB1310L    COMP  PIC  S9(4).
           02  IMB1310F    PICTURE X.
           02  FILLER REDEFINES IMB1310F.
             03 IMB1310A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1310I  PIC X(1).
           02  IMB1185L    COMP  PIC  S9(4).
           02  IMB1185F    PICTURE X.
           02  FILLER REDEFINES IMB1185F.
             03 IMB1185A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1185I  PIC X(1).
           02  IME1185L    COMP  PIC  S9(4).
           02  IME1185F    PICTURE X.
           02  FILLER REDEFINES IME1185F.
             03 IME1185A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1185I  PIC X(16).
           02  IMB1311L    COMP  PIC  S9(4).
           02  IMB1311F    PICTURE X.
           02  FILLER REDEFINES IMB1311F.
             03 IMB1311A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1311I  PIC X(1).
           02  IMB1186L    COMP  PIC  S9(4).
           02  IMB1186F    PICTURE X.
           02  FILLER REDEFINES IMB1186F.
             03 IMB1186A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1186I  PIC X(1).
           02  IME1186L    COMP  PIC  S9(4).
           02  IME1186F    PICTURE X.
           02  FILLER REDEFINES IME1186F.
             03 IME1186A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1186I  PIC X(16).
           02  IMB1312L    COMP  PIC  S9(4).
           02  IMB1312F    PICTURE X.
           02  FILLER REDEFINES IMB1312F.
             03 IMB1312A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1312I  PIC X(1).
           02  IMB1187L    COMP  PIC  S9(4).
           02  IMB1187F    PICTURE X.
           02  FILLER REDEFINES IMB1187F.
             03 IMB1187A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1187I  PIC X(1).
           02  IME1187L    COMP  PIC  S9(4).
           02  IME1187F    PICTURE X.
           02  FILLER REDEFINES IME1187F.
             03 IME1187A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1187I  PIC X(16).
           02  IMB1313L    COMP  PIC  S9(4).
           02  IMB1313F    PICTURE X.
           02  FILLER REDEFINES IMB1313F.
             03 IMB1313A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1313I  PIC X(1).
           02  IMB1188L    COMP  PIC  S9(4).
           02  IMB1188F    PICTURE X.
           02  FILLER REDEFINES IMB1188F.
             03 IMB1188A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1188I  PIC X(1).
           02  IME1188L    COMP  PIC  S9(4).
           02  IME1188F    PICTURE X.
           02  FILLER REDEFINES IME1188F.
             03 IME1188A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1188I  PIC X(16).
           02  IMB1314L    COMP  PIC  S9(4).
           02  IMB1314F    PICTURE X.
           02  FILLER REDEFINES IMB1314F.
             03 IMB1314A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1314I  PIC X(1).
           02  IMB1189L    COMP  PIC  S9(4).
           02  IMB1189F    PICTURE X.
           02  FILLER REDEFINES IMB1189F.
             03 IMB1189A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1189I  PIC X(1).
           02  IME1189L    COMP  PIC  S9(4).
           02  IME1189F    PICTURE X.
           02  FILLER REDEFINES IME1189F.
             03 IME1189A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1189I  PIC X(16).
           02  IMB1315L    COMP  PIC  S9(4).
           02  IMB1315F    PICTURE X.
           02  FILLER REDEFINES IMB1315F.
             03 IMB1315A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1315I  PIC X(1).
           02  IMB1190L    COMP  PIC  S9(4).
           02  IMB1190F    PICTURE X.
           02  FILLER REDEFINES IMB1190F.
             03 IMB1190A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1190I  PIC X(1).
           02  IME1190L    COMP  PIC  S9(4).
           02  IME1190F    PICTURE X.
           02  FILLER REDEFINES IME1190F.
             03 IME1190A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1190I  PIC X(16).
           02  IMB1316L    COMP  PIC  S9(4).
           02  IMB1316F    PICTURE X.
           02  FILLER REDEFINES IMB1316F.
             03 IMB1316A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1316I  PIC X(1).
           02  IMB1191L    COMP  PIC  S9(4).
           02  IMB1191F    PICTURE X.
           02  FILLER REDEFINES IMB1191F.
             03 IMB1191A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1191I  PIC X(1).
           02  IME1191L    COMP  PIC  S9(4).
           02  IME1191F    PICTURE X.
           02  FILLER REDEFINES IME1191F.
             03 IME1191A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1191I  PIC X(16).
           02  IMB1333L    COMP  PIC  S9(4).
           02  IMB1333F    PICTURE X.
           02  FILLER REDEFINES IMB1333F.
             03 IMB1333A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1333I  PIC X(1).
           02  IMB1332L    COMP  PIC  S9(4).
           02  IMB1332F    PICTURE X.
           02  FILLER REDEFINES IMB1332F.
             03 IMB1332A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1332I  PIC X(1).
           02  IME1332L    COMP  PIC  S9(4).
           02  IME1332F    PICTURE X.
           02  FILLER REDEFINES IME1332F.
             03 IME1332A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1332I  PIC X(16).
           02  IMB1317L    COMP  PIC  S9(4).
           02  IMB1317F    PICTURE X.
           02  FILLER REDEFINES IMB1317F.
             03 IMB1317A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1317I  PIC X(1).
           02  IMB1192L    COMP  PIC  S9(4).
           02  IMB1192F    PICTURE X.
           02  FILLER REDEFINES IMB1192F.
             03 IMB1192A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1192I  PIC X(1).
           02  IME1192L    COMP  PIC  S9(4).
           02  IME1192F    PICTURE X.
           02  FILLER REDEFINES IME1192F.
             03 IME1192A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1192I  PIC X(16).
           02  IMB1318L    COMP  PIC  S9(4).
           02  IMB1318F    PICTURE X.
           02  FILLER REDEFINES IMB1318F.
             03 IMB1318A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1318I  PIC X(1).
           02  IMB1193L    COMP  PIC  S9(4).
           02  IMB1193F    PICTURE X.
           02  FILLER REDEFINES IMB1193F.
             03 IMB1193A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1193I  PIC X(1).
           02  IME1193L    COMP  PIC  S9(4).
           02  IME1193F    PICTURE X.
           02  FILLER REDEFINES IME1193F.
             03 IME1193A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1193I  PIC X(16).
           02  IMB1319L    COMP  PIC  S9(4).
           02  IMB1319F    PICTURE X.
           02  FILLER REDEFINES IMB1319F.
             03 IMB1319A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1319I  PIC X(1).
           02  IMB1194L    COMP  PIC  S9(4).
           02  IMB1194F    PICTURE X.
           02  FILLER REDEFINES IMB1194F.
             03 IMB1194A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1194I  PIC X(1).
           02  IME1194L    COMP  PIC  S9(4).
           02  IME1194F    PICTURE X.
           02  FILLER REDEFINES IME1194F.
             03 IME1194A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1194I  PIC X(16).
           02  IMB1320L    COMP  PIC  S9(4).
           02  IMB1320F    PICTURE X.
           02  FILLER REDEFINES IMB1320F.
             03 IMB1320A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1320I  PIC X(1).
           02  IMB1195L    COMP  PIC  S9(4).
           02  IMB1195F    PICTURE X.
           02  FILLER REDEFINES IMB1195F.
             03 IMB1195A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1195I  PIC X(1).
           02  IME1195L    COMP  PIC  S9(4).
           02  IME1195F    PICTURE X.
           02  FILLER REDEFINES IME1195F.
             03 IME1195A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1195I  PIC X(16).
           02  IMB1200L    COMP  PIC  S9(4).
           02  IMB1200F    PICTURE X.
           02  FILLER REDEFINES IMB1200F.
             03 IMB1200A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1200I  PIC X(1).
           02  IMB1196L    COMP  PIC  S9(4).
           02  IMB1196F    PICTURE X.
           02  FILLER REDEFINES IMB1196F.
             03 IMB1196A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1196I  PIC X(1).
           02  IME1196L    COMP  PIC  S9(4).
           02  IME1196F    PICTURE X.
           02  FILLER REDEFINES IME1196F.
             03 IME1196A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1196I  PIC X(16).
           02  IMB1201L    COMP  PIC  S9(4).
           02  IMB1201F    PICTURE X.
           02  FILLER REDEFINES IMB1201F.
             03 IMB1201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1201I  PIC X(1).
           02  IMB1197L    COMP  PIC  S9(4).
           02  IMB1197F    PICTURE X.
           02  FILLER REDEFINES IMB1197F.
             03 IMB1197A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1197I  PIC X(1).
           02  IME1197L    COMP  PIC  S9(4).
           02  IME1197F    PICTURE X.
           02  FILLER REDEFINES IME1197F.
             03 IME1197A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1197I  PIC X(16).
           02  IMB1202L    COMP  PIC  S9(4).
           02  IMB1202F    PICTURE X.
           02  FILLER REDEFINES IMB1202F.
             03 IMB1202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1202I  PIC X(1).
           02  IMB1299L    COMP  PIC  S9(4).
           02  IMB1299F    PICTURE X.
           02  FILLER REDEFINES IMB1299F.
             03 IMB1299A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1299I  PIC X(1).
           02  IME1299L    COMP  PIC  S9(4).
           02  IME1299F    PICTURE X.
           02  FILLER REDEFINES IME1299F.
             03 IME1299A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1299I  PIC X(16).
           02  IMB1203L    COMP  PIC  S9(4).
           02  IMB1203F    PICTURE X.
           02  FILLER REDEFINES IMB1203F.
             03 IMB1203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1203I  PIC X(1).
           02  IMB1300L    COMP  PIC  S9(4).
           02  IMB1300F    PICTURE X.
           02  FILLER REDEFINES IMB1300F.
             03 IMB1300A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1300I  PIC X(1).
           02  IME1300L    COMP  PIC  S9(4).
           02  IME1300F    PICTURE X.
           02  FILLER REDEFINES IME1300F.
             03 IME1300A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1300I  PIC X(16).
           02  IMB1204L    COMP  PIC  S9(4).
           02  IMB1204F    PICTURE X.
           02  FILLER REDEFINES IMB1204F.
             03 IMB1204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1204I  PIC X(1).
           02  IMB1301L    COMP  PIC  S9(4).
           02  IMB1301F    PICTURE X.
           02  FILLER REDEFINES IMB1301F.
             03 IMB1301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1301I  PIC X(1).
           02  IME1301L    COMP  PIC  S9(4).
           02  IME1301F    PICTURE X.
           02  FILLER REDEFINES IME1301F.
             03 IME1301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1301I  PIC X(16).
           02  IMB1205L    COMP  PIC  S9(4).
           02  IMB1205F    PICTURE X.
           02  FILLER REDEFINES IMB1205F.
             03 IMB1205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1205I  PIC X(1).
           02  IMB1302L    COMP  PIC  S9(4).
           02  IMB1302F    PICTURE X.
           02  FILLER REDEFINES IMB1302F.
             03 IMB1302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1302I  PIC X(1).
           02  IME1302L    COMP  PIC  S9(4).
           02  IME1302F    PICTURE X.
           02  FILLER REDEFINES IME1302F.
             03 IME1302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1302I  PIC X(16).
           02  IMB1206L    COMP  PIC  S9(4).
           02  IMB1206F    PICTURE X.
           02  FILLER REDEFINES IMB1206F.
             03 IMB1206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1206I  PIC X(1).
           02  IMB1303L    COMP  PIC  S9(4).
           02  IMB1303F    PICTURE X.
           02  FILLER REDEFINES IMB1303F.
             03 IMB1303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1303I  PIC X(1).
           02  IME1303L    COMP  PIC  S9(4).
           02  IME1303F    PICTURE X.
           02  FILLER REDEFINES IME1303F.
             03 IME1303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1303I  PIC X(16).
           02  IMB1207L    COMP  PIC  S9(4).
           02  IMB1207F    PICTURE X.
           02  FILLER REDEFINES IMB1207F.
             03 IMB1207A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1207I  PIC X(1).
           02  IMB1304L    COMP  PIC  S9(4).
           02  IMB1304F    PICTURE X.
           02  FILLER REDEFINES IMB1304F.
             03 IMB1304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1304I  PIC X(1).
           02  IME1304L    COMP  PIC  S9(4).
           02  IME1304F    PICTURE X.
           02  FILLER REDEFINES IME1304F.
             03 IME1304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1304I  PIC X(16).
           02  IMB1208L    COMP  PIC  S9(4).
           02  IMB1208F    PICTURE X.
           02  FILLER REDEFINES IMB1208F.
             03 IMB1208A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1208I  PIC X(1).
           02  IMB1305L    COMP  PIC  S9(4).
           02  IMB1305F    PICTURE X.
           02  FILLER REDEFINES IMB1305F.
             03 IMB1305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1305I  PIC X(1).
           02  IME1305L    COMP  PIC  S9(4).
           02  IME1305F    PICTURE X.
           02  FILLER REDEFINES IME1305F.
             03 IME1305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1305I  PIC X(16).
           02  IMB1209L    COMP  PIC  S9(4).
           02  IMB1209F    PICTURE X.
           02  FILLER REDEFINES IMB1209F.
             03 IMB1209A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1209I  PIC X(1).
           02  IMB1306L    COMP  PIC  S9(4).
           02  IMB1306F    PICTURE X.
           02  FILLER REDEFINES IMB1306F.
             03 IMB1306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1306I  PIC X(1).
           02  IME1306L    COMP  PIC  S9(4).
           02  IME1306F    PICTURE X.
           02  FILLER REDEFINES IME1306F.
             03 IME1306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1306I  PIC X(16).
           02  IMB1210L    COMP  PIC  S9(4).
           02  IMB1210F    PICTURE X.
           02  FILLER REDEFINES IMB1210F.
             03 IMB1210A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1210I  PIC X(1).
           02  IMB1307L    COMP  PIC  S9(4).
           02  IMB1307F    PICTURE X.
           02  FILLER REDEFINES IMB1307F.
             03 IMB1307A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1307I  PIC X(1).
           02  IME1307L    COMP  PIC  S9(4).
           02  IME1307F    PICTURE X.
           02  FILLER REDEFINES IME1307F.
             03 IME1307A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1307I  PIC X(16).
           02  IMB2029L    COMP  PIC  S9(4).
           02  IMB2029F    PICTURE X.
           02  FILLER REDEFINES IMB2029F.
             03 IMB2029A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2029I  PIC X(1).
           02  IME2029L    COMP  PIC  S9(4).
           02  IME2029F    PICTURE X.
           02  FILLER REDEFINES IME2029F.
             03 IME2029A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME2029I  PIC X(16).
           02  IMB2010L    COMP  PIC  S9(4).
           02  IMB2010F    PICTURE X.
           02  FILLER REDEFINES IMB2010F.
             03 IMB2010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2010I  PIC X(1).
           02  IME2010L    COMP  PIC  S9(4).
           02  IME2010F    PICTURE X.
           02  FILLER REDEFINES IME2010F.
             03 IME2010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME2010I  PIC X(16).
           02  IMB2011L    COMP  PIC  S9(4).
           02  IMB2011F    PICTURE X.
           02  FILLER REDEFINES IMB2011F.
             03 IMB2011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2011I  PIC X(1).
           02  IME2011L    COMP  PIC  S9(4).
           02  IME2011F    PICTURE X.
           02  FILLER REDEFINES IME2011F.
             03 IME2011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME2011I  PIC X(16).
           02  IMB2030L    COMP  PIC  S9(4).
           02  IMB2030F    PICTURE X.
           02  FILLER REDEFINES IMB2030F.
             03 IMB2030A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2030I  PIC X(1).
           02  IME2030L    COMP  PIC  S9(4).
           02  IME2030F    PICTURE X.
           02  FILLER REDEFINES IME2030F.
             03 IME2030A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME2030I  PIC X(16).
           02  IMB2040L    COMP  PIC  S9(4).
           02  IMB2040F    PICTURE X.
           02  FILLER REDEFINES IMB2040F.
             03 IMB2040A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2040I  PIC X(1).
           02  IME2040L    COMP  PIC  S9(4).
           02  IME2040F    PICTURE X.
           02  FILLER REDEFINES IME2040F.
             03 IME2040A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME2040I  PIC X(16).
           02  IMPFS21L    COMP  PIC  S9(4).
           02  IMPFS21F    PICTURE X.
           02  FILLER REDEFINES IMPFS21F.
             03 IMPFS21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS21I  PIC X(79).
           02  IMERR21L    COMP  PIC  S9(4).
           02  IMERR21F    PICTURE X.
           02  FILLER REDEFINES IMERR21F.
             03 IMERR21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR21I  PIC X(79).
       01  IMB1M21O REDEFINES IMB1M21I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN20C    PICTURE X.
           02  IMTRN20P    PICTURE X.
           02  IMTRN20H    PICTURE X.
           02  IMTRN20V    PICTURE X.
           02  IMTRN20O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE21C    PICTURE X.
           02  BDATE21P    PICTURE X.
           02  BDATE21H    PICTURE X.
           02  BDATE21V    PICTURE X.
           02  BDATE21O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME21C    PICTURE X.
           02  BTIME21P    PICTURE X.
           02  BTIME21H    PICTURE X.
           02  BTIME21V    PICTURE X.
           02  BTIME21O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE21C    PICTURE X.
           02  IMPGE21P    PICTURE X.
           02  IMPGE21H    PICTURE X.
           02  IMPGE21V    PICTURE X.
           02  IMPGE21O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1021C    PICTURE X.
           02  CTL1021P    PICTURE X.
           02  CTL1021H    PICTURE X.
           02  CTL1021V    PICTURE X.
           02  CTL1021O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2021C    PICTURE X.
           02  CTL2021P    PICTURE X.
           02  CTL2021H    PICTURE X.
           02  CTL2021V    PICTURE X.
           02  CTL2021O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3021C    PICTURE X.
           02  CTL3021P    PICTURE X.
           02  CTL3021H    PICTURE X.
           02  CTL3021V    PICTURE X.
           02  CTL3021O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB1308C    PICTURE X.
           02  IMB1308P    PICTURE X.
           02  IMB1308H    PICTURE X.
           02  IMB1308V    PICTURE X.
           02  IMB1308O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1296C    PICTURE X.
           02  IMB1296P    PICTURE X.
           02  IMB1296H    PICTURE X.
           02  IMB1296V    PICTURE X.
           02  IMB1296O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1296C    PICTURE X.
           02  IME1296P    PICTURE X.
           02  IME1296H    PICTURE X.
           02  IME1296V    PICTURE X.
           02  IME1296O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1309C    PICTURE X.
           02  IMB1309P    PICTURE X.
           02  IMB1309H    PICTURE X.
           02  IMB1309V    PICTURE X.
           02  IMB1309O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1297C    PICTURE X.
           02  IMB1297P    PICTURE X.
           02  IMB1297H    PICTURE X.
           02  IMB1297V    PICTURE X.
           02  IMB1297O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1297C    PICTURE X.
           02  IME1297P    PICTURE X.
           02  IME1297H    PICTURE X.
           02  IME1297V    PICTURE X.
           02  IME1297O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1310C    PICTURE X.
           02  IMB1310P    PICTURE X.
           02  IMB1310H    PICTURE X.
           02  IMB1310V    PICTURE X.
           02  IMB1310O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1185C    PICTURE X.
           02  IMB1185P    PICTURE X.
           02  IMB1185H    PICTURE X.
           02  IMB1185V    PICTURE X.
           02  IMB1185O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1185C    PICTURE X.
           02  IME1185P    PICTURE X.
           02  IME1185H    PICTURE X.
           02  IME1185V    PICTURE X.
           02  IME1185O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1311C    PICTURE X.
           02  IMB1311P    PICTURE X.
           02  IMB1311H    PICTURE X.
           02  IMB1311V    PICTURE X.
           02  IMB1311O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1186C    PICTURE X.
           02  IMB1186P    PICTURE X.
           02  IMB1186H    PICTURE X.
           02  IMB1186V    PICTURE X.
           02  IMB1186O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1186C    PICTURE X.
           02  IME1186P    PICTURE X.
           02  IME1186H    PICTURE X.
           02  IME1186V    PICTURE X.
           02  IME1186O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1312C    PICTURE X.
           02  IMB1312P    PICTURE X.
           02  IMB1312H    PICTURE X.
           02  IMB1312V    PICTURE X.
           02  IMB1312O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1187C    PICTURE X.
           02  IMB1187P    PICTURE X.
           02  IMB1187H    PICTURE X.
           02  IMB1187V    PICTURE X.
           02  IMB1187O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1187C    PICTURE X.
           02  IME1187P    PICTURE X.
           02  IME1187H    PICTURE X.
           02  IME1187V    PICTURE X.
           02  IME1187O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1313C    PICTURE X.
           02  IMB1313P    PICTURE X.
           02  IMB1313H    PICTURE X.
           02  IMB1313V    PICTURE X.
           02  IMB1313O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1188C    PICTURE X.
           02  IMB1188P    PICTURE X.
           02  IMB1188H    PICTURE X.
           02  IMB1188V    PICTURE X.
           02  IMB1188O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1188C    PICTURE X.
           02  IME1188P    PICTURE X.
           02  IME1188H    PICTURE X.
           02  IME1188V    PICTURE X.
           02  IME1188O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1314C    PICTURE X.
           02  IMB1314P    PICTURE X.
           02  IMB1314H    PICTURE X.
           02  IMB1314V    PICTURE X.
           02  IMB1314O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1189C    PICTURE X.
           02  IMB1189P    PICTURE X.
           02  IMB1189H    PICTURE X.
           02  IMB1189V    PICTURE X.
           02  IMB1189O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1189C    PICTURE X.
           02  IME1189P    PICTURE X.
           02  IME1189H    PICTURE X.
           02  IME1189V    PICTURE X.
           02  IME1189O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1315C    PICTURE X.
           02  IMB1315P    PICTURE X.
           02  IMB1315H    PICTURE X.
           02  IMB1315V    PICTURE X.
           02  IMB1315O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1190C    PICTURE X.
           02  IMB1190P    PICTURE X.
           02  IMB1190H    PICTURE X.
           02  IMB1190V    PICTURE X.
           02  IMB1190O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1190C    PICTURE X.
           02  IME1190P    PICTURE X.
           02  IME1190H    PICTURE X.
           02  IME1190V    PICTURE X.
           02  IME1190O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1316C    PICTURE X.
           02  IMB1316P    PICTURE X.
           02  IMB1316H    PICTURE X.
           02  IMB1316V    PICTURE X.
           02  IMB1316O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1191C    PICTURE X.
           02  IMB1191P    PICTURE X.
           02  IMB1191H    PICTURE X.
           02  IMB1191V    PICTURE X.
           02  IMB1191O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1191C    PICTURE X.
           02  IME1191P    PICTURE X.
           02  IME1191H    PICTURE X.
           02  IME1191V    PICTURE X.
           02  IME1191O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1333C    PICTURE X.
           02  IMB1333P    PICTURE X.
           02  IMB1333H    PICTURE X.
           02  IMB1333V    PICTURE X.
           02  IMB1333O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1332C    PICTURE X.
           02  IMB1332P    PICTURE X.
           02  IMB1332H    PICTURE X.
           02  IMB1332V    PICTURE X.
           02  IMB1332O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1332C    PICTURE X.
           02  IME1332P    PICTURE X.
           02  IME1332H    PICTURE X.
           02  IME1332V    PICTURE X.
           02  IME1332O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1317C    PICTURE X.
           02  IMB1317P    PICTURE X.
           02  IMB1317H    PICTURE X.
           02  IMB1317V    PICTURE X.
           02  IMB1317O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1192C    PICTURE X.
           02  IMB1192P    PICTURE X.
           02  IMB1192H    PICTURE X.
           02  IMB1192V    PICTURE X.
           02  IMB1192O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1192C    PICTURE X.
           02  IME1192P    PICTURE X.
           02  IME1192H    PICTURE X.
           02  IME1192V    PICTURE X.
           02  IME1192O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1318C    PICTURE X.
           02  IMB1318P    PICTURE X.
           02  IMB1318H    PICTURE X.
           02  IMB1318V    PICTURE X.
           02  IMB1318O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1193C    PICTURE X.
           02  IMB1193P    PICTURE X.
           02  IMB1193H    PICTURE X.
           02  IMB1193V    PICTURE X.
           02  IMB1193O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1193C    PICTURE X.
           02  IME1193P    PICTURE X.
           02  IME1193H    PICTURE X.
           02  IME1193V    PICTURE X.
           02  IME1193O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1319C    PICTURE X.
           02  IMB1319P    PICTURE X.
           02  IMB1319H    PICTURE X.
           02  IMB1319V    PICTURE X.
           02  IMB1319O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1194C    PICTURE X.
           02  IMB1194P    PICTURE X.
           02  IMB1194H    PICTURE X.
           02  IMB1194V    PICTURE X.
           02  IMB1194O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1194C    PICTURE X.
           02  IME1194P    PICTURE X.
           02  IME1194H    PICTURE X.
           02  IME1194V    PICTURE X.
           02  IME1194O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1320C    PICTURE X.
           02  IMB1320P    PICTURE X.
           02  IMB1320H    PICTURE X.
           02  IMB1320V    PICTURE X.
           02  IMB1320O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1195C    PICTURE X.
           02  IMB1195P    PICTURE X.
           02  IMB1195H    PICTURE X.
           02  IMB1195V    PICTURE X.
           02  IMB1195O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1195C    PICTURE X.
           02  IME1195P    PICTURE X.
           02  IME1195H    PICTURE X.
           02  IME1195V    PICTURE X.
           02  IME1195O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1200C    PICTURE X.
           02  IMB1200P    PICTURE X.
           02  IMB1200H    PICTURE X.
           02  IMB1200V    PICTURE X.
           02  IMB1200O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1196C    PICTURE X.
           02  IMB1196P    PICTURE X.
           02  IMB1196H    PICTURE X.
           02  IMB1196V    PICTURE X.
           02  IMB1196O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1196C    PICTURE X.
           02  IME1196P    PICTURE X.
           02  IME1196H    PICTURE X.
           02  IME1196V    PICTURE X.
           02  IME1196O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1201C    PICTURE X.
           02  IMB1201P    PICTURE X.
           02  IMB1201H    PICTURE X.
           02  IMB1201V    PICTURE X.
           02  IMB1201O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1197C    PICTURE X.
           02  IMB1197P    PICTURE X.
           02  IMB1197H    PICTURE X.
           02  IMB1197V    PICTURE X.
           02  IMB1197O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1197C    PICTURE X.
           02  IME1197P    PICTURE X.
           02  IME1197H    PICTURE X.
           02  IME1197V    PICTURE X.
           02  IME1197O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1202C    PICTURE X.
           02  IMB1202P    PICTURE X.
           02  IMB1202H    PICTURE X.
           02  IMB1202V    PICTURE X.
           02  IMB1202O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1299C    PICTURE X.
           02  IMB1299P    PICTURE X.
           02  IMB1299H    PICTURE X.
           02  IMB1299V    PICTURE X.
           02  IMB1299O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1299C    PICTURE X.
           02  IME1299P    PICTURE X.
           02  IME1299H    PICTURE X.
           02  IME1299V    PICTURE X.
           02  IME1299O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1203C    PICTURE X.
           02  IMB1203P    PICTURE X.
           02  IMB1203H    PICTURE X.
           02  IMB1203V    PICTURE X.
           02  IMB1203O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1300C    PICTURE X.
           02  IMB1300P    PICTURE X.
           02  IMB1300H    PICTURE X.
           02  IMB1300V    PICTURE X.
           02  IMB1300O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1300C    PICTURE X.
           02  IME1300P    PICTURE X.
           02  IME1300H    PICTURE X.
           02  IME1300V    PICTURE X.
           02  IME1300O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1204C    PICTURE X.
           02  IMB1204P    PICTURE X.
           02  IMB1204H    PICTURE X.
           02  IMB1204V    PICTURE X.
           02  IMB1204O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1301C    PICTURE X.
           02  IMB1301P    PICTURE X.
           02  IMB1301H    PICTURE X.
           02  IMB1301V    PICTURE X.
           02  IMB1301O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1301C    PICTURE X.
           02  IME1301P    PICTURE X.
           02  IME1301H    PICTURE X.
           02  IME1301V    PICTURE X.
           02  IME1301O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1205C    PICTURE X.
           02  IMB1205P    PICTURE X.
           02  IMB1205H    PICTURE X.
           02  IMB1205V    PICTURE X.
           02  IMB1205O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1302C    PICTURE X.
           02  IMB1302P    PICTURE X.
           02  IMB1302H    PICTURE X.
           02  IMB1302V    PICTURE X.
           02  IMB1302O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1302C    PICTURE X.
           02  IME1302P    PICTURE X.
           02  IME1302H    PICTURE X.
           02  IME1302V    PICTURE X.
           02  IME1302O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1206C    PICTURE X.
           02  IMB1206P    PICTURE X.
           02  IMB1206H    PICTURE X.
           02  IMB1206V    PICTURE X.
           02  IMB1206O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1303C    PICTURE X.
           02  IMB1303P    PICTURE X.
           02  IMB1303H    PICTURE X.
           02  IMB1303V    PICTURE X.
           02  IMB1303O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1303C    PICTURE X.
           02  IME1303P    PICTURE X.
           02  IME1303H    PICTURE X.
           02  IME1303V    PICTURE X.
           02  IME1303O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1207C    PICTURE X.
           02  IMB1207P    PICTURE X.
           02  IMB1207H    PICTURE X.
           02  IMB1207V    PICTURE X.
           02  IMB1207O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1304C    PICTURE X.
           02  IMB1304P    PICTURE X.
           02  IMB1304H    PICTURE X.
           02  IMB1304V    PICTURE X.
           02  IMB1304O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1304C    PICTURE X.
           02  IME1304P    PICTURE X.
           02  IME1304H    PICTURE X.
           02  IME1304V    PICTURE X.
           02  IME1304O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1208C    PICTURE X.
           02  IMB1208P    PICTURE X.
           02  IMB1208H    PICTURE X.
           02  IMB1208V    PICTURE X.
           02  IMB1208O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1305C    PICTURE X.
           02  IMB1305P    PICTURE X.
           02  IMB1305H    PICTURE X.
           02  IMB1305V    PICTURE X.
           02  IMB1305O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1305C    PICTURE X.
           02  IME1305P    PICTURE X.
           02  IME1305H    PICTURE X.
           02  IME1305V    PICTURE X.
           02  IME1305O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1209C    PICTURE X.
           02  IMB1209P    PICTURE X.
           02  IMB1209H    PICTURE X.
           02  IMB1209V    PICTURE X.
           02  IMB1209O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1306C    PICTURE X.
           02  IMB1306P    PICTURE X.
           02  IMB1306H    PICTURE X.
           02  IMB1306V    PICTURE X.
           02  IMB1306O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1306C    PICTURE X.
           02  IME1306P    PICTURE X.
           02  IME1306H    PICTURE X.
           02  IME1306V    PICTURE X.
           02  IME1306O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB1210C    PICTURE X.
           02  IMB1210P    PICTURE X.
           02  IMB1210H    PICTURE X.
           02  IMB1210V    PICTURE X.
           02  IMB1210O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1307C    PICTURE X.
           02  IMB1307P    PICTURE X.
           02  IMB1307H    PICTURE X.
           02  IMB1307V    PICTURE X.
           02  IMB1307O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1307C    PICTURE X.
           02  IME1307P    PICTURE X.
           02  IME1307H    PICTURE X.
           02  IME1307V    PICTURE X.
           02  IME1307O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB2029C    PICTURE X.
           02  IMB2029P    PICTURE X.
           02  IMB2029H    PICTURE X.
           02  IMB2029V    PICTURE X.
           02  IMB2029O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME2029C    PICTURE X.
           02  IME2029P    PICTURE X.
           02  IME2029H    PICTURE X.
           02  IME2029V    PICTURE X.
           02  IME2029O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB2010C    PICTURE X.
           02  IMB2010P    PICTURE X.
           02  IMB2010H    PICTURE X.
           02  IMB2010V    PICTURE X.
           02  IMB2010O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME2010C    PICTURE X.
           02  IME2010P    PICTURE X.
           02  IME2010H    PICTURE X.
           02  IME2010V    PICTURE X.
           02  IME2010O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB2011C    PICTURE X.
           02  IMB2011P    PICTURE X.
           02  IMB2011H    PICTURE X.
           02  IMB2011V    PICTURE X.
           02  IMB2011O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME2011C    PICTURE X.
           02  IME2011P    PICTURE X.
           02  IME2011H    PICTURE X.
           02  IME2011V    PICTURE X.
           02  IME2011O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB2030C    PICTURE X.
           02  IMB2030P    PICTURE X.
           02  IMB2030H    PICTURE X.
           02  IMB2030V    PICTURE X.
           02  IMB2030O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME2030C    PICTURE X.
           02  IME2030P    PICTURE X.
           02  IME2030H    PICTURE X.
           02  IME2030V    PICTURE X.
           02  IME2030O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB2040C    PICTURE X.
           02  IMB2040P    PICTURE X.
           02  IMB2040H    PICTURE X.
           02  IMB2040V    PICTURE X.
           02  IMB2040O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME2040C    PICTURE X.
           02  IME2040P    PICTURE X.
           02  IME2040H    PICTURE X.
           02  IME2040V    PICTURE X.
           02  IME2040O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMPFS21C    PICTURE X.
           02  IMPFS21P    PICTURE X.
           02  IMPFS21H    PICTURE X.
           02  IMPFS21V    PICTURE X.
           02  IMPFS21O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR21C    PICTURE X.
           02  IMERR21P    PICTURE X.
           02  IMERR21H    PICTURE X.
           02  IMERR21V    PICTURE X.
           02  IMERR21O  PIC X(79).
       01  IMB1M22I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN21L    COMP  PIC  S9(4).
           02  IMTRN21F    PICTURE X.
           02  FILLER REDEFINES IMTRN21F.
             03 IMTRN21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN21I  PIC X(4).
           02  BDATE23L    COMP  PIC  S9(4).
           02  BDATE23F    PICTURE X.
           02  FILLER REDEFINES BDATE23F.
             03 BDATE23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE23I  PIC X(8).
           02  BTIME23L    COMP  PIC  S9(4).
           02  BTIME23F    PICTURE X.
           02  FILLER REDEFINES BTIME23F.
             03 BTIME23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME23I  PIC X(8).
           02  IMPGE23L    COMP  PIC  S9(4).
           02  IMPGE23F    PICTURE X.
           02  FILLER REDEFINES IMPGE23F.
             03 IMPGE23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE23I  PIC X(2).
           02  CTL1023L    COMP  PIC  S9(4).
           02  CTL1023F    PICTURE X.
           02  FILLER REDEFINES CTL1023F.
             03 CTL1023A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1023I  PIC X(2).
           02  CTL2023L    COMP  PIC  S9(4).
           02  CTL2023F    PICTURE X.
           02  FILLER REDEFINES CTL2023F.
             03 CTL2023A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2023I  PIC X(3).
           02  CTL3023L    COMP  PIC  S9(4).
           02  CTL3023F    PICTURE X.
           02  FILLER REDEFINES CTL3023F.
             03 CTL3023A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3023I  PIC X(3).
           02  IMB3055L    COMP  PIC  S9(4).
           02  IMB3055F    PICTURE X.
           02  FILLER REDEFINES IMB3055F.
             03 IMB3055A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB3055I  PIC X(1).
           02  IME3055L    COMP  PIC  S9(4).
           02  IME3055F    PICTURE X.
           02  FILLER REDEFINES IME3055F.
             03 IME3055A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME3055I  PIC X(24).
           02  B301101L    COMP  PIC  S9(4).
           02  B301101F    PICTURE X.
           02  FILLER REDEFINES B301101F.
             03 B301101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301101I  PIC X(1).
           02  B301102L    COMP  PIC  S9(4).
           02  B301102F    PICTURE X.
           02  FILLER REDEFINES B301102F.
             03 B301102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301102I  PIC X(1).
           02  B301103L    COMP  PIC  S9(4).
           02  B301103F    PICTURE X.
           02  FILLER REDEFINES B301103F.
             03 B301103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301103I  PIC X(1).
           02  B301104L    COMP  PIC  S9(4).
           02  B301104F    PICTURE X.
           02  FILLER REDEFINES B301104F.
             03 B301104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301104I  PIC X(1).
           02  B301105L    COMP  PIC  S9(4).
           02  B301105F    PICTURE X.
           02  FILLER REDEFINES B301105F.
             03 B301105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301105I  PIC X(1).
           02  B301106L    COMP  PIC  S9(4).
           02  B301106F    PICTURE X.
           02  FILLER REDEFINES B301106F.
             03 B301106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301106I  PIC X(1).
           02  B301107L    COMP  PIC  S9(4).
           02  B301107F    PICTURE X.
           02  FILLER REDEFINES B301107F.
             03 B301107A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301107I  PIC X(1).
           02  B301108L    COMP  PIC  S9(4).
           02  B301108F    PICTURE X.
           02  FILLER REDEFINES B301108F.
             03 B301108A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301108I  PIC X(1).
           02  B301109L    COMP  PIC  S9(4).
           02  B301109F    PICTURE X.
           02  FILLER REDEFINES B301109F.
             03 B301109A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301109I  PIC X(1).
           02  B301110L    COMP  PIC  S9(4).
           02  B301110F    PICTURE X.
           02  FILLER REDEFINES B301110F.
             03 B301110A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301110I  PIC X(1).
           02  B301111L    COMP  PIC  S9(4).
           02  B301111F    PICTURE X.
           02  FILLER REDEFINES B301111F.
             03 B301111A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301111I  PIC X(1).
           02  B301112L    COMP  PIC  S9(4).
           02  B301112F    PICTURE X.
           02  FILLER REDEFINES B301112F.
             03 B301112A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301112I  PIC X(1).
           02  B301113L    COMP  PIC  S9(4).
           02  B301113F    PICTURE X.
           02  FILLER REDEFINES B301113F.
             03 B301113A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301113I  PIC X(1).
           02  B301114L    COMP  PIC  S9(4).
           02  B301114F    PICTURE X.
           02  FILLER REDEFINES B301114F.
             03 B301114A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301114I  PIC X(1).
           02  B301115L    COMP  PIC  S9(4).
           02  B301115F    PICTURE X.
           02  FILLER REDEFINES B301115F.
             03 B301115A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301115I  PIC X(1).
           02  B301116L    COMP  PIC  S9(4).
           02  B301116F    PICTURE X.
           02  FILLER REDEFINES B301116F.
             03 B301116A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301116I  PIC X(1).
           02  B301117L    COMP  PIC  S9(4).
           02  B301117F    PICTURE X.
           02  FILLER REDEFINES B301117F.
             03 B301117A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301117I  PIC X(1).
           02  B301118L    COMP  PIC  S9(4).
           02  B301118F    PICTURE X.
           02  FILLER REDEFINES B301118F.
             03 B301118A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301118I  PIC X(1).
           02  B301119L    COMP  PIC  S9(4).
           02  B301119F    PICTURE X.
           02  FILLER REDEFINES B301119F.
             03 B301119A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301119I  PIC X(1).
           02  B301120L    COMP  PIC  S9(4).
           02  B301120F    PICTURE X.
           02  FILLER REDEFINES B301120F.
             03 B301120A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301120I  PIC X(1).
           02  B412701L    COMP  PIC  S9(4).
           02  B412701F    PICTURE X.
           02  FILLER REDEFINES B412701F.
             03 B412701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412701I  PIC X(2).
           02  B412702L    COMP  PIC  S9(4).
           02  B412702F    PICTURE X.
           02  FILLER REDEFINES B412702F.
             03 B412702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412702I  PIC X(2).
           02  B412703L    COMP  PIC  S9(4).
           02  B412703F    PICTURE X.
           02  FILLER REDEFINES B412703F.
             03 B412703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412703I  PIC X(2).
           02  B412704L    COMP  PIC  S9(4).
           02  B412704F    PICTURE X.
           02  FILLER REDEFINES B412704F.
             03 B412704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412704I  PIC X(2).
           02  B412705L    COMP  PIC  S9(4).
           02  B412705F    PICTURE X.
           02  FILLER REDEFINES B412705F.
             03 B412705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412705I  PIC X(2).
           02  B412706L    COMP  PIC  S9(4).
           02  B412706F    PICTURE X.
           02  FILLER REDEFINES B412706F.
             03 B412706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412706I  PIC X(2).
           02  B412707L    COMP  PIC  S9(4).
           02  B412707F    PICTURE X.
           02  FILLER REDEFINES B412707F.
             03 B412707A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412707I  PIC X(2).
           02  B412708L    COMP  PIC  S9(4).
           02  B412708F    PICTURE X.
           02  FILLER REDEFINES B412708F.
             03 B412708A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412708I  PIC X(2).
           02  B412709L    COMP  PIC  S9(4).
           02  B412709F    PICTURE X.
           02  FILLER REDEFINES B412709F.
             03 B412709A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412709I  PIC X(2).
           02  B412710L    COMP  PIC  S9(4).
           02  B412710F    PICTURE X.
           02  FILLER REDEFINES B412710F.
             03 B412710A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412710I  PIC X(2).
           02  B412711L    COMP  PIC  S9(4).
           02  B412711F    PICTURE X.
           02  FILLER REDEFINES B412711F.
             03 B412711A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412711I  PIC X(2).
           02  B412712L    COMP  PIC  S9(4).
           02  B412712F    PICTURE X.
           02  FILLER REDEFINES B412712F.
             03 B412712A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412712I  PIC X(2).
           02  B412713L    COMP  PIC  S9(4).
           02  B412713F    PICTURE X.
           02  FILLER REDEFINES B412713F.
             03 B412713A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412713I  PIC X(2).
           02  B412714L    COMP  PIC  S9(4).
           02  B412714F    PICTURE X.
           02  FILLER REDEFINES B412714F.
             03 B412714A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412714I  PIC X(2).
           02  B412715L    COMP  PIC  S9(4).
           02  B412715F    PICTURE X.
           02  FILLER REDEFINES B412715F.
             03 B412715A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412715I  PIC X(2).
           02  B412716L    COMP  PIC  S9(4).
           02  B412716F    PICTURE X.
           02  FILLER REDEFINES B412716F.
             03 B412716A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412716I  PIC X(2).
           02  B412717L    COMP  PIC  S9(4).
           02  B412717F    PICTURE X.
           02  FILLER REDEFINES B412717F.
             03 B412717A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412717I  PIC X(2).
           02  B412718L    COMP  PIC  S9(4).
           02  B412718F    PICTURE X.
           02  FILLER REDEFINES B412718F.
             03 B412718A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412718I  PIC X(2).
           02  B412719L    COMP  PIC  S9(4).
           02  B412719F    PICTURE X.
           02  FILLER REDEFINES B412719F.
             03 B412719A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412719I  PIC X(2).
           02  B412720L    COMP  PIC  S9(4).
           02  B412720F    PICTURE X.
           02  FILLER REDEFINES B412720F.
             03 B412720A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412720I  PIC X(2).
           02  B412721L    COMP  PIC  S9(4).
           02  B412721F    PICTURE X.
           02  FILLER REDEFINES B412721F.
             03 B412721A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412721I  PIC X(2).
           02  B412722L    COMP  PIC  S9(4).
           02  B412722F    PICTURE X.
           02  FILLER REDEFINES B412722F.
             03 B412722A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412722I  PIC X(2).
           02  B412723L    COMP  PIC  S9(4).
           02  B412723F    PICTURE X.
           02  FILLER REDEFINES B412723F.
             03 B412723A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412723I  PIC X(2).
           02  B412724L    COMP  PIC  S9(4).
           02  B412724F    PICTURE X.
           02  FILLER REDEFINES B412724F.
             03 B412724A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412724I  PIC X(2).
           02  B412725L    COMP  PIC  S9(4).
           02  B412725F    PICTURE X.
           02  FILLER REDEFINES B412725F.
             03 B412725A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412725I  PIC X(2).
           02  B412726L    COMP  PIC  S9(4).
           02  B412726F    PICTURE X.
           02  FILLER REDEFINES B412726F.
             03 B412726A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412726I  PIC X(2).
           02  B412727L    COMP  PIC  S9(4).
           02  B412727F    PICTURE X.
           02  FILLER REDEFINES B412727F.
             03 B412727A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412727I  PIC X(2).
           02  B412728L    COMP  PIC  S9(4).
           02  B412728F    PICTURE X.
           02  FILLER REDEFINES B412728F.
             03 B412728A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412728I  PIC X(2).
           02  B412729L    COMP  PIC  S9(4).
           02  B412729F    PICTURE X.
           02  FILLER REDEFINES B412729F.
             03 B412729A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412729I  PIC X(2).
           02  B412730L    COMP  PIC  S9(4).
           02  B412730F    PICTURE X.
           02  FILLER REDEFINES B412730F.
             03 B412730A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412730I  PIC X(2).
           02  B412731L    COMP  PIC  S9(4).
           02  B412731F    PICTURE X.
           02  FILLER REDEFINES B412731F.
             03 B412731A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412731I  PIC X(2).
           02  B412732L    COMP  PIC  S9(4).
           02  B412732F    PICTURE X.
           02  FILLER REDEFINES B412732F.
             03 B412732A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412732I  PIC X(2).
           02  B412733L    COMP  PIC  S9(4).
           02  B412733F    PICTURE X.
           02  FILLER REDEFINES B412733F.
             03 B412733A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412733I  PIC X(2).
           02  B412734L    COMP  PIC  S9(4).
           02  B412734F    PICTURE X.
           02  FILLER REDEFINES B412734F.
             03 B412734A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412734I  PIC X(2).
           02  B412735L    COMP  PIC  S9(4).
           02  B412735F    PICTURE X.
           02  FILLER REDEFINES B412735F.
             03 B412735A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B412735I  PIC X(2).
           02  IMPFS22L    COMP  PIC  S9(4).
           02  IMPFS22F    PICTURE X.
           02  FILLER REDEFINES IMPFS22F.
             03 IMPFS22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS22I  PIC X(79).
           02  IMERR22L    COMP  PIC  S9(4).
           02  IMERR22F    PICTURE X.
           02  FILLER REDEFINES IMERR22F.
             03 IMERR22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR22I  PIC X(79).
       01  IMB1M22O REDEFINES IMB1M22I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN21C    PICTURE X.
           02  IMTRN21P    PICTURE X.
           02  IMTRN21H    PICTURE X.
           02  IMTRN21V    PICTURE X.
           02  IMTRN21O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE23C    PICTURE X.
           02  BDATE23P    PICTURE X.
           02  BDATE23H    PICTURE X.
           02  BDATE23V    PICTURE X.
           02  BDATE23O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME23C    PICTURE X.
           02  BTIME23P    PICTURE X.
           02  BTIME23H    PICTURE X.
           02  BTIME23V    PICTURE X.
           02  BTIME23O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE23C    PICTURE X.
           02  IMPGE23P    PICTURE X.
           02  IMPGE23H    PICTURE X.
           02  IMPGE23V    PICTURE X.
           02  IMPGE23O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1023C    PICTURE X.
           02  CTL1023P    PICTURE X.
           02  CTL1023H    PICTURE X.
           02  CTL1023V    PICTURE X.
           02  CTL1023O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2023C    PICTURE X.
           02  CTL2023P    PICTURE X.
           02  CTL2023H    PICTURE X.
           02  CTL2023V    PICTURE X.
           02  CTL2023O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3023C    PICTURE X.
           02  CTL3023P    PICTURE X.
           02  CTL3023H    PICTURE X.
           02  CTL3023V    PICTURE X.
           02  CTL3023O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB3055C    PICTURE X.
           02  IMB3055P    PICTURE X.
           02  IMB3055H    PICTURE X.
           02  IMB3055V    PICTURE X.
           02  IMB3055O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME3055C    PICTURE X.
           02  IME3055P    PICTURE X.
           02  IME3055H    PICTURE X.
           02  IME3055V    PICTURE X.
           02  IME3055O  PIC X(24).
           02  FILLER PICTURE X(3).
           02  B301101C    PICTURE X.
           02  B301101P    PICTURE X.
           02  B301101H    PICTURE X.
           02  B301101V    PICTURE X.
           02  B301101O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301102C    PICTURE X.
           02  B301102P    PICTURE X.
           02  B301102H    PICTURE X.
           02  B301102V    PICTURE X.
           02  B301102O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301103C    PICTURE X.
           02  B301103P    PICTURE X.
           02  B301103H    PICTURE X.
           02  B301103V    PICTURE X.
           02  B301103O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301104C    PICTURE X.
           02  B301104P    PICTURE X.
           02  B301104H    PICTURE X.
           02  B301104V    PICTURE X.
           02  B301104O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301105C    PICTURE X.
           02  B301105P    PICTURE X.
           02  B301105H    PICTURE X.
           02  B301105V    PICTURE X.
           02  B301105O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301106C    PICTURE X.
           02  B301106P    PICTURE X.
           02  B301106H    PICTURE X.
           02  B301106V    PICTURE X.
           02  B301106O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301107C    PICTURE X.
           02  B301107P    PICTURE X.
           02  B301107H    PICTURE X.
           02  B301107V    PICTURE X.
           02  B301107O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301108C    PICTURE X.
           02  B301108P    PICTURE X.
           02  B301108H    PICTURE X.
           02  B301108V    PICTURE X.
           02  B301108O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301109C    PICTURE X.
           02  B301109P    PICTURE X.
           02  B301109H    PICTURE X.
           02  B301109V    PICTURE X.
           02  B301109O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301110C    PICTURE X.
           02  B301110P    PICTURE X.
           02  B301110H    PICTURE X.
           02  B301110V    PICTURE X.
           02  B301110O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301111C    PICTURE X.
           02  B301111P    PICTURE X.
           02  B301111H    PICTURE X.
           02  B301111V    PICTURE X.
           02  B301111O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301112C    PICTURE X.
           02  B301112P    PICTURE X.
           02  B301112H    PICTURE X.
           02  B301112V    PICTURE X.
           02  B301112O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301113C    PICTURE X.
           02  B301113P    PICTURE X.
           02  B301113H    PICTURE X.
           02  B301113V    PICTURE X.
           02  B301113O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301114C    PICTURE X.
           02  B301114P    PICTURE X.
           02  B301114H    PICTURE X.
           02  B301114V    PICTURE X.
           02  B301114O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301115C    PICTURE X.
           02  B301115P    PICTURE X.
           02  B301115H    PICTURE X.
           02  B301115V    PICTURE X.
           02  B301115O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301116C    PICTURE X.
           02  B301116P    PICTURE X.
           02  B301116H    PICTURE X.
           02  B301116V    PICTURE X.
           02  B301116O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301117C    PICTURE X.
           02  B301117P    PICTURE X.
           02  B301117H    PICTURE X.
           02  B301117V    PICTURE X.
           02  B301117O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301118C    PICTURE X.
           02  B301118P    PICTURE X.
           02  B301118H    PICTURE X.
           02  B301118V    PICTURE X.
           02  B301118O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301119C    PICTURE X.
           02  B301119P    PICTURE X.
           02  B301119H    PICTURE X.
           02  B301119V    PICTURE X.
           02  B301119O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301120C    PICTURE X.
           02  B301120P    PICTURE X.
           02  B301120H    PICTURE X.
           02  B301120V    PICTURE X.
           02  B301120O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B412701C    PICTURE X.
           02  B412701P    PICTURE X.
           02  B412701H    PICTURE X.
           02  B412701V    PICTURE X.
           02  B412701O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412702C    PICTURE X.
           02  B412702P    PICTURE X.
           02  B412702H    PICTURE X.
           02  B412702V    PICTURE X.
           02  B412702O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412703C    PICTURE X.
           02  B412703P    PICTURE X.
           02  B412703H    PICTURE X.
           02  B412703V    PICTURE X.
           02  B412703O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412704C    PICTURE X.
           02  B412704P    PICTURE X.
           02  B412704H    PICTURE X.
           02  B412704V    PICTURE X.
           02  B412704O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412705C    PICTURE X.
           02  B412705P    PICTURE X.
           02  B412705H    PICTURE X.
           02  B412705V    PICTURE X.
           02  B412705O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412706C    PICTURE X.
           02  B412706P    PICTURE X.
           02  B412706H    PICTURE X.
           02  B412706V    PICTURE X.
           02  B412706O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412707C    PICTURE X.
           02  B412707P    PICTURE X.
           02  B412707H    PICTURE X.
           02  B412707V    PICTURE X.
           02  B412707O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412708C    PICTURE X.
           02  B412708P    PICTURE X.
           02  B412708H    PICTURE X.
           02  B412708V    PICTURE X.
           02  B412708O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412709C    PICTURE X.
           02  B412709P    PICTURE X.
           02  B412709H    PICTURE X.
           02  B412709V    PICTURE X.
           02  B412709O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412710C    PICTURE X.
           02  B412710P    PICTURE X.
           02  B412710H    PICTURE X.
           02  B412710V    PICTURE X.
           02  B412710O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412711C    PICTURE X.
           02  B412711P    PICTURE X.
           02  B412711H    PICTURE X.
           02  B412711V    PICTURE X.
           02  B412711O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412712C    PICTURE X.
           02  B412712P    PICTURE X.
           02  B412712H    PICTURE X.
           02  B412712V    PICTURE X.
           02  B412712O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412713C    PICTURE X.
           02  B412713P    PICTURE X.
           02  B412713H    PICTURE X.
           02  B412713V    PICTURE X.
           02  B412713O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412714C    PICTURE X.
           02  B412714P    PICTURE X.
           02  B412714H    PICTURE X.
           02  B412714V    PICTURE X.
           02  B412714O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412715C    PICTURE X.
           02  B412715P    PICTURE X.
           02  B412715H    PICTURE X.
           02  B412715V    PICTURE X.
           02  B412715O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412716C    PICTURE X.
           02  B412716P    PICTURE X.
           02  B412716H    PICTURE X.
           02  B412716V    PICTURE X.
           02  B412716O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412717C    PICTURE X.
           02  B412717P    PICTURE X.
           02  B412717H    PICTURE X.
           02  B412717V    PICTURE X.
           02  B412717O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412718C    PICTURE X.
           02  B412718P    PICTURE X.
           02  B412718H    PICTURE X.
           02  B412718V    PICTURE X.
           02  B412718O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412719C    PICTURE X.
           02  B412719P    PICTURE X.
           02  B412719H    PICTURE X.
           02  B412719V    PICTURE X.
           02  B412719O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412720C    PICTURE X.
           02  B412720P    PICTURE X.
           02  B412720H    PICTURE X.
           02  B412720V    PICTURE X.
           02  B412720O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412721C    PICTURE X.
           02  B412721P    PICTURE X.
           02  B412721H    PICTURE X.
           02  B412721V    PICTURE X.
           02  B412721O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412722C    PICTURE X.
           02  B412722P    PICTURE X.
           02  B412722H    PICTURE X.
           02  B412722V    PICTURE X.
           02  B412722O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412723C    PICTURE X.
           02  B412723P    PICTURE X.
           02  B412723H    PICTURE X.
           02  B412723V    PICTURE X.
           02  B412723O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412724C    PICTURE X.
           02  B412724P    PICTURE X.
           02  B412724H    PICTURE X.
           02  B412724V    PICTURE X.
           02  B412724O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412725C    PICTURE X.
           02  B412725P    PICTURE X.
           02  B412725H    PICTURE X.
           02  B412725V    PICTURE X.
           02  B412725O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412726C    PICTURE X.
           02  B412726P    PICTURE X.
           02  B412726H    PICTURE X.
           02  B412726V    PICTURE X.
           02  B412726O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412727C    PICTURE X.
           02  B412727P    PICTURE X.
           02  B412727H    PICTURE X.
           02  B412727V    PICTURE X.
           02  B412727O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412728C    PICTURE X.
           02  B412728P    PICTURE X.
           02  B412728H    PICTURE X.
           02  B412728V    PICTURE X.
           02  B412728O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412729C    PICTURE X.
           02  B412729P    PICTURE X.
           02  B412729H    PICTURE X.
           02  B412729V    PICTURE X.
           02  B412729O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412730C    PICTURE X.
           02  B412730P    PICTURE X.
           02  B412730H    PICTURE X.
           02  B412730V    PICTURE X.
           02  B412730O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412731C    PICTURE X.
           02  B412731P    PICTURE X.
           02  B412731H    PICTURE X.
           02  B412731V    PICTURE X.
           02  B412731O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412732C    PICTURE X.
           02  B412732P    PICTURE X.
           02  B412732H    PICTURE X.
           02  B412732V    PICTURE X.
           02  B412732O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412733C    PICTURE X.
           02  B412733P    PICTURE X.
           02  B412733H    PICTURE X.
           02  B412733V    PICTURE X.
           02  B412733O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412734C    PICTURE X.
           02  B412734P    PICTURE X.
           02  B412734H    PICTURE X.
           02  B412734V    PICTURE X.
           02  B412734O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B412735C    PICTURE X.
           02  B412735P    PICTURE X.
           02  B412735H    PICTURE X.
           02  B412735V    PICTURE X.
           02  B412735O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMPFS22C    PICTURE X.
           02  IMPFS22P    PICTURE X.
           02  IMPFS22H    PICTURE X.
           02  IMPFS22V    PICTURE X.
           02  IMPFS22O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR22C    PICTURE X.
           02  IMERR22P    PICTURE X.
           02  IMERR22H    PICTURE X.
           02  IMERR22V    PICTURE X.
           02  IMERR22O  PIC X(79).
       01  IMB1M24I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN23L    COMP  PIC  S9(4).
           02  IMTRN23F    PICTURE X.
           02  FILLER REDEFINES IMTRN23F.
             03 IMTRN23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN23I  PIC X(4).
           02  BDATE25L    COMP  PIC  S9(4).
           02  BDATE25F    PICTURE X.
           02  FILLER REDEFINES BDATE25F.
             03 BDATE25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE25I  PIC X(8).
           02  BTIME25L    COMP  PIC  S9(4).
           02  BTIME25F    PICTURE X.
           02  FILLER REDEFINES BTIME25F.
             03 BTIME25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME25I  PIC X(8).
           02  IMPGE25L    COMP  PIC  S9(4).
           02  IMPGE25F    PICTURE X.
           02  FILLER REDEFINES IMPGE25F.
             03 IMPGE25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE25I  PIC X(2).
           02  CTL1025L    COMP  PIC  S9(4).
           02  CTL1025F    PICTURE X.
           02  FILLER REDEFINES CTL1025F.
             03 CTL1025A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1025I  PIC X(2).
           02  CTL2025L    COMP  PIC  S9(4).
           02  CTL2025F    PICTURE X.
           02  FILLER REDEFINES CTL2025F.
             03 CTL2025A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2025I  PIC X(3).
           02  CTL3025L    COMP  PIC  S9(4).
           02  CTL3025F    PICTURE X.
           02  FILLER REDEFINES CTL3025F.
             03 CTL3025A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3025I  PIC X(3).
           02  B200829L    COMP  PIC  S9(4).
           02  B200829F    PICTURE X.
           02  FILLER REDEFINES B200829F.
             03 B200829A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200829I  PIC X(2).
           02  B200929L    COMP  PIC  S9(4).
           02  B200929F    PICTURE X.
           02  FILLER REDEFINES B200929F.
             03 B200929A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200929I  PIC X(1).
           02  E200929L    COMP  PIC  S9(4).
           02  E200929F    PICTURE X.
           02  FILLER REDEFINES E200929F.
             03 E200929A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200929I  PIC X(13).
           02  E301429L    COMP  PIC  S9(4).
           02  E301429F    PICTURE X.
           02  FILLER REDEFINES E301429F.
             03 E301429A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301429I  PIC X(3).
           02  E301529L    COMP  PIC  S9(4).
           02  E301529F    PICTURE X.
           02  FILLER REDEFINES E301529F.
             03 E301529A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301529I  PIC X(3).
           02  B200830L    COMP  PIC  S9(4).
           02  B200830F    PICTURE X.
           02  FILLER REDEFINES B200830F.
             03 B200830A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200830I  PIC X(2).
           02  B200930L    COMP  PIC  S9(4).
           02  B200930F    PICTURE X.
           02  FILLER REDEFINES B200930F.
             03 B200930A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200930I  PIC X(1).
           02  E200930L    COMP  PIC  S9(4).
           02  E200930F    PICTURE X.
           02  FILLER REDEFINES E200930F.
             03 E200930A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200930I  PIC X(13).
           02  E301430L    COMP  PIC  S9(4).
           02  E301430F    PICTURE X.
           02  FILLER REDEFINES E301430F.
             03 E301430A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301430I  PIC X(3).
           02  E301530L    COMP  PIC  S9(4).
           02  E301530F    PICTURE X.
           02  FILLER REDEFINES E301530F.
             03 E301530A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301530I  PIC X(3).
           02  B200831L    COMP  PIC  S9(4).
           02  B200831F    PICTURE X.
           02  FILLER REDEFINES B200831F.
             03 B200831A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200831I  PIC X(2).
           02  B200931L    COMP  PIC  S9(4).
           02  B200931F    PICTURE X.
           02  FILLER REDEFINES B200931F.
             03 B200931A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200931I  PIC X(1).
           02  E200931L    COMP  PIC  S9(4).
           02  E200931F    PICTURE X.
           02  FILLER REDEFINES E200931F.
             03 E200931A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200931I  PIC X(13).
           02  E301431L    COMP  PIC  S9(4).
           02  E301431F    PICTURE X.
           02  FILLER REDEFINES E301431F.
             03 E301431A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301431I  PIC X(3).
           02  E301531L    COMP  PIC  S9(4).
           02  E301531F    PICTURE X.
           02  FILLER REDEFINES E301531F.
             03 E301531A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301531I  PIC X(3).
           02  B200832L    COMP  PIC  S9(4).
           02  B200832F    PICTURE X.
           02  FILLER REDEFINES B200832F.
             03 B200832A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200832I  PIC X(2).
           02  B200932L    COMP  PIC  S9(4).
           02  B200932F    PICTURE X.
           02  FILLER REDEFINES B200932F.
             03 B200932A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200932I  PIC X(1).
           02  E200932L    COMP  PIC  S9(4).
           02  E200932F    PICTURE X.
           02  FILLER REDEFINES E200932F.
             03 E200932A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200932I  PIC X(13).
           02  E301432L    COMP  PIC  S9(4).
           02  E301432F    PICTURE X.
           02  FILLER REDEFINES E301432F.
             03 E301432A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301432I  PIC X(3).
           02  E301532L    COMP  PIC  S9(4).
           02  E301532F    PICTURE X.
           02  FILLER REDEFINES E301532F.
             03 E301532A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301532I  PIC X(3).
           02  B200833L    COMP  PIC  S9(4).
           02  B200833F    PICTURE X.
           02  FILLER REDEFINES B200833F.
             03 B200833A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200833I  PIC X(2).
           02  B200933L    COMP  PIC  S9(4).
           02  B200933F    PICTURE X.
           02  FILLER REDEFINES B200933F.
             03 B200933A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200933I  PIC X(1).
           02  E200933L    COMP  PIC  S9(4).
           02  E200933F    PICTURE X.
           02  FILLER REDEFINES E200933F.
             03 E200933A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200933I  PIC X(13).
           02  E301433L    COMP  PIC  S9(4).
           02  E301433F    PICTURE X.
           02  FILLER REDEFINES E301433F.
             03 E301433A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301433I  PIC X(3).
           02  E301533L    COMP  PIC  S9(4).
           02  E301533F    PICTURE X.
           02  FILLER REDEFINES E301533F.
             03 E301533A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301533I  PIC X(3).
           02  B200834L    COMP  PIC  S9(4).
           02  B200834F    PICTURE X.
           02  FILLER REDEFINES B200834F.
             03 B200834A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200834I  PIC X(2).
           02  B200934L    COMP  PIC  S9(4).
           02  B200934F    PICTURE X.
           02  FILLER REDEFINES B200934F.
             03 B200934A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200934I  PIC X(1).
           02  E200934L    COMP  PIC  S9(4).
           02  E200934F    PICTURE X.
           02  FILLER REDEFINES E200934F.
             03 E200934A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200934I  PIC X(13).
           02  E301434L    COMP  PIC  S9(4).
           02  E301434F    PICTURE X.
           02  FILLER REDEFINES E301434F.
             03 E301434A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301434I  PIC X(3).
           02  E301534L    COMP  PIC  S9(4).
           02  E301534F    PICTURE X.
           02  FILLER REDEFINES E301534F.
             03 E301534A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301534I  PIC X(3).
           02  B200835L    COMP  PIC  S9(4).
           02  B200835F    PICTURE X.
           02  FILLER REDEFINES B200835F.
             03 B200835A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200835I  PIC X(2).
           02  B200935L    COMP  PIC  S9(4).
           02  B200935F    PICTURE X.
           02  FILLER REDEFINES B200935F.
             03 B200935A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200935I  PIC X(1).
           02  E200935L    COMP  PIC  S9(4).
           02  E200935F    PICTURE X.
           02  FILLER REDEFINES E200935F.
             03 E200935A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200935I  PIC X(13).
           02  E301435L    COMP  PIC  S9(4).
           02  E301435F    PICTURE X.
           02  FILLER REDEFINES E301435F.
             03 E301435A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301435I  PIC X(3).
           02  E301535L    COMP  PIC  S9(4).
           02  E301535F    PICTURE X.
           02  FILLER REDEFINES E301535F.
             03 E301535A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301535I  PIC X(3).
           02  B200836L    COMP  PIC  S9(4).
           02  B200836F    PICTURE X.
           02  FILLER REDEFINES B200836F.
             03 B200836A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200836I  PIC X(2).
           02  B200936L    COMP  PIC  S9(4).
           02  B200936F    PICTURE X.
           02  FILLER REDEFINES B200936F.
             03 B200936A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200936I  PIC X(1).
           02  E200936L    COMP  PIC  S9(4).
           02  E200936F    PICTURE X.
           02  FILLER REDEFINES E200936F.
             03 E200936A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200936I  PIC X(13).
           02  E301436L    COMP  PIC  S9(4).
           02  E301436F    PICTURE X.
           02  FILLER REDEFINES E301436F.
             03 E301436A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301436I  PIC X(3).
           02  E301536L    COMP  PIC  S9(4).
           02  E301536F    PICTURE X.
           02  FILLER REDEFINES E301536F.
             03 E301536A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301536I  PIC X(3).
           02  B200837L    COMP  PIC  S9(4).
           02  B200837F    PICTURE X.
           02  FILLER REDEFINES B200837F.
             03 B200837A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200837I  PIC X(2).
           02  B200937L    COMP  PIC  S9(4).
           02  B200937F    PICTURE X.
           02  FILLER REDEFINES B200937F.
             03 B200937A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200937I  PIC X(1).
           02  E200937L    COMP  PIC  S9(4).
           02  E200937F    PICTURE X.
           02  FILLER REDEFINES E200937F.
             03 E200937A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200937I  PIC X(13).
           02  E301437L    COMP  PIC  S9(4).
           02  E301437F    PICTURE X.
           02  FILLER REDEFINES E301437F.
             03 E301437A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301437I  PIC X(3).
           02  E301537L    COMP  PIC  S9(4).
           02  E301537F    PICTURE X.
           02  FILLER REDEFINES E301537F.
             03 E301537A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301537I  PIC X(3).
           02  B200838L    COMP  PIC  S9(4).
           02  B200838F    PICTURE X.
           02  FILLER REDEFINES B200838F.
             03 B200838A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200838I  PIC X(2).
           02  B200938L    COMP  PIC  S9(4).
           02  B200938F    PICTURE X.
           02  FILLER REDEFINES B200938F.
             03 B200938A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200938I  PIC X(1).
           02  E200938L    COMP  PIC  S9(4).
           02  E200938F    PICTURE X.
           02  FILLER REDEFINES E200938F.
             03 E200938A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200938I  PIC X(13).
           02  E301438L    COMP  PIC  S9(4).
           02  E301438F    PICTURE X.
           02  FILLER REDEFINES E301438F.
             03 E301438A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301438I  PIC X(3).
           02  E301538L    COMP  PIC  S9(4).
           02  E301538F    PICTURE X.
           02  FILLER REDEFINES E301538F.
             03 E301538A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301538I  PIC X(3).
           02  B200839L    COMP  PIC  S9(4).
           02  B200839F    PICTURE X.
           02  FILLER REDEFINES B200839F.
             03 B200839A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200839I  PIC X(2).
           02  B200939L    COMP  PIC  S9(4).
           02  B200939F    PICTURE X.
           02  FILLER REDEFINES B200939F.
             03 B200939A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200939I  PIC X(1).
           02  E200939L    COMP  PIC  S9(4).
           02  E200939F    PICTURE X.
           02  FILLER REDEFINES E200939F.
             03 E200939A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200939I  PIC X(13).
           02  E301439L    COMP  PIC  S9(4).
           02  E301439F    PICTURE X.
           02  FILLER REDEFINES E301439F.
             03 E301439A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301439I  PIC X(3).
           02  E301539L    COMP  PIC  S9(4).
           02  E301539F    PICTURE X.
           02  FILLER REDEFINES E301539F.
             03 E301539A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301539I  PIC X(3).
           02  B200840L    COMP  PIC  S9(4).
           02  B200840F    PICTURE X.
           02  FILLER REDEFINES B200840F.
             03 B200840A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200840I  PIC X(2).
           02  B200940L    COMP  PIC  S9(4).
           02  B200940F    PICTURE X.
           02  FILLER REDEFINES B200940F.
             03 B200940A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200940I  PIC X(1).
           02  E200940L    COMP  PIC  S9(4).
           02  E200940F    PICTURE X.
           02  FILLER REDEFINES E200940F.
             03 E200940A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200940I  PIC X(13).
           02  E301440L    COMP  PIC  S9(4).
           02  E301440F    PICTURE X.
           02  FILLER REDEFINES E301440F.
             03 E301440A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301440I  PIC X(3).
           02  E301540L    COMP  PIC  S9(4).
           02  E301540F    PICTURE X.
           02  FILLER REDEFINES E301540F.
             03 E301540A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301540I  PIC X(3).
           02  B200841L    COMP  PIC  S9(4).
           02  B200841F    PICTURE X.
           02  FILLER REDEFINES B200841F.
             03 B200841A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200841I  PIC X(2).
           02  B200941L    COMP  PIC  S9(4).
           02  B200941F    PICTURE X.
           02  FILLER REDEFINES B200941F.
             03 B200941A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200941I  PIC X(1).
           02  E200941L    COMP  PIC  S9(4).
           02  E200941F    PICTURE X.
           02  FILLER REDEFINES E200941F.
             03 E200941A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200941I  PIC X(13).
           02  E301441L    COMP  PIC  S9(4).
           02  E301441F    PICTURE X.
           02  FILLER REDEFINES E301441F.
             03 E301441A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301441I  PIC X(3).
           02  E301541L    COMP  PIC  S9(4).
           02  E301541F    PICTURE X.
           02  FILLER REDEFINES E301541F.
             03 E301541A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301541I  PIC X(3).
           02  B200842L    COMP  PIC  S9(4).
           02  B200842F    PICTURE X.
           02  FILLER REDEFINES B200842F.
             03 B200842A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200842I  PIC X(2).
           02  B200942L    COMP  PIC  S9(4).
           02  B200942F    PICTURE X.
           02  FILLER REDEFINES B200942F.
             03 B200942A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200942I  PIC X(1).
           02  E200942L    COMP  PIC  S9(4).
           02  E200942F    PICTURE X.
           02  FILLER REDEFINES E200942F.
             03 E200942A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200942I  PIC X(13).
           02  E301442L    COMP  PIC  S9(4).
           02  E301442F    PICTURE X.
           02  FILLER REDEFINES E301442F.
             03 E301442A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301442I  PIC X(3).
           02  E301542L    COMP  PIC  S9(4).
           02  E301542F    PICTURE X.
           02  FILLER REDEFINES E301542F.
             03 E301542A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301542I  PIC X(3).
           02  B200843L    COMP  PIC  S9(4).
           02  B200843F    PICTURE X.
           02  FILLER REDEFINES B200843F.
             03 B200843A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200843I  PIC X(2).
           02  B200943L    COMP  PIC  S9(4).
           02  B200943F    PICTURE X.
           02  FILLER REDEFINES B200943F.
             03 B200943A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200943I  PIC X(1).
           02  E200943L    COMP  PIC  S9(4).
           02  E200943F    PICTURE X.
           02  FILLER REDEFINES E200943F.
             03 E200943A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200943I  PIC X(13).
           02  E301443L    COMP  PIC  S9(4).
           02  E301443F    PICTURE X.
           02  FILLER REDEFINES E301443F.
             03 E301443A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301443I  PIC X(3).
           02  E301543L    COMP  PIC  S9(4).
           02  E301543F    PICTURE X.
           02  FILLER REDEFINES E301543F.
             03 E301543A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301543I  PIC X(3).
           02  B200844L    COMP  PIC  S9(4).
           02  B200844F    PICTURE X.
           02  FILLER REDEFINES B200844F.
             03 B200844A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200844I  PIC X(2).
           02  B200944L    COMP  PIC  S9(4).
           02  B200944F    PICTURE X.
           02  FILLER REDEFINES B200944F.
             03 B200944A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200944I  PIC X(1).
           02  E200944L    COMP  PIC  S9(4).
           02  E200944F    PICTURE X.
           02  FILLER REDEFINES E200944F.
             03 E200944A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200944I  PIC X(13).
           02  E301444L    COMP  PIC  S9(4).
           02  E301444F    PICTURE X.
           02  FILLER REDEFINES E301444F.
             03 E301444A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301444I  PIC X(3).
           02  E301544L    COMP  PIC  S9(4).
           02  E301544F    PICTURE X.
           02  FILLER REDEFINES E301544F.
             03 E301544A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301544I  PIC X(3).
           02  B200845L    COMP  PIC  S9(4).
           02  B200845F    PICTURE X.
           02  FILLER REDEFINES B200845F.
             03 B200845A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200845I  PIC X(2).
           02  B200945L    COMP  PIC  S9(4).
           02  B200945F    PICTURE X.
           02  FILLER REDEFINES B200945F.
             03 B200945A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200945I  PIC X(1).
           02  E200945L    COMP  PIC  S9(4).
           02  E200945F    PICTURE X.
           02  FILLER REDEFINES E200945F.
             03 E200945A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200945I  PIC X(13).
           02  E301445L    COMP  PIC  S9(4).
           02  E301445F    PICTURE X.
           02  FILLER REDEFINES E301445F.
             03 E301445A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301445I  PIC X(3).
           02  E301545L    COMP  PIC  S9(4).
           02  E301545F    PICTURE X.
           02  FILLER REDEFINES E301545F.
             03 E301545A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301545I  PIC X(3).
           02  B200846L    COMP  PIC  S9(4).
           02  B200846F    PICTURE X.
           02  FILLER REDEFINES B200846F.
             03 B200846A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200846I  PIC X(2).
           02  B200946L    COMP  PIC  S9(4).
           02  B200946F    PICTURE X.
           02  FILLER REDEFINES B200946F.
             03 B200946A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200946I  PIC X(1).
           02  E200946L    COMP  PIC  S9(4).
           02  E200946F    PICTURE X.
           02  FILLER REDEFINES E200946F.
             03 E200946A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200946I  PIC X(13).
           02  E301446L    COMP  PIC  S9(4).
           02  E301446F    PICTURE X.
           02  FILLER REDEFINES E301446F.
             03 E301446A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301446I  PIC X(3).
           02  E301546L    COMP  PIC  S9(4).
           02  E301546F    PICTURE X.
           02  FILLER REDEFINES E301546F.
             03 E301546A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301546I  PIC X(3).
           02  B200847L    COMP  PIC  S9(4).
           02  B200847F    PICTURE X.
           02  FILLER REDEFINES B200847F.
             03 B200847A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200847I  PIC X(2).
           02  B200947L    COMP  PIC  S9(4).
           02  B200947F    PICTURE X.
           02  FILLER REDEFINES B200947F.
             03 B200947A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200947I  PIC X(1).
           02  E200947L    COMP  PIC  S9(4).
           02  E200947F    PICTURE X.
           02  FILLER REDEFINES E200947F.
             03 E200947A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200947I  PIC X(13).
           02  E301447L    COMP  PIC  S9(4).
           02  E301447F    PICTURE X.
           02  FILLER REDEFINES E301447F.
             03 E301447A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301447I  PIC X(3).
           02  E301547L    COMP  PIC  S9(4).
           02  E301547F    PICTURE X.
           02  FILLER REDEFINES E301547F.
             03 E301547A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301547I  PIC X(3).
           02  B200848L    COMP  PIC  S9(4).
           02  B200848F    PICTURE X.
           02  FILLER REDEFINES B200848F.
             03 B200848A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200848I  PIC X(2).
           02  B200948L    COMP  PIC  S9(4).
           02  B200948F    PICTURE X.
           02  FILLER REDEFINES B200948F.
             03 B200948A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200948I  PIC X(1).
           02  E200948L    COMP  PIC  S9(4).
           02  E200948F    PICTURE X.
           02  FILLER REDEFINES E200948F.
             03 E200948A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200948I  PIC X(13).
           02  E301448L    COMP  PIC  S9(4).
           02  E301448F    PICTURE X.
           02  FILLER REDEFINES E301448F.
             03 E301448A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301448I  PIC X(3).
           02  E301548L    COMP  PIC  S9(4).
           02  E301548F    PICTURE X.
           02  FILLER REDEFINES E301548F.
             03 E301548A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301548I  PIC X(3).
           02  B200849L    COMP  PIC  S9(4).
           02  B200849F    PICTURE X.
           02  FILLER REDEFINES B200849F.
             03 B200849A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200849I  PIC X(2).
           02  B200949L    COMP  PIC  S9(4).
           02  B200949F    PICTURE X.
           02  FILLER REDEFINES B200949F.
             03 B200949A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200949I  PIC X(1).
           02  E200949L    COMP  PIC  S9(4).
           02  E200949F    PICTURE X.
           02  FILLER REDEFINES E200949F.
             03 E200949A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200949I  PIC X(13).
           02  E301449L    COMP  PIC  S9(4).
           02  E301449F    PICTURE X.
           02  FILLER REDEFINES E301449F.
             03 E301449A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301449I  PIC X(3).
           02  E301549L    COMP  PIC  S9(4).
           02  E301549F    PICTURE X.
           02  FILLER REDEFINES E301549F.
             03 E301549A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301549I  PIC X(3).
           02  B200850L    COMP  PIC  S9(4).
           02  B200850F    PICTURE X.
           02  FILLER REDEFINES B200850F.
             03 B200850A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200850I  PIC X(2).
           02  B200950L    COMP  PIC  S9(4).
           02  B200950F    PICTURE X.
           02  FILLER REDEFINES B200950F.
             03 B200950A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B200950I  PIC X(1).
           02  E200950L    COMP  PIC  S9(4).
           02  E200950F    PICTURE X.
           02  FILLER REDEFINES E200950F.
             03 E200950A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E200950I  PIC X(13).
           02  E301450L    COMP  PIC  S9(4).
           02  E301450F    PICTURE X.
           02  FILLER REDEFINES E301450F.
             03 E301450A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301450I  PIC X(3).
           02  E301550L    COMP  PIC  S9(4).
           02  E301550F    PICTURE X.
           02  FILLER REDEFINES E301550F.
             03 E301550A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E301550I  PIC X(3).
           02  IMPFS24L    COMP  PIC  S9(4).
           02  IMPFS24F    PICTURE X.
           02  FILLER REDEFINES IMPFS24F.
             03 IMPFS24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS24I  PIC X(79).
           02  IMERR24L    COMP  PIC  S9(4).
           02  IMERR24F    PICTURE X.
           02  FILLER REDEFINES IMERR24F.
             03 IMERR24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR24I  PIC X(79).
       01  IMB1M24O REDEFINES IMB1M24I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN23C    PICTURE X.
           02  IMTRN23P    PICTURE X.
           02  IMTRN23H    PICTURE X.
           02  IMTRN23V    PICTURE X.
           02  IMTRN23O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE25C    PICTURE X.
           02  BDATE25P    PICTURE X.
           02  BDATE25H    PICTURE X.
           02  BDATE25V    PICTURE X.
           02  BDATE25O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME25C    PICTURE X.
           02  BTIME25P    PICTURE X.
           02  BTIME25H    PICTURE X.
           02  BTIME25V    PICTURE X.
           02  BTIME25O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE25C    PICTURE X.
           02  IMPGE25P    PICTURE X.
           02  IMPGE25H    PICTURE X.
           02  IMPGE25V    PICTURE X.
           02  IMPGE25O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1025C    PICTURE X.
           02  CTL1025P    PICTURE X.
           02  CTL1025H    PICTURE X.
           02  CTL1025V    PICTURE X.
           02  CTL1025O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2025C    PICTURE X.
           02  CTL2025P    PICTURE X.
           02  CTL2025H    PICTURE X.
           02  CTL2025V    PICTURE X.
           02  CTL2025O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3025C    PICTURE X.
           02  CTL3025P    PICTURE X.
           02  CTL3025H    PICTURE X.
           02  CTL3025V    PICTURE X.
           02  CTL3025O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200829C    PICTURE X.
           02  B200829P    PICTURE X.
           02  B200829H    PICTURE X.
           02  B200829V    PICTURE X.
           02  B200829O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200929C    PICTURE X.
           02  B200929P    PICTURE X.
           02  B200929H    PICTURE X.
           02  B200929V    PICTURE X.
           02  B200929O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200929C    PICTURE X.
           02  E200929P    PICTURE X.
           02  E200929H    PICTURE X.
           02  E200929V    PICTURE X.
           02  E200929O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301429C    PICTURE X.
           02  E301429P    PICTURE X.
           02  E301429H    PICTURE X.
           02  E301429V    PICTURE X.
           02  E301429O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301529C    PICTURE X.
           02  E301529P    PICTURE X.
           02  E301529H    PICTURE X.
           02  E301529V    PICTURE X.
           02  E301529O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200830C    PICTURE X.
           02  B200830P    PICTURE X.
           02  B200830H    PICTURE X.
           02  B200830V    PICTURE X.
           02  B200830O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200930C    PICTURE X.
           02  B200930P    PICTURE X.
           02  B200930H    PICTURE X.
           02  B200930V    PICTURE X.
           02  B200930O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200930C    PICTURE X.
           02  E200930P    PICTURE X.
           02  E200930H    PICTURE X.
           02  E200930V    PICTURE X.
           02  E200930O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301430C    PICTURE X.
           02  E301430P    PICTURE X.
           02  E301430H    PICTURE X.
           02  E301430V    PICTURE X.
           02  E301430O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301530C    PICTURE X.
           02  E301530P    PICTURE X.
           02  E301530H    PICTURE X.
           02  E301530V    PICTURE X.
           02  E301530O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200831C    PICTURE X.
           02  B200831P    PICTURE X.
           02  B200831H    PICTURE X.
           02  B200831V    PICTURE X.
           02  B200831O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200931C    PICTURE X.
           02  B200931P    PICTURE X.
           02  B200931H    PICTURE X.
           02  B200931V    PICTURE X.
           02  B200931O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200931C    PICTURE X.
           02  E200931P    PICTURE X.
           02  E200931H    PICTURE X.
           02  E200931V    PICTURE X.
           02  E200931O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301431C    PICTURE X.
           02  E301431P    PICTURE X.
           02  E301431H    PICTURE X.
           02  E301431V    PICTURE X.
           02  E301431O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301531C    PICTURE X.
           02  E301531P    PICTURE X.
           02  E301531H    PICTURE X.
           02  E301531V    PICTURE X.
           02  E301531O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200832C    PICTURE X.
           02  B200832P    PICTURE X.
           02  B200832H    PICTURE X.
           02  B200832V    PICTURE X.
           02  B200832O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200932C    PICTURE X.
           02  B200932P    PICTURE X.
           02  B200932H    PICTURE X.
           02  B200932V    PICTURE X.
           02  B200932O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200932C    PICTURE X.
           02  E200932P    PICTURE X.
           02  E200932H    PICTURE X.
           02  E200932V    PICTURE X.
           02  E200932O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301432C    PICTURE X.
           02  E301432P    PICTURE X.
           02  E301432H    PICTURE X.
           02  E301432V    PICTURE X.
           02  E301432O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301532C    PICTURE X.
           02  E301532P    PICTURE X.
           02  E301532H    PICTURE X.
           02  E301532V    PICTURE X.
           02  E301532O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200833C    PICTURE X.
           02  B200833P    PICTURE X.
           02  B200833H    PICTURE X.
           02  B200833V    PICTURE X.
           02  B200833O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200933C    PICTURE X.
           02  B200933P    PICTURE X.
           02  B200933H    PICTURE X.
           02  B200933V    PICTURE X.
           02  B200933O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200933C    PICTURE X.
           02  E200933P    PICTURE X.
           02  E200933H    PICTURE X.
           02  E200933V    PICTURE X.
           02  E200933O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301433C    PICTURE X.
           02  E301433P    PICTURE X.
           02  E301433H    PICTURE X.
           02  E301433V    PICTURE X.
           02  E301433O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301533C    PICTURE X.
           02  E301533P    PICTURE X.
           02  E301533H    PICTURE X.
           02  E301533V    PICTURE X.
           02  E301533O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200834C    PICTURE X.
           02  B200834P    PICTURE X.
           02  B200834H    PICTURE X.
           02  B200834V    PICTURE X.
           02  B200834O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200934C    PICTURE X.
           02  B200934P    PICTURE X.
           02  B200934H    PICTURE X.
           02  B200934V    PICTURE X.
           02  B200934O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200934C    PICTURE X.
           02  E200934P    PICTURE X.
           02  E200934H    PICTURE X.
           02  E200934V    PICTURE X.
           02  E200934O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301434C    PICTURE X.
           02  E301434P    PICTURE X.
           02  E301434H    PICTURE X.
           02  E301434V    PICTURE X.
           02  E301434O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301534C    PICTURE X.
           02  E301534P    PICTURE X.
           02  E301534H    PICTURE X.
           02  E301534V    PICTURE X.
           02  E301534O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200835C    PICTURE X.
           02  B200835P    PICTURE X.
           02  B200835H    PICTURE X.
           02  B200835V    PICTURE X.
           02  B200835O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200935C    PICTURE X.
           02  B200935P    PICTURE X.
           02  B200935H    PICTURE X.
           02  B200935V    PICTURE X.
           02  B200935O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200935C    PICTURE X.
           02  E200935P    PICTURE X.
           02  E200935H    PICTURE X.
           02  E200935V    PICTURE X.
           02  E200935O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301435C    PICTURE X.
           02  E301435P    PICTURE X.
           02  E301435H    PICTURE X.
           02  E301435V    PICTURE X.
           02  E301435O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301535C    PICTURE X.
           02  E301535P    PICTURE X.
           02  E301535H    PICTURE X.
           02  E301535V    PICTURE X.
           02  E301535O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200836C    PICTURE X.
           02  B200836P    PICTURE X.
           02  B200836H    PICTURE X.
           02  B200836V    PICTURE X.
           02  B200836O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200936C    PICTURE X.
           02  B200936P    PICTURE X.
           02  B200936H    PICTURE X.
           02  B200936V    PICTURE X.
           02  B200936O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200936C    PICTURE X.
           02  E200936P    PICTURE X.
           02  E200936H    PICTURE X.
           02  E200936V    PICTURE X.
           02  E200936O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301436C    PICTURE X.
           02  E301436P    PICTURE X.
           02  E301436H    PICTURE X.
           02  E301436V    PICTURE X.
           02  E301436O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301536C    PICTURE X.
           02  E301536P    PICTURE X.
           02  E301536H    PICTURE X.
           02  E301536V    PICTURE X.
           02  E301536O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200837C    PICTURE X.
           02  B200837P    PICTURE X.
           02  B200837H    PICTURE X.
           02  B200837V    PICTURE X.
           02  B200837O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200937C    PICTURE X.
           02  B200937P    PICTURE X.
           02  B200937H    PICTURE X.
           02  B200937V    PICTURE X.
           02  B200937O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200937C    PICTURE X.
           02  E200937P    PICTURE X.
           02  E200937H    PICTURE X.
           02  E200937V    PICTURE X.
           02  E200937O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301437C    PICTURE X.
           02  E301437P    PICTURE X.
           02  E301437H    PICTURE X.
           02  E301437V    PICTURE X.
           02  E301437O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301537C    PICTURE X.
           02  E301537P    PICTURE X.
           02  E301537H    PICTURE X.
           02  E301537V    PICTURE X.
           02  E301537O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200838C    PICTURE X.
           02  B200838P    PICTURE X.
           02  B200838H    PICTURE X.
           02  B200838V    PICTURE X.
           02  B200838O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200938C    PICTURE X.
           02  B200938P    PICTURE X.
           02  B200938H    PICTURE X.
           02  B200938V    PICTURE X.
           02  B200938O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200938C    PICTURE X.
           02  E200938P    PICTURE X.
           02  E200938H    PICTURE X.
           02  E200938V    PICTURE X.
           02  E200938O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301438C    PICTURE X.
           02  E301438P    PICTURE X.
           02  E301438H    PICTURE X.
           02  E301438V    PICTURE X.
           02  E301438O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301538C    PICTURE X.
           02  E301538P    PICTURE X.
           02  E301538H    PICTURE X.
           02  E301538V    PICTURE X.
           02  E301538O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200839C    PICTURE X.
           02  B200839P    PICTURE X.
           02  B200839H    PICTURE X.
           02  B200839V    PICTURE X.
           02  B200839O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200939C    PICTURE X.
           02  B200939P    PICTURE X.
           02  B200939H    PICTURE X.
           02  B200939V    PICTURE X.
           02  B200939O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200939C    PICTURE X.
           02  E200939P    PICTURE X.
           02  E200939H    PICTURE X.
           02  E200939V    PICTURE X.
           02  E200939O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301439C    PICTURE X.
           02  E301439P    PICTURE X.
           02  E301439H    PICTURE X.
           02  E301439V    PICTURE X.
           02  E301439O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301539C    PICTURE X.
           02  E301539P    PICTURE X.
           02  E301539H    PICTURE X.
           02  E301539V    PICTURE X.
           02  E301539O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200840C    PICTURE X.
           02  B200840P    PICTURE X.
           02  B200840H    PICTURE X.
           02  B200840V    PICTURE X.
           02  B200840O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200940C    PICTURE X.
           02  B200940P    PICTURE X.
           02  B200940H    PICTURE X.
           02  B200940V    PICTURE X.
           02  B200940O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200940C    PICTURE X.
           02  E200940P    PICTURE X.
           02  E200940H    PICTURE X.
           02  E200940V    PICTURE X.
           02  E200940O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301440C    PICTURE X.
           02  E301440P    PICTURE X.
           02  E301440H    PICTURE X.
           02  E301440V    PICTURE X.
           02  E301440O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301540C    PICTURE X.
           02  E301540P    PICTURE X.
           02  E301540H    PICTURE X.
           02  E301540V    PICTURE X.
           02  E301540O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200841C    PICTURE X.
           02  B200841P    PICTURE X.
           02  B200841H    PICTURE X.
           02  B200841V    PICTURE X.
           02  B200841O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200941C    PICTURE X.
           02  B200941P    PICTURE X.
           02  B200941H    PICTURE X.
           02  B200941V    PICTURE X.
           02  B200941O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200941C    PICTURE X.
           02  E200941P    PICTURE X.
           02  E200941H    PICTURE X.
           02  E200941V    PICTURE X.
           02  E200941O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301441C    PICTURE X.
           02  E301441P    PICTURE X.
           02  E301441H    PICTURE X.
           02  E301441V    PICTURE X.
           02  E301441O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301541C    PICTURE X.
           02  E301541P    PICTURE X.
           02  E301541H    PICTURE X.
           02  E301541V    PICTURE X.
           02  E301541O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200842C    PICTURE X.
           02  B200842P    PICTURE X.
           02  B200842H    PICTURE X.
           02  B200842V    PICTURE X.
           02  B200842O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200942C    PICTURE X.
           02  B200942P    PICTURE X.
           02  B200942H    PICTURE X.
           02  B200942V    PICTURE X.
           02  B200942O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200942C    PICTURE X.
           02  E200942P    PICTURE X.
           02  E200942H    PICTURE X.
           02  E200942V    PICTURE X.
           02  E200942O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301442C    PICTURE X.
           02  E301442P    PICTURE X.
           02  E301442H    PICTURE X.
           02  E301442V    PICTURE X.
           02  E301442O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301542C    PICTURE X.
           02  E301542P    PICTURE X.
           02  E301542H    PICTURE X.
           02  E301542V    PICTURE X.
           02  E301542O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200843C    PICTURE X.
           02  B200843P    PICTURE X.
           02  B200843H    PICTURE X.
           02  B200843V    PICTURE X.
           02  B200843O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200943C    PICTURE X.
           02  B200943P    PICTURE X.
           02  B200943H    PICTURE X.
           02  B200943V    PICTURE X.
           02  B200943O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200943C    PICTURE X.
           02  E200943P    PICTURE X.
           02  E200943H    PICTURE X.
           02  E200943V    PICTURE X.
           02  E200943O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301443C    PICTURE X.
           02  E301443P    PICTURE X.
           02  E301443H    PICTURE X.
           02  E301443V    PICTURE X.
           02  E301443O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301543C    PICTURE X.
           02  E301543P    PICTURE X.
           02  E301543H    PICTURE X.
           02  E301543V    PICTURE X.
           02  E301543O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200844C    PICTURE X.
           02  B200844P    PICTURE X.
           02  B200844H    PICTURE X.
           02  B200844V    PICTURE X.
           02  B200844O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200944C    PICTURE X.
           02  B200944P    PICTURE X.
           02  B200944H    PICTURE X.
           02  B200944V    PICTURE X.
           02  B200944O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200944C    PICTURE X.
           02  E200944P    PICTURE X.
           02  E200944H    PICTURE X.
           02  E200944V    PICTURE X.
           02  E200944O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301444C    PICTURE X.
           02  E301444P    PICTURE X.
           02  E301444H    PICTURE X.
           02  E301444V    PICTURE X.
           02  E301444O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301544C    PICTURE X.
           02  E301544P    PICTURE X.
           02  E301544H    PICTURE X.
           02  E301544V    PICTURE X.
           02  E301544O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200845C    PICTURE X.
           02  B200845P    PICTURE X.
           02  B200845H    PICTURE X.
           02  B200845V    PICTURE X.
           02  B200845O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200945C    PICTURE X.
           02  B200945P    PICTURE X.
           02  B200945H    PICTURE X.
           02  B200945V    PICTURE X.
           02  B200945O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200945C    PICTURE X.
           02  E200945P    PICTURE X.
           02  E200945H    PICTURE X.
           02  E200945V    PICTURE X.
           02  E200945O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301445C    PICTURE X.
           02  E301445P    PICTURE X.
           02  E301445H    PICTURE X.
           02  E301445V    PICTURE X.
           02  E301445O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301545C    PICTURE X.
           02  E301545P    PICTURE X.
           02  E301545H    PICTURE X.
           02  E301545V    PICTURE X.
           02  E301545O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200846C    PICTURE X.
           02  B200846P    PICTURE X.
           02  B200846H    PICTURE X.
           02  B200846V    PICTURE X.
           02  B200846O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200946C    PICTURE X.
           02  B200946P    PICTURE X.
           02  B200946H    PICTURE X.
           02  B200946V    PICTURE X.
           02  B200946O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200946C    PICTURE X.
           02  E200946P    PICTURE X.
           02  E200946H    PICTURE X.
           02  E200946V    PICTURE X.
           02  E200946O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301446C    PICTURE X.
           02  E301446P    PICTURE X.
           02  E301446H    PICTURE X.
           02  E301446V    PICTURE X.
           02  E301446O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301546C    PICTURE X.
           02  E301546P    PICTURE X.
           02  E301546H    PICTURE X.
           02  E301546V    PICTURE X.
           02  E301546O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200847C    PICTURE X.
           02  B200847P    PICTURE X.
           02  B200847H    PICTURE X.
           02  B200847V    PICTURE X.
           02  B200847O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200947C    PICTURE X.
           02  B200947P    PICTURE X.
           02  B200947H    PICTURE X.
           02  B200947V    PICTURE X.
           02  B200947O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200947C    PICTURE X.
           02  E200947P    PICTURE X.
           02  E200947H    PICTURE X.
           02  E200947V    PICTURE X.
           02  E200947O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301447C    PICTURE X.
           02  E301447P    PICTURE X.
           02  E301447H    PICTURE X.
           02  E301447V    PICTURE X.
           02  E301447O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301547C    PICTURE X.
           02  E301547P    PICTURE X.
           02  E301547H    PICTURE X.
           02  E301547V    PICTURE X.
           02  E301547O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200848C    PICTURE X.
           02  B200848P    PICTURE X.
           02  B200848H    PICTURE X.
           02  B200848V    PICTURE X.
           02  B200848O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200948C    PICTURE X.
           02  B200948P    PICTURE X.
           02  B200948H    PICTURE X.
           02  B200948V    PICTURE X.
           02  B200948O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200948C    PICTURE X.
           02  E200948P    PICTURE X.
           02  E200948H    PICTURE X.
           02  E200948V    PICTURE X.
           02  E200948O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301448C    PICTURE X.
           02  E301448P    PICTURE X.
           02  E301448H    PICTURE X.
           02  E301448V    PICTURE X.
           02  E301448O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301548C    PICTURE X.
           02  E301548P    PICTURE X.
           02  E301548H    PICTURE X.
           02  E301548V    PICTURE X.
           02  E301548O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200849C    PICTURE X.
           02  B200849P    PICTURE X.
           02  B200849H    PICTURE X.
           02  B200849V    PICTURE X.
           02  B200849O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200949C    PICTURE X.
           02  B200949P    PICTURE X.
           02  B200949H    PICTURE X.
           02  B200949V    PICTURE X.
           02  B200949O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200949C    PICTURE X.
           02  E200949P    PICTURE X.
           02  E200949H    PICTURE X.
           02  E200949V    PICTURE X.
           02  E200949O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301449C    PICTURE X.
           02  E301449P    PICTURE X.
           02  E301449H    PICTURE X.
           02  E301449V    PICTURE X.
           02  E301449O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301549C    PICTURE X.
           02  E301549P    PICTURE X.
           02  E301549H    PICTURE X.
           02  E301549V    PICTURE X.
           02  E301549O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B200850C    PICTURE X.
           02  B200850P    PICTURE X.
           02  B200850H    PICTURE X.
           02  B200850V    PICTURE X.
           02  B200850O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B200950C    PICTURE X.
           02  B200950P    PICTURE X.
           02  B200950H    PICTURE X.
           02  B200950V    PICTURE X.
           02  B200950O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E200950C    PICTURE X.
           02  E200950P    PICTURE X.
           02  E200950H    PICTURE X.
           02  E200950V    PICTURE X.
           02  E200950O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  E301450C    PICTURE X.
           02  E301450P    PICTURE X.
           02  E301450H    PICTURE X.
           02  E301450V    PICTURE X.
           02  E301450O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  E301550C    PICTURE X.
           02  E301550P    PICTURE X.
           02  E301550H    PICTURE X.
           02  E301550V    PICTURE X.
           02  E301550O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMPFS24C    PICTURE X.
           02  IMPFS24P    PICTURE X.
           02  IMPFS24H    PICTURE X.
           02  IMPFS24V    PICTURE X.
           02  IMPFS24O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR24C    PICTURE X.
           02  IMERR24P    PICTURE X.
           02  IMERR24H    PICTURE X.
           02  IMERR24V    PICTURE X.
           02  IMERR24O  PIC X(79).
       01  IMB1M25I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN24L    COMP  PIC  S9(4).
           02  IMTRN24F    PICTURE X.
           02  FILLER REDEFINES IMTRN24F.
             03 IMTRN24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN24I  PIC X(4).
           02  BDATE26L    COMP  PIC  S9(4).
           02  BDATE26F    PICTURE X.
           02  FILLER REDEFINES BDATE26F.
             03 BDATE26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE26I  PIC X(8).
           02  BTIME26L    COMP  PIC  S9(4).
           02  BTIME26F    PICTURE X.
           02  FILLER REDEFINES BTIME26F.
             03 BTIME26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME26I  PIC X(8).
           02  IMPGE26L    COMP  PIC  S9(4).
           02  IMPGE26F    PICTURE X.
           02  FILLER REDEFINES IMPGE26F.
             03 IMPGE26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE26I  PIC X(2).
           02  CTL1026L    COMP  PIC  S9(4).
           02  CTL1026F    PICTURE X.
           02  FILLER REDEFINES CTL1026F.
             03 CTL1026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1026I  PIC X(2).
           02  CTL2026L    COMP  PIC  S9(4).
           02  CTL2026F    PICTURE X.
           02  FILLER REDEFINES CTL2026F.
             03 CTL2026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2026I  PIC X(3).
           02  CTL3026L    COMP  PIC  S9(4).
           02  CTL3026F    PICTURE X.
           02  FILLER REDEFINES CTL3026F.
             03 CTL3026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3026I  PIC X(3).
           02  IMDEL01L    COMP  PIC  S9(4).
           02  IMDEL01F    PICTURE X.
           02  FILLER REDEFINES IMDEL01F.
             03 IMDEL01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDEL01I  PIC X(1).
           02  B601301L    COMP  PIC  S9(4).
           02  B601301F    PICTURE X.
           02  FILLER REDEFINES B601301F.
             03 B601301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601301I  PIC X(1).
           02  E601301L    COMP  PIC  S9(4).
           02  E601301F    PICTURE X.
           02  FILLER REDEFINES E601301F.
             03 E601301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601301I  PIC X(9).
           02  B601401L    COMP  PIC  S9(4).
           02  B601401F    PICTURE X.
           02  FILLER REDEFINES B601401F.
             03 B601401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601401I  PIC X(1).
           02  E601401L    COMP  PIC  S9(4).
           02  E601401F    PICTURE X.
           02  FILLER REDEFINES E601401F.
             03 E601401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601401I  PIC X(6).
           02  B304001L    COMP  PIC  S9(4).
           02  B304001F    PICTURE X.
           02  FILLER REDEFINES B304001F.
             03 B304001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304001I  PIC X(1).
           02  E304001L    COMP  PIC  S9(4).
           02  E304001F    PICTURE X.
           02  FILLER REDEFINES E304001F.
             03 E304001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304001I  PIC X(3).
           02  B601601L    COMP  PIC  S9(4).
           02  B601601F    PICTURE X.
           02  FILLER REDEFINES B601601F.
             03 B601601A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601601I  PIC X(1).
           02  E601601L    COMP  PIC  S9(4).
           02  E601601F    PICTURE X.
           02  FILLER REDEFINES E601601F.
             03 E601601A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601601I  PIC X(11).
           02  B601701L    COMP  PIC  S9(4).
           02  B601701F    PICTURE X.
           02  FILLER REDEFINES B601701F.
             03 B601701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601701I  PIC X(2).
           02  E601701L    COMP  PIC  S9(4).
           02  E601701F    PICTURE X.
           02  FILLER REDEFINES E601701F.
             03 E601701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601701I  PIC X(14).
           02  IMDEL02L    COMP  PIC  S9(4).
           02  IMDEL02F    PICTURE X.
           02  FILLER REDEFINES IMDEL02F.
             03 IMDEL02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDEL02I  PIC X(1).
           02  B601302L    COMP  PIC  S9(4).
           02  B601302F    PICTURE X.
           02  FILLER REDEFINES B601302F.
             03 B601302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601302I  PIC X(1).
           02  E601302L    COMP  PIC  S9(4).
           02  E601302F    PICTURE X.
           02  FILLER REDEFINES E601302F.
             03 E601302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601302I  PIC X(9).
           02  B601402L    COMP  PIC  S9(4).
           02  B601402F    PICTURE X.
           02  FILLER REDEFINES B601402F.
             03 B601402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601402I  PIC X(1).
           02  E601402L    COMP  PIC  S9(4).
           02  E601402F    PICTURE X.
           02  FILLER REDEFINES E601402F.
             03 E601402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601402I  PIC X(6).
           02  B304002L    COMP  PIC  S9(4).
           02  B304002F    PICTURE X.
           02  FILLER REDEFINES B304002F.
             03 B304002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304002I  PIC X(1).
           02  E304002L    COMP  PIC  S9(4).
           02  E304002F    PICTURE X.
           02  FILLER REDEFINES E304002F.
             03 E304002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304002I  PIC X(3).
           02  B601602L    COMP  PIC  S9(4).
           02  B601602F    PICTURE X.
           02  FILLER REDEFINES B601602F.
             03 B601602A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601602I  PIC X(1).
           02  E601602L    COMP  PIC  S9(4).
           02  E601602F    PICTURE X.
           02  FILLER REDEFINES E601602F.
             03 E601602A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601602I  PIC X(11).
           02  B601702L    COMP  PIC  S9(4).
           02  B601702F    PICTURE X.
           02  FILLER REDEFINES B601702F.
             03 B601702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601702I  PIC X(2).
           02  E601702L    COMP  PIC  S9(4).
           02  E601702F    PICTURE X.
           02  FILLER REDEFINES E601702F.
             03 E601702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601702I  PIC X(14).
           02  IMDEL03L    COMP  PIC  S9(4).
           02  IMDEL03F    PICTURE X.
           02  FILLER REDEFINES IMDEL03F.
             03 IMDEL03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDEL03I  PIC X(1).
           02  B601303L    COMP  PIC  S9(4).
           02  B601303F    PICTURE X.
           02  FILLER REDEFINES B601303F.
             03 B601303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601303I  PIC X(1).
           02  E601303L    COMP  PIC  S9(4).
           02  E601303F    PICTURE X.
           02  FILLER REDEFINES E601303F.
             03 E601303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601303I  PIC X(9).
           02  B601403L    COMP  PIC  S9(4).
           02  B601403F    PICTURE X.
           02  FILLER REDEFINES B601403F.
             03 B601403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601403I  PIC X(1).
           02  E601403L    COMP  PIC  S9(4).
           02  E601403F    PICTURE X.
           02  FILLER REDEFINES E601403F.
             03 E601403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601403I  PIC X(6).
           02  B304003L    COMP  PIC  S9(4).
           02  B304003F    PICTURE X.
           02  FILLER REDEFINES B304003F.
             03 B304003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304003I  PIC X(1).
           02  E304003L    COMP  PIC  S9(4).
           02  E304003F    PICTURE X.
           02  FILLER REDEFINES E304003F.
             03 E304003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304003I  PIC X(3).
           02  B601603L    COMP  PIC  S9(4).
           02  B601603F    PICTURE X.
           02  FILLER REDEFINES B601603F.
             03 B601603A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601603I  PIC X(1).
           02  E601603L    COMP  PIC  S9(4).
           02  E601603F    PICTURE X.
           02  FILLER REDEFINES E601603F.
             03 E601603A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601603I  PIC X(11).
           02  B601703L    COMP  PIC  S9(4).
           02  B601703F    PICTURE X.
           02  FILLER REDEFINES B601703F.
             03 B601703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601703I  PIC X(2).
           02  E601703L    COMP  PIC  S9(4).
           02  E601703F    PICTURE X.
           02  FILLER REDEFINES E601703F.
             03 E601703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601703I  PIC X(14).
           02  IMDEL04L    COMP  PIC  S9(4).
           02  IMDEL04F    PICTURE X.
           02  FILLER REDEFINES IMDEL04F.
             03 IMDEL04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDEL04I  PIC X(1).
           02  B601304L    COMP  PIC  S9(4).
           02  B601304F    PICTURE X.
           02  FILLER REDEFINES B601304F.
             03 B601304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601304I  PIC X(1).
           02  E601304L    COMP  PIC  S9(4).
           02  E601304F    PICTURE X.
           02  FILLER REDEFINES E601304F.
             03 E601304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601304I  PIC X(9).
           02  B601404L    COMP  PIC  S9(4).
           02  B601404F    PICTURE X.
           02  FILLER REDEFINES B601404F.
             03 B601404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601404I  PIC X(1).
           02  E601404L    COMP  PIC  S9(4).
           02  E601404F    PICTURE X.
           02  FILLER REDEFINES E601404F.
             03 E601404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601404I  PIC X(6).
           02  B304004L    COMP  PIC  S9(4).
           02  B304004F    PICTURE X.
           02  FILLER REDEFINES B304004F.
             03 B304004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304004I  PIC X(1).
           02  E304004L    COMP  PIC  S9(4).
           02  E304004F    PICTURE X.
           02  FILLER REDEFINES E304004F.
             03 E304004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304004I  PIC X(3).
           02  B601604L    COMP  PIC  S9(4).
           02  B601604F    PICTURE X.
           02  FILLER REDEFINES B601604F.
             03 B601604A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601604I  PIC X(1).
           02  E601604L    COMP  PIC  S9(4).
           02  E601604F    PICTURE X.
           02  FILLER REDEFINES E601604F.
             03 E601604A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601604I  PIC X(11).
           02  B601704L    COMP  PIC  S9(4).
           02  B601704F    PICTURE X.
           02  FILLER REDEFINES B601704F.
             03 B601704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601704I  PIC X(2).
           02  E601704L    COMP  PIC  S9(4).
           02  E601704F    PICTURE X.
           02  FILLER REDEFINES E601704F.
             03 E601704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601704I  PIC X(14).
           02  IMDEL05L    COMP  PIC  S9(4).
           02  IMDEL05F    PICTURE X.
           02  FILLER REDEFINES IMDEL05F.
             03 IMDEL05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDEL05I  PIC X(1).
           02  B601305L    COMP  PIC  S9(4).
           02  B601305F    PICTURE X.
           02  FILLER REDEFINES B601305F.
             03 B601305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601305I  PIC X(1).
           02  E601305L    COMP  PIC  S9(4).
           02  E601305F    PICTURE X.
           02  FILLER REDEFINES E601305F.
             03 E601305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601305I  PIC X(9).
           02  B601405L    COMP  PIC  S9(4).
           02  B601405F    PICTURE X.
           02  FILLER REDEFINES B601405F.
             03 B601405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601405I  PIC X(1).
           02  E601405L    COMP  PIC  S9(4).
           02  E601405F    PICTURE X.
           02  FILLER REDEFINES E601405F.
             03 E601405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601405I  PIC X(6).
           02  B304005L    COMP  PIC  S9(4).
           02  B304005F    PICTURE X.
           02  FILLER REDEFINES B304005F.
             03 B304005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304005I  PIC X(1).
           02  E304005L    COMP  PIC  S9(4).
           02  E304005F    PICTURE X.
           02  FILLER REDEFINES E304005F.
             03 E304005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304005I  PIC X(3).
           02  B601605L    COMP  PIC  S9(4).
           02  B601605F    PICTURE X.
           02  FILLER REDEFINES B601605F.
             03 B601605A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601605I  PIC X(1).
           02  E601605L    COMP  PIC  S9(4).
           02  E601605F    PICTURE X.
           02  FILLER REDEFINES E601605F.
             03 E601605A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601605I  PIC X(11).
           02  B601705L    COMP  PIC  S9(4).
           02  B601705F    PICTURE X.
           02  FILLER REDEFINES B601705F.
             03 B601705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601705I  PIC X(2).
           02  E601705L    COMP  PIC  S9(4).
           02  E601705F    PICTURE X.
           02  FILLER REDEFINES E601705F.
             03 E601705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601705I  PIC X(14).
           02  IMDEL06L    COMP  PIC  S9(4).
           02  IMDEL06F    PICTURE X.
           02  FILLER REDEFINES IMDEL06F.
             03 IMDEL06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDEL06I  PIC X(1).
           02  B601306L    COMP  PIC  S9(4).
           02  B601306F    PICTURE X.
           02  FILLER REDEFINES B601306F.
             03 B601306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601306I  PIC X(1).
           02  E601306L    COMP  PIC  S9(4).
           02  E601306F    PICTURE X.
           02  FILLER REDEFINES E601306F.
             03 E601306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601306I  PIC X(9).
           02  B601406L    COMP  PIC  S9(4).
           02  B601406F    PICTURE X.
           02  FILLER REDEFINES B601406F.
             03 B601406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601406I  PIC X(1).
           02  E601406L    COMP  PIC  S9(4).
           02  E601406F    PICTURE X.
           02  FILLER REDEFINES E601406F.
             03 E601406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601406I  PIC X(6).
           02  B304006L    COMP  PIC  S9(4).
           02  B304006F    PICTURE X.
           02  FILLER REDEFINES B304006F.
             03 B304006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304006I  PIC X(1).
           02  E304006L    COMP  PIC  S9(4).
           02  E304006F    PICTURE X.
           02  FILLER REDEFINES E304006F.
             03 E304006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304006I  PIC X(3).
           02  B601606L    COMP  PIC  S9(4).
           02  B601606F    PICTURE X.
           02  FILLER REDEFINES B601606F.
             03 B601606A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601606I  PIC X(1).
           02  E601606L    COMP  PIC  S9(4).
           02  E601606F    PICTURE X.
           02  FILLER REDEFINES E601606F.
             03 E601606A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601606I  PIC X(11).
           02  B601706L    COMP  PIC  S9(4).
           02  B601706F    PICTURE X.
           02  FILLER REDEFINES B601706F.
             03 B601706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601706I  PIC X(2).
           02  E601706L    COMP  PIC  S9(4).
           02  E601706F    PICTURE X.
           02  FILLER REDEFINES E601706F.
             03 E601706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601706I  PIC X(14).
           02  B304101L    COMP  PIC  S9(4).
           02  B304101F    PICTURE X.
           02  FILLER REDEFINES B304101F.
             03 B304101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304101I  PIC X(1).
           02  E304101L    COMP  PIC  S9(4).
           02  E304101F    PICTURE X.
           02  FILLER REDEFINES E304101F.
             03 E304101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304101I  PIC X(16).
           02  B304201L    COMP  PIC  S9(4).
           02  B304201F    PICTURE X.
           02  FILLER REDEFINES B304201F.
             03 B304201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304201I  PIC X(1).
           02  E304201L    COMP  PIC  S9(4).
           02  E304201F    PICTURE X.
           02  FILLER REDEFINES E304201F.
             03 E304201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304201I  PIC X(3).
           02  B305401L    COMP  PIC  S9(4).
           02  B305401F    PICTURE X.
           02  FILLER REDEFINES B305401F.
             03 B305401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305401I  PIC X(1).
           02  E305401L    COMP  PIC  S9(4).
           02  E305401F    PICTURE X.
           02  FILLER REDEFINES E305401F.
             03 E305401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305401I  PIC X(8).
           02  B302801L    COMP  PIC  S9(4).
           02  B302801F    PICTURE X.
           02  FILLER REDEFINES B302801F.
             03 B302801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302801I  PIC X(1).
           02  E302801L    COMP  PIC  S9(4).
           02  E302801F    PICTURE X.
           02  FILLER REDEFINES E302801F.
             03 E302801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E302801I  PIC X(3).
           02  B305701L    COMP  PIC  S9(4).
           02  B305701F    PICTURE X.
           02  FILLER REDEFINES B305701F.
             03 B305701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305701I  PIC X(1).
           02  E305701L    COMP  PIC  S9(4).
           02  E305701F    PICTURE X.
           02  FILLER REDEFINES E305701F.
             03 E305701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305701I  PIC X(3).
           02  B304102L    COMP  PIC  S9(4).
           02  B304102F    PICTURE X.
           02  FILLER REDEFINES B304102F.
             03 B304102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304102I  PIC X(1).
           02  E304102L    COMP  PIC  S9(4).
           02  E304102F    PICTURE X.
           02  FILLER REDEFINES E304102F.
             03 E304102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304102I  PIC X(16).
           02  B304202L    COMP  PIC  S9(4).
           02  B304202F    PICTURE X.
           02  FILLER REDEFINES B304202F.
             03 B304202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304202I  PIC X(1).
           02  E304202L    COMP  PIC  S9(4).
           02  E304202F    PICTURE X.
           02  FILLER REDEFINES E304202F.
             03 E304202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304202I  PIC X(3).
           02  B305402L    COMP  PIC  S9(4).
           02  B305402F    PICTURE X.
           02  FILLER REDEFINES B305402F.
             03 B305402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305402I  PIC X(1).
           02  E305402L    COMP  PIC  S9(4).
           02  E305402F    PICTURE X.
           02  FILLER REDEFINES E305402F.
             03 E305402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305402I  PIC X(8).
           02  B302802L    COMP  PIC  S9(4).
           02  B302802F    PICTURE X.
           02  FILLER REDEFINES B302802F.
             03 B302802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302802I  PIC X(1).
           02  E302802L    COMP  PIC  S9(4).
           02  E302802F    PICTURE X.
           02  FILLER REDEFINES E302802F.
             03 E302802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E302802I  PIC X(3).
           02  B305702L    COMP  PIC  S9(4).
           02  B305702F    PICTURE X.
           02  FILLER REDEFINES B305702F.
             03 B305702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305702I  PIC X(1).
           02  E305702L    COMP  PIC  S9(4).
           02  E305702F    PICTURE X.
           02  FILLER REDEFINES E305702F.
             03 E305702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305702I  PIC X(3).
           02  B304103L    COMP  PIC  S9(4).
           02  B304103F    PICTURE X.
           02  FILLER REDEFINES B304103F.
             03 B304103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304103I  PIC X(1).
           02  E304103L    COMP  PIC  S9(4).
           02  E304103F    PICTURE X.
           02  FILLER REDEFINES E304103F.
             03 E304103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304103I  PIC X(16).
           02  B304203L    COMP  PIC  S9(4).
           02  B304203F    PICTURE X.
           02  FILLER REDEFINES B304203F.
             03 B304203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304203I  PIC X(1).
           02  E304203L    COMP  PIC  S9(4).
           02  E304203F    PICTURE X.
           02  FILLER REDEFINES E304203F.
             03 E304203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304203I  PIC X(3).
           02  B305403L    COMP  PIC  S9(4).
           02  B305403F    PICTURE X.
           02  FILLER REDEFINES B305403F.
             03 B305403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305403I  PIC X(1).
           02  E305403L    COMP  PIC  S9(4).
           02  E305403F    PICTURE X.
           02  FILLER REDEFINES E305403F.
             03 E305403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305403I  PIC X(8).
           02  B302803L    COMP  PIC  S9(4).
           02  B302803F    PICTURE X.
           02  FILLER REDEFINES B302803F.
             03 B302803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302803I  PIC X(1).
           02  E302803L    COMP  PIC  S9(4).
           02  E302803F    PICTURE X.
           02  FILLER REDEFINES E302803F.
             03 E302803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E302803I  PIC X(3).
           02  B305703L    COMP  PIC  S9(4).
           02  B305703F    PICTURE X.
           02  FILLER REDEFINES B305703F.
             03 B305703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305703I  PIC X(1).
           02  E305703L    COMP  PIC  S9(4).
           02  E305703F    PICTURE X.
           02  FILLER REDEFINES E305703F.
             03 E305703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305703I  PIC X(3).
           02  B304104L    COMP  PIC  S9(4).
           02  B304104F    PICTURE X.
           02  FILLER REDEFINES B304104F.
             03 B304104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304104I  PIC X(1).
           02  E304104L    COMP  PIC  S9(4).
           02  E304104F    PICTURE X.
           02  FILLER REDEFINES E304104F.
             03 E304104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304104I  PIC X(16).
           02  B304204L    COMP  PIC  S9(4).
           02  B304204F    PICTURE X.
           02  FILLER REDEFINES B304204F.
             03 B304204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304204I  PIC X(1).
           02  E304204L    COMP  PIC  S9(4).
           02  E304204F    PICTURE X.
           02  FILLER REDEFINES E304204F.
             03 E304204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304204I  PIC X(3).
           02  B305404L    COMP  PIC  S9(4).
           02  B305404F    PICTURE X.
           02  FILLER REDEFINES B305404F.
             03 B305404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305404I  PIC X(1).
           02  E305404L    COMP  PIC  S9(4).
           02  E305404F    PICTURE X.
           02  FILLER REDEFINES E305404F.
             03 E305404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305404I  PIC X(8).
           02  B302804L    COMP  PIC  S9(4).
           02  B302804F    PICTURE X.
           02  FILLER REDEFINES B302804F.
             03 B302804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302804I  PIC X(1).
           02  E302804L    COMP  PIC  S9(4).
           02  E302804F    PICTURE X.
           02  FILLER REDEFINES E302804F.
             03 E302804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E302804I  PIC X(3).
           02  B305704L    COMP  PIC  S9(4).
           02  B305704F    PICTURE X.
           02  FILLER REDEFINES B305704F.
             03 B305704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305704I  PIC X(1).
           02  E305704L    COMP  PIC  S9(4).
           02  E305704F    PICTURE X.
           02  FILLER REDEFINES E305704F.
             03 E305704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305704I  PIC X(3).
           02  B304105L    COMP  PIC  S9(4).
           02  B304105F    PICTURE X.
           02  FILLER REDEFINES B304105F.
             03 B304105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304105I  PIC X(1).
           02  E304105L    COMP  PIC  S9(4).
           02  E304105F    PICTURE X.
           02  FILLER REDEFINES E304105F.
             03 E304105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304105I  PIC X(16).
           02  B304205L    COMP  PIC  S9(4).
           02  B304205F    PICTURE X.
           02  FILLER REDEFINES B304205F.
             03 B304205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304205I  PIC X(1).
           02  E304205L    COMP  PIC  S9(4).
           02  E304205F    PICTURE X.
           02  FILLER REDEFINES E304205F.
             03 E304205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304205I  PIC X(3).
           02  B305405L    COMP  PIC  S9(4).
           02  B305405F    PICTURE X.
           02  FILLER REDEFINES B305405F.
             03 B305405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305405I  PIC X(1).
           02  E305405L    COMP  PIC  S9(4).
           02  E305405F    PICTURE X.
           02  FILLER REDEFINES E305405F.
             03 E305405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305405I  PIC X(8).
           02  B302805L    COMP  PIC  S9(4).
           02  B302805F    PICTURE X.
           02  FILLER REDEFINES B302805F.
             03 B302805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302805I  PIC X(1).
           02  E302805L    COMP  PIC  S9(4).
           02  E302805F    PICTURE X.
           02  FILLER REDEFINES E302805F.
             03 E302805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E302805I  PIC X(3).
           02  B305705L    COMP  PIC  S9(4).
           02  B305705F    PICTURE X.
           02  FILLER REDEFINES B305705F.
             03 B305705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305705I  PIC X(1).
           02  E305705L    COMP  PIC  S9(4).
           02  E305705F    PICTURE X.
           02  FILLER REDEFINES E305705F.
             03 E305705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305705I  PIC X(3).
           02  B304106L    COMP  PIC  S9(4).
           02  B304106F    PICTURE X.
           02  FILLER REDEFINES B304106F.
             03 B304106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304106I  PIC X(1).
           02  E304106L    COMP  PIC  S9(4).
           02  E304106F    PICTURE X.
           02  FILLER REDEFINES E304106F.
             03 E304106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304106I  PIC X(16).
           02  B304206L    COMP  PIC  S9(4).
           02  B304206F    PICTURE X.
           02  FILLER REDEFINES B304206F.
             03 B304206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B304206I  PIC X(1).
           02  E304206L    COMP  PIC  S9(4).
           02  E304206F    PICTURE X.
           02  FILLER REDEFINES E304206F.
             03 E304206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E304206I  PIC X(3).
           02  B305406L    COMP  PIC  S9(4).
           02  B305406F    PICTURE X.
           02  FILLER REDEFINES B305406F.
             03 B305406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305406I  PIC X(1).
           02  E305406L    COMP  PIC  S9(4).
           02  E305406F    PICTURE X.
           02  FILLER REDEFINES E305406F.
             03 E305406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305406I  PIC X(8).
           02  B302806L    COMP  PIC  S9(4).
           02  B302806F    PICTURE X.
           02  FILLER REDEFINES B302806F.
             03 B302806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302806I  PIC X(1).
           02  E302806L    COMP  PIC  S9(4).
           02  E302806F    PICTURE X.
           02  FILLER REDEFINES E302806F.
             03 E302806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E302806I  PIC X(3).
           02  B305706L    COMP  PIC  S9(4).
           02  B305706F    PICTURE X.
           02  FILLER REDEFINES B305706F.
             03 B305706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B305706I  PIC X(1).
           02  E305706L    COMP  PIC  S9(4).
           02  E305706F    PICTURE X.
           02  FILLER REDEFINES E305706F.
             03 E305706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E305706I  PIC X(3).
           02  IMPFS25L    COMP  PIC  S9(4).
           02  IMPFS25F    PICTURE X.
           02  FILLER REDEFINES IMPFS25F.
             03 IMPFS25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS25I  PIC X(79).
           02  IMERR25L    COMP  PIC  S9(4).
           02  IMERR25F    PICTURE X.
           02  FILLER REDEFINES IMERR25F.
             03 IMERR25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR25I  PIC X(79).
       01  IMB1M25O REDEFINES IMB1M25I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN24C    PICTURE X.
           02  IMTRN24P    PICTURE X.
           02  IMTRN24H    PICTURE X.
           02  IMTRN24V    PICTURE X.
           02  IMTRN24O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE26C    PICTURE X.
           02  BDATE26P    PICTURE X.
           02  BDATE26H    PICTURE X.
           02  BDATE26V    PICTURE X.
           02  BDATE26O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME26C    PICTURE X.
           02  BTIME26P    PICTURE X.
           02  BTIME26H    PICTURE X.
           02  BTIME26V    PICTURE X.
           02  BTIME26O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE26C    PICTURE X.
           02  IMPGE26P    PICTURE X.
           02  IMPGE26H    PICTURE X.
           02  IMPGE26V    PICTURE X.
           02  IMPGE26O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1026C    PICTURE X.
           02  CTL1026P    PICTURE X.
           02  CTL1026H    PICTURE X.
           02  CTL1026V    PICTURE X.
           02  CTL1026O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2026C    PICTURE X.
           02  CTL2026P    PICTURE X.
           02  CTL2026H    PICTURE X.
           02  CTL2026V    PICTURE X.
           02  CTL2026O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3026C    PICTURE X.
           02  CTL3026P    PICTURE X.
           02  CTL3026H    PICTURE X.
           02  CTL3026V    PICTURE X.
           02  CTL3026O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMDEL01C    PICTURE X.
           02  IMDEL01P    PICTURE X.
           02  IMDEL01H    PICTURE X.
           02  IMDEL01V    PICTURE X.
           02  IMDEL01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601301C    PICTURE X.
           02  B601301P    PICTURE X.
           02  B601301H    PICTURE X.
           02  B601301V    PICTURE X.
           02  B601301O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601301C    PICTURE X.
           02  E601301P    PICTURE X.
           02  E601301H    PICTURE X.
           02  E601301V    PICTURE X.
           02  E601301O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601401C    PICTURE X.
           02  B601401P    PICTURE X.
           02  B601401H    PICTURE X.
           02  B601401V    PICTURE X.
           02  B601401O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601401C    PICTURE X.
           02  E601401P    PICTURE X.
           02  E601401H    PICTURE X.
           02  E601401V    PICTURE X.
           02  E601401O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B304001C    PICTURE X.
           02  B304001P    PICTURE X.
           02  B304001H    PICTURE X.
           02  B304001V    PICTURE X.
           02  B304001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304001C    PICTURE X.
           02  E304001P    PICTURE X.
           02  E304001H    PICTURE X.
           02  E304001V    PICTURE X.
           02  E304001O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B601601C    PICTURE X.
           02  B601601P    PICTURE X.
           02  B601601H    PICTURE X.
           02  B601601V    PICTURE X.
           02  B601601O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601601C    PICTURE X.
           02  E601601P    PICTURE X.
           02  E601601H    PICTURE X.
           02  E601601V    PICTURE X.
           02  E601601O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  B601701C    PICTURE X.
           02  B601701P    PICTURE X.
           02  B601701H    PICTURE X.
           02  B601701V    PICTURE X.
           02  B601701O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E601701C    PICTURE X.
           02  E601701P    PICTURE X.
           02  E601701H    PICTURE X.
           02  E601701V    PICTURE X.
           02  E601701O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  IMDEL02C    PICTURE X.
           02  IMDEL02P    PICTURE X.
           02  IMDEL02H    PICTURE X.
           02  IMDEL02V    PICTURE X.
           02  IMDEL02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601302C    PICTURE X.
           02  B601302P    PICTURE X.
           02  B601302H    PICTURE X.
           02  B601302V    PICTURE X.
           02  B601302O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601302C    PICTURE X.
           02  E601302P    PICTURE X.
           02  E601302H    PICTURE X.
           02  E601302V    PICTURE X.
           02  E601302O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601402C    PICTURE X.
           02  B601402P    PICTURE X.
           02  B601402H    PICTURE X.
           02  B601402V    PICTURE X.
           02  B601402O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601402C    PICTURE X.
           02  E601402P    PICTURE X.
           02  E601402H    PICTURE X.
           02  E601402V    PICTURE X.
           02  E601402O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B304002C    PICTURE X.
           02  B304002P    PICTURE X.
           02  B304002H    PICTURE X.
           02  B304002V    PICTURE X.
           02  B304002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304002C    PICTURE X.
           02  E304002P    PICTURE X.
           02  E304002H    PICTURE X.
           02  E304002V    PICTURE X.
           02  E304002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B601602C    PICTURE X.
           02  B601602P    PICTURE X.
           02  B601602H    PICTURE X.
           02  B601602V    PICTURE X.
           02  B601602O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601602C    PICTURE X.
           02  E601602P    PICTURE X.
           02  E601602H    PICTURE X.
           02  E601602V    PICTURE X.
           02  E601602O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  B601702C    PICTURE X.
           02  B601702P    PICTURE X.
           02  B601702H    PICTURE X.
           02  B601702V    PICTURE X.
           02  B601702O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E601702C    PICTURE X.
           02  E601702P    PICTURE X.
           02  E601702H    PICTURE X.
           02  E601702V    PICTURE X.
           02  E601702O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  IMDEL03C    PICTURE X.
           02  IMDEL03P    PICTURE X.
           02  IMDEL03H    PICTURE X.
           02  IMDEL03V    PICTURE X.
           02  IMDEL03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601303C    PICTURE X.
           02  B601303P    PICTURE X.
           02  B601303H    PICTURE X.
           02  B601303V    PICTURE X.
           02  B601303O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601303C    PICTURE X.
           02  E601303P    PICTURE X.
           02  E601303H    PICTURE X.
           02  E601303V    PICTURE X.
           02  E601303O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601403C    PICTURE X.
           02  B601403P    PICTURE X.
           02  B601403H    PICTURE X.
           02  B601403V    PICTURE X.
           02  B601403O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601403C    PICTURE X.
           02  E601403P    PICTURE X.
           02  E601403H    PICTURE X.
           02  E601403V    PICTURE X.
           02  E601403O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B304003C    PICTURE X.
           02  B304003P    PICTURE X.
           02  B304003H    PICTURE X.
           02  B304003V    PICTURE X.
           02  B304003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304003C    PICTURE X.
           02  E304003P    PICTURE X.
           02  E304003H    PICTURE X.
           02  E304003V    PICTURE X.
           02  E304003O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B601603C    PICTURE X.
           02  B601603P    PICTURE X.
           02  B601603H    PICTURE X.
           02  B601603V    PICTURE X.
           02  B601603O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601603C    PICTURE X.
           02  E601603P    PICTURE X.
           02  E601603H    PICTURE X.
           02  E601603V    PICTURE X.
           02  E601603O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  B601703C    PICTURE X.
           02  B601703P    PICTURE X.
           02  B601703H    PICTURE X.
           02  B601703V    PICTURE X.
           02  B601703O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E601703C    PICTURE X.
           02  E601703P    PICTURE X.
           02  E601703H    PICTURE X.
           02  E601703V    PICTURE X.
           02  E601703O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  IMDEL04C    PICTURE X.
           02  IMDEL04P    PICTURE X.
           02  IMDEL04H    PICTURE X.
           02  IMDEL04V    PICTURE X.
           02  IMDEL04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601304C    PICTURE X.
           02  B601304P    PICTURE X.
           02  B601304H    PICTURE X.
           02  B601304V    PICTURE X.
           02  B601304O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601304C    PICTURE X.
           02  E601304P    PICTURE X.
           02  E601304H    PICTURE X.
           02  E601304V    PICTURE X.
           02  E601304O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601404C    PICTURE X.
           02  B601404P    PICTURE X.
           02  B601404H    PICTURE X.
           02  B601404V    PICTURE X.
           02  B601404O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601404C    PICTURE X.
           02  E601404P    PICTURE X.
           02  E601404H    PICTURE X.
           02  E601404V    PICTURE X.
           02  E601404O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B304004C    PICTURE X.
           02  B304004P    PICTURE X.
           02  B304004H    PICTURE X.
           02  B304004V    PICTURE X.
           02  B304004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304004C    PICTURE X.
           02  E304004P    PICTURE X.
           02  E304004H    PICTURE X.
           02  E304004V    PICTURE X.
           02  E304004O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B601604C    PICTURE X.
           02  B601604P    PICTURE X.
           02  B601604H    PICTURE X.
           02  B601604V    PICTURE X.
           02  B601604O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601604C    PICTURE X.
           02  E601604P    PICTURE X.
           02  E601604H    PICTURE X.
           02  E601604V    PICTURE X.
           02  E601604O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  B601704C    PICTURE X.
           02  B601704P    PICTURE X.
           02  B601704H    PICTURE X.
           02  B601704V    PICTURE X.
           02  B601704O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E601704C    PICTURE X.
           02  E601704P    PICTURE X.
           02  E601704H    PICTURE X.
           02  E601704V    PICTURE X.
           02  E601704O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  IMDEL05C    PICTURE X.
           02  IMDEL05P    PICTURE X.
           02  IMDEL05H    PICTURE X.
           02  IMDEL05V    PICTURE X.
           02  IMDEL05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601305C    PICTURE X.
           02  B601305P    PICTURE X.
           02  B601305H    PICTURE X.
           02  B601305V    PICTURE X.
           02  B601305O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601305C    PICTURE X.
           02  E601305P    PICTURE X.
           02  E601305H    PICTURE X.
           02  E601305V    PICTURE X.
           02  E601305O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601405C    PICTURE X.
           02  B601405P    PICTURE X.
           02  B601405H    PICTURE X.
           02  B601405V    PICTURE X.
           02  B601405O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601405C    PICTURE X.
           02  E601405P    PICTURE X.
           02  E601405H    PICTURE X.
           02  E601405V    PICTURE X.
           02  E601405O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B304005C    PICTURE X.
           02  B304005P    PICTURE X.
           02  B304005H    PICTURE X.
           02  B304005V    PICTURE X.
           02  B304005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304005C    PICTURE X.
           02  E304005P    PICTURE X.
           02  E304005H    PICTURE X.
           02  E304005V    PICTURE X.
           02  E304005O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B601605C    PICTURE X.
           02  B601605P    PICTURE X.
           02  B601605H    PICTURE X.
           02  B601605V    PICTURE X.
           02  B601605O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601605C    PICTURE X.
           02  E601605P    PICTURE X.
           02  E601605H    PICTURE X.
           02  E601605V    PICTURE X.
           02  E601605O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  B601705C    PICTURE X.
           02  B601705P    PICTURE X.
           02  B601705H    PICTURE X.
           02  B601705V    PICTURE X.
           02  B601705O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E601705C    PICTURE X.
           02  E601705P    PICTURE X.
           02  E601705H    PICTURE X.
           02  E601705V    PICTURE X.
           02  E601705O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  IMDEL06C    PICTURE X.
           02  IMDEL06P    PICTURE X.
           02  IMDEL06H    PICTURE X.
           02  IMDEL06V    PICTURE X.
           02  IMDEL06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601306C    PICTURE X.
           02  B601306P    PICTURE X.
           02  B601306H    PICTURE X.
           02  B601306V    PICTURE X.
           02  B601306O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601306C    PICTURE X.
           02  E601306P    PICTURE X.
           02  E601306H    PICTURE X.
           02  E601306V    PICTURE X.
           02  E601306O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601406C    PICTURE X.
           02  B601406P    PICTURE X.
           02  B601406H    PICTURE X.
           02  B601406V    PICTURE X.
           02  B601406O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601406C    PICTURE X.
           02  E601406P    PICTURE X.
           02  E601406H    PICTURE X.
           02  E601406V    PICTURE X.
           02  E601406O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B304006C    PICTURE X.
           02  B304006P    PICTURE X.
           02  B304006H    PICTURE X.
           02  B304006V    PICTURE X.
           02  B304006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304006C    PICTURE X.
           02  E304006P    PICTURE X.
           02  E304006H    PICTURE X.
           02  E304006V    PICTURE X.
           02  E304006O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B601606C    PICTURE X.
           02  B601606P    PICTURE X.
           02  B601606H    PICTURE X.
           02  B601606V    PICTURE X.
           02  B601606O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601606C    PICTURE X.
           02  E601606P    PICTURE X.
           02  E601606H    PICTURE X.
           02  E601606V    PICTURE X.
           02  E601606O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  B601706C    PICTURE X.
           02  B601706P    PICTURE X.
           02  B601706H    PICTURE X.
           02  B601706V    PICTURE X.
           02  B601706O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E601706C    PICTURE X.
           02  E601706P    PICTURE X.
           02  E601706H    PICTURE X.
           02  E601706V    PICTURE X.
           02  E601706O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  B304101C    PICTURE X.
           02  B304101P    PICTURE X.
           02  B304101H    PICTURE X.
           02  B304101V    PICTURE X.
           02  B304101O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304101C    PICTURE X.
           02  E304101P    PICTURE X.
           02  E304101H    PICTURE X.
           02  E304101V    PICTURE X.
           02  E304101O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B304201C    PICTURE X.
           02  B304201P    PICTURE X.
           02  B304201H    PICTURE X.
           02  B304201V    PICTURE X.
           02  B304201O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304201C    PICTURE X.
           02  E304201P    PICTURE X.
           02  E304201H    PICTURE X.
           02  E304201V    PICTURE X.
           02  E304201O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305401C    PICTURE X.
           02  B305401P    PICTURE X.
           02  B305401H    PICTURE X.
           02  B305401V    PICTURE X.
           02  B305401O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305401C    PICTURE X.
           02  E305401P    PICTURE X.
           02  E305401H    PICTURE X.
           02  E305401V    PICTURE X.
           02  E305401O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B302801C    PICTURE X.
           02  B302801P    PICTURE X.
           02  B302801H    PICTURE X.
           02  B302801V    PICTURE X.
           02  B302801O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E302801C    PICTURE X.
           02  E302801P    PICTURE X.
           02  E302801H    PICTURE X.
           02  E302801V    PICTURE X.
           02  E302801O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305701C    PICTURE X.
           02  B305701P    PICTURE X.
           02  B305701H    PICTURE X.
           02  B305701V    PICTURE X.
           02  B305701O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305701C    PICTURE X.
           02  E305701P    PICTURE X.
           02  E305701H    PICTURE X.
           02  E305701V    PICTURE X.
           02  E305701O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B304102C    PICTURE X.
           02  B304102P    PICTURE X.
           02  B304102H    PICTURE X.
           02  B304102V    PICTURE X.
           02  B304102O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304102C    PICTURE X.
           02  E304102P    PICTURE X.
           02  E304102H    PICTURE X.
           02  E304102V    PICTURE X.
           02  E304102O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B304202C    PICTURE X.
           02  B304202P    PICTURE X.
           02  B304202H    PICTURE X.
           02  B304202V    PICTURE X.
           02  B304202O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304202C    PICTURE X.
           02  E304202P    PICTURE X.
           02  E304202H    PICTURE X.
           02  E304202V    PICTURE X.
           02  E304202O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305402C    PICTURE X.
           02  B305402P    PICTURE X.
           02  B305402H    PICTURE X.
           02  B305402V    PICTURE X.
           02  B305402O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305402C    PICTURE X.
           02  E305402P    PICTURE X.
           02  E305402H    PICTURE X.
           02  E305402V    PICTURE X.
           02  E305402O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B302802C    PICTURE X.
           02  B302802P    PICTURE X.
           02  B302802H    PICTURE X.
           02  B302802V    PICTURE X.
           02  B302802O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E302802C    PICTURE X.
           02  E302802P    PICTURE X.
           02  E302802H    PICTURE X.
           02  E302802V    PICTURE X.
           02  E302802O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305702C    PICTURE X.
           02  B305702P    PICTURE X.
           02  B305702H    PICTURE X.
           02  B305702V    PICTURE X.
           02  B305702O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305702C    PICTURE X.
           02  E305702P    PICTURE X.
           02  E305702H    PICTURE X.
           02  E305702V    PICTURE X.
           02  E305702O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B304103C    PICTURE X.
           02  B304103P    PICTURE X.
           02  B304103H    PICTURE X.
           02  B304103V    PICTURE X.
           02  B304103O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304103C    PICTURE X.
           02  E304103P    PICTURE X.
           02  E304103H    PICTURE X.
           02  E304103V    PICTURE X.
           02  E304103O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B304203C    PICTURE X.
           02  B304203P    PICTURE X.
           02  B304203H    PICTURE X.
           02  B304203V    PICTURE X.
           02  B304203O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304203C    PICTURE X.
           02  E304203P    PICTURE X.
           02  E304203H    PICTURE X.
           02  E304203V    PICTURE X.
           02  E304203O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305403C    PICTURE X.
           02  B305403P    PICTURE X.
           02  B305403H    PICTURE X.
           02  B305403V    PICTURE X.
           02  B305403O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305403C    PICTURE X.
           02  E305403P    PICTURE X.
           02  E305403H    PICTURE X.
           02  E305403V    PICTURE X.
           02  E305403O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B302803C    PICTURE X.
           02  B302803P    PICTURE X.
           02  B302803H    PICTURE X.
           02  B302803V    PICTURE X.
           02  B302803O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E302803C    PICTURE X.
           02  E302803P    PICTURE X.
           02  E302803H    PICTURE X.
           02  E302803V    PICTURE X.
           02  E302803O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305703C    PICTURE X.
           02  B305703P    PICTURE X.
           02  B305703H    PICTURE X.
           02  B305703V    PICTURE X.
           02  B305703O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305703C    PICTURE X.
           02  E305703P    PICTURE X.
           02  E305703H    PICTURE X.
           02  E305703V    PICTURE X.
           02  E305703O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B304104C    PICTURE X.
           02  B304104P    PICTURE X.
           02  B304104H    PICTURE X.
           02  B304104V    PICTURE X.
           02  B304104O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304104C    PICTURE X.
           02  E304104P    PICTURE X.
           02  E304104H    PICTURE X.
           02  E304104V    PICTURE X.
           02  E304104O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B304204C    PICTURE X.
           02  B304204P    PICTURE X.
           02  B304204H    PICTURE X.
           02  B304204V    PICTURE X.
           02  B304204O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304204C    PICTURE X.
           02  E304204P    PICTURE X.
           02  E304204H    PICTURE X.
           02  E304204V    PICTURE X.
           02  E304204O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305404C    PICTURE X.
           02  B305404P    PICTURE X.
           02  B305404H    PICTURE X.
           02  B305404V    PICTURE X.
           02  B305404O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305404C    PICTURE X.
           02  E305404P    PICTURE X.
           02  E305404H    PICTURE X.
           02  E305404V    PICTURE X.
           02  E305404O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B302804C    PICTURE X.
           02  B302804P    PICTURE X.
           02  B302804H    PICTURE X.
           02  B302804V    PICTURE X.
           02  B302804O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E302804C    PICTURE X.
           02  E302804P    PICTURE X.
           02  E302804H    PICTURE X.
           02  E302804V    PICTURE X.
           02  E302804O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305704C    PICTURE X.
           02  B305704P    PICTURE X.
           02  B305704H    PICTURE X.
           02  B305704V    PICTURE X.
           02  B305704O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305704C    PICTURE X.
           02  E305704P    PICTURE X.
           02  E305704H    PICTURE X.
           02  E305704V    PICTURE X.
           02  E305704O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B304105C    PICTURE X.
           02  B304105P    PICTURE X.
           02  B304105H    PICTURE X.
           02  B304105V    PICTURE X.
           02  B304105O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304105C    PICTURE X.
           02  E304105P    PICTURE X.
           02  E304105H    PICTURE X.
           02  E304105V    PICTURE X.
           02  E304105O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B304205C    PICTURE X.
           02  B304205P    PICTURE X.
           02  B304205H    PICTURE X.
           02  B304205V    PICTURE X.
           02  B304205O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304205C    PICTURE X.
           02  E304205P    PICTURE X.
           02  E304205H    PICTURE X.
           02  E304205V    PICTURE X.
           02  E304205O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305405C    PICTURE X.
           02  B305405P    PICTURE X.
           02  B305405H    PICTURE X.
           02  B305405V    PICTURE X.
           02  B305405O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305405C    PICTURE X.
           02  E305405P    PICTURE X.
           02  E305405H    PICTURE X.
           02  E305405V    PICTURE X.
           02  E305405O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B302805C    PICTURE X.
           02  B302805P    PICTURE X.
           02  B302805H    PICTURE X.
           02  B302805V    PICTURE X.
           02  B302805O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E302805C    PICTURE X.
           02  E302805P    PICTURE X.
           02  E302805H    PICTURE X.
           02  E302805V    PICTURE X.
           02  E302805O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305705C    PICTURE X.
           02  B305705P    PICTURE X.
           02  B305705H    PICTURE X.
           02  B305705V    PICTURE X.
           02  B305705O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305705C    PICTURE X.
           02  E305705P    PICTURE X.
           02  E305705H    PICTURE X.
           02  E305705V    PICTURE X.
           02  E305705O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B304106C    PICTURE X.
           02  B304106P    PICTURE X.
           02  B304106H    PICTURE X.
           02  B304106V    PICTURE X.
           02  B304106O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304106C    PICTURE X.
           02  E304106P    PICTURE X.
           02  E304106H    PICTURE X.
           02  E304106V    PICTURE X.
           02  E304106O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B304206C    PICTURE X.
           02  B304206P    PICTURE X.
           02  B304206H    PICTURE X.
           02  B304206V    PICTURE X.
           02  B304206O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E304206C    PICTURE X.
           02  E304206P    PICTURE X.
           02  E304206H    PICTURE X.
           02  E304206V    PICTURE X.
           02  E304206O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305406C    PICTURE X.
           02  B305406P    PICTURE X.
           02  B305406H    PICTURE X.
           02  B305406V    PICTURE X.
           02  B305406O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305406C    PICTURE X.
           02  E305406P    PICTURE X.
           02  E305406H    PICTURE X.
           02  E305406V    PICTURE X.
           02  E305406O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B302806C    PICTURE X.
           02  B302806P    PICTURE X.
           02  B302806H    PICTURE X.
           02  B302806V    PICTURE X.
           02  B302806O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E302806C    PICTURE X.
           02  E302806P    PICTURE X.
           02  E302806H    PICTURE X.
           02  E302806V    PICTURE X.
           02  E302806O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B305706C    PICTURE X.
           02  B305706P    PICTURE X.
           02  B305706H    PICTURE X.
           02  B305706V    PICTURE X.
           02  B305706O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E305706C    PICTURE X.
           02  E305706P    PICTURE X.
           02  E305706H    PICTURE X.
           02  E305706V    PICTURE X.
           02  E305706O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMPFS25C    PICTURE X.
           02  IMPFS25P    PICTURE X.
           02  IMPFS25H    PICTURE X.
           02  IMPFS25V    PICTURE X.
           02  IMPFS25O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR25C    PICTURE X.
           02  IMERR25P    PICTURE X.
           02  IMERR25H    PICTURE X.
           02  IMERR25V    PICTURE X.
           02  IMERR25O  PIC X(79).
       01  IMB1M26I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN25L    COMP  PIC  S9(4).
           02  IMTRN25F    PICTURE X.
           02  FILLER REDEFINES IMTRN25F.
             03 IMTRN25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN25I  PIC X(4).
           02  BDATE27L    COMP  PIC  S9(4).
           02  BDATE27F    PICTURE X.
           02  FILLER REDEFINES BDATE27F.
             03 BDATE27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE27I  PIC X(8).
           02  BTIME27L    COMP  PIC  S9(4).
           02  BTIME27F    PICTURE X.
           02  FILLER REDEFINES BTIME27F.
             03 BTIME27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME27I  PIC X(8).
           02  IMPGE27L    COMP  PIC  S9(4).
           02  IMPGE27F    PICTURE X.
           02  FILLER REDEFINES IMPGE27F.
             03 IMPGE27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE27I  PIC X(2).
           02  CTL1027L    COMP  PIC  S9(4).
           02  CTL1027F    PICTURE X.
           02  FILLER REDEFINES CTL1027F.
             03 CTL1027A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1027I  PIC X(2).
           02  CTL2027L    COMP  PIC  S9(4).
           02  CTL2027F    PICTURE X.
           02  FILLER REDEFINES CTL2027F.
             03 CTL2027A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2027I  PIC X(3).
           02  CTL3027L    COMP  PIC  S9(4).
           02  CTL3027F    PICTURE X.
           02  FILLER REDEFINES CTL3027F.
             03 CTL3027A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3027I  PIC X(3).
           02  B302001L    COMP  PIC  S9(4).
           02  B302001F    PICTURE X.
           02  FILLER REDEFINES B302001F.
             03 B302001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302001I  PIC X(1).
           02  B302101L    COMP  PIC  S9(4).
           02  B302101F    PICTURE X.
           02  FILLER REDEFINES B302101F.
             03 B302101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302101I  PIC X(1).
           02  B302201L    COMP  PIC  S9(4).
           02  B302201F    PICTURE X.
           02  FILLER REDEFINES B302201F.
             03 B302201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302201I  PIC X(1).
           02  B302301L    COMP  PIC  S9(4).
           02  B302301F    PICTURE X.
           02  FILLER REDEFINES B302301F.
             03 B302301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302301I  PIC X(1).
           02  B302401L    COMP  PIC  S9(4).
           02  B302401F    PICTURE X.
           02  FILLER REDEFINES B302401F.
             03 B302401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302401I  PIC X(1).
           02  B302501L    COMP  PIC  S9(4).
           02  B302501F    PICTURE X.
           02  FILLER REDEFINES B302501F.
             03 B302501A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302501I  PIC X(1).
           02  B303101L    COMP  PIC  S9(4).
           02  B303101F    PICTURE X.
           02  FILLER REDEFINES B303101F.
             03 B303101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303101I  PIC X(1).
           02  B303201L    COMP  PIC  S9(4).
           02  B303201F    PICTURE X.
           02  FILLER REDEFINES B303201F.
             03 B303201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303201I  PIC X(1).
           02  B303301L    COMP  PIC  S9(4).
           02  B303301F    PICTURE X.
           02  FILLER REDEFINES B303301F.
             03 B303301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303301I  PIC X(1).
           02  B303401L    COMP  PIC  S9(4).
           02  B303401F    PICTURE X.
           02  FILLER REDEFINES B303401F.
             03 B303401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303401I  PIC X(1).
           02  B303501L    COMP  PIC  S9(4).
           02  B303501F    PICTURE X.
           02  FILLER REDEFINES B303501F.
             03 B303501A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303501I  PIC X(1).
           02  B303601L    COMP  PIC  S9(4).
           02  B303601F    PICTURE X.
           02  FILLER REDEFINES B303601F.
             03 B303601A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303601I  PIC X(1).
           02  B302901L    COMP  PIC  S9(4).
           02  B302901F    PICTURE X.
           02  FILLER REDEFINES B302901F.
             03 B302901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302901I  PIC X(1).
           02  B303001L    COMP  PIC  S9(4).
           02  B303001F    PICTURE X.
           02  FILLER REDEFINES B303001F.
             03 B303001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303001I  PIC X(1).
           02  B302002L    COMP  PIC  S9(4).
           02  B302002F    PICTURE X.
           02  FILLER REDEFINES B302002F.
             03 B302002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302002I  PIC X(1).
           02  B302102L    COMP  PIC  S9(4).
           02  B302102F    PICTURE X.
           02  FILLER REDEFINES B302102F.
             03 B302102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302102I  PIC X(1).
           02  B302202L    COMP  PIC  S9(4).
           02  B302202F    PICTURE X.
           02  FILLER REDEFINES B302202F.
             03 B302202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302202I  PIC X(1).
           02  B302302L    COMP  PIC  S9(4).
           02  B302302F    PICTURE X.
           02  FILLER REDEFINES B302302F.
             03 B302302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302302I  PIC X(1).
           02  B302402L    COMP  PIC  S9(4).
           02  B302402F    PICTURE X.
           02  FILLER REDEFINES B302402F.
             03 B302402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302402I  PIC X(1).
           02  B302502L    COMP  PIC  S9(4).
           02  B302502F    PICTURE X.
           02  FILLER REDEFINES B302502F.
             03 B302502A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302502I  PIC X(1).
           02  B303102L    COMP  PIC  S9(4).
           02  B303102F    PICTURE X.
           02  FILLER REDEFINES B303102F.
             03 B303102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303102I  PIC X(1).
           02  B303202L    COMP  PIC  S9(4).
           02  B303202F    PICTURE X.
           02  FILLER REDEFINES B303202F.
             03 B303202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303202I  PIC X(1).
           02  B303302L    COMP  PIC  S9(4).
           02  B303302F    PICTURE X.
           02  FILLER REDEFINES B303302F.
             03 B303302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303302I  PIC X(1).
           02  B303402L    COMP  PIC  S9(4).
           02  B303402F    PICTURE X.
           02  FILLER REDEFINES B303402F.
             03 B303402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303402I  PIC X(1).
           02  B303502L    COMP  PIC  S9(4).
           02  B303502F    PICTURE X.
           02  FILLER REDEFINES B303502F.
             03 B303502A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303502I  PIC X(1).
           02  B303602L    COMP  PIC  S9(4).
           02  B303602F    PICTURE X.
           02  FILLER REDEFINES B303602F.
             03 B303602A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303602I  PIC X(1).
           02  B302902L    COMP  PIC  S9(4).
           02  B302902F    PICTURE X.
           02  FILLER REDEFINES B302902F.
             03 B302902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302902I  PIC X(1).
           02  B303002L    COMP  PIC  S9(4).
           02  B303002F    PICTURE X.
           02  FILLER REDEFINES B303002F.
             03 B303002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303002I  PIC X(1).
           02  B302003L    COMP  PIC  S9(4).
           02  B302003F    PICTURE X.
           02  FILLER REDEFINES B302003F.
             03 B302003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302003I  PIC X(1).
           02  B302103L    COMP  PIC  S9(4).
           02  B302103F    PICTURE X.
           02  FILLER REDEFINES B302103F.
             03 B302103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302103I  PIC X(1).
           02  B302203L    COMP  PIC  S9(4).
           02  B302203F    PICTURE X.
           02  FILLER REDEFINES B302203F.
             03 B302203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302203I  PIC X(1).
           02  B302303L    COMP  PIC  S9(4).
           02  B302303F    PICTURE X.
           02  FILLER REDEFINES B302303F.
             03 B302303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302303I  PIC X(1).
           02  B302403L    COMP  PIC  S9(4).
           02  B302403F    PICTURE X.
           02  FILLER REDEFINES B302403F.
             03 B302403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302403I  PIC X(1).
           02  B302503L    COMP  PIC  S9(4).
           02  B302503F    PICTURE X.
           02  FILLER REDEFINES B302503F.
             03 B302503A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302503I  PIC X(1).
           02  B303103L    COMP  PIC  S9(4).
           02  B303103F    PICTURE X.
           02  FILLER REDEFINES B303103F.
             03 B303103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303103I  PIC X(1).
           02  B303203L    COMP  PIC  S9(4).
           02  B303203F    PICTURE X.
           02  FILLER REDEFINES B303203F.
             03 B303203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303203I  PIC X(1).
           02  B303303L    COMP  PIC  S9(4).
           02  B303303F    PICTURE X.
           02  FILLER REDEFINES B303303F.
             03 B303303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303303I  PIC X(1).
           02  B303403L    COMP  PIC  S9(4).
           02  B303403F    PICTURE X.
           02  FILLER REDEFINES B303403F.
             03 B303403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303403I  PIC X(1).
           02  B303503L    COMP  PIC  S9(4).
           02  B303503F    PICTURE X.
           02  FILLER REDEFINES B303503F.
             03 B303503A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303503I  PIC X(1).
           02  B303603L    COMP  PIC  S9(4).
           02  B303603F    PICTURE X.
           02  FILLER REDEFINES B303603F.
             03 B303603A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303603I  PIC X(1).
           02  B302903L    COMP  PIC  S9(4).
           02  B302903F    PICTURE X.
           02  FILLER REDEFINES B302903F.
             03 B302903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302903I  PIC X(1).
           02  B303003L    COMP  PIC  S9(4).
           02  B303003F    PICTURE X.
           02  FILLER REDEFINES B303003F.
             03 B303003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303003I  PIC X(1).
           02  B302004L    COMP  PIC  S9(4).
           02  B302004F    PICTURE X.
           02  FILLER REDEFINES B302004F.
             03 B302004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302004I  PIC X(1).
           02  B302104L    COMP  PIC  S9(4).
           02  B302104F    PICTURE X.
           02  FILLER REDEFINES B302104F.
             03 B302104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302104I  PIC X(1).
           02  B302204L    COMP  PIC  S9(4).
           02  B302204F    PICTURE X.
           02  FILLER REDEFINES B302204F.
             03 B302204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302204I  PIC X(1).
           02  B302304L    COMP  PIC  S9(4).
           02  B302304F    PICTURE X.
           02  FILLER REDEFINES B302304F.
             03 B302304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302304I  PIC X(1).
           02  B302404L    COMP  PIC  S9(4).
           02  B302404F    PICTURE X.
           02  FILLER REDEFINES B302404F.
             03 B302404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302404I  PIC X(1).
           02  B302504L    COMP  PIC  S9(4).
           02  B302504F    PICTURE X.
           02  FILLER REDEFINES B302504F.
             03 B302504A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302504I  PIC X(1).
           02  B303104L    COMP  PIC  S9(4).
           02  B303104F    PICTURE X.
           02  FILLER REDEFINES B303104F.
             03 B303104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303104I  PIC X(1).
           02  B303204L    COMP  PIC  S9(4).
           02  B303204F    PICTURE X.
           02  FILLER REDEFINES B303204F.
             03 B303204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303204I  PIC X(1).
           02  B303304L    COMP  PIC  S9(4).
           02  B303304F    PICTURE X.
           02  FILLER REDEFINES B303304F.
             03 B303304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303304I  PIC X(1).
           02  B303404L    COMP  PIC  S9(4).
           02  B303404F    PICTURE X.
           02  FILLER REDEFINES B303404F.
             03 B303404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303404I  PIC X(1).
           02  B303504L    COMP  PIC  S9(4).
           02  B303504F    PICTURE X.
           02  FILLER REDEFINES B303504F.
             03 B303504A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303504I  PIC X(1).
           02  B303604L    COMP  PIC  S9(4).
           02  B303604F    PICTURE X.
           02  FILLER REDEFINES B303604F.
             03 B303604A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303604I  PIC X(1).
           02  B302904L    COMP  PIC  S9(4).
           02  B302904F    PICTURE X.
           02  FILLER REDEFINES B302904F.
             03 B302904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302904I  PIC X(1).
           02  B303004L    COMP  PIC  S9(4).
           02  B303004F    PICTURE X.
           02  FILLER REDEFINES B303004F.
             03 B303004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303004I  PIC X(1).
           02  B302005L    COMP  PIC  S9(4).
           02  B302005F    PICTURE X.
           02  FILLER REDEFINES B302005F.
             03 B302005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302005I  PIC X(1).
           02  B302105L    COMP  PIC  S9(4).
           02  B302105F    PICTURE X.
           02  FILLER REDEFINES B302105F.
             03 B302105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302105I  PIC X(1).
           02  B302205L    COMP  PIC  S9(4).
           02  B302205F    PICTURE X.
           02  FILLER REDEFINES B302205F.
             03 B302205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302205I  PIC X(1).
           02  B302305L    COMP  PIC  S9(4).
           02  B302305F    PICTURE X.
           02  FILLER REDEFINES B302305F.
             03 B302305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302305I  PIC X(1).
           02  B302405L    COMP  PIC  S9(4).
           02  B302405F    PICTURE X.
           02  FILLER REDEFINES B302405F.
             03 B302405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302405I  PIC X(1).
           02  B302505L    COMP  PIC  S9(4).
           02  B302505F    PICTURE X.
           02  FILLER REDEFINES B302505F.
             03 B302505A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302505I  PIC X(1).
           02  B303105L    COMP  PIC  S9(4).
           02  B303105F    PICTURE X.
           02  FILLER REDEFINES B303105F.
             03 B303105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303105I  PIC X(1).
           02  B303205L    COMP  PIC  S9(4).
           02  B303205F    PICTURE X.
           02  FILLER REDEFINES B303205F.
             03 B303205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303205I  PIC X(1).
           02  B303305L    COMP  PIC  S9(4).
           02  B303305F    PICTURE X.
           02  FILLER REDEFINES B303305F.
             03 B303305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303305I  PIC X(1).
           02  B303405L    COMP  PIC  S9(4).
           02  B303405F    PICTURE X.
           02  FILLER REDEFINES B303405F.
             03 B303405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303405I  PIC X(1).
           02  B303505L    COMP  PIC  S9(4).
           02  B303505F    PICTURE X.
           02  FILLER REDEFINES B303505F.
             03 B303505A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303505I  PIC X(1).
           02  B303605L    COMP  PIC  S9(4).
           02  B303605F    PICTURE X.
           02  FILLER REDEFINES B303605F.
             03 B303605A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303605I  PIC X(1).
           02  B302905L    COMP  PIC  S9(4).
           02  B302905F    PICTURE X.
           02  FILLER REDEFINES B302905F.
             03 B302905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302905I  PIC X(1).
           02  B303005L    COMP  PIC  S9(4).
           02  B303005F    PICTURE X.
           02  FILLER REDEFINES B303005F.
             03 B303005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303005I  PIC X(1).
           02  B302006L    COMP  PIC  S9(4).
           02  B302006F    PICTURE X.
           02  FILLER REDEFINES B302006F.
             03 B302006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302006I  PIC X(1).
           02  B302106L    COMP  PIC  S9(4).
           02  B302106F    PICTURE X.
           02  FILLER REDEFINES B302106F.
             03 B302106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302106I  PIC X(1).
           02  B302206L    COMP  PIC  S9(4).
           02  B302206F    PICTURE X.
           02  FILLER REDEFINES B302206F.
             03 B302206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302206I  PIC X(1).
           02  B302306L    COMP  PIC  S9(4).
           02  B302306F    PICTURE X.
           02  FILLER REDEFINES B302306F.
             03 B302306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302306I  PIC X(1).
           02  B302406L    COMP  PIC  S9(4).
           02  B302406F    PICTURE X.
           02  FILLER REDEFINES B302406F.
             03 B302406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302406I  PIC X(1).
           02  B302506L    COMP  PIC  S9(4).
           02  B302506F    PICTURE X.
           02  FILLER REDEFINES B302506F.
             03 B302506A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302506I  PIC X(1).
           02  B303106L    COMP  PIC  S9(4).
           02  B303106F    PICTURE X.
           02  FILLER REDEFINES B303106F.
             03 B303106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303106I  PIC X(1).
           02  B303206L    COMP  PIC  S9(4).
           02  B303206F    PICTURE X.
           02  FILLER REDEFINES B303206F.
             03 B303206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303206I  PIC X(1).
           02  B303306L    COMP  PIC  S9(4).
           02  B303306F    PICTURE X.
           02  FILLER REDEFINES B303306F.
             03 B303306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303306I  PIC X(1).
           02  B303406L    COMP  PIC  S9(4).
           02  B303406F    PICTURE X.
           02  FILLER REDEFINES B303406F.
             03 B303406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303406I  PIC X(1).
           02  B303506L    COMP  PIC  S9(4).
           02  B303506F    PICTURE X.
           02  FILLER REDEFINES B303506F.
             03 B303506A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303506I  PIC X(1).
           02  B303606L    COMP  PIC  S9(4).
           02  B303606F    PICTURE X.
           02  FILLER REDEFINES B303606F.
             03 B303606A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303606I  PIC X(1).
           02  B302906L    COMP  PIC  S9(4).
           02  B302906F    PICTURE X.
           02  FILLER REDEFINES B302906F.
             03 B302906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302906I  PIC X(1).
           02  B303006L    COMP  PIC  S9(4).
           02  B303006F    PICTURE X.
           02  FILLER REDEFINES B303006F.
             03 B303006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B303006I  PIC X(1).
           02  B301201L    COMP  PIC  S9(4).
           02  B301201F    PICTURE X.
           02  FILLER REDEFINES B301201F.
             03 B301201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301201I  PIC X(5).
           02  B301301L    COMP  PIC  S9(4).
           02  B301301F    PICTURE X.
           02  FILLER REDEFINES B301301F.
             03 B301301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301301I  PIC X(5).
           02  B302601L    COMP  PIC  S9(4).
           02  B302601F    PICTURE X.
           02  FILLER REDEFINES B302601F.
             03 B302601A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302601I  PIC X(2).
           02  B302701L    COMP  PIC  S9(4).
           02  B302701F    PICTURE X.
           02  FILLER REDEFINES B302701F.
             03 B302701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302701I  PIC X(1).
           02  B301202L    COMP  PIC  S9(4).
           02  B301202F    PICTURE X.
           02  FILLER REDEFINES B301202F.
             03 B301202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301202I  PIC X(5).
           02  B301302L    COMP  PIC  S9(4).
           02  B301302F    PICTURE X.
           02  FILLER REDEFINES B301302F.
             03 B301302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301302I  PIC X(5).
           02  B302602L    COMP  PIC  S9(4).
           02  B302602F    PICTURE X.
           02  FILLER REDEFINES B302602F.
             03 B302602A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302602I  PIC X(2).
           02  B302702L    COMP  PIC  S9(4).
           02  B302702F    PICTURE X.
           02  FILLER REDEFINES B302702F.
             03 B302702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302702I  PIC X(1).
           02  B301203L    COMP  PIC  S9(4).
           02  B301203F    PICTURE X.
           02  FILLER REDEFINES B301203F.
             03 B301203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301203I  PIC X(5).
           02  B301303L    COMP  PIC  S9(4).
           02  B301303F    PICTURE X.
           02  FILLER REDEFINES B301303F.
             03 B301303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301303I  PIC X(5).
           02  B302603L    COMP  PIC  S9(4).
           02  B302603F    PICTURE X.
           02  FILLER REDEFINES B302603F.
             03 B302603A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302603I  PIC X(2).
           02  B302703L    COMP  PIC  S9(4).
           02  B302703F    PICTURE X.
           02  FILLER REDEFINES B302703F.
             03 B302703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302703I  PIC X(1).
           02  B301204L    COMP  PIC  S9(4).
           02  B301204F    PICTURE X.
           02  FILLER REDEFINES B301204F.
             03 B301204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301204I  PIC X(5).
           02  B301304L    COMP  PIC  S9(4).
           02  B301304F    PICTURE X.
           02  FILLER REDEFINES B301304F.
             03 B301304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301304I  PIC X(5).
           02  B302604L    COMP  PIC  S9(4).
           02  B302604F    PICTURE X.
           02  FILLER REDEFINES B302604F.
             03 B302604A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302604I  PIC X(2).
           02  B302704L    COMP  PIC  S9(4).
           02  B302704F    PICTURE X.
           02  FILLER REDEFINES B302704F.
             03 B302704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302704I  PIC X(1).
           02  B301205L    COMP  PIC  S9(4).
           02  B301205F    PICTURE X.
           02  FILLER REDEFINES B301205F.
             03 B301205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301205I  PIC X(5).
           02  B301305L    COMP  PIC  S9(4).
           02  B301305F    PICTURE X.
           02  FILLER REDEFINES B301305F.
             03 B301305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301305I  PIC X(5).
           02  B302605L    COMP  PIC  S9(4).
           02  B302605F    PICTURE X.
           02  FILLER REDEFINES B302605F.
             03 B302605A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302605I  PIC X(2).
           02  B302705L    COMP  PIC  S9(4).
           02  B302705F    PICTURE X.
           02  FILLER REDEFINES B302705F.
             03 B302705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302705I  PIC X(1).
           02  B301206L    COMP  PIC  S9(4).
           02  B301206F    PICTURE X.
           02  FILLER REDEFINES B301206F.
             03 B301206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301206I  PIC X(5).
           02  B301306L    COMP  PIC  S9(4).
           02  B301306F    PICTURE X.
           02  FILLER REDEFINES B301306F.
             03 B301306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B301306I  PIC X(5).
           02  B302606L    COMP  PIC  S9(4).
           02  B302606F    PICTURE X.
           02  FILLER REDEFINES B302606F.
             03 B302606A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302606I  PIC X(2).
           02  B302706L    COMP  PIC  S9(4).
           02  B302706F    PICTURE X.
           02  FILLER REDEFINES B302706F.
             03 B302706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B302706I  PIC X(1).
           02  IMPFS26L    COMP  PIC  S9(4).
           02  IMPFS26F    PICTURE X.
           02  FILLER REDEFINES IMPFS26F.
             03 IMPFS26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS26I  PIC X(79).
           02  IMERR26L    COMP  PIC  S9(4).
           02  IMERR26F    PICTURE X.
           02  FILLER REDEFINES IMERR26F.
             03 IMERR26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR26I  PIC X(79).
       01  IMB1M26O REDEFINES IMB1M26I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN25C    PICTURE X.
           02  IMTRN25P    PICTURE X.
           02  IMTRN25H    PICTURE X.
           02  IMTRN25V    PICTURE X.
           02  IMTRN25O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE27C    PICTURE X.
           02  BDATE27P    PICTURE X.
           02  BDATE27H    PICTURE X.
           02  BDATE27V    PICTURE X.
           02  BDATE27O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME27C    PICTURE X.
           02  BTIME27P    PICTURE X.
           02  BTIME27H    PICTURE X.
           02  BTIME27V    PICTURE X.
           02  BTIME27O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE27C    PICTURE X.
           02  IMPGE27P    PICTURE X.
           02  IMPGE27H    PICTURE X.
           02  IMPGE27V    PICTURE X.
           02  IMPGE27O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1027C    PICTURE X.
           02  CTL1027P    PICTURE X.
           02  CTL1027H    PICTURE X.
           02  CTL1027V    PICTURE X.
           02  CTL1027O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2027C    PICTURE X.
           02  CTL2027P    PICTURE X.
           02  CTL2027H    PICTURE X.
           02  CTL2027V    PICTURE X.
           02  CTL2027O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3027C    PICTURE X.
           02  CTL3027P    PICTURE X.
           02  CTL3027H    PICTURE X.
           02  CTL3027V    PICTURE X.
           02  CTL3027O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B302001C    PICTURE X.
           02  B302001P    PICTURE X.
           02  B302001H    PICTURE X.
           02  B302001V    PICTURE X.
           02  B302001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302101C    PICTURE X.
           02  B302101P    PICTURE X.
           02  B302101H    PICTURE X.
           02  B302101V    PICTURE X.
           02  B302101O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302201C    PICTURE X.
           02  B302201P    PICTURE X.
           02  B302201H    PICTURE X.
           02  B302201V    PICTURE X.
           02  B302201O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302301C    PICTURE X.
           02  B302301P    PICTURE X.
           02  B302301H    PICTURE X.
           02  B302301V    PICTURE X.
           02  B302301O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302401C    PICTURE X.
           02  B302401P    PICTURE X.
           02  B302401H    PICTURE X.
           02  B302401V    PICTURE X.
           02  B302401O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302501C    PICTURE X.
           02  B302501P    PICTURE X.
           02  B302501H    PICTURE X.
           02  B302501V    PICTURE X.
           02  B302501O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303101C    PICTURE X.
           02  B303101P    PICTURE X.
           02  B303101H    PICTURE X.
           02  B303101V    PICTURE X.
           02  B303101O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303201C    PICTURE X.
           02  B303201P    PICTURE X.
           02  B303201H    PICTURE X.
           02  B303201V    PICTURE X.
           02  B303201O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303301C    PICTURE X.
           02  B303301P    PICTURE X.
           02  B303301H    PICTURE X.
           02  B303301V    PICTURE X.
           02  B303301O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303401C    PICTURE X.
           02  B303401P    PICTURE X.
           02  B303401H    PICTURE X.
           02  B303401V    PICTURE X.
           02  B303401O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303501C    PICTURE X.
           02  B303501P    PICTURE X.
           02  B303501H    PICTURE X.
           02  B303501V    PICTURE X.
           02  B303501O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303601C    PICTURE X.
           02  B303601P    PICTURE X.
           02  B303601H    PICTURE X.
           02  B303601V    PICTURE X.
           02  B303601O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302901C    PICTURE X.
           02  B302901P    PICTURE X.
           02  B302901H    PICTURE X.
           02  B302901V    PICTURE X.
           02  B302901O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303001C    PICTURE X.
           02  B303001P    PICTURE X.
           02  B303001H    PICTURE X.
           02  B303001V    PICTURE X.
           02  B303001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302002C    PICTURE X.
           02  B302002P    PICTURE X.
           02  B302002H    PICTURE X.
           02  B302002V    PICTURE X.
           02  B302002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302102C    PICTURE X.
           02  B302102P    PICTURE X.
           02  B302102H    PICTURE X.
           02  B302102V    PICTURE X.
           02  B302102O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302202C    PICTURE X.
           02  B302202P    PICTURE X.
           02  B302202H    PICTURE X.
           02  B302202V    PICTURE X.
           02  B302202O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302302C    PICTURE X.
           02  B302302P    PICTURE X.
           02  B302302H    PICTURE X.
           02  B302302V    PICTURE X.
           02  B302302O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302402C    PICTURE X.
           02  B302402P    PICTURE X.
           02  B302402H    PICTURE X.
           02  B302402V    PICTURE X.
           02  B302402O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302502C    PICTURE X.
           02  B302502P    PICTURE X.
           02  B302502H    PICTURE X.
           02  B302502V    PICTURE X.
           02  B302502O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303102C    PICTURE X.
           02  B303102P    PICTURE X.
           02  B303102H    PICTURE X.
           02  B303102V    PICTURE X.
           02  B303102O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303202C    PICTURE X.
           02  B303202P    PICTURE X.
           02  B303202H    PICTURE X.
           02  B303202V    PICTURE X.
           02  B303202O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303302C    PICTURE X.
           02  B303302P    PICTURE X.
           02  B303302H    PICTURE X.
           02  B303302V    PICTURE X.
           02  B303302O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303402C    PICTURE X.
           02  B303402P    PICTURE X.
           02  B303402H    PICTURE X.
           02  B303402V    PICTURE X.
           02  B303402O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303502C    PICTURE X.
           02  B303502P    PICTURE X.
           02  B303502H    PICTURE X.
           02  B303502V    PICTURE X.
           02  B303502O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303602C    PICTURE X.
           02  B303602P    PICTURE X.
           02  B303602H    PICTURE X.
           02  B303602V    PICTURE X.
           02  B303602O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302902C    PICTURE X.
           02  B302902P    PICTURE X.
           02  B302902H    PICTURE X.
           02  B302902V    PICTURE X.
           02  B302902O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303002C    PICTURE X.
           02  B303002P    PICTURE X.
           02  B303002H    PICTURE X.
           02  B303002V    PICTURE X.
           02  B303002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302003C    PICTURE X.
           02  B302003P    PICTURE X.
           02  B302003H    PICTURE X.
           02  B302003V    PICTURE X.
           02  B302003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302103C    PICTURE X.
           02  B302103P    PICTURE X.
           02  B302103H    PICTURE X.
           02  B302103V    PICTURE X.
           02  B302103O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302203C    PICTURE X.
           02  B302203P    PICTURE X.
           02  B302203H    PICTURE X.
           02  B302203V    PICTURE X.
           02  B302203O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302303C    PICTURE X.
           02  B302303P    PICTURE X.
           02  B302303H    PICTURE X.
           02  B302303V    PICTURE X.
           02  B302303O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302403C    PICTURE X.
           02  B302403P    PICTURE X.
           02  B302403H    PICTURE X.
           02  B302403V    PICTURE X.
           02  B302403O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302503C    PICTURE X.
           02  B302503P    PICTURE X.
           02  B302503H    PICTURE X.
           02  B302503V    PICTURE X.
           02  B302503O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303103C    PICTURE X.
           02  B303103P    PICTURE X.
           02  B303103H    PICTURE X.
           02  B303103V    PICTURE X.
           02  B303103O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303203C    PICTURE X.
           02  B303203P    PICTURE X.
           02  B303203H    PICTURE X.
           02  B303203V    PICTURE X.
           02  B303203O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303303C    PICTURE X.
           02  B303303P    PICTURE X.
           02  B303303H    PICTURE X.
           02  B303303V    PICTURE X.
           02  B303303O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303403C    PICTURE X.
           02  B303403P    PICTURE X.
           02  B303403H    PICTURE X.
           02  B303403V    PICTURE X.
           02  B303403O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303503C    PICTURE X.
           02  B303503P    PICTURE X.
           02  B303503H    PICTURE X.
           02  B303503V    PICTURE X.
           02  B303503O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303603C    PICTURE X.
           02  B303603P    PICTURE X.
           02  B303603H    PICTURE X.
           02  B303603V    PICTURE X.
           02  B303603O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302903C    PICTURE X.
           02  B302903P    PICTURE X.
           02  B302903H    PICTURE X.
           02  B302903V    PICTURE X.
           02  B302903O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303003C    PICTURE X.
           02  B303003P    PICTURE X.
           02  B303003H    PICTURE X.
           02  B303003V    PICTURE X.
           02  B303003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302004C    PICTURE X.
           02  B302004P    PICTURE X.
           02  B302004H    PICTURE X.
           02  B302004V    PICTURE X.
           02  B302004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302104C    PICTURE X.
           02  B302104P    PICTURE X.
           02  B302104H    PICTURE X.
           02  B302104V    PICTURE X.
           02  B302104O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302204C    PICTURE X.
           02  B302204P    PICTURE X.
           02  B302204H    PICTURE X.
           02  B302204V    PICTURE X.
           02  B302204O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302304C    PICTURE X.
           02  B302304P    PICTURE X.
           02  B302304H    PICTURE X.
           02  B302304V    PICTURE X.
           02  B302304O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302404C    PICTURE X.
           02  B302404P    PICTURE X.
           02  B302404H    PICTURE X.
           02  B302404V    PICTURE X.
           02  B302404O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302504C    PICTURE X.
           02  B302504P    PICTURE X.
           02  B302504H    PICTURE X.
           02  B302504V    PICTURE X.
           02  B302504O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303104C    PICTURE X.
           02  B303104P    PICTURE X.
           02  B303104H    PICTURE X.
           02  B303104V    PICTURE X.
           02  B303104O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303204C    PICTURE X.
           02  B303204P    PICTURE X.
           02  B303204H    PICTURE X.
           02  B303204V    PICTURE X.
           02  B303204O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303304C    PICTURE X.
           02  B303304P    PICTURE X.
           02  B303304H    PICTURE X.
           02  B303304V    PICTURE X.
           02  B303304O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303404C    PICTURE X.
           02  B303404P    PICTURE X.
           02  B303404H    PICTURE X.
           02  B303404V    PICTURE X.
           02  B303404O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303504C    PICTURE X.
           02  B303504P    PICTURE X.
           02  B303504H    PICTURE X.
           02  B303504V    PICTURE X.
           02  B303504O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303604C    PICTURE X.
           02  B303604P    PICTURE X.
           02  B303604H    PICTURE X.
           02  B303604V    PICTURE X.
           02  B303604O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302904C    PICTURE X.
           02  B302904P    PICTURE X.
           02  B302904H    PICTURE X.
           02  B302904V    PICTURE X.
           02  B302904O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303004C    PICTURE X.
           02  B303004P    PICTURE X.
           02  B303004H    PICTURE X.
           02  B303004V    PICTURE X.
           02  B303004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302005C    PICTURE X.
           02  B302005P    PICTURE X.
           02  B302005H    PICTURE X.
           02  B302005V    PICTURE X.
           02  B302005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302105C    PICTURE X.
           02  B302105P    PICTURE X.
           02  B302105H    PICTURE X.
           02  B302105V    PICTURE X.
           02  B302105O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302205C    PICTURE X.
           02  B302205P    PICTURE X.
           02  B302205H    PICTURE X.
           02  B302205V    PICTURE X.
           02  B302205O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302305C    PICTURE X.
           02  B302305P    PICTURE X.
           02  B302305H    PICTURE X.
           02  B302305V    PICTURE X.
           02  B302305O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302405C    PICTURE X.
           02  B302405P    PICTURE X.
           02  B302405H    PICTURE X.
           02  B302405V    PICTURE X.
           02  B302405O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302505C    PICTURE X.
           02  B302505P    PICTURE X.
           02  B302505H    PICTURE X.
           02  B302505V    PICTURE X.
           02  B302505O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303105C    PICTURE X.
           02  B303105P    PICTURE X.
           02  B303105H    PICTURE X.
           02  B303105V    PICTURE X.
           02  B303105O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303205C    PICTURE X.
           02  B303205P    PICTURE X.
           02  B303205H    PICTURE X.
           02  B303205V    PICTURE X.
           02  B303205O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303305C    PICTURE X.
           02  B303305P    PICTURE X.
           02  B303305H    PICTURE X.
           02  B303305V    PICTURE X.
           02  B303305O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303405C    PICTURE X.
           02  B303405P    PICTURE X.
           02  B303405H    PICTURE X.
           02  B303405V    PICTURE X.
           02  B303405O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303505C    PICTURE X.
           02  B303505P    PICTURE X.
           02  B303505H    PICTURE X.
           02  B303505V    PICTURE X.
           02  B303505O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303605C    PICTURE X.
           02  B303605P    PICTURE X.
           02  B303605H    PICTURE X.
           02  B303605V    PICTURE X.
           02  B303605O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302905C    PICTURE X.
           02  B302905P    PICTURE X.
           02  B302905H    PICTURE X.
           02  B302905V    PICTURE X.
           02  B302905O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303005C    PICTURE X.
           02  B303005P    PICTURE X.
           02  B303005H    PICTURE X.
           02  B303005V    PICTURE X.
           02  B303005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302006C    PICTURE X.
           02  B302006P    PICTURE X.
           02  B302006H    PICTURE X.
           02  B302006V    PICTURE X.
           02  B302006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302106C    PICTURE X.
           02  B302106P    PICTURE X.
           02  B302106H    PICTURE X.
           02  B302106V    PICTURE X.
           02  B302106O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302206C    PICTURE X.
           02  B302206P    PICTURE X.
           02  B302206H    PICTURE X.
           02  B302206V    PICTURE X.
           02  B302206O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302306C    PICTURE X.
           02  B302306P    PICTURE X.
           02  B302306H    PICTURE X.
           02  B302306V    PICTURE X.
           02  B302306O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302406C    PICTURE X.
           02  B302406P    PICTURE X.
           02  B302406H    PICTURE X.
           02  B302406V    PICTURE X.
           02  B302406O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302506C    PICTURE X.
           02  B302506P    PICTURE X.
           02  B302506H    PICTURE X.
           02  B302506V    PICTURE X.
           02  B302506O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303106C    PICTURE X.
           02  B303106P    PICTURE X.
           02  B303106H    PICTURE X.
           02  B303106V    PICTURE X.
           02  B303106O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303206C    PICTURE X.
           02  B303206P    PICTURE X.
           02  B303206H    PICTURE X.
           02  B303206V    PICTURE X.
           02  B303206O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303306C    PICTURE X.
           02  B303306P    PICTURE X.
           02  B303306H    PICTURE X.
           02  B303306V    PICTURE X.
           02  B303306O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303406C    PICTURE X.
           02  B303406P    PICTURE X.
           02  B303406H    PICTURE X.
           02  B303406V    PICTURE X.
           02  B303406O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303506C    PICTURE X.
           02  B303506P    PICTURE X.
           02  B303506H    PICTURE X.
           02  B303506V    PICTURE X.
           02  B303506O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303606C    PICTURE X.
           02  B303606P    PICTURE X.
           02  B303606H    PICTURE X.
           02  B303606V    PICTURE X.
           02  B303606O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B302906C    PICTURE X.
           02  B302906P    PICTURE X.
           02  B302906H    PICTURE X.
           02  B302906V    PICTURE X.
           02  B302906O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B303006C    PICTURE X.
           02  B303006P    PICTURE X.
           02  B303006H    PICTURE X.
           02  B303006V    PICTURE X.
           02  B303006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301201C    PICTURE X.
           02  B301201P    PICTURE X.
           02  B301201H    PICTURE X.
           02  B301201V    PICTURE X.
           02  B301201O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B301301C    PICTURE X.
           02  B301301P    PICTURE X.
           02  B301301H    PICTURE X.
           02  B301301V    PICTURE X.
           02  B301301O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B302601C    PICTURE X.
           02  B302601P    PICTURE X.
           02  B302601H    PICTURE X.
           02  B302601V    PICTURE X.
           02  B302601O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B302701C    PICTURE X.
           02  B302701P    PICTURE X.
           02  B302701H    PICTURE X.
           02  B302701V    PICTURE X.
           02  B302701O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301202C    PICTURE X.
           02  B301202P    PICTURE X.
           02  B301202H    PICTURE X.
           02  B301202V    PICTURE X.
           02  B301202O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B301302C    PICTURE X.
           02  B301302P    PICTURE X.
           02  B301302H    PICTURE X.
           02  B301302V    PICTURE X.
           02  B301302O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B302602C    PICTURE X.
           02  B302602P    PICTURE X.
           02  B302602H    PICTURE X.
           02  B302602V    PICTURE X.
           02  B302602O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B302702C    PICTURE X.
           02  B302702P    PICTURE X.
           02  B302702H    PICTURE X.
           02  B302702V    PICTURE X.
           02  B302702O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301203C    PICTURE X.
           02  B301203P    PICTURE X.
           02  B301203H    PICTURE X.
           02  B301203V    PICTURE X.
           02  B301203O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B301303C    PICTURE X.
           02  B301303P    PICTURE X.
           02  B301303H    PICTURE X.
           02  B301303V    PICTURE X.
           02  B301303O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B302603C    PICTURE X.
           02  B302603P    PICTURE X.
           02  B302603H    PICTURE X.
           02  B302603V    PICTURE X.
           02  B302603O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B302703C    PICTURE X.
           02  B302703P    PICTURE X.
           02  B302703H    PICTURE X.
           02  B302703V    PICTURE X.
           02  B302703O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301204C    PICTURE X.
           02  B301204P    PICTURE X.
           02  B301204H    PICTURE X.
           02  B301204V    PICTURE X.
           02  B301204O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B301304C    PICTURE X.
           02  B301304P    PICTURE X.
           02  B301304H    PICTURE X.
           02  B301304V    PICTURE X.
           02  B301304O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B302604C    PICTURE X.
           02  B302604P    PICTURE X.
           02  B302604H    PICTURE X.
           02  B302604V    PICTURE X.
           02  B302604O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B302704C    PICTURE X.
           02  B302704P    PICTURE X.
           02  B302704H    PICTURE X.
           02  B302704V    PICTURE X.
           02  B302704O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301205C    PICTURE X.
           02  B301205P    PICTURE X.
           02  B301205H    PICTURE X.
           02  B301205V    PICTURE X.
           02  B301205O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B301305C    PICTURE X.
           02  B301305P    PICTURE X.
           02  B301305H    PICTURE X.
           02  B301305V    PICTURE X.
           02  B301305O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B302605C    PICTURE X.
           02  B302605P    PICTURE X.
           02  B302605H    PICTURE X.
           02  B302605V    PICTURE X.
           02  B302605O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B302705C    PICTURE X.
           02  B302705P    PICTURE X.
           02  B302705H    PICTURE X.
           02  B302705V    PICTURE X.
           02  B302705O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B301206C    PICTURE X.
           02  B301206P    PICTURE X.
           02  B301206H    PICTURE X.
           02  B301206V    PICTURE X.
           02  B301206O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B301306C    PICTURE X.
           02  B301306P    PICTURE X.
           02  B301306H    PICTURE X.
           02  B301306V    PICTURE X.
           02  B301306O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  B302606C    PICTURE X.
           02  B302606P    PICTURE X.
           02  B302606H    PICTURE X.
           02  B302606V    PICTURE X.
           02  B302606O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B302706C    PICTURE X.
           02  B302706P    PICTURE X.
           02  B302706H    PICTURE X.
           02  B302706V    PICTURE X.
           02  B302706O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS26C    PICTURE X.
           02  IMPFS26P    PICTURE X.
           02  IMPFS26H    PICTURE X.
           02  IMPFS26V    PICTURE X.
           02  IMPFS26O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR26C    PICTURE X.
           02  IMERR26P    PICTURE X.
           02  IMERR26H    PICTURE X.
           02  IMERR26V    PICTURE X.
           02  IMERR26O  PIC X(79).
       01  IMB1M27I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN26L    COMP  PIC  S9(4).
           02  IMTRN26F    PICTURE X.
           02  FILLER REDEFINES IMTRN26F.
             03 IMTRN26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN26I  PIC X(4).
           02  BDATE28L    COMP  PIC  S9(4).
           02  BDATE28F    PICTURE X.
           02  FILLER REDEFINES BDATE28F.
             03 BDATE28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE28I  PIC X(8).
           02  BTIME28L    COMP  PIC  S9(4).
           02  BTIME28F    PICTURE X.
           02  FILLER REDEFINES BTIME28F.
             03 BTIME28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME28I  PIC X(8).
           02  IMPGE28L    COMP  PIC  S9(4).
           02  IMPGE28F    PICTURE X.
           02  FILLER REDEFINES IMPGE28F.
             03 IMPGE28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE28I  PIC X(2).
           02  CTL1028L    COMP  PIC  S9(4).
           02  CTL1028F    PICTURE X.
           02  FILLER REDEFINES CTL1028F.
             03 CTL1028A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1028I  PIC X(2).
           02  CTL2028L    COMP  PIC  S9(4).
           02  CTL2028F    PICTURE X.
           02  FILLER REDEFINES CTL2028F.
             03 CTL2028A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2028I  PIC X(3).
           02  CTL3028L    COMP  PIC  S9(4).
           02  CTL3028F    PICTURE X.
           02  FILLER REDEFINES CTL3028F.
             03 CTL3028A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3028I  PIC X(3).
           02  B6013D1L    COMP  PIC  S9(4).
           02  B6013D1F    PICTURE X.
           02  FILLER REDEFINES B6013D1F.
             03 B6013D1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B6013D1I  PIC X(1).
           02  E6013E1L    COMP  PIC  S9(4).
           02  E6013E1F    PICTURE X.
           02  FILLER REDEFINES E6013E1F.
             03 E6013E1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E6013E1I  PIC X(9).
           02  B601201L    COMP  PIC  S9(4).
           02  B601201F    PICTURE X.
           02  FILLER REDEFINES B601201F.
             03 B601201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601201I  PIC X(4).
           02  B601501L    COMP  PIC  S9(4).
           02  B601501F    PICTURE X.
           02  FILLER REDEFINES B601501F.
             03 B601501A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601501I  PIC X(1).
           02  B601001L    COMP  PIC  S9(4).
           02  B601001F    PICTURE X.
           02  FILLER REDEFINES B601001F.
             03 B601001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601001I  PIC X(1).
           02  B601801L    COMP  PIC  S9(4).
           02  B601801F    PICTURE X.
           02  FILLER REDEFINES B601801F.
             03 B601801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601801I  PIC X(6).
           02  B601101L    COMP  PIC  S9(4).
           02  B601101F    PICTURE X.
           02  FILLER REDEFINES B601101F.
             03 B601101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601101I  PIC X(1).
           02  E601101L    COMP  PIC  S9(4).
           02  E601101F    PICTURE X.
           02  FILLER REDEFINES E601101F.
             03 E601101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601101I  PIC X(15).
           02  B6013D2L    COMP  PIC  S9(4).
           02  B6013D2F    PICTURE X.
           02  FILLER REDEFINES B6013D2F.
             03 B6013D2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B6013D2I  PIC X(1).
           02  E6013E2L    COMP  PIC  S9(4).
           02  E6013E2F    PICTURE X.
           02  FILLER REDEFINES E6013E2F.
             03 E6013E2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E6013E2I  PIC X(9).
           02  B601202L    COMP  PIC  S9(4).
           02  B601202F    PICTURE X.
           02  FILLER REDEFINES B601202F.
             03 B601202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601202I  PIC X(4).
           02  B601502L    COMP  PIC  S9(4).
           02  B601502F    PICTURE X.
           02  FILLER REDEFINES B601502F.
             03 B601502A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601502I  PIC X(1).
           02  B601002L    COMP  PIC  S9(4).
           02  B601002F    PICTURE X.
           02  FILLER REDEFINES B601002F.
             03 B601002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601002I  PIC X(1).
           02  B601802L    COMP  PIC  S9(4).
           02  B601802F    PICTURE X.
           02  FILLER REDEFINES B601802F.
             03 B601802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601802I  PIC X(6).
           02  B601102L    COMP  PIC  S9(4).
           02  B601102F    PICTURE X.
           02  FILLER REDEFINES B601102F.
             03 B601102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601102I  PIC X(1).
           02  E601102L    COMP  PIC  S9(4).
           02  E601102F    PICTURE X.
           02  FILLER REDEFINES E601102F.
             03 E601102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601102I  PIC X(15).
           02  B6016D3L    COMP  PIC  S9(4).
           02  B6016D3F    PICTURE X.
           02  FILLER REDEFINES B6016D3F.
             03 B6016D3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B6016D3I  PIC X(1).
           02  E6013E3L    COMP  PIC  S9(4).
           02  E6013E3F    PICTURE X.
           02  FILLER REDEFINES E6013E3F.
             03 E6013E3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E6013E3I  PIC X(9).
           02  B601203L    COMP  PIC  S9(4).
           02  B601203F    PICTURE X.
           02  FILLER REDEFINES B601203F.
             03 B601203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601203I  PIC X(4).
           02  B601503L    COMP  PIC  S9(4).
           02  B601503F    PICTURE X.
           02  FILLER REDEFINES B601503F.
             03 B601503A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601503I  PIC X(1).
           02  B601003L    COMP  PIC  S9(4).
           02  B601003F    PICTURE X.
           02  FILLER REDEFINES B601003F.
             03 B601003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601003I  PIC X(1).
           02  B601803L    COMP  PIC  S9(4).
           02  B601803F    PICTURE X.
           02  FILLER REDEFINES B601803F.
             03 B601803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601803I  PIC X(6).
           02  B601103L    COMP  PIC  S9(4).
           02  B601103F    PICTURE X.
           02  FILLER REDEFINES B601103F.
             03 B601103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601103I  PIC X(1).
           02  E601103L    COMP  PIC  S9(4).
           02  E601103F    PICTURE X.
           02  FILLER REDEFINES E601103F.
             03 E601103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601103I  PIC X(15).
           02  B6013D4L    COMP  PIC  S9(4).
           02  B6013D4F    PICTURE X.
           02  FILLER REDEFINES B6013D4F.
             03 B6013D4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B6013D4I  PIC X(1).
           02  E6013E4L    COMP  PIC  S9(4).
           02  E6013E4F    PICTURE X.
           02  FILLER REDEFINES E6013E4F.
             03 E6013E4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E6013E4I  PIC X(9).
           02  B601204L    COMP  PIC  S9(4).
           02  B601204F    PICTURE X.
           02  FILLER REDEFINES B601204F.
             03 B601204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601204I  PIC X(4).
           02  B601504L    COMP  PIC  S9(4).
           02  B601504F    PICTURE X.
           02  FILLER REDEFINES B601504F.
             03 B601504A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601504I  PIC X(1).
           02  B601004L    COMP  PIC  S9(4).
           02  B601004F    PICTURE X.
           02  FILLER REDEFINES B601004F.
             03 B601004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601004I  PIC X(1).
           02  B601804L    COMP  PIC  S9(4).
           02  B601804F    PICTURE X.
           02  FILLER REDEFINES B601804F.
             03 B601804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601804I  PIC X(6).
           02  B601104L    COMP  PIC  S9(4).
           02  B601104F    PICTURE X.
           02  FILLER REDEFINES B601104F.
             03 B601104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601104I  PIC X(1).
           02  E601104L    COMP  PIC  S9(4).
           02  E601104F    PICTURE X.
           02  FILLER REDEFINES E601104F.
             03 E601104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601104I  PIC X(15).
           02  B6013D5L    COMP  PIC  S9(4).
           02  B6013D5F    PICTURE X.
           02  FILLER REDEFINES B6013D5F.
             03 B6013D5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B6013D5I  PIC X(1).
           02  E6013E5L    COMP  PIC  S9(4).
           02  E6013E5F    PICTURE X.
           02  FILLER REDEFINES E6013E5F.
             03 E6013E5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E6013E5I  PIC X(9).
           02  B601205L    COMP  PIC  S9(4).
           02  B601205F    PICTURE X.
           02  FILLER REDEFINES B601205F.
             03 B601205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601205I  PIC X(4).
           02  B601505L    COMP  PIC  S9(4).
           02  B601505F    PICTURE X.
           02  FILLER REDEFINES B601505F.
             03 B601505A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601505I  PIC X(1).
           02  B601005L    COMP  PIC  S9(4).
           02  B601005F    PICTURE X.
           02  FILLER REDEFINES B601005F.
             03 B601005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601005I  PIC X(1).
           02  B601805L    COMP  PIC  S9(4).
           02  B601805F    PICTURE X.
           02  FILLER REDEFINES B601805F.
             03 B601805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601805I  PIC X(6).
           02  B601105L    COMP  PIC  S9(4).
           02  B601105F    PICTURE X.
           02  FILLER REDEFINES B601105F.
             03 B601105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601105I  PIC X(1).
           02  E601105L    COMP  PIC  S9(4).
           02  E601105F    PICTURE X.
           02  FILLER REDEFINES E601105F.
             03 E601105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601105I  PIC X(15).
           02  B6013D6L    COMP  PIC  S9(4).
           02  B6013D6F    PICTURE X.
           02  FILLER REDEFINES B6013D6F.
             03 B6013D6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B6013D6I  PIC X(1).
           02  E6013E6L    COMP  PIC  S9(4).
           02  E6013E6F    PICTURE X.
           02  FILLER REDEFINES E6013E6F.
             03 E6013E6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E6013E6I  PIC X(9).
           02  B601206L    COMP  PIC  S9(4).
           02  B601206F    PICTURE X.
           02  FILLER REDEFINES B601206F.
             03 B601206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601206I  PIC X(4).
           02  B601506L    COMP  PIC  S9(4).
           02  B601506F    PICTURE X.
           02  FILLER REDEFINES B601506F.
             03 B601506A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601506I  PIC X(1).
           02  B601006L    COMP  PIC  S9(4).
           02  B601006F    PICTURE X.
           02  FILLER REDEFINES B601006F.
             03 B601006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601006I  PIC X(1).
           02  B601806L    COMP  PIC  S9(4).
           02  B601806F    PICTURE X.
           02  FILLER REDEFINES B601806F.
             03 B601806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601806I  PIC X(6).
           02  B601106L    COMP  PIC  S9(4).
           02  B601106F    PICTURE X.
           02  FILLER REDEFINES B601106F.
             03 B601106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B601106I  PIC X(1).
           02  E601106L    COMP  PIC  S9(4).
           02  E601106F    PICTURE X.
           02  FILLER REDEFINES E601106F.
             03 E601106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E601106I  PIC X(15).
           02  IMPFS27L    COMP  PIC  S9(4).
           02  IMPFS27F    PICTURE X.
           02  FILLER REDEFINES IMPFS27F.
             03 IMPFS27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS27I  PIC X(79).
           02  IMERR27L    COMP  PIC  S9(4).
           02  IMERR27F    PICTURE X.
           02  FILLER REDEFINES IMERR27F.
             03 IMERR27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR27I  PIC X(79).
       01  IMB1M27O REDEFINES IMB1M27I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN26C    PICTURE X.
           02  IMTRN26P    PICTURE X.
           02  IMTRN26H    PICTURE X.
           02  IMTRN26V    PICTURE X.
           02  IMTRN26O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE28C    PICTURE X.
           02  BDATE28P    PICTURE X.
           02  BDATE28H    PICTURE X.
           02  BDATE28V    PICTURE X.
           02  BDATE28O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME28C    PICTURE X.
           02  BTIME28P    PICTURE X.
           02  BTIME28H    PICTURE X.
           02  BTIME28V    PICTURE X.
           02  BTIME28O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE28C    PICTURE X.
           02  IMPGE28P    PICTURE X.
           02  IMPGE28H    PICTURE X.
           02  IMPGE28V    PICTURE X.
           02  IMPGE28O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1028C    PICTURE X.
           02  CTL1028P    PICTURE X.
           02  CTL1028H    PICTURE X.
           02  CTL1028V    PICTURE X.
           02  CTL1028O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2028C    PICTURE X.
           02  CTL2028P    PICTURE X.
           02  CTL2028H    PICTURE X.
           02  CTL2028V    PICTURE X.
           02  CTL2028O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3028C    PICTURE X.
           02  CTL3028P    PICTURE X.
           02  CTL3028H    PICTURE X.
           02  CTL3028V    PICTURE X.
           02  CTL3028O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B6013D1C    PICTURE X.
           02  B6013D1P    PICTURE X.
           02  B6013D1H    PICTURE X.
           02  B6013D1V    PICTURE X.
           02  B6013D1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E6013E1C    PICTURE X.
           02  E6013E1P    PICTURE X.
           02  E6013E1H    PICTURE X.
           02  E6013E1V    PICTURE X.
           02  E6013E1O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601201C    PICTURE X.
           02  B601201P    PICTURE X.
           02  B601201H    PICTURE X.
           02  B601201V    PICTURE X.
           02  B601201O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B601501C    PICTURE X.
           02  B601501P    PICTURE X.
           02  B601501H    PICTURE X.
           02  B601501V    PICTURE X.
           02  B601501O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601001C    PICTURE X.
           02  B601001P    PICTURE X.
           02  B601001H    PICTURE X.
           02  B601001V    PICTURE X.
           02  B601001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601801C    PICTURE X.
           02  B601801P    PICTURE X.
           02  B601801H    PICTURE X.
           02  B601801V    PICTURE X.
           02  B601801O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B601101C    PICTURE X.
           02  B601101P    PICTURE X.
           02  B601101H    PICTURE X.
           02  B601101V    PICTURE X.
           02  B601101O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601101C    PICTURE X.
           02  E601101P    PICTURE X.
           02  E601101H    PICTURE X.
           02  E601101V    PICTURE X.
           02  E601101O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  B6013D2C    PICTURE X.
           02  B6013D2P    PICTURE X.
           02  B6013D2H    PICTURE X.
           02  B6013D2V    PICTURE X.
           02  B6013D2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E6013E2C    PICTURE X.
           02  E6013E2P    PICTURE X.
           02  E6013E2H    PICTURE X.
           02  E6013E2V    PICTURE X.
           02  E6013E2O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601202C    PICTURE X.
           02  B601202P    PICTURE X.
           02  B601202H    PICTURE X.
           02  B601202V    PICTURE X.
           02  B601202O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B601502C    PICTURE X.
           02  B601502P    PICTURE X.
           02  B601502H    PICTURE X.
           02  B601502V    PICTURE X.
           02  B601502O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601002C    PICTURE X.
           02  B601002P    PICTURE X.
           02  B601002H    PICTURE X.
           02  B601002V    PICTURE X.
           02  B601002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601802C    PICTURE X.
           02  B601802P    PICTURE X.
           02  B601802H    PICTURE X.
           02  B601802V    PICTURE X.
           02  B601802O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B601102C    PICTURE X.
           02  B601102P    PICTURE X.
           02  B601102H    PICTURE X.
           02  B601102V    PICTURE X.
           02  B601102O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601102C    PICTURE X.
           02  E601102P    PICTURE X.
           02  E601102H    PICTURE X.
           02  E601102V    PICTURE X.
           02  E601102O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  B6016D3C    PICTURE X.
           02  B6016D3P    PICTURE X.
           02  B6016D3H    PICTURE X.
           02  B6016D3V    PICTURE X.
           02  B6016D3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E6013E3C    PICTURE X.
           02  E6013E3P    PICTURE X.
           02  E6013E3H    PICTURE X.
           02  E6013E3V    PICTURE X.
           02  E6013E3O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601203C    PICTURE X.
           02  B601203P    PICTURE X.
           02  B601203H    PICTURE X.
           02  B601203V    PICTURE X.
           02  B601203O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B601503C    PICTURE X.
           02  B601503P    PICTURE X.
           02  B601503H    PICTURE X.
           02  B601503V    PICTURE X.
           02  B601503O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601003C    PICTURE X.
           02  B601003P    PICTURE X.
           02  B601003H    PICTURE X.
           02  B601003V    PICTURE X.
           02  B601003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601803C    PICTURE X.
           02  B601803P    PICTURE X.
           02  B601803H    PICTURE X.
           02  B601803V    PICTURE X.
           02  B601803O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B601103C    PICTURE X.
           02  B601103P    PICTURE X.
           02  B601103H    PICTURE X.
           02  B601103V    PICTURE X.
           02  B601103O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601103C    PICTURE X.
           02  E601103P    PICTURE X.
           02  E601103H    PICTURE X.
           02  E601103V    PICTURE X.
           02  E601103O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  B6013D4C    PICTURE X.
           02  B6013D4P    PICTURE X.
           02  B6013D4H    PICTURE X.
           02  B6013D4V    PICTURE X.
           02  B6013D4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E6013E4C    PICTURE X.
           02  E6013E4P    PICTURE X.
           02  E6013E4H    PICTURE X.
           02  E6013E4V    PICTURE X.
           02  E6013E4O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601204C    PICTURE X.
           02  B601204P    PICTURE X.
           02  B601204H    PICTURE X.
           02  B601204V    PICTURE X.
           02  B601204O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B601504C    PICTURE X.
           02  B601504P    PICTURE X.
           02  B601504H    PICTURE X.
           02  B601504V    PICTURE X.
           02  B601504O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601004C    PICTURE X.
           02  B601004P    PICTURE X.
           02  B601004H    PICTURE X.
           02  B601004V    PICTURE X.
           02  B601004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601804C    PICTURE X.
           02  B601804P    PICTURE X.
           02  B601804H    PICTURE X.
           02  B601804V    PICTURE X.
           02  B601804O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B601104C    PICTURE X.
           02  B601104P    PICTURE X.
           02  B601104H    PICTURE X.
           02  B601104V    PICTURE X.
           02  B601104O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601104C    PICTURE X.
           02  E601104P    PICTURE X.
           02  E601104H    PICTURE X.
           02  E601104V    PICTURE X.
           02  E601104O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  B6013D5C    PICTURE X.
           02  B6013D5P    PICTURE X.
           02  B6013D5H    PICTURE X.
           02  B6013D5V    PICTURE X.
           02  B6013D5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E6013E5C    PICTURE X.
           02  E6013E5P    PICTURE X.
           02  E6013E5H    PICTURE X.
           02  E6013E5V    PICTURE X.
           02  E6013E5O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601205C    PICTURE X.
           02  B601205P    PICTURE X.
           02  B601205H    PICTURE X.
           02  B601205V    PICTURE X.
           02  B601205O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B601505C    PICTURE X.
           02  B601505P    PICTURE X.
           02  B601505H    PICTURE X.
           02  B601505V    PICTURE X.
           02  B601505O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601005C    PICTURE X.
           02  B601005P    PICTURE X.
           02  B601005H    PICTURE X.
           02  B601005V    PICTURE X.
           02  B601005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601805C    PICTURE X.
           02  B601805P    PICTURE X.
           02  B601805H    PICTURE X.
           02  B601805V    PICTURE X.
           02  B601805O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B601105C    PICTURE X.
           02  B601105P    PICTURE X.
           02  B601105H    PICTURE X.
           02  B601105V    PICTURE X.
           02  B601105O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601105C    PICTURE X.
           02  E601105P    PICTURE X.
           02  E601105H    PICTURE X.
           02  E601105V    PICTURE X.
           02  E601105O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  B6013D6C    PICTURE X.
           02  B6013D6P    PICTURE X.
           02  B6013D6H    PICTURE X.
           02  B6013D6V    PICTURE X.
           02  B6013D6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E6013E6C    PICTURE X.
           02  E6013E6P    PICTURE X.
           02  E6013E6H    PICTURE X.
           02  E6013E6V    PICTURE X.
           02  E6013E6O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  B601206C    PICTURE X.
           02  B601206P    PICTURE X.
           02  B601206H    PICTURE X.
           02  B601206V    PICTURE X.
           02  B601206O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  B601506C    PICTURE X.
           02  B601506P    PICTURE X.
           02  B601506H    PICTURE X.
           02  B601506V    PICTURE X.
           02  B601506O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601006C    PICTURE X.
           02  B601006P    PICTURE X.
           02  B601006H    PICTURE X.
           02  B601006V    PICTURE X.
           02  B601006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B601806C    PICTURE X.
           02  B601806P    PICTURE X.
           02  B601806H    PICTURE X.
           02  B601806V    PICTURE X.
           02  B601806O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  B601106C    PICTURE X.
           02  B601106P    PICTURE X.
           02  B601106H    PICTURE X.
           02  B601106V    PICTURE X.
           02  B601106O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E601106C    PICTURE X.
           02  E601106P    PICTURE X.
           02  E601106H    PICTURE X.
           02  E601106V    PICTURE X.
           02  E601106O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  IMPFS27C    PICTURE X.
           02  IMPFS27P    PICTURE X.
           02  IMPFS27H    PICTURE X.
           02  IMPFS27V    PICTURE X.
           02  IMPFS27O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR27C    PICTURE X.
           02  IMERR27P    PICTURE X.
           02  IMERR27H    PICTURE X.
           02  IMERR27V    PICTURE X.
           02  IMERR27O  PIC X(79).
       01  IMB1M28I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN27L    COMP  PIC  S9(4).
           02  IMTRN27F    PICTURE X.
           02  FILLER REDEFINES IMTRN27F.
             03 IMTRN27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN27I  PIC X(4).
           02  BDATE29L    COMP  PIC  S9(4).
           02  BDATE29F    PICTURE X.
           02  FILLER REDEFINES BDATE29F.
             03 BDATE29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE29I  PIC X(8).
           02  BTIME29L    COMP  PIC  S9(4).
           02  BTIME29F    PICTURE X.
           02  FILLER REDEFINES BTIME29F.
             03 BTIME29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME29I  PIC X(8).
           02  IMPGE29L    COMP  PIC  S9(4).
           02  IMPGE29F    PICTURE X.
           02  FILLER REDEFINES IMPGE29F.
             03 IMPGE29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE29I  PIC X(2).
           02  CTL1029L    COMP  PIC  S9(4).
           02  CTL1029F    PICTURE X.
           02  FILLER REDEFINES CTL1029F.
             03 CTL1029A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1029I  PIC X(2).
           02  CTL2029L    COMP  PIC  S9(4).
           02  CTL2029F    PICTURE X.
           02  FILLER REDEFINES CTL2029F.
             03 CTL2029A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2029I  PIC X(3).
           02  CTL3029L    COMP  PIC  S9(4).
           02  CTL3029F    PICTURE X.
           02  FILLER REDEFINES CTL3029F.
             03 CTL3029A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3029I  PIC X(3).
           02  IMB3019L    COMP  PIC  S9(4).
           02  IMB3019F    PICTURE X.
           02  FILLER REDEFINES IMB3019F.
             03 IMB3019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB3019I  PIC X(1).
           02  IMB3016L    COMP  PIC  S9(4).
           02  IMB3016F    PICTURE X.
           02  FILLER REDEFINES IMB3016F.
             03 IMB3016A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB3016I  PIC X(1).
           02  IMB3018L    COMP  PIC  S9(4).
           02  IMB3018F    PICTURE X.
           02  FILLER REDEFINES IMB3018F.
             03 IMB3018A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB3018I  PIC X(1).
           02  IMB3017L    COMP  PIC  S9(4).
           02  IMB3017F    PICTURE X.
           02  FILLER REDEFINES IMB3017F.
             03 IMB3017A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB3017I  PIC X(1).
           02  IMB1231L    COMP  PIC  S9(4).
           02  IMB1231F    PICTURE X.
           02  FILLER REDEFINES IMB1231F.
             03 IMB1231A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1231I  PIC X(1).
           02  IMB3037L    COMP  PIC  S9(4).
           02  IMB3037F    PICTURE X.
           02  FILLER REDEFINES IMB3037F.
             03 IMB3037A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB3037I  PIC X(1).
           02  IMB3038L    COMP  PIC  S9(4).
           02  IMB3038F    PICTURE X.
           02  FILLER REDEFINES IMB3038F.
             03 IMB3038A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB3038I  PIC X(3).
           02  IMB3039L    COMP  PIC  S9(4).
           02  IMB3039F    PICTURE X.
           02  FILLER REDEFINES IMB3039F.
             03 IMB3039A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB3039I  PIC X(13).
           02  IMB2031L    COMP  PIC  S9(4).
           02  IMB2031F    PICTURE X.
           02  FILLER REDEFINES IMB2031F.
             03 IMB2031A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2031I  PIC X(1).
           02  IMB1093L    COMP  PIC  S9(4).
           02  IMB1093F    PICTURE X.
           02  FILLER REDEFINES IMB1093F.
             03 IMB1093A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1093I  PIC X(1).
           02  IMB6019L    COMP  PIC  S9(4).
           02  IMB6019F    PICTURE X.
           02  FILLER REDEFINES IMB6019F.
             03 IMB6019A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB6019I  PIC X(1).
           02  IMB3056L    COMP  PIC  S9(4).
           02  IMB3056F    PICTURE X.
           02  FILLER REDEFINES IMB3056F.
             03 IMB3056A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB3056I  PIC X(1).
           02  B201701L    COMP  PIC  S9(4).
           02  B201701F    PICTURE X.
           02  FILLER REDEFINES B201701F.
             03 B201701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201701I  PIC X(1).
           02  E201701L    COMP  PIC  S9(4).
           02  E201701F    PICTURE X.
           02  FILLER REDEFINES E201701F.
             03 E201701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E201701I  PIC X(16).
           02  B202701L    COMP  PIC  S9(4).
           02  B202701F    PICTURE X.
           02  FILLER REDEFINES B202701F.
             03 B202701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202701I  PIC X(1).
           02  E202701L    COMP  PIC  S9(4).
           02  E202701F    PICTURE X.
           02  FILLER REDEFINES E202701F.
             03 E202701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202701I  PIC X(13).
           02  B202801L    COMP  PIC  S9(4).
           02  B202801F    PICTURE X.
           02  FILLER REDEFINES B202801F.
             03 B202801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202801I  PIC X(2).
           02  E202801L    COMP  PIC  S9(4).
           02  E202801F    PICTURE X.
           02  FILLER REDEFINES E202801F.
             03 E202801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202801I  PIC X(8).
           02  B201702L    COMP  PIC  S9(4).
           02  B201702F    PICTURE X.
           02  FILLER REDEFINES B201702F.
             03 B201702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201702I  PIC X(1).
           02  E201702L    COMP  PIC  S9(4).
           02  E201702F    PICTURE X.
           02  FILLER REDEFINES E201702F.
             03 E201702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E201702I  PIC X(16).
           02  B202702L    COMP  PIC  S9(4).
           02  B202702F    PICTURE X.
           02  FILLER REDEFINES B202702F.
             03 B202702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202702I  PIC X(1).
           02  E202702L    COMP  PIC  S9(4).
           02  E202702F    PICTURE X.
           02  FILLER REDEFINES E202702F.
             03 E202702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202702I  PIC X(13).
           02  B202802L    COMP  PIC  S9(4).
           02  B202802F    PICTURE X.
           02  FILLER REDEFINES B202802F.
             03 B202802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202802I  PIC X(2).
           02  E202802L    COMP  PIC  S9(4).
           02  E202802F    PICTURE X.
           02  FILLER REDEFINES E202802F.
             03 E202802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202802I  PIC X(8).
           02  B201703L    COMP  PIC  S9(4).
           02  B201703F    PICTURE X.
           02  FILLER REDEFINES B201703F.
             03 B201703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201703I  PIC X(1).
           02  E201703L    COMP  PIC  S9(4).
           02  E201703F    PICTURE X.
           02  FILLER REDEFINES E201703F.
             03 E201703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E201703I  PIC X(16).
           02  B202703L    COMP  PIC  S9(4).
           02  B202703F    PICTURE X.
           02  FILLER REDEFINES B202703F.
             03 B202703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202703I  PIC X(1).
           02  E202703L    COMP  PIC  S9(4).
           02  E202703F    PICTURE X.
           02  FILLER REDEFINES E202703F.
             03 E202703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202703I  PIC X(13).
           02  B202803L    COMP  PIC  S9(4).
           02  B202803F    PICTURE X.
           02  FILLER REDEFINES B202803F.
             03 B202803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202803I  PIC X(2).
           02  E202803L    COMP  PIC  S9(4).
           02  E202803F    PICTURE X.
           02  FILLER REDEFINES E202803F.
             03 E202803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202803I  PIC X(8).
           02  B201704L    COMP  PIC  S9(4).
           02  B201704F    PICTURE X.
           02  FILLER REDEFINES B201704F.
             03 B201704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201704I  PIC X(1).
           02  E201704L    COMP  PIC  S9(4).
           02  E201704F    PICTURE X.
           02  FILLER REDEFINES E201704F.
             03 E201704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E201704I  PIC X(16).
           02  B202704L    COMP  PIC  S9(4).
           02  B202704F    PICTURE X.
           02  FILLER REDEFINES B202704F.
             03 B202704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202704I  PIC X(1).
           02  E202704L    COMP  PIC  S9(4).
           02  E202704F    PICTURE X.
           02  FILLER REDEFINES E202704F.
             03 E202704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202704I  PIC X(13).
           02  B202804L    COMP  PIC  S9(4).
           02  B202804F    PICTURE X.
           02  FILLER REDEFINES B202804F.
             03 B202804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202804I  PIC X(2).
           02  IMB2028L    COMP  PIC  S9(4).
           02  IMB2028F    PICTURE X.
           02  FILLER REDEFINES IMB2028F.
             03 IMB2028A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2028I  PIC X(8).
           02  B201705L    COMP  PIC  S9(4).
           02  B201705F    PICTURE X.
           02  FILLER REDEFINES B201705F.
             03 B201705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201705I  PIC X(1).
           02  E201705L    COMP  PIC  S9(4).
           02  E201705F    PICTURE X.
           02  FILLER REDEFINES E201705F.
             03 E201705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E201705I  PIC X(16).
           02  B202705L    COMP  PIC  S9(4).
           02  B202705F    PICTURE X.
           02  FILLER REDEFINES B202705F.
             03 B202705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202705I  PIC X(1).
           02  E202705L    COMP  PIC  S9(4).
           02  E202705F    PICTURE X.
           02  FILLER REDEFINES E202705F.
             03 E202705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202705I  PIC X(13).
           02  B202805L    COMP  PIC  S9(4).
           02  B202805F    PICTURE X.
           02  FILLER REDEFINES B202805F.
             03 B202805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202805I  PIC X(2).
           02  E202805L    COMP  PIC  S9(4).
           02  E202805F    PICTURE X.
           02  FILLER REDEFINES E202805F.
             03 E202805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202805I  PIC X(8).
           02  B201706L    COMP  PIC  S9(4).
           02  B201706F    PICTURE X.
           02  FILLER REDEFINES B201706F.
             03 B201706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201706I  PIC X(1).
           02  E201706L    COMP  PIC  S9(4).
           02  E201706F    PICTURE X.
           02  FILLER REDEFINES E201706F.
             03 E201706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E201706I  PIC X(16).
           02  B202706L    COMP  PIC  S9(4).
           02  B202706F    PICTURE X.
           02  FILLER REDEFINES B202706F.
             03 B202706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202706I  PIC X(1).
           02  E202706L    COMP  PIC  S9(4).
           02  E202706F    PICTURE X.
           02  FILLER REDEFINES E202706F.
             03 E202706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202706I  PIC X(13).
           02  B202806L    COMP  PIC  S9(4).
           02  B202806F    PICTURE X.
           02  FILLER REDEFINES B202806F.
             03 B202806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202806I  PIC X(2).
           02  E202806L    COMP  PIC  S9(4).
           02  E202806F    PICTURE X.
           02  FILLER REDEFINES E202806F.
             03 E202806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  E202806I  PIC X(8).
           02  IMPFS28L    COMP  PIC  S9(4).
           02  IMPFS28F    PICTURE X.
           02  FILLER REDEFINES IMPFS28F.
             03 IMPFS28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS28I  PIC X(79).
           02  IMERR28L    COMP  PIC  S9(4).
           02  IMERR28F    PICTURE X.
           02  FILLER REDEFINES IMERR28F.
             03 IMERR28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR28I  PIC X(79).
       01  IMB1M28O REDEFINES IMB1M28I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN27C    PICTURE X.
           02  IMTRN27P    PICTURE X.
           02  IMTRN27H    PICTURE X.
           02  IMTRN27V    PICTURE X.
           02  IMTRN27O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE29C    PICTURE X.
           02  BDATE29P    PICTURE X.
           02  BDATE29H    PICTURE X.
           02  BDATE29V    PICTURE X.
           02  BDATE29O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME29C    PICTURE X.
           02  BTIME29P    PICTURE X.
           02  BTIME29H    PICTURE X.
           02  BTIME29V    PICTURE X.
           02  BTIME29O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE29C    PICTURE X.
           02  IMPGE29P    PICTURE X.
           02  IMPGE29H    PICTURE X.
           02  IMPGE29V    PICTURE X.
           02  IMPGE29O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1029C    PICTURE X.
           02  CTL1029P    PICTURE X.
           02  CTL1029H    PICTURE X.
           02  CTL1029V    PICTURE X.
           02  CTL1029O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2029C    PICTURE X.
           02  CTL2029P    PICTURE X.
           02  CTL2029H    PICTURE X.
           02  CTL2029V    PICTURE X.
           02  CTL2029O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3029C    PICTURE X.
           02  CTL3029P    PICTURE X.
           02  CTL3029H    PICTURE X.
           02  CTL3029V    PICTURE X.
           02  CTL3029O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB3019C    PICTURE X.
           02  IMB3019P    PICTURE X.
           02  IMB3019H    PICTURE X.
           02  IMB3019V    PICTURE X.
           02  IMB3019O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB3016C    PICTURE X.
           02  IMB3016P    PICTURE X.
           02  IMB3016H    PICTURE X.
           02  IMB3016V    PICTURE X.
           02  IMB3016O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB3018C    PICTURE X.
           02  IMB3018P    PICTURE X.
           02  IMB3018H    PICTURE X.
           02  IMB3018V    PICTURE X.
           02  IMB3018O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB3017C    PICTURE X.
           02  IMB3017P    PICTURE X.
           02  IMB3017H    PICTURE X.
           02  IMB3017V    PICTURE X.
           02  IMB3017O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1231C    PICTURE X.
           02  IMB1231P    PICTURE X.
           02  IMB1231H    PICTURE X.
           02  IMB1231V    PICTURE X.
           02  IMB1231O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB3037C    PICTURE X.
           02  IMB3037P    PICTURE X.
           02  IMB3037H    PICTURE X.
           02  IMB3037V    PICTURE X.
           02  IMB3037O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB3038C    PICTURE X.
           02  IMB3038P    PICTURE X.
           02  IMB3038H    PICTURE X.
           02  IMB3038V    PICTURE X.
           02  IMB3038O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB3039C    PICTURE X.
           02  IMB3039P    PICTURE X.
           02  IMB3039H    PICTURE X.
           02  IMB3039V    PICTURE X.
           02  IMB3039O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMB2031C    PICTURE X.
           02  IMB2031P    PICTURE X.
           02  IMB2031H    PICTURE X.
           02  IMB2031V    PICTURE X.
           02  IMB2031O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1093C    PICTURE X.
           02  IMB1093P    PICTURE X.
           02  IMB1093H    PICTURE X.
           02  IMB1093V    PICTURE X.
           02  IMB1093O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB6019C    PICTURE X.
           02  IMB6019P    PICTURE X.
           02  IMB6019H    PICTURE X.
           02  IMB6019V    PICTURE X.
           02  IMB6019O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB3056C    PICTURE X.
           02  IMB3056P    PICTURE X.
           02  IMB3056H    PICTURE X.
           02  IMB3056V    PICTURE X.
           02  IMB3056O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B201701C    PICTURE X.
           02  B201701P    PICTURE X.
           02  B201701H    PICTURE X.
           02  B201701V    PICTURE X.
           02  B201701O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E201701C    PICTURE X.
           02  E201701P    PICTURE X.
           02  E201701H    PICTURE X.
           02  E201701V    PICTURE X.
           02  E201701O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B202701C    PICTURE X.
           02  B202701P    PICTURE X.
           02  B202701H    PICTURE X.
           02  B202701V    PICTURE X.
           02  B202701O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E202701C    PICTURE X.
           02  E202701P    PICTURE X.
           02  E202701H    PICTURE X.
           02  E202701V    PICTURE X.
           02  E202701O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B202801C    PICTURE X.
           02  B202801P    PICTURE X.
           02  B202801H    PICTURE X.
           02  B202801V    PICTURE X.
           02  B202801O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E202801C    PICTURE X.
           02  E202801P    PICTURE X.
           02  E202801H    PICTURE X.
           02  E202801V    PICTURE X.
           02  E202801O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B201702C    PICTURE X.
           02  B201702P    PICTURE X.
           02  B201702H    PICTURE X.
           02  B201702V    PICTURE X.
           02  B201702O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E201702C    PICTURE X.
           02  E201702P    PICTURE X.
           02  E201702H    PICTURE X.
           02  E201702V    PICTURE X.
           02  E201702O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B202702C    PICTURE X.
           02  B202702P    PICTURE X.
           02  B202702H    PICTURE X.
           02  B202702V    PICTURE X.
           02  B202702O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E202702C    PICTURE X.
           02  E202702P    PICTURE X.
           02  E202702H    PICTURE X.
           02  E202702V    PICTURE X.
           02  E202702O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B202802C    PICTURE X.
           02  B202802P    PICTURE X.
           02  B202802H    PICTURE X.
           02  B202802V    PICTURE X.
           02  B202802O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E202802C    PICTURE X.
           02  E202802P    PICTURE X.
           02  E202802H    PICTURE X.
           02  E202802V    PICTURE X.
           02  E202802O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B201703C    PICTURE X.
           02  B201703P    PICTURE X.
           02  B201703H    PICTURE X.
           02  B201703V    PICTURE X.
           02  B201703O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E201703C    PICTURE X.
           02  E201703P    PICTURE X.
           02  E201703H    PICTURE X.
           02  E201703V    PICTURE X.
           02  E201703O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B202703C    PICTURE X.
           02  B202703P    PICTURE X.
           02  B202703H    PICTURE X.
           02  B202703V    PICTURE X.
           02  B202703O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E202703C    PICTURE X.
           02  E202703P    PICTURE X.
           02  E202703H    PICTURE X.
           02  E202703V    PICTURE X.
           02  E202703O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B202803C    PICTURE X.
           02  B202803P    PICTURE X.
           02  B202803H    PICTURE X.
           02  B202803V    PICTURE X.
           02  B202803O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E202803C    PICTURE X.
           02  E202803P    PICTURE X.
           02  E202803H    PICTURE X.
           02  E202803V    PICTURE X.
           02  E202803O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B201704C    PICTURE X.
           02  B201704P    PICTURE X.
           02  B201704H    PICTURE X.
           02  B201704V    PICTURE X.
           02  B201704O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E201704C    PICTURE X.
           02  E201704P    PICTURE X.
           02  E201704H    PICTURE X.
           02  E201704V    PICTURE X.
           02  E201704O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B202704C    PICTURE X.
           02  B202704P    PICTURE X.
           02  B202704H    PICTURE X.
           02  B202704V    PICTURE X.
           02  B202704O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E202704C    PICTURE X.
           02  E202704P    PICTURE X.
           02  E202704H    PICTURE X.
           02  E202704V    PICTURE X.
           02  E202704O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B202804C    PICTURE X.
           02  B202804P    PICTURE X.
           02  B202804H    PICTURE X.
           02  B202804V    PICTURE X.
           02  B202804O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMB2028C    PICTURE X.
           02  IMB2028P    PICTURE X.
           02  IMB2028H    PICTURE X.
           02  IMB2028V    PICTURE X.
           02  IMB2028O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B201705C    PICTURE X.
           02  B201705P    PICTURE X.
           02  B201705H    PICTURE X.
           02  B201705V    PICTURE X.
           02  B201705O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E201705C    PICTURE X.
           02  E201705P    PICTURE X.
           02  E201705H    PICTURE X.
           02  E201705V    PICTURE X.
           02  E201705O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B202705C    PICTURE X.
           02  B202705P    PICTURE X.
           02  B202705H    PICTURE X.
           02  B202705V    PICTURE X.
           02  B202705O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E202705C    PICTURE X.
           02  E202705P    PICTURE X.
           02  E202705H    PICTURE X.
           02  E202705V    PICTURE X.
           02  E202705O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B202805C    PICTURE X.
           02  B202805P    PICTURE X.
           02  B202805H    PICTURE X.
           02  B202805V    PICTURE X.
           02  B202805O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E202805C    PICTURE X.
           02  E202805P    PICTURE X.
           02  E202805H    PICTURE X.
           02  E202805V    PICTURE X.
           02  E202805O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  B201706C    PICTURE X.
           02  B201706P    PICTURE X.
           02  B201706H    PICTURE X.
           02  B201706V    PICTURE X.
           02  B201706O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E201706C    PICTURE X.
           02  E201706P    PICTURE X.
           02  E201706H    PICTURE X.
           02  E201706V    PICTURE X.
           02  E201706O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  B202706C    PICTURE X.
           02  B202706P    PICTURE X.
           02  B202706H    PICTURE X.
           02  B202706V    PICTURE X.
           02  B202706O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  E202706C    PICTURE X.
           02  E202706P    PICTURE X.
           02  E202706H    PICTURE X.
           02  E202706V    PICTURE X.
           02  E202706O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  B202806C    PICTURE X.
           02  B202806P    PICTURE X.
           02  B202806H    PICTURE X.
           02  B202806V    PICTURE X.
           02  B202806O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  E202806C    PICTURE X.
           02  E202806P    PICTURE X.
           02  E202806H    PICTURE X.
           02  E202806V    PICTURE X.
           02  E202806O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPFS28C    PICTURE X.
           02  IMPFS28P    PICTURE X.
           02  IMPFS28H    PICTURE X.
           02  IMPFS28V    PICTURE X.
           02  IMPFS28O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR28C    PICTURE X.
           02  IMERR28P    PICTURE X.
           02  IMERR28H    PICTURE X.
           02  IMERR28V    PICTURE X.
           02  IMERR28O  PIC X(79).
       01  IMB1M29I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN28L    COMP  PIC  S9(4).
           02  IMTRN28F    PICTURE X.
           02  FILLER REDEFINES IMTRN28F.
             03 IMTRN28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN28I  PIC X(4).
           02  BDATE30L    COMP  PIC  S9(4).
           02  BDATE30F    PICTURE X.
           02  FILLER REDEFINES BDATE30F.
             03 BDATE30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE30I  PIC X(8).
           02  BTIME30L    COMP  PIC  S9(4).
           02  BTIME30F    PICTURE X.
           02  FILLER REDEFINES BTIME30F.
             03 BTIME30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME30I  PIC X(8).
           02  IMPGE30L    COMP  PIC  S9(4).
           02  IMPGE30F    PICTURE X.
           02  FILLER REDEFINES IMPGE30F.
             03 IMPGE30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE30I  PIC X(2).
           02  CTL1030L    COMP  PIC  S9(4).
           02  CTL1030F    PICTURE X.
           02  FILLER REDEFINES CTL1030F.
             03 CTL1030A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1030I  PIC X(2).
           02  CTL2030L    COMP  PIC  S9(4).
           02  CTL2030F    PICTURE X.
           02  FILLER REDEFINES CTL2030F.
             03 CTL2030A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2030I  PIC X(3).
           02  CTL3030L    COMP  PIC  S9(4).
           02  CTL3030F    PICTURE X.
           02  FILLER REDEFINES CTL3030F.
             03 CTL3030A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3030I  PIC X(3).
           02  B201801L    COMP  PIC  S9(4).
           02  B201801F    PICTURE X.
           02  FILLER REDEFINES B201801F.
             03 B201801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201801I  PIC X(2).
           02  B201802L    COMP  PIC  S9(4).
           02  B201802F    PICTURE X.
           02  FILLER REDEFINES B201802F.
             03 B201802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201802I  PIC X(2).
           02  B201803L    COMP  PIC  S9(4).
           02  B201803F    PICTURE X.
           02  FILLER REDEFINES B201803F.
             03 B201803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201803I  PIC X(2).
           02  B201804L    COMP  PIC  S9(4).
           02  B201804F    PICTURE X.
           02  FILLER REDEFINES B201804F.
             03 B201804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201804I  PIC X(2).
           02  B201805L    COMP  PIC  S9(4).
           02  B201805F    PICTURE X.
           02  FILLER REDEFINES B201805F.
             03 B201805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201805I  PIC X(2).
           02  B201806L    COMP  PIC  S9(4).
           02  B201806F    PICTURE X.
           02  FILLER REDEFINES B201806F.
             03 B201806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201806I  PIC X(2).
           02  B201807L    COMP  PIC  S9(4).
           02  B201807F    PICTURE X.
           02  FILLER REDEFINES B201807F.
             03 B201807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201807I  PIC X(2).
           02  B201808L    COMP  PIC  S9(4).
           02  B201808F    PICTURE X.
           02  FILLER REDEFINES B201808F.
             03 B201808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201808I  PIC X(2).
           02  B201901L    COMP  PIC  S9(4).
           02  B201901F    PICTURE X.
           02  FILLER REDEFINES B201901F.
             03 B201901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201901I  PIC X(2).
           02  B201902L    COMP  PIC  S9(4).
           02  B201902F    PICTURE X.
           02  FILLER REDEFINES B201902F.
             03 B201902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201902I  PIC X(2).
           02  B201903L    COMP  PIC  S9(4).
           02  B201903F    PICTURE X.
           02  FILLER REDEFINES B201903F.
             03 B201903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201903I  PIC X(2).
           02  B201904L    COMP  PIC  S9(4).
           02  B201904F    PICTURE X.
           02  FILLER REDEFINES B201904F.
             03 B201904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201904I  PIC X(2).
           02  B201905L    COMP  PIC  S9(4).
           02  B201905F    PICTURE X.
           02  FILLER REDEFINES B201905F.
             03 B201905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201905I  PIC X(2).
           02  B201906L    COMP  PIC  S9(4).
           02  B201906F    PICTURE X.
           02  FILLER REDEFINES B201906F.
             03 B201906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B201906I  PIC X(2).
           02  B202001L    COMP  PIC  S9(4).
           02  B202001F    PICTURE X.
           02  FILLER REDEFINES B202001F.
             03 B202001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202001I  PIC X(1).
           02  B202002L    COMP  PIC  S9(4).
           02  B202002F    PICTURE X.
           02  FILLER REDEFINES B202002F.
             03 B202002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202002I  PIC X(1).
           02  B202003L    COMP  PIC  S9(4).
           02  B202003F    PICTURE X.
           02  FILLER REDEFINES B202003F.
             03 B202003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202003I  PIC X(1).
           02  B202004L    COMP  PIC  S9(4).
           02  B202004F    PICTURE X.
           02  FILLER REDEFINES B202004F.
             03 B202004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202004I  PIC X(1).
           02  B202005L    COMP  PIC  S9(4).
           02  B202005F    PICTURE X.
           02  FILLER REDEFINES B202005F.
             03 B202005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202005I  PIC X(1).
           02  B202006L    COMP  PIC  S9(4).
           02  B202006F    PICTURE X.
           02  FILLER REDEFINES B202006F.
             03 B202006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202006I  PIC X(1).
           02  B202101L    COMP  PIC  S9(4).
           02  B202101F    PICTURE X.
           02  FILLER REDEFINES B202101F.
             03 B202101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202101I  PIC X(1).
           02  B202102L    COMP  PIC  S9(4).
           02  B202102F    PICTURE X.
           02  FILLER REDEFINES B202102F.
             03 B202102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202102I  PIC X(1).
           02  B202103L    COMP  PIC  S9(4).
           02  B202103F    PICTURE X.
           02  FILLER REDEFINES B202103F.
             03 B202103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202103I  PIC X(1).
           02  B202104L    COMP  PIC  S9(4).
           02  B202104F    PICTURE X.
           02  FILLER REDEFINES B202104F.
             03 B202104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202104I  PIC X(1).
           02  B202105L    COMP  PIC  S9(4).
           02  B202105F    PICTURE X.
           02  FILLER REDEFINES B202105F.
             03 B202105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202105I  PIC X(1).
           02  B202106L    COMP  PIC  S9(4).
           02  B202106F    PICTURE X.
           02  FILLER REDEFINES B202106F.
             03 B202106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B202106I  PIC X(1).
           02  B122801L    COMP  PIC  S9(4).
           02  B122801F    PICTURE X.
           02  FILLER REDEFINES B122801F.
             03 B122801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122801I  PIC X(2).
           02  B122802L    COMP  PIC  S9(4).
           02  B122802F    PICTURE X.
           02  FILLER REDEFINES B122802F.
             03 B122802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122802I  PIC X(2).
           02  B122803L    COMP  PIC  S9(4).
           02  B122803F    PICTURE X.
           02  FILLER REDEFINES B122803F.
             03 B122803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122803I  PIC X(2).
           02  B122804L    COMP  PIC  S9(4).
           02  B122804F    PICTURE X.
           02  FILLER REDEFINES B122804F.
             03 B122804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122804I  PIC X(2).
           02  B122805L    COMP  PIC  S9(4).
           02  B122805F    PICTURE X.
           02  FILLER REDEFINES B122805F.
             03 B122805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122805I  PIC X(2).
           02  B122806L    COMP  PIC  S9(4).
           02  B122806F    PICTURE X.
           02  FILLER REDEFINES B122806F.
             03 B122806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122806I  PIC X(2).
           02  B122807L    COMP  PIC  S9(4).
           02  B122807F    PICTURE X.
           02  FILLER REDEFINES B122807F.
             03 B122807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122807I  PIC X(2).
           02  B122808L    COMP  PIC  S9(4).
           02  B122808F    PICTURE X.
           02  FILLER REDEFINES B122808F.
             03 B122808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122808I  PIC X(2).
           02  B122809L    COMP  PIC  S9(4).
           02  B122809F    PICTURE X.
           02  FILLER REDEFINES B122809F.
             03 B122809A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122809I  PIC X(2).
           02  B122810L    COMP  PIC  S9(4).
           02  B122810F    PICTURE X.
           02  FILLER REDEFINES B122810F.
             03 B122810A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122810I  PIC X(2).
           02  B122901L    COMP  PIC  S9(4).
           02  B122901F    PICTURE X.
           02  FILLER REDEFINES B122901F.
             03 B122901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122901I  PIC X(1).
           02  B122902L    COMP  PIC  S9(4).
           02  B122902F    PICTURE X.
           02  FILLER REDEFINES B122902F.
             03 B122902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122902I  PIC X(1).
           02  B122903L    COMP  PIC  S9(4).
           02  B122903F    PICTURE X.
           02  FILLER REDEFINES B122903F.
             03 B122903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122903I  PIC X(1).
           02  B122904L    COMP  PIC  S9(4).
           02  B122904F    PICTURE X.
           02  FILLER REDEFINES B122904F.
             03 B122904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122904I  PIC X(1).
           02  B122905L    COMP  PIC  S9(4).
           02  B122905F    PICTURE X.
           02  FILLER REDEFINES B122905F.
             03 B122905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122905I  PIC X(1).
           02  B122906L    COMP  PIC  S9(4).
           02  B122906F    PICTURE X.
           02  FILLER REDEFINES B122906F.
             03 B122906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122906I  PIC X(1).
           02  B122907L    COMP  PIC  S9(4).
           02  B122907F    PICTURE X.
           02  FILLER REDEFINES B122907F.
             03 B122907A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122907I  PIC X(1).
           02  B122908L    COMP  PIC  S9(4).
           02  B122908F    PICTURE X.
           02  FILLER REDEFINES B122908F.
             03 B122908A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122908I  PIC X(1).
           02  B122909L    COMP  PIC  S9(4).
           02  B122909F    PICTURE X.
           02  FILLER REDEFINES B122909F.
             03 B122909A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122909I  PIC X(1).
           02  B122910L    COMP  PIC  S9(4).
           02  B122910F    PICTURE X.
           02  FILLER REDEFINES B122910F.
             03 B122910A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B122910I  PIC X(1).
           02  B123001L    COMP  PIC  S9(4).
           02  B123001F    PICTURE X.
           02  FILLER REDEFINES B123001F.
             03 B123001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123001I  PIC X(1).
           02  B123002L    COMP  PIC  S9(4).
           02  B123002F    PICTURE X.
           02  FILLER REDEFINES B123002F.
             03 B123002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123002I  PIC X(1).
           02  B123003L    COMP  PIC  S9(4).
           02  B123003F    PICTURE X.
           02  FILLER REDEFINES B123003F.
             03 B123003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123003I  PIC X(1).
           02  B123004L    COMP  PIC  S9(4).
           02  B123004F    PICTURE X.
           02  FILLER REDEFINES B123004F.
             03 B123004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123004I  PIC X(1).
           02  B123005L    COMP  PIC  S9(4).
           02  B123005F    PICTURE X.
           02  FILLER REDEFINES B123005F.
             03 B123005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123005I  PIC X(1).
           02  B123006L    COMP  PIC  S9(4).
           02  B123006F    PICTURE X.
           02  FILLER REDEFINES B123006F.
             03 B123006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123006I  PIC X(1).
           02  B123007L    COMP  PIC  S9(4).
           02  B123007F    PICTURE X.
           02  FILLER REDEFINES B123007F.
             03 B123007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123007I  PIC X(1).
           02  B123008L    COMP  PIC  S9(4).
           02  B123008F    PICTURE X.
           02  FILLER REDEFINES B123008F.
             03 B123008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123008I  PIC X(1).
           02  B123009L    COMP  PIC  S9(4).
           02  B123009F    PICTURE X.
           02  FILLER REDEFINES B123009F.
             03 B123009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123009I  PIC X(1).
           02  B123010L    COMP  PIC  S9(4).
           02  B123010F    PICTURE X.
           02  FILLER REDEFINES B123010F.
             03 B123010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B123010I  PIC X(1).
           02  IMPFS29L    COMP  PIC  S9(4).
           02  IMPFS29F    PICTURE X.
           02  FILLER REDEFINES IMPFS29F.
             03 IMPFS29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS29I  PIC X(79).
           02  IMERR29L    COMP  PIC  S9(4).
           02  IMERR29F    PICTURE X.
           02  FILLER REDEFINES IMERR29F.
             03 IMERR29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR29I  PIC X(79).
       01  IMB1M29O REDEFINES IMB1M29I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN28C    PICTURE X.
           02  IMTRN28P    PICTURE X.
           02  IMTRN28H    PICTURE X.
           02  IMTRN28V    PICTURE X.
           02  IMTRN28O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE30C    PICTURE X.
           02  BDATE30P    PICTURE X.
           02  BDATE30H    PICTURE X.
           02  BDATE30V    PICTURE X.
           02  BDATE30O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME30C    PICTURE X.
           02  BTIME30P    PICTURE X.
           02  BTIME30H    PICTURE X.
           02  BTIME30V    PICTURE X.
           02  BTIME30O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE30C    PICTURE X.
           02  IMPGE30P    PICTURE X.
           02  IMPGE30H    PICTURE X.
           02  IMPGE30V    PICTURE X.
           02  IMPGE30O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1030C    PICTURE X.
           02  CTL1030P    PICTURE X.
           02  CTL1030H    PICTURE X.
           02  CTL1030V    PICTURE X.
           02  CTL1030O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2030C    PICTURE X.
           02  CTL2030P    PICTURE X.
           02  CTL2030H    PICTURE X.
           02  CTL2030V    PICTURE X.
           02  CTL2030O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3030C    PICTURE X.
           02  CTL3030P    PICTURE X.
           02  CTL3030H    PICTURE X.
           02  CTL3030V    PICTURE X.
           02  CTL3030O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B201801C    PICTURE X.
           02  B201801P    PICTURE X.
           02  B201801H    PICTURE X.
           02  B201801V    PICTURE X.
           02  B201801O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201802C    PICTURE X.
           02  B201802P    PICTURE X.
           02  B201802H    PICTURE X.
           02  B201802V    PICTURE X.
           02  B201802O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201803C    PICTURE X.
           02  B201803P    PICTURE X.
           02  B201803H    PICTURE X.
           02  B201803V    PICTURE X.
           02  B201803O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201804C    PICTURE X.
           02  B201804P    PICTURE X.
           02  B201804H    PICTURE X.
           02  B201804V    PICTURE X.
           02  B201804O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201805C    PICTURE X.
           02  B201805P    PICTURE X.
           02  B201805H    PICTURE X.
           02  B201805V    PICTURE X.
           02  B201805O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201806C    PICTURE X.
           02  B201806P    PICTURE X.
           02  B201806H    PICTURE X.
           02  B201806V    PICTURE X.
           02  B201806O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201807C    PICTURE X.
           02  B201807P    PICTURE X.
           02  B201807H    PICTURE X.
           02  B201807V    PICTURE X.
           02  B201807O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201808C    PICTURE X.
           02  B201808P    PICTURE X.
           02  B201808H    PICTURE X.
           02  B201808V    PICTURE X.
           02  B201808O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201901C    PICTURE X.
           02  B201901P    PICTURE X.
           02  B201901H    PICTURE X.
           02  B201901V    PICTURE X.
           02  B201901O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201902C    PICTURE X.
           02  B201902P    PICTURE X.
           02  B201902H    PICTURE X.
           02  B201902V    PICTURE X.
           02  B201902O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201903C    PICTURE X.
           02  B201903P    PICTURE X.
           02  B201903H    PICTURE X.
           02  B201903V    PICTURE X.
           02  B201903O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201904C    PICTURE X.
           02  B201904P    PICTURE X.
           02  B201904H    PICTURE X.
           02  B201904V    PICTURE X.
           02  B201904O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201905C    PICTURE X.
           02  B201905P    PICTURE X.
           02  B201905H    PICTURE X.
           02  B201905V    PICTURE X.
           02  B201905O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B201906C    PICTURE X.
           02  B201906P    PICTURE X.
           02  B201906H    PICTURE X.
           02  B201906V    PICTURE X.
           02  B201906O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B202001C    PICTURE X.
           02  B202001P    PICTURE X.
           02  B202001H    PICTURE X.
           02  B202001V    PICTURE X.
           02  B202001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202002C    PICTURE X.
           02  B202002P    PICTURE X.
           02  B202002H    PICTURE X.
           02  B202002V    PICTURE X.
           02  B202002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202003C    PICTURE X.
           02  B202003P    PICTURE X.
           02  B202003H    PICTURE X.
           02  B202003V    PICTURE X.
           02  B202003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202004C    PICTURE X.
           02  B202004P    PICTURE X.
           02  B202004H    PICTURE X.
           02  B202004V    PICTURE X.
           02  B202004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202005C    PICTURE X.
           02  B202005P    PICTURE X.
           02  B202005H    PICTURE X.
           02  B202005V    PICTURE X.
           02  B202005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202006C    PICTURE X.
           02  B202006P    PICTURE X.
           02  B202006H    PICTURE X.
           02  B202006V    PICTURE X.
           02  B202006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202101C    PICTURE X.
           02  B202101P    PICTURE X.
           02  B202101H    PICTURE X.
           02  B202101V    PICTURE X.
           02  B202101O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202102C    PICTURE X.
           02  B202102P    PICTURE X.
           02  B202102H    PICTURE X.
           02  B202102V    PICTURE X.
           02  B202102O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202103C    PICTURE X.
           02  B202103P    PICTURE X.
           02  B202103H    PICTURE X.
           02  B202103V    PICTURE X.
           02  B202103O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202104C    PICTURE X.
           02  B202104P    PICTURE X.
           02  B202104H    PICTURE X.
           02  B202104V    PICTURE X.
           02  B202104O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202105C    PICTURE X.
           02  B202105P    PICTURE X.
           02  B202105H    PICTURE X.
           02  B202105V    PICTURE X.
           02  B202105O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B202106C    PICTURE X.
           02  B202106P    PICTURE X.
           02  B202106H    PICTURE X.
           02  B202106V    PICTURE X.
           02  B202106O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122801C    PICTURE X.
           02  B122801P    PICTURE X.
           02  B122801H    PICTURE X.
           02  B122801V    PICTURE X.
           02  B122801O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122802C    PICTURE X.
           02  B122802P    PICTURE X.
           02  B122802H    PICTURE X.
           02  B122802V    PICTURE X.
           02  B122802O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122803C    PICTURE X.
           02  B122803P    PICTURE X.
           02  B122803H    PICTURE X.
           02  B122803V    PICTURE X.
           02  B122803O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122804C    PICTURE X.
           02  B122804P    PICTURE X.
           02  B122804H    PICTURE X.
           02  B122804V    PICTURE X.
           02  B122804O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122805C    PICTURE X.
           02  B122805P    PICTURE X.
           02  B122805H    PICTURE X.
           02  B122805V    PICTURE X.
           02  B122805O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122806C    PICTURE X.
           02  B122806P    PICTURE X.
           02  B122806H    PICTURE X.
           02  B122806V    PICTURE X.
           02  B122806O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122807C    PICTURE X.
           02  B122807P    PICTURE X.
           02  B122807H    PICTURE X.
           02  B122807V    PICTURE X.
           02  B122807O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122808C    PICTURE X.
           02  B122808P    PICTURE X.
           02  B122808H    PICTURE X.
           02  B122808V    PICTURE X.
           02  B122808O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122809C    PICTURE X.
           02  B122809P    PICTURE X.
           02  B122809H    PICTURE X.
           02  B122809V    PICTURE X.
           02  B122809O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122810C    PICTURE X.
           02  B122810P    PICTURE X.
           02  B122810H    PICTURE X.
           02  B122810V    PICTURE X.
           02  B122810O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B122901C    PICTURE X.
           02  B122901P    PICTURE X.
           02  B122901H    PICTURE X.
           02  B122901V    PICTURE X.
           02  B122901O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122902C    PICTURE X.
           02  B122902P    PICTURE X.
           02  B122902H    PICTURE X.
           02  B122902V    PICTURE X.
           02  B122902O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122903C    PICTURE X.
           02  B122903P    PICTURE X.
           02  B122903H    PICTURE X.
           02  B122903V    PICTURE X.
           02  B122903O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122904C    PICTURE X.
           02  B122904P    PICTURE X.
           02  B122904H    PICTURE X.
           02  B122904V    PICTURE X.
           02  B122904O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122905C    PICTURE X.
           02  B122905P    PICTURE X.
           02  B122905H    PICTURE X.
           02  B122905V    PICTURE X.
           02  B122905O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122906C    PICTURE X.
           02  B122906P    PICTURE X.
           02  B122906H    PICTURE X.
           02  B122906V    PICTURE X.
           02  B122906O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122907C    PICTURE X.
           02  B122907P    PICTURE X.
           02  B122907H    PICTURE X.
           02  B122907V    PICTURE X.
           02  B122907O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122908C    PICTURE X.
           02  B122908P    PICTURE X.
           02  B122908H    PICTURE X.
           02  B122908V    PICTURE X.
           02  B122908O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122909C    PICTURE X.
           02  B122909P    PICTURE X.
           02  B122909H    PICTURE X.
           02  B122909V    PICTURE X.
           02  B122909O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B122910C    PICTURE X.
           02  B122910P    PICTURE X.
           02  B122910H    PICTURE X.
           02  B122910V    PICTURE X.
           02  B122910O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123001C    PICTURE X.
           02  B123001P    PICTURE X.
           02  B123001H    PICTURE X.
           02  B123001V    PICTURE X.
           02  B123001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123002C    PICTURE X.
           02  B123002P    PICTURE X.
           02  B123002H    PICTURE X.
           02  B123002V    PICTURE X.
           02  B123002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123003C    PICTURE X.
           02  B123003P    PICTURE X.
           02  B123003H    PICTURE X.
           02  B123003V    PICTURE X.
           02  B123003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123004C    PICTURE X.
           02  B123004P    PICTURE X.
           02  B123004H    PICTURE X.
           02  B123004V    PICTURE X.
           02  B123004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123005C    PICTURE X.
           02  B123005P    PICTURE X.
           02  B123005H    PICTURE X.
           02  B123005V    PICTURE X.
           02  B123005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123006C    PICTURE X.
           02  B123006P    PICTURE X.
           02  B123006H    PICTURE X.
           02  B123006V    PICTURE X.
           02  B123006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123007C    PICTURE X.
           02  B123007P    PICTURE X.
           02  B123007H    PICTURE X.
           02  B123007V    PICTURE X.
           02  B123007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123008C    PICTURE X.
           02  B123008P    PICTURE X.
           02  B123008H    PICTURE X.
           02  B123008V    PICTURE X.
           02  B123008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123009C    PICTURE X.
           02  B123009P    PICTURE X.
           02  B123009H    PICTURE X.
           02  B123009V    PICTURE X.
           02  B123009O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B123010C    PICTURE X.
           02  B123010P    PICTURE X.
           02  B123010H    PICTURE X.
           02  B123010V    PICTURE X.
           02  B123010O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS29C    PICTURE X.
           02  IMPFS29P    PICTURE X.
           02  IMPFS29H    PICTURE X.
           02  IMPFS29V    PICTURE X.
           02  IMPFS29O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR29C    PICTURE X.
           02  IMERR29P    PICTURE X.
           02  IMERR29H    PICTURE X.
           02  IMERR29V    PICTURE X.
           02  IMERR29O  PIC X(79).
       01  IMB1M30I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN29L    COMP  PIC  S9(4).
           02  IMTRN29F    PICTURE X.
           02  FILLER REDEFINES IMTRN29F.
             03 IMTRN29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN29I  PIC X(4).
           02  BDATE31L    COMP  PIC  S9(4).
           02  BDATE31F    PICTURE X.
           02  FILLER REDEFINES BDATE31F.
             03 BDATE31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE31I  PIC X(8).
           02  BTIME31L    COMP  PIC  S9(4).
           02  BTIME31F    PICTURE X.
           02  FILLER REDEFINES BTIME31F.
             03 BTIME31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME31I  PIC X(8).
           02  IMPGE31L    COMP  PIC  S9(4).
           02  IMPGE31F    PICTURE X.
           02  FILLER REDEFINES IMPGE31F.
             03 IMPGE31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE31I  PIC X(2).
           02  CTL1031L    COMP  PIC  S9(4).
           02  CTL1031F    PICTURE X.
           02  FILLER REDEFINES CTL1031F.
             03 CTL1031A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1031I  PIC X(2).
           02  CTL2031L    COMP  PIC  S9(4).
           02  CTL2031F    PICTURE X.
           02  FILLER REDEFINES CTL2031F.
             03 CTL2031A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2031I  PIC X(3).
           02  CTL3031L    COMP  PIC  S9(4).
           02  CTL3031F    PICTURE X.
           02  FILLER REDEFINES CTL3031F.
             03 CTL3031A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3031I  PIC X(3).
           02  IMB2032L    COMP  PIC  S9(4).
           02  IMB2032F    PICTURE X.
           02  FILLER REDEFINES IMB2032F.
             03 IMB2032A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2032I  PIC X(3).
           02  IMB2033L    COMP  PIC  S9(4).
           02  IMB2033F    PICTURE X.
           02  FILLER REDEFINES IMB2033F.
             03 IMB2033A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2033I  PIC X(3).
           02  IMB2034L    COMP  PIC  S9(4).
           02  IMB2034F    PICTURE X.
           02  FILLER REDEFINES IMB2034F.
             03 IMB2034A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB2034I  PIC X(3).
           02  IMB4005L    COMP  PIC  S9(4).
           02  IMB4005F    PICTURE X.
           02  FILLER REDEFINES IMB4005F.
             03 IMB4005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4005I  PIC X(1).
           02  IMB5045L    COMP  PIC  S9(4).
           02  IMB5045F    PICTURE X.
           02  FILLER REDEFINES IMB5045F.
             03 IMB5045A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5045I  PIC X(4).
           02  IMB5043L    COMP  PIC  S9(4).
           02  IMB5043F    PICTURE X.
           02  FILLER REDEFINES IMB5043F.
             03 IMB5043A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5043I  PIC X(1).
           02  IMB1106L    COMP  PIC  S9(4).
           02  IMB1106F    PICTURE X.
           02  FILLER REDEFINES IMB1106F.
             03 IMB1106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1106I  PIC X(1).
           02  IMB1105L    COMP  PIC  S9(4).
           02  IMB1105F    PICTURE X.
           02  FILLER REDEFINES IMB1105F.
             03 IMB1105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1105I  PIC X(1).
           02  IMB5046L    COMP  PIC  S9(4).
           02  IMB5046F    PICTURE X.
           02  FILLER REDEFINES IMB5046F.
             03 IMB5046A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5046I  PIC X(10).
           02  IMB5047L    COMP  PIC  S9(4).
           02  IMB5047F    PICTURE X.
           02  FILLER REDEFINES IMB5047F.
             03 IMB5047A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5047I  PIC X(10).
           02  IMB5048L    COMP  PIC  S9(4).
           02  IMB5048F    PICTURE X.
           02  FILLER REDEFINES IMB5048F.
             03 IMB5048A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5048I  PIC X(10).
           02  IMB5049L    COMP  PIC  S9(4).
           02  IMB5049F    PICTURE X.
           02  FILLER REDEFINES IMB5049F.
             03 IMB5049A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5049I  PIC X(10).
           02  IMB5050L    COMP  PIC  S9(4).
           02  IMB5050F    PICTURE X.
           02  FILLER REDEFINES IMB5050F.
             03 IMB5050A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5050I  PIC X(10).
           02  IMB5051L    COMP  PIC  S9(4).
           02  IMB5051F    PICTURE X.
           02  FILLER REDEFINES IMB5051F.
             03 IMB5051A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5051I  PIC X(10).
           02  IMB5052L    COMP  PIC  S9(4).
           02  IMB5052F    PICTURE X.
           02  FILLER REDEFINES IMB5052F.
             03 IMB5052A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5052I  PIC X(10).
           02  IMB5053L    COMP  PIC  S9(4).
           02  IMB5053F    PICTURE X.
           02  FILLER REDEFINES IMB5053F.
             03 IMB5053A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5053I  PIC X(10).
           02  IMPFS30L    COMP  PIC  S9(4).
           02  IMPFS30F    PICTURE X.
           02  FILLER REDEFINES IMPFS30F.
             03 IMPFS30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS30I  PIC X(79).
           02  IMERR30L    COMP  PIC  S9(4).
           02  IMERR30F    PICTURE X.
           02  FILLER REDEFINES IMERR30F.
             03 IMERR30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR30I  PIC X(79).
       01  IMB1M30O REDEFINES IMB1M30I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN29C    PICTURE X.
           02  IMTRN29P    PICTURE X.
           02  IMTRN29H    PICTURE X.
           02  IMTRN29V    PICTURE X.
           02  IMTRN29O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE31C    PICTURE X.
           02  BDATE31P    PICTURE X.
           02  BDATE31H    PICTURE X.
           02  BDATE31V    PICTURE X.
           02  BDATE31O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME31C    PICTURE X.
           02  BTIME31P    PICTURE X.
           02  BTIME31H    PICTURE X.
           02  BTIME31V    PICTURE X.
           02  BTIME31O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE31C    PICTURE X.
           02  IMPGE31P    PICTURE X.
           02  IMPGE31H    PICTURE X.
           02  IMPGE31V    PICTURE X.
           02  IMPGE31O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1031C    PICTURE X.
           02  CTL1031P    PICTURE X.
           02  CTL1031H    PICTURE X.
           02  CTL1031V    PICTURE X.
           02  CTL1031O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2031C    PICTURE X.
           02  CTL2031P    PICTURE X.
           02  CTL2031H    PICTURE X.
           02  CTL2031V    PICTURE X.
           02  CTL2031O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3031C    PICTURE X.
           02  CTL3031P    PICTURE X.
           02  CTL3031H    PICTURE X.
           02  CTL3031V    PICTURE X.
           02  CTL3031O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB2032C    PICTURE X.
           02  IMB2032P    PICTURE X.
           02  IMB2032H    PICTURE X.
           02  IMB2032V    PICTURE X.
           02  IMB2032O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB2033C    PICTURE X.
           02  IMB2033P    PICTURE X.
           02  IMB2033H    PICTURE X.
           02  IMB2033V    PICTURE X.
           02  IMB2033O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB2034C    PICTURE X.
           02  IMB2034P    PICTURE X.
           02  IMB2034H    PICTURE X.
           02  IMB2034V    PICTURE X.
           02  IMB2034O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB4005C    PICTURE X.
           02  IMB4005P    PICTURE X.
           02  IMB4005H    PICTURE X.
           02  IMB4005V    PICTURE X.
           02  IMB4005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5045C    PICTURE X.
           02  IMB5045P    PICTURE X.
           02  IMB5045H    PICTURE X.
           02  IMB5045V    PICTURE X.
           02  IMB5045O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5043C    PICTURE X.
           02  IMB5043P    PICTURE X.
           02  IMB5043H    PICTURE X.
           02  IMB5043V    PICTURE X.
           02  IMB5043O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1106C    PICTURE X.
           02  IMB1106P    PICTURE X.
           02  IMB1106H    PICTURE X.
           02  IMB1106V    PICTURE X.
           02  IMB1106O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1105C    PICTURE X.
           02  IMB1105P    PICTURE X.
           02  IMB1105H    PICTURE X.
           02  IMB1105V    PICTURE X.
           02  IMB1105O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB5046C    PICTURE X.
           02  IMB5046P    PICTURE X.
           02  IMB5046H    PICTURE X.
           02  IMB5046V    PICTURE X.
           02  IMB5046O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB5047C    PICTURE X.
           02  IMB5047P    PICTURE X.
           02  IMB5047H    PICTURE X.
           02  IMB5047V    PICTURE X.
           02  IMB5047O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB5048C    PICTURE X.
           02  IMB5048P    PICTURE X.
           02  IMB5048H    PICTURE X.
           02  IMB5048V    PICTURE X.
           02  IMB5048O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB5049C    PICTURE X.
           02  IMB5049P    PICTURE X.
           02  IMB5049H    PICTURE X.
           02  IMB5049V    PICTURE X.
           02  IMB5049O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB5050C    PICTURE X.
           02  IMB5050P    PICTURE X.
           02  IMB5050H    PICTURE X.
           02  IMB5050V    PICTURE X.
           02  IMB5050O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB5051C    PICTURE X.
           02  IMB5051P    PICTURE X.
           02  IMB5051H    PICTURE X.
           02  IMB5051V    PICTURE X.
           02  IMB5051O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB5052C    PICTURE X.
           02  IMB5052P    PICTURE X.
           02  IMB5052H    PICTURE X.
           02  IMB5052V    PICTURE X.
           02  IMB5052O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMB5053C    PICTURE X.
           02  IMB5053P    PICTURE X.
           02  IMB5053H    PICTURE X.
           02  IMB5053V    PICTURE X.
           02  IMB5053O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMPFS30C    PICTURE X.
           02  IMPFS30P    PICTURE X.
           02  IMPFS30H    PICTURE X.
           02  IMPFS30V    PICTURE X.
           02  IMPFS30O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR30C    PICTURE X.
           02  IMERR30P    PICTURE X.
           02  IMERR30H    PICTURE X.
           02  IMERR30V    PICTURE X.
           02  IMERR30O  PIC X(79).
       01  IMB1M31I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN30L    COMP  PIC  S9(4).
           02  IMTRN30F    PICTURE X.
           02  FILLER REDEFINES IMTRN30F.
             03 IMTRN30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN30I  PIC X(4).
           02  BDATE32L    COMP  PIC  S9(4).
           02  BDATE32F    PICTURE X.
           02  FILLER REDEFINES BDATE32F.
             03 BDATE32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE32I  PIC X(8).
           02  BTIME32L    COMP  PIC  S9(4).
           02  BTIME32F    PICTURE X.
           02  FILLER REDEFINES BTIME32F.
             03 BTIME32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME32I  PIC X(8).
           02  IMPGE32L    COMP  PIC  S9(4).
           02  IMPGE32F    PICTURE X.
           02  FILLER REDEFINES IMPGE32F.
             03 IMPGE32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE32I  PIC X(2).
           02  CTL1032L    COMP  PIC  S9(4).
           02  CTL1032F    PICTURE X.
           02  FILLER REDEFINES CTL1032F.
             03 CTL1032A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1032I  PIC X(2).
           02  CTL2032L    COMP  PIC  S9(4).
           02  CTL2032F    PICTURE X.
           02  FILLER REDEFINES CTL2032F.
             03 CTL2032A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2032I  PIC X(3).
           02  CTL3032L    COMP  PIC  S9(4).
           02  CTL3032F    PICTURE X.
           02  FILLER REDEFINES CTL3032F.
             03 CTL3032A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3032I  PIC X(3).
           02  IMB7028L    COMP  PIC  S9(4).
           02  IMB7028F    PICTURE X.
           02  FILLER REDEFINES IMB7028F.
             03 IMB7028A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7028I  PIC X(7).
           02  IMB7029L    COMP  PIC  S9(4).
           02  IMB7029F    PICTURE X.
           02  FILLER REDEFINES IMB7029F.
             03 IMB7029A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7029I  PIC X(18).
           02  IMB7033L    COMP  PIC  S9(4).
           02  IMB7033F    PICTURE X.
           02  FILLER REDEFINES IMB7033F.
             03 IMB7033A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7033I  PIC X(5).
           02  IMB7034L    COMP  PIC  S9(4).
           02  IMB7034F    PICTURE X.
           02  FILLER REDEFINES IMB7034F.
             03 IMB7034A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7034I  PIC X(18).
           02  IMB7035L    COMP  PIC  S9(4).
           02  IMB7035F    PICTURE X.
           02  FILLER REDEFINES IMB7035F.
             03 IMB7035A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7035I  PIC X(5).
           02  IMB7036L    COMP  PIC  S9(4).
           02  IMB7036F    PICTURE X.
           02  FILLER REDEFINES IMB7036F.
             03 IMB7036A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7036I  PIC X(18).
           02  IMB7037L    COMP  PIC  S9(4).
           02  IMB7037F    PICTURE X.
           02  FILLER REDEFINES IMB7037F.
             03 IMB7037A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7037I  PIC X(5).
           02  IMB7038L    COMP  PIC  S9(4).
           02  IMB7038F    PICTURE X.
           02  FILLER REDEFINES IMB7038F.
             03 IMB7038A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7038I  PIC X(18).
           02  IMB7041L    COMP  PIC  S9(4).
           02  IMB7041F    PICTURE X.
           02  FILLER REDEFINES IMB7041F.
             03 IMB7041A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7041I  PIC X(7).
           02  IMB7042L    COMP  PIC  S9(4).
           02  IMB7042F    PICTURE X.
           02  FILLER REDEFINES IMB7042F.
             03 IMB7042A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7042I  PIC X(18).
           02  IMB7043L    COMP  PIC  S9(4).
           02  IMB7043F    PICTURE X.
           02  FILLER REDEFINES IMB7043F.
             03 IMB7043A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7043I  PIC X(7).
           02  IMB7044L    COMP  PIC  S9(4).
           02  IMB7044F    PICTURE X.
           02  FILLER REDEFINES IMB7044F.
             03 IMB7044A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7044I  PIC X(18).
           02  IMB7045L    COMP  PIC  S9(4).
           02  IMB7045F    PICTURE X.
           02  FILLER REDEFINES IMB7045F.
             03 IMB7045A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7045I  PIC X(16).
           02  IMB7046L    COMP  PIC  S9(4).
           02  IMB7046F    PICTURE X.
           02  FILLER REDEFINES IMB7046F.
             03 IMB7046A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7046I  PIC X(16).
           02  IMB7047L    COMP  PIC  S9(4).
           02  IMB7047F    PICTURE X.
           02  FILLER REDEFINES IMB7047F.
             03 IMB7047A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7047I  PIC X(18).
           02  IMB7039L    COMP  PIC  S9(4).
           02  IMB7039F    PICTURE X.
           02  FILLER REDEFINES IMB7039F.
             03 IMB7039A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7039I  PIC X(15).
           02  IMB7040L    COMP  PIC  S9(4).
           02  IMB7040F    PICTURE X.
           02  FILLER REDEFINES IMB7040F.
             03 IMB7040A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7040I  PIC X(15).
           02  IMB7030L    COMP  PIC  S9(4).
           02  IMB7030F    PICTURE X.
           02  FILLER REDEFINES IMB7030F.
             03 IMB7030A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7030I  PIC X(5).
           02  IMB7031L    COMP  PIC  S9(4).
           02  IMB7031F    PICTURE X.
           02  FILLER REDEFINES IMB7031F.
             03 IMB7031A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7031I  PIC X(5).
           02  IMB7032L    COMP  PIC  S9(4).
           02  IMB7032F    PICTURE X.
           02  FILLER REDEFINES IMB7032F.
             03 IMB7032A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7032I  PIC X(5).
           02  IMPFS31L    COMP  PIC  S9(4).
           02  IMPFS31F    PICTURE X.
           02  FILLER REDEFINES IMPFS31F.
             03 IMPFS31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS31I  PIC X(79).
           02  IMERR31L    COMP  PIC  S9(4).
           02  IMERR31F    PICTURE X.
           02  FILLER REDEFINES IMERR31F.
             03 IMERR31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR31I  PIC X(79).
       01  IMB1M31O REDEFINES IMB1M31I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN30C    PICTURE X.
           02  IMTRN30P    PICTURE X.
           02  IMTRN30H    PICTURE X.
           02  IMTRN30V    PICTURE X.
           02  IMTRN30O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE32C    PICTURE X.
           02  BDATE32P    PICTURE X.
           02  BDATE32H    PICTURE X.
           02  BDATE32V    PICTURE X.
           02  BDATE32O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME32C    PICTURE X.
           02  BTIME32P    PICTURE X.
           02  BTIME32H    PICTURE X.
           02  BTIME32V    PICTURE X.
           02  BTIME32O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE32C    PICTURE X.
           02  IMPGE32P    PICTURE X.
           02  IMPGE32H    PICTURE X.
           02  IMPGE32V    PICTURE X.
           02  IMPGE32O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1032C    PICTURE X.
           02  CTL1032P    PICTURE X.
           02  CTL1032H    PICTURE X.
           02  CTL1032V    PICTURE X.
           02  CTL1032O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2032C    PICTURE X.
           02  CTL2032P    PICTURE X.
           02  CTL2032H    PICTURE X.
           02  CTL2032V    PICTURE X.
           02  CTL2032O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3032C    PICTURE X.
           02  CTL3032P    PICTURE X.
           02  CTL3032H    PICTURE X.
           02  CTL3032V    PICTURE X.
           02  CTL3032O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB7028C    PICTURE X.
           02  IMB7028P    PICTURE X.
           02  IMB7028H    PICTURE X.
           02  IMB7028V    PICTURE X.
           02  IMB7028O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7029C    PICTURE X.
           02  IMB7029P    PICTURE X.
           02  IMB7029H    PICTURE X.
           02  IMB7029V    PICTURE X.
           02  IMB7029O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7033C    PICTURE X.
           02  IMB7033P    PICTURE X.
           02  IMB7033H    PICTURE X.
           02  IMB7033V    PICTURE X.
           02  IMB7033O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB7034C    PICTURE X.
           02  IMB7034P    PICTURE X.
           02  IMB7034H    PICTURE X.
           02  IMB7034V    PICTURE X.
           02  IMB7034O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7035C    PICTURE X.
           02  IMB7035P    PICTURE X.
           02  IMB7035H    PICTURE X.
           02  IMB7035V    PICTURE X.
           02  IMB7035O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB7036C    PICTURE X.
           02  IMB7036P    PICTURE X.
           02  IMB7036H    PICTURE X.
           02  IMB7036V    PICTURE X.
           02  IMB7036O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7037C    PICTURE X.
           02  IMB7037P    PICTURE X.
           02  IMB7037H    PICTURE X.
           02  IMB7037V    PICTURE X.
           02  IMB7037O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB7038C    PICTURE X.
           02  IMB7038P    PICTURE X.
           02  IMB7038H    PICTURE X.
           02  IMB7038V    PICTURE X.
           02  IMB7038O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7041C    PICTURE X.
           02  IMB7041P    PICTURE X.
           02  IMB7041H    PICTURE X.
           02  IMB7041V    PICTURE X.
           02  IMB7041O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7042C    PICTURE X.
           02  IMB7042P    PICTURE X.
           02  IMB7042H    PICTURE X.
           02  IMB7042V    PICTURE X.
           02  IMB7042O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7043C    PICTURE X.
           02  IMB7043P    PICTURE X.
           02  IMB7043H    PICTURE X.
           02  IMB7043V    PICTURE X.
           02  IMB7043O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7044C    PICTURE X.
           02  IMB7044P    PICTURE X.
           02  IMB7044H    PICTURE X.
           02  IMB7044V    PICTURE X.
           02  IMB7044O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7045C    PICTURE X.
           02  IMB7045P    PICTURE X.
           02  IMB7045H    PICTURE X.
           02  IMB7045V    PICTURE X.
           02  IMB7045O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7046C    PICTURE X.
           02  IMB7046P    PICTURE X.
           02  IMB7046H    PICTURE X.
           02  IMB7046V    PICTURE X.
           02  IMB7046O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7047C    PICTURE X.
           02  IMB7047P    PICTURE X.
           02  IMB7047H    PICTURE X.
           02  IMB7047V    PICTURE X.
           02  IMB7047O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7039C    PICTURE X.
           02  IMB7039P    PICTURE X.
           02  IMB7039H    PICTURE X.
           02  IMB7039V    PICTURE X.
           02  IMB7039O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  IMB7040C    PICTURE X.
           02  IMB7040P    PICTURE X.
           02  IMB7040H    PICTURE X.
           02  IMB7040V    PICTURE X.
           02  IMB7040O  PIC X(15).
           02  FILLER PICTURE X(3).
           02  IMB7030C    PICTURE X.
           02  IMB7030P    PICTURE X.
           02  IMB7030H    PICTURE X.
           02  IMB7030V    PICTURE X.
           02  IMB7030O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB7031C    PICTURE X.
           02  IMB7031P    PICTURE X.
           02  IMB7031H    PICTURE X.
           02  IMB7031V    PICTURE X.
           02  IMB7031O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB7032C    PICTURE X.
           02  IMB7032P    PICTURE X.
           02  IMB7032H    PICTURE X.
           02  IMB7032V    PICTURE X.
           02  IMB7032O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMPFS31C    PICTURE X.
           02  IMPFS31P    PICTURE X.
           02  IMPFS31H    PICTURE X.
           02  IMPFS31V    PICTURE X.
           02  IMPFS31O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR31C    PICTURE X.
           02  IMERR31P    PICTURE X.
           02  IMERR31H    PICTURE X.
           02  IMERR31V    PICTURE X.
           02  IMERR31O  PIC X(79).
       01  IMB1M32I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN31L    COMP  PIC  S9(4).
           02  IMTRN31F    PICTURE X.
           02  FILLER REDEFINES IMTRN31F.
             03 IMTRN31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN31I  PIC X(4).
           02  BDATE33L    COMP  PIC  S9(4).
           02  BDATE33F    PICTURE X.
           02  FILLER REDEFINES BDATE33F.
             03 BDATE33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE33I  PIC X(8).
           02  BTIME33L    COMP  PIC  S9(4).
           02  BTIME33F    PICTURE X.
           02  FILLER REDEFINES BTIME33F.
             03 BTIME33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME33I  PIC X(8).
           02  IMPGE33L    COMP  PIC  S9(4).
           02  IMPGE33F    PICTURE X.
           02  FILLER REDEFINES IMPGE33F.
             03 IMPGE33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE33I  PIC X(2).
           02  CTL1033L    COMP  PIC  S9(4).
           02  CTL1033F    PICTURE X.
           02  FILLER REDEFINES CTL1033F.
             03 CTL1033A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1033I  PIC X(2).
           02  CTL2033L    COMP  PIC  S9(4).
           02  CTL2033F    PICTURE X.
           02  FILLER REDEFINES CTL2033F.
             03 CTL2033A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2033I  PIC X(3).
           02  CTL3033L    COMP  PIC  S9(4).
           02  CTL3033F    PICTURE X.
           02  FILLER REDEFINES CTL3033F.
             03 CTL3033A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3033I  PIC X(3).
           02  IMB7127L    COMP  PIC  S9(4).
           02  IMB7127F    PICTURE X.
           02  FILLER REDEFINES IMB7127F.
             03 IMB7127A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7127I  PIC X(7).
           02  IMB7128L    COMP  PIC  S9(4).
           02  IMB7128F    PICTURE X.
           02  FILLER REDEFINES IMB7128F.
             03 IMB7128A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7128I  PIC X(18).
           02  IMB7129L    COMP  PIC  S9(4).
           02  IMB7129F    PICTURE X.
           02  FILLER REDEFINES IMB7129F.
             03 IMB7129A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7129I  PIC X(16).
           02  IMB7130L    COMP  PIC  S9(4).
           02  IMB7130F    PICTURE X.
           02  FILLER REDEFINES IMB7130F.
             03 IMB7130A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7130I  PIC X(16).
           02  IMB7131L    COMP  PIC  S9(4).
           02  IMB7131F    PICTURE X.
           02  FILLER REDEFINES IMB7131F.
             03 IMB7131A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7131I  PIC X(18).
           02  IMB7132L    COMP  PIC  S9(4).
           02  IMB7132F    PICTURE X.
           02  FILLER REDEFINES IMB7132F.
             03 IMB7132A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7132I  PIC X(18).
           02  IMB7133L    COMP  PIC  S9(4).
           02  IMB7133F    PICTURE X.
           02  FILLER REDEFINES IMB7133F.
             03 IMB7133A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7133I  PIC X(16).
           02  IMPFS32L    COMP  PIC  S9(4).
           02  IMPFS32F    PICTURE X.
           02  FILLER REDEFINES IMPFS32F.
             03 IMPFS32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS32I  PIC X(79).
           02  IMERR32L    COMP  PIC  S9(4).
           02  IMERR32F    PICTURE X.
           02  FILLER REDEFINES IMERR32F.
             03 IMERR32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR32I  PIC X(79).
       01  IMB1M32O REDEFINES IMB1M32I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN31C    PICTURE X.
           02  IMTRN31P    PICTURE X.
           02  IMTRN31H    PICTURE X.
           02  IMTRN31V    PICTURE X.
           02  IMTRN31O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE33C    PICTURE X.
           02  BDATE33P    PICTURE X.
           02  BDATE33H    PICTURE X.
           02  BDATE33V    PICTURE X.
           02  BDATE33O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME33C    PICTURE X.
           02  BTIME33P    PICTURE X.
           02  BTIME33H    PICTURE X.
           02  BTIME33V    PICTURE X.
           02  BTIME33O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE33C    PICTURE X.
           02  IMPGE33P    PICTURE X.
           02  IMPGE33H    PICTURE X.
           02  IMPGE33V    PICTURE X.
           02  IMPGE33O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1033C    PICTURE X.
           02  CTL1033P    PICTURE X.
           02  CTL1033H    PICTURE X.
           02  CTL1033V    PICTURE X.
           02  CTL1033O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2033C    PICTURE X.
           02  CTL2033P    PICTURE X.
           02  CTL2033H    PICTURE X.
           02  CTL2033V    PICTURE X.
           02  CTL2033O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3033C    PICTURE X.
           02  CTL3033P    PICTURE X.
           02  CTL3033H    PICTURE X.
           02  CTL3033V    PICTURE X.
           02  CTL3033O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB7127C    PICTURE X.
           02  IMB7127P    PICTURE X.
           02  IMB7127H    PICTURE X.
           02  IMB7127V    PICTURE X.
           02  IMB7127O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7128C    PICTURE X.
           02  IMB7128P    PICTURE X.
           02  IMB7128H    PICTURE X.
           02  IMB7128V    PICTURE X.
           02  IMB7128O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7129C    PICTURE X.
           02  IMB7129P    PICTURE X.
           02  IMB7129H    PICTURE X.
           02  IMB7129V    PICTURE X.
           02  IMB7129O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7130C    PICTURE X.
           02  IMB7130P    PICTURE X.
           02  IMB7130H    PICTURE X.
           02  IMB7130V    PICTURE X.
           02  IMB7130O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7131C    PICTURE X.
           02  IMB7131P    PICTURE X.
           02  IMB7131H    PICTURE X.
           02  IMB7131V    PICTURE X.
           02  IMB7131O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7132C    PICTURE X.
           02  IMB7132P    PICTURE X.
           02  IMB7132H    PICTURE X.
           02  IMB7132V    PICTURE X.
           02  IMB7132O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7133C    PICTURE X.
           02  IMB7133P    PICTURE X.
           02  IMB7133H    PICTURE X.
           02  IMB7133V    PICTURE X.
           02  IMB7133O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMPFS32C    PICTURE X.
           02  IMPFS32P    PICTURE X.
           02  IMPFS32H    PICTURE X.
           02  IMPFS32V    PICTURE X.
           02  IMPFS32O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR32C    PICTURE X.
           02  IMERR32P    PICTURE X.
           02  IMERR32H    PICTURE X.
           02  IMERR32V    PICTURE X.
           02  IMERR32O  PIC X(79).
       01  IMB1M33I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN32L    COMP  PIC  S9(4).
           02  IMTRN32F    PICTURE X.
           02  FILLER REDEFINES IMTRN32F.
             03 IMTRN32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN32I  PIC X(4).
           02  BDATE34L    COMP  PIC  S9(4).
           02  BDATE34F    PICTURE X.
           02  FILLER REDEFINES BDATE34F.
             03 BDATE34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE34I  PIC X(8).
           02  BTIME34L    COMP  PIC  S9(4).
           02  BTIME34F    PICTURE X.
           02  FILLER REDEFINES BTIME34F.
             03 BTIME34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME34I  PIC X(8).
           02  IMPGE34L    COMP  PIC  S9(4).
           02  IMPGE34F    PICTURE X.
           02  FILLER REDEFINES IMPGE34F.
             03 IMPGE34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE34I  PIC X(2).
           02  CTL1034L    COMP  PIC  S9(4).
           02  CTL1034F    PICTURE X.
           02  FILLER REDEFINES CTL1034F.
             03 CTL1034A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1034I  PIC X(2).
           02  CTL2034L    COMP  PIC  S9(4).
           02  CTL2034F    PICTURE X.
           02  FILLER REDEFINES CTL2034F.
             03 CTL2034A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2034I  PIC X(3).
           02  CTL3034L    COMP  PIC  S9(4).
           02  CTL3034F    PICTURE X.
           02  FILLER REDEFINES CTL3034F.
             03 CTL3034A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3034I  PIC X(3).
           02  IMB7073L    COMP  PIC  S9(4).
           02  IMB7073F    PICTURE X.
           02  FILLER REDEFINES IMB7073F.
             03 IMB7073A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7073I  PIC X(7).
           02  IMB7074L    COMP  PIC  S9(4).
           02  IMB7074F    PICTURE X.
           02  FILLER REDEFINES IMB7074F.
             03 IMB7074A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7074I  PIC X(18).
           02  IMB7082L    COMP  PIC  S9(4).
           02  IMB7082F    PICTURE X.
           02  FILLER REDEFINES IMB7082F.
             03 IMB7082A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7082I  PIC X(5).
           02  IMB7083L    COMP  PIC  S9(4).
           02  IMB7083F    PICTURE X.
           02  FILLER REDEFINES IMB7083F.
             03 IMB7083A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7083I  PIC X(16).
           02  IMB7084L    COMP  PIC  S9(4).
           02  IMB7084F    PICTURE X.
           02  FILLER REDEFINES IMB7084F.
             03 IMB7084A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7084I  PIC X(5).
           02  IMB7085L    COMP  PIC  S9(4).
           02  IMB7085F    PICTURE X.
           02  FILLER REDEFINES IMB7085F.
             03 IMB7085A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7085I  PIC X(16).
           02  IMB7081L    COMP  PIC  S9(4).
           02  IMB7081F    PICTURE X.
           02  FILLER REDEFINES IMB7081F.
             03 IMB7081A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7081I  PIC X(18).
           02  IMB7091L    COMP  PIC  S9(4).
           02  IMB7091F    PICTURE X.
           02  FILLER REDEFINES IMB7091F.
             03 IMB7091A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7091I  PIC X(16).
           02  IMB7079L    COMP  PIC  S9(4).
           02  IMB7079F    PICTURE X.
           02  FILLER REDEFINES IMB7079F.
             03 IMB7079A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7079I  PIC X(16).
           02  IMB7076L    COMP  PIC  S9(4).
           02  IMB7076F    PICTURE X.
           02  FILLER REDEFINES IMB7076F.
             03 IMB7076A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7076I  PIC X(16).
           02  IMB7077L    COMP  PIC  S9(4).
           02  IMB7077F    PICTURE X.
           02  FILLER REDEFINES IMB7077F.
             03 IMB7077A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7077I  PIC X(16).
           02  IMB7078L    COMP  PIC  S9(4).
           02  IMB7078F    PICTURE X.
           02  FILLER REDEFINES IMB7078F.
             03 IMB7078A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7078I  PIC X(16).
           02  IMB7075L    COMP  PIC  S9(4).
           02  IMB7075F    PICTURE X.
           02  FILLER REDEFINES IMB7075F.
             03 IMB7075A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7075I  PIC X(16).
           02  IMB7080L    COMP  PIC  S9(4).
           02  IMB7080F    PICTURE X.
           02  FILLER REDEFINES IMB7080F.
             03 IMB7080A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7080I  PIC X(16).
           02  IMB7086L    COMP  PIC  S9(4).
           02  IMB7086F    PICTURE X.
           02  FILLER REDEFINES IMB7086F.
             03 IMB7086A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7086I  PIC X(18).
           02  IMB7087L    COMP  PIC  S9(4).
           02  IMB7087F    PICTURE X.
           02  FILLER REDEFINES IMB7087F.
             03 IMB7087A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7087I  PIC X(18).
           02  IMB7088L    COMP  PIC  S9(4).
           02  IMB7088F    PICTURE X.
           02  FILLER REDEFINES IMB7088F.
             03 IMB7088A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7088I  PIC X(16).
           02  IMB7089L    COMP  PIC  S9(4).
           02  IMB7089F    PICTURE X.
           02  FILLER REDEFINES IMB7089F.
             03 IMB7089A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7089I  PIC X(16).
           02  IMB7090L    COMP  PIC  S9(4).
           02  IMB7090F    PICTURE X.
           02  FILLER REDEFINES IMB7090F.
             03 IMB7090A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7090I  PIC X(18).
           02  IMPFS33L    COMP  PIC  S9(4).
           02  IMPFS33F    PICTURE X.
           02  FILLER REDEFINES IMPFS33F.
             03 IMPFS33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS33I  PIC X(79).
           02  IMERR33L    COMP  PIC  S9(4).
           02  IMERR33F    PICTURE X.
           02  FILLER REDEFINES IMERR33F.
             03 IMERR33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR33I  PIC X(79).
       01  IMB1M33O REDEFINES IMB1M33I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN32C    PICTURE X.
           02  IMTRN32P    PICTURE X.
           02  IMTRN32H    PICTURE X.
           02  IMTRN32V    PICTURE X.
           02  IMTRN32O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE34C    PICTURE X.
           02  BDATE34P    PICTURE X.
           02  BDATE34H    PICTURE X.
           02  BDATE34V    PICTURE X.
           02  BDATE34O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME34C    PICTURE X.
           02  BTIME34P    PICTURE X.
           02  BTIME34H    PICTURE X.
           02  BTIME34V    PICTURE X.
           02  BTIME34O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE34C    PICTURE X.
           02  IMPGE34P    PICTURE X.
           02  IMPGE34H    PICTURE X.
           02  IMPGE34V    PICTURE X.
           02  IMPGE34O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1034C    PICTURE X.
           02  CTL1034P    PICTURE X.
           02  CTL1034H    PICTURE X.
           02  CTL1034V    PICTURE X.
           02  CTL1034O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2034C    PICTURE X.
           02  CTL2034P    PICTURE X.
           02  CTL2034H    PICTURE X.
           02  CTL2034V    PICTURE X.
           02  CTL2034O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3034C    PICTURE X.
           02  CTL3034P    PICTURE X.
           02  CTL3034H    PICTURE X.
           02  CTL3034V    PICTURE X.
           02  CTL3034O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB7073C    PICTURE X.
           02  IMB7073P    PICTURE X.
           02  IMB7073H    PICTURE X.
           02  IMB7073V    PICTURE X.
           02  IMB7073O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7074C    PICTURE X.
           02  IMB7074P    PICTURE X.
           02  IMB7074H    PICTURE X.
           02  IMB7074V    PICTURE X.
           02  IMB7074O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7082C    PICTURE X.
           02  IMB7082P    PICTURE X.
           02  IMB7082H    PICTURE X.
           02  IMB7082V    PICTURE X.
           02  IMB7082O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB7083C    PICTURE X.
           02  IMB7083P    PICTURE X.
           02  IMB7083H    PICTURE X.
           02  IMB7083V    PICTURE X.
           02  IMB7083O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7084C    PICTURE X.
           02  IMB7084P    PICTURE X.
           02  IMB7084H    PICTURE X.
           02  IMB7084V    PICTURE X.
           02  IMB7084O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB7085C    PICTURE X.
           02  IMB7085P    PICTURE X.
           02  IMB7085H    PICTURE X.
           02  IMB7085V    PICTURE X.
           02  IMB7085O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7081C    PICTURE X.
           02  IMB7081P    PICTURE X.
           02  IMB7081H    PICTURE X.
           02  IMB7081V    PICTURE X.
           02  IMB7081O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7091C    PICTURE X.
           02  IMB7091P    PICTURE X.
           02  IMB7091H    PICTURE X.
           02  IMB7091V    PICTURE X.
           02  IMB7091O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7079C    PICTURE X.
           02  IMB7079P    PICTURE X.
           02  IMB7079H    PICTURE X.
           02  IMB7079V    PICTURE X.
           02  IMB7079O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7076C    PICTURE X.
           02  IMB7076P    PICTURE X.
           02  IMB7076H    PICTURE X.
           02  IMB7076V    PICTURE X.
           02  IMB7076O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7077C    PICTURE X.
           02  IMB7077P    PICTURE X.
           02  IMB7077H    PICTURE X.
           02  IMB7077V    PICTURE X.
           02  IMB7077O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7078C    PICTURE X.
           02  IMB7078P    PICTURE X.
           02  IMB7078H    PICTURE X.
           02  IMB7078V    PICTURE X.
           02  IMB7078O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7075C    PICTURE X.
           02  IMB7075P    PICTURE X.
           02  IMB7075H    PICTURE X.
           02  IMB7075V    PICTURE X.
           02  IMB7075O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7080C    PICTURE X.
           02  IMB7080P    PICTURE X.
           02  IMB7080H    PICTURE X.
           02  IMB7080V    PICTURE X.
           02  IMB7080O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7086C    PICTURE X.
           02  IMB7086P    PICTURE X.
           02  IMB7086H    PICTURE X.
           02  IMB7086V    PICTURE X.
           02  IMB7086O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7087C    PICTURE X.
           02  IMB7087P    PICTURE X.
           02  IMB7087H    PICTURE X.
           02  IMB7087V    PICTURE X.
           02  IMB7087O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7088C    PICTURE X.
           02  IMB7088P    PICTURE X.
           02  IMB7088H    PICTURE X.
           02  IMB7088V    PICTURE X.
           02  IMB7088O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7089C    PICTURE X.
           02  IMB7089P    PICTURE X.
           02  IMB7089H    PICTURE X.
           02  IMB7089V    PICTURE X.
           02  IMB7089O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7090C    PICTURE X.
           02  IMB7090P    PICTURE X.
           02  IMB7090H    PICTURE X.
           02  IMB7090V    PICTURE X.
           02  IMB7090O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMPFS33C    PICTURE X.
           02  IMPFS33P    PICTURE X.
           02  IMPFS33H    PICTURE X.
           02  IMPFS33V    PICTURE X.
           02  IMPFS33O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR33C    PICTURE X.
           02  IMERR33P    PICTURE X.
           02  IMERR33H    PICTURE X.
           02  IMERR33V    PICTURE X.
           02  IMERR33O  PIC X(79).
       01  IMB1M34I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN33L    COMP  PIC  S9(4).
           02  IMTRN33F    PICTURE X.
           02  FILLER REDEFINES IMTRN33F.
             03 IMTRN33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN33I  PIC X(4).
           02  BDATE35L    COMP  PIC  S9(4).
           02  BDATE35F    PICTURE X.
           02  FILLER REDEFINES BDATE35F.
             03 BDATE35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE35I  PIC X(8).
           02  BTIME35L    COMP  PIC  S9(4).
           02  BTIME35F    PICTURE X.
           02  FILLER REDEFINES BTIME35F.
             03 BTIME35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME35I  PIC X(8).
           02  IMPGE35L    COMP  PIC  S9(4).
           02  IMPGE35F    PICTURE X.
           02  FILLER REDEFINES IMPGE35F.
             03 IMPGE35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE35I  PIC X(2).
           02  CTL1035L    COMP  PIC  S9(4).
           02  CTL1035F    PICTURE X.
           02  FILLER REDEFINES CTL1035F.
             03 CTL1035A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1035I  PIC X(2).
           02  CTL2035L    COMP  PIC  S9(4).
           02  CTL2035F    PICTURE X.
           02  FILLER REDEFINES CTL2035F.
             03 CTL2035A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2035I  PIC X(3).
           02  CTL3035L    COMP  PIC  S9(4).
           02  CTL3035F    PICTURE X.
           02  FILLER REDEFINES CTL3035F.
             03 CTL3035A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3035I  PIC X(3).
           02  IMB7099L    COMP  PIC  S9(4).
           02  IMB7099F    PICTURE X.
           02  FILLER REDEFINES IMB7099F.
             03 IMB7099A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7099I  PIC X(7).
           02  IMB7100L    COMP  PIC  S9(4).
           02  IMB7100F    PICTURE X.
           02  FILLER REDEFINES IMB7100F.
             03 IMB7100A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7100I  PIC X(18).
           02  IMB7101L    COMP  PIC  S9(4).
           02  IMB7101F    PICTURE X.
           02  FILLER REDEFINES IMB7101F.
             03 IMB7101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7101I  PIC X(16).
           02  IMB7102L    COMP  PIC  S9(4).
           02  IMB7102F    PICTURE X.
           02  FILLER REDEFINES IMB7102F.
             03 IMB7102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7102I  PIC X(16).
           02  IMB7103L    COMP  PIC  S9(4).
           02  IMB7103F    PICTURE X.
           02  FILLER REDEFINES IMB7103F.
             03 IMB7103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7103I  PIC X(18).
           02  IMB7104L    COMP  PIC  S9(4).
           02  IMB7104F    PICTURE X.
           02  FILLER REDEFINES IMB7104F.
             03 IMB7104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7104I  PIC X(18).
           02  IMB7105L    COMP  PIC  S9(4).
           02  IMB7105F    PICTURE X.
           02  FILLER REDEFINES IMB7105F.
             03 IMB7105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7105I  PIC X(16).
           02  IMPFS34L    COMP  PIC  S9(4).
           02  IMPFS34F    PICTURE X.
           02  FILLER REDEFINES IMPFS34F.
             03 IMPFS34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS34I  PIC X(79).
           02  IMERR34L    COMP  PIC  S9(4).
           02  IMERR34F    PICTURE X.
           02  FILLER REDEFINES IMERR34F.
             03 IMERR34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR34I  PIC X(79).
       01  IMB1M34O REDEFINES IMB1M34I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN33C    PICTURE X.
           02  IMTRN33P    PICTURE X.
           02  IMTRN33H    PICTURE X.
           02  IMTRN33V    PICTURE X.
           02  IMTRN33O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE35C    PICTURE X.
           02  BDATE35P    PICTURE X.
           02  BDATE35H    PICTURE X.
           02  BDATE35V    PICTURE X.
           02  BDATE35O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME35C    PICTURE X.
           02  BTIME35P    PICTURE X.
           02  BTIME35H    PICTURE X.
           02  BTIME35V    PICTURE X.
           02  BTIME35O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE35C    PICTURE X.
           02  IMPGE35P    PICTURE X.
           02  IMPGE35H    PICTURE X.
           02  IMPGE35V    PICTURE X.
           02  IMPGE35O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1035C    PICTURE X.
           02  CTL1035P    PICTURE X.
           02  CTL1035H    PICTURE X.
           02  CTL1035V    PICTURE X.
           02  CTL1035O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2035C    PICTURE X.
           02  CTL2035P    PICTURE X.
           02  CTL2035H    PICTURE X.
           02  CTL2035V    PICTURE X.
           02  CTL2035O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3035C    PICTURE X.
           02  CTL3035P    PICTURE X.
           02  CTL3035H    PICTURE X.
           02  CTL3035V    PICTURE X.
           02  CTL3035O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB7099C    PICTURE X.
           02  IMB7099P    PICTURE X.
           02  IMB7099H    PICTURE X.
           02  IMB7099V    PICTURE X.
           02  IMB7099O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7100C    PICTURE X.
           02  IMB7100P    PICTURE X.
           02  IMB7100H    PICTURE X.
           02  IMB7100V    PICTURE X.
           02  IMB7100O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7101C    PICTURE X.
           02  IMB7101P    PICTURE X.
           02  IMB7101H    PICTURE X.
           02  IMB7101V    PICTURE X.
           02  IMB7101O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7102C    PICTURE X.
           02  IMB7102P    PICTURE X.
           02  IMB7102H    PICTURE X.
           02  IMB7102V    PICTURE X.
           02  IMB7102O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMB7103C    PICTURE X.
           02  IMB7103P    PICTURE X.
           02  IMB7103H    PICTURE X.
           02  IMB7103V    PICTURE X.
           02  IMB7103O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7104C    PICTURE X.
           02  IMB7104P    PICTURE X.
           02  IMB7104H    PICTURE X.
           02  IMB7104V    PICTURE X.
           02  IMB7104O  PIC X(18).
           02  FILLER PICTURE X(3).
           02  IMB7105C    PICTURE X.
           02  IMB7105P    PICTURE X.
           02  IMB7105H    PICTURE X.
           02  IMB7105V    PICTURE X.
           02  IMB7105O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMPFS34C    PICTURE X.
           02  IMPFS34P    PICTURE X.
           02  IMPFS34H    PICTURE X.
           02  IMPFS34V    PICTURE X.
           02  IMPFS34O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR34C    PICTURE X.
           02  IMERR34P    PICTURE X.
           02  IMERR34H    PICTURE X.
           02  IMERR34V    PICTURE X.
           02  IMERR34O  PIC X(79).
       01  IMB1M35I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN34L    COMP  PIC  S9(4).
           02  IMTRN34F    PICTURE X.
           02  FILLER REDEFINES IMTRN34F.
             03 IMTRN34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN34I  PIC X(4).
           02  BDATE36L    COMP  PIC  S9(4).
           02  BDATE36F    PICTURE X.
           02  FILLER REDEFINES BDATE36F.
             03 BDATE36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE36I  PIC X(8).
           02  BTIME36L    COMP  PIC  S9(4).
           02  BTIME36F    PICTURE X.
           02  FILLER REDEFINES BTIME36F.
             03 BTIME36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME36I  PIC X(8).
           02  IMPGE36L    COMP  PIC  S9(4).
           02  IMPGE36F    PICTURE X.
           02  FILLER REDEFINES IMPGE36F.
             03 IMPGE36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE36I  PIC X(2).
           02  CTL1036L    COMP  PIC  S9(4).
           02  CTL1036F    PICTURE X.
           02  FILLER REDEFINES CTL1036F.
             03 CTL1036A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1036I  PIC X(2).
           02  CTL2036L    COMP  PIC  S9(4).
           02  CTL2036F    PICTURE X.
           02  FILLER REDEFINES CTL2036F.
             03 CTL2036A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2036I  PIC X(3).
           02  CTL3036L    COMP  PIC  S9(4).
           02  CTL3036F    PICTURE X.
           02  FILLER REDEFINES CTL3036F.
             03 CTL3036A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3036I  PIC X(3).
           02  IMB7111L    COMP  PIC  S9(4).
           02  IMB7111F    PICTURE X.
           02  FILLER REDEFINES IMB7111F.
             03 IMB7111A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7111I  PIC X(11).
           02  IMB7112L    COMP  PIC  S9(4).
           02  IMB7112F    PICTURE X.
           02  FILLER REDEFINES IMB7112F.
             03 IMB7112A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7112I  PIC X(7).
           02  IMB7113L    COMP  PIC  S9(4).
           02  IMB7113F    PICTURE X.
           02  FILLER REDEFINES IMB7113F.
             03 IMB7113A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7113I  PIC X(7).
           02  IMB7114L    COMP  PIC  S9(4).
           02  IMB7114F    PICTURE X.
           02  FILLER REDEFINES IMB7114F.
             03 IMB7114A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7114I  PIC X(11).
           02  IMB7115L    COMP  PIC  S9(4).
           02  IMB7115F    PICTURE X.
           02  FILLER REDEFINES IMB7115F.
             03 IMB7115A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7115I  PIC X(5).
           02  IMB7051L    COMP  PIC  S9(4).
           02  IMB7051F    PICTURE X.
           02  FILLER REDEFINES IMB7051F.
             03 IMB7051A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7051I  PIC X(7).
           02  IMB7053L    COMP  PIC  S9(4).
           02  IMB7053F    PICTURE X.
           02  FILLER REDEFINES IMB7053F.
             03 IMB7053A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7053I  PIC X(7).
           02  IMB7116L    COMP  PIC  S9(4).
           02  IMB7116F    PICTURE X.
           02  FILLER REDEFINES IMB7116F.
             03 IMB7116A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7116I  PIC X(11).
           02  IMB7117L    COMP  PIC  S9(4).
           02  IMB7117F    PICTURE X.
           02  FILLER REDEFINES IMB7117F.
             03 IMB7117A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7117I  PIC X(9).
           02  IMB7118L    COMP  PIC  S9(4).
           02  IMB7118F    PICTURE X.
           02  FILLER REDEFINES IMB7118F.
             03 IMB7118A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7118I  PIC X(9).
           02  IMB7119L    COMP  PIC  S9(4).
           02  IMB7119F    PICTURE X.
           02  FILLER REDEFINES IMB7119F.
             03 IMB7119A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB7119I  PIC X(11).
           02  IMPFS35L    COMP  PIC  S9(4).
           02  IMPFS35F    PICTURE X.
           02  FILLER REDEFINES IMPFS35F.
             03 IMPFS35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS35I  PIC X(79).
           02  IMERR35L    COMP  PIC  S9(4).
           02  IMERR35F    PICTURE X.
           02  FILLER REDEFINES IMERR35F.
             03 IMERR35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR35I  PIC X(79).
       01  IMB1M35O REDEFINES IMB1M35I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN34C    PICTURE X.
           02  IMTRN34P    PICTURE X.
           02  IMTRN34H    PICTURE X.
           02  IMTRN34V    PICTURE X.
           02  IMTRN34O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE36C    PICTURE X.
           02  BDATE36P    PICTURE X.
           02  BDATE36H    PICTURE X.
           02  BDATE36V    PICTURE X.
           02  BDATE36O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME36C    PICTURE X.
           02  BTIME36P    PICTURE X.
           02  BTIME36H    PICTURE X.
           02  BTIME36V    PICTURE X.
           02  BTIME36O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE36C    PICTURE X.
           02  IMPGE36P    PICTURE X.
           02  IMPGE36H    PICTURE X.
           02  IMPGE36V    PICTURE X.
           02  IMPGE36O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1036C    PICTURE X.
           02  CTL1036P    PICTURE X.
           02  CTL1036H    PICTURE X.
           02  CTL1036V    PICTURE X.
           02  CTL1036O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2036C    PICTURE X.
           02  CTL2036P    PICTURE X.
           02  CTL2036H    PICTURE X.
           02  CTL2036V    PICTURE X.
           02  CTL2036O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3036C    PICTURE X.
           02  CTL3036P    PICTURE X.
           02  CTL3036H    PICTURE X.
           02  CTL3036V    PICTURE X.
           02  CTL3036O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB7111C    PICTURE X.
           02  IMB7111P    PICTURE X.
           02  IMB7111H    PICTURE X.
           02  IMB7111V    PICTURE X.
           02  IMB7111O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  IMB7112C    PICTURE X.
           02  IMB7112P    PICTURE X.
           02  IMB7112H    PICTURE X.
           02  IMB7112V    PICTURE X.
           02  IMB7112O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7113C    PICTURE X.
           02  IMB7113P    PICTURE X.
           02  IMB7113H    PICTURE X.
           02  IMB7113V    PICTURE X.
           02  IMB7113O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7114C    PICTURE X.
           02  IMB7114P    PICTURE X.
           02  IMB7114H    PICTURE X.
           02  IMB7114V    PICTURE X.
           02  IMB7114O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  IMB7115C    PICTURE X.
           02  IMB7115P    PICTURE X.
           02  IMB7115H    PICTURE X.
           02  IMB7115V    PICTURE X.
           02  IMB7115O  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMB7051C    PICTURE X.
           02  IMB7051P    PICTURE X.
           02  IMB7051H    PICTURE X.
           02  IMB7051V    PICTURE X.
           02  IMB7051O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7053C    PICTURE X.
           02  IMB7053P    PICTURE X.
           02  IMB7053H    PICTURE X.
           02  IMB7053V    PICTURE X.
           02  IMB7053O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  IMB7116C    PICTURE X.
           02  IMB7116P    PICTURE X.
           02  IMB7116H    PICTURE X.
           02  IMB7116V    PICTURE X.
           02  IMB7116O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  IMB7117C    PICTURE X.
           02  IMB7117P    PICTURE X.
           02  IMB7117H    PICTURE X.
           02  IMB7117V    PICTURE X.
           02  IMB7117O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  IMB7118C    PICTURE X.
           02  IMB7118P    PICTURE X.
           02  IMB7118H    PICTURE X.
           02  IMB7118V    PICTURE X.
           02  IMB7118O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  IMB7119C    PICTURE X.
           02  IMB7119P    PICTURE X.
           02  IMB7119H    PICTURE X.
           02  IMB7119V    PICTURE X.
           02  IMB7119O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  IMPFS35C    PICTURE X.
           02  IMPFS35P    PICTURE X.
           02  IMPFS35H    PICTURE X.
           02  IMPFS35V    PICTURE X.
           02  IMPFS35O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR35C    PICTURE X.
           02  IMERR35P    PICTURE X.
           02  IMERR35H    PICTURE X.
           02  IMERR35V    PICTURE X.
           02  IMERR35O  PIC X(79).
       01  IMB1M36I REDEFINES IMB1M23I.
           02  FILLER PIC X(12).
           02  IMTRN35L    COMP  PIC  S9(4).
           02  IMTRN35F    PICTURE X.
           02  FILLER REDEFINES IMTRN35F.
             03 IMTRN35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN35I  PIC X(4).
           02  BDATE37L    COMP  PIC  S9(4).
           02  BDATE37F    PICTURE X.
           02  FILLER REDEFINES BDATE37F.
             03 BDATE37A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BDATE37I  PIC X(8).
           02  BTIME37L    COMP  PIC  S9(4).
           02  BTIME37F    PICTURE X.
           02  FILLER REDEFINES BTIME37F.
             03 BTIME37A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BTIME37I  PIC X(8).
           02  IMPGE37L    COMP  PIC  S9(4).
           02  IMPGE37F    PICTURE X.
           02  FILLER REDEFINES IMPGE37F.
             03 IMPGE37A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGE37I  PIC X(2).
           02  CTL1037L    COMP  PIC  S9(4).
           02  CTL1037F    PICTURE X.
           02  FILLER REDEFINES CTL1037F.
             03 CTL1037A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1037I  PIC X(2).
           02  CTL2037L    COMP  PIC  S9(4).
           02  CTL2037F    PICTURE X.
           02  FILLER REDEFINES CTL2037F.
             03 CTL2037A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2037I  PIC X(3).
           02  CTL3037L    COMP  PIC  S9(4).
           02  CTL3037F    PICTURE X.
           02  FILLER REDEFINES CTL3037F.
             03 CTL3037A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3037I  PIC X(3).
           02  B2022D1L    COMP  PIC  S9(4).
           02  B2022D1F    PICTURE X.
           02  FILLER REDEFINES B2022D1F.
             03 B2022D1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2022D1I  PIC X(2).
           02  B2022D2L    COMP  PIC  S9(4).
           02  B2022D2F    PICTURE X.
           02  FILLER REDEFINES B2022D2F.
             03 B2022D2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2022D2I  PIC X(2).
           02  B2022D3L    COMP  PIC  S9(4).
           02  B2022D3F    PICTURE X.
           02  FILLER REDEFINES B2022D3F.
             03 B2022D3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2022D3I  PIC X(2).
           02  B2022D4L    COMP  PIC  S9(4).
           02  B2022D4F    PICTURE X.
           02  FILLER REDEFINES B2022D4F.
             03 B2022D4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2022D4I  PIC X(2).
           02  B2022D5L    COMP  PIC  S9(4).
           02  B2022D5F    PICTURE X.
           02  FILLER REDEFINES B2022D5F.
             03 B2022D5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2022D5I  PIC X(2).
           02  B2022D6L    COMP  PIC  S9(4).
           02  B2022D6F    PICTURE X.
           02  FILLER REDEFINES B2022D6F.
             03 B2022D6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2022D6I  PIC X(2).
           02  B2022D7L    COMP  PIC  S9(4).
           02  B2022D7F    PICTURE X.
           02  FILLER REDEFINES B2022D7F.
             03 B2022D7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2022D7I  PIC X(2).
           02  B2022D8L    COMP  PIC  S9(4).
           02  B2022D8F    PICTURE X.
           02  FILLER REDEFINES B2022D8F.
             03 B2022D8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2022D8I  PIC X(2).
           02  B2023D1L    COMP  PIC  S9(4).
           02  B2023D1F    PICTURE X.
           02  FILLER REDEFINES B2023D1F.
             03 B2023D1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2023D1I  PIC X(2).
           02  B2023D2L    COMP  PIC  S9(4).
           02  B2023D2F    PICTURE X.
           02  FILLER REDEFINES B2023D2F.
             03 B2023D2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2023D2I  PIC X(2).
           02  B2023D3L    COMP  PIC  S9(4).
           02  B2023D3F    PICTURE X.
           02  FILLER REDEFINES B2023D3F.
             03 B2023D3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2023D3I  PIC X(2).
           02  B2023D4L    COMP  PIC  S9(4).
           02  B2023D4F    PICTURE X.
           02  FILLER REDEFINES B2023D4F.
             03 B2023D4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2023D4I  PIC X(2).
           02  B2023D5L    COMP  PIC  S9(4).
           02  B2023D5F    PICTURE X.
           02  FILLER REDEFINES B2023D5F.
             03 B2023D5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2023D5I  PIC X(2).
           02  B2023D6L    COMP  PIC  S9(4).
           02  B2023D6F    PICTURE X.
           02  FILLER REDEFINES B2023D6F.
             03 B2023D6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2023D6I  PIC X(2).
           02  B2024D1L    COMP  PIC  S9(4).
           02  B2024D1F    PICTURE X.
           02  FILLER REDEFINES B2024D1F.
             03 B2024D1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2024D1I  PIC X(1).
           02  B2024D2L    COMP  PIC  S9(4).
           02  B2024D2F    PICTURE X.
           02  FILLER REDEFINES B2024D2F.
             03 B2024D2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2024D2I  PIC X(1).
           02  B2024D3L    COMP  PIC  S9(4).
           02  B2024D3F    PICTURE X.
           02  FILLER REDEFINES B2024D3F.
             03 B2024D3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2024D3I  PIC X(1).
           02  B2024D4L    COMP  PIC  S9(4).
           02  B2024D4F    PICTURE X.
           02  FILLER REDEFINES B2024D4F.
             03 B2024D4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2024D4I  PIC X(1).
           02  B2024D5L    COMP  PIC  S9(4).
           02  B2024D5F    PICTURE X.
           02  FILLER REDEFINES B2024D5F.
             03 B2024D5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2024D5I  PIC X(1).
           02  B2024D6L    COMP  PIC  S9(4).
           02  B2024D6F    PICTURE X.
           02  FILLER REDEFINES B2024D6F.
             03 B2024D6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2024D6I  PIC X(1).
           02  B2025D1L    COMP  PIC  S9(4).
           02  B2025D1F    PICTURE X.
           02  FILLER REDEFINES B2025D1F.
             03 B2025D1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2025D1I  PIC X(1).
           02  B2025D2L    COMP  PIC  S9(4).
           02  B2025D2F    PICTURE X.
           02  FILLER REDEFINES B2025D2F.
             03 B2025D2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2025D2I  PIC X(1).
           02  B2025D3L    COMP  PIC  S9(4).
           02  B2025D3F    PICTURE X.
           02  FILLER REDEFINES B2025D3F.
             03 B2025D3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2025D3I  PIC X(1).
           02  B2025D4L    COMP  PIC  S9(4).
           02  B2025D4F    PICTURE X.
           02  FILLER REDEFINES B2025D4F.
             03 B2025D4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2025D4I  PIC X(1).
           02  B2025D5L    COMP  PIC  S9(4).
           02  B2025D5F    PICTURE X.
           02  FILLER REDEFINES B2025D5F.
             03 B2025D5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2025D5I  PIC X(1).
           02  B2025D6L    COMP  PIC  S9(4).
           02  B2025D6F    PICTURE X.
           02  FILLER REDEFINES B2025D6F.
             03 B2025D6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  B2025D6I  PIC X(1).
           02  IMB1257L    COMP  PIC  S9(4).
           02  IMB1257F    PICTURE X.
           02  FILLER REDEFINES IMB1257F.
             03 IMB1257A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1257I  PIC X(1).
           02  IME1257L    COMP  PIC  S9(4).
           02  IME1257F    PICTURE X.
           02  FILLER REDEFINES IME1257F.
             03 IME1257A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1257I  PIC X(4).
           02  IMB1256L    COMP  PIC  S9(4).
           02  IMB1256F    PICTURE X.
           02  FILLER REDEFINES IMB1256F.
             03 IMB1256A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1256I  PIC X(1).
           02  IME1256L    COMP  PIC  S9(4).
           02  IME1256F    PICTURE X.
           02  FILLER REDEFINES IME1256F.
             03 IME1256A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1256I  PIC X(4).
           02  IMB1258L    COMP  PIC  S9(4).
           02  IMB1258F    PICTURE X.
           02  FILLER REDEFINES IMB1258F.
             03 IMB1258A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1258I  PIC X(1).
           02  IME1258L    COMP  PIC  S9(4).
           02  IME1258F    PICTURE X.
           02  FILLER REDEFINES IME1258F.
             03 IME1258A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1258I  PIC X(4).
           02  IMB1259L    COMP  PIC  S9(4).
           02  IMB1259F    PICTURE X.
           02  FILLER REDEFINES IMB1259F.
             03 IMB1259A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1259I  PIC X(1).
           02  IME1259L    COMP  PIC  S9(4).
           02  IME1259F    PICTURE X.
           02  FILLER REDEFINES IME1259F.
             03 IME1259A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1259I  PIC X(4).
           02  IMB1261L    COMP  PIC  S9(4).
           02  IMB1261F    PICTURE X.
           02  FILLER REDEFINES IMB1261F.
             03 IMB1261A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1261I  PIC X(1).
           02  IME1261L    COMP  PIC  S9(4).
           02  IME1261F    PICTURE X.
           02  FILLER REDEFINES IME1261F.
             03 IME1261A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1261I  PIC X(4).
           02  IMB1260L    COMP  PIC  S9(4).
           02  IMB1260F    PICTURE X.
           02  FILLER REDEFINES IMB1260F.
             03 IMB1260A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1260I  PIC X(1).
           02  IME1260L    COMP  PIC  S9(4).
           02  IME1260F    PICTURE X.
           02  FILLER REDEFINES IME1260F.
             03 IME1260A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1260I  PIC X(4).
           02  IMB1262L    COMP  PIC  S9(4).
           02  IMB1262F    PICTURE X.
           02  FILLER REDEFINES IMB1262F.
             03 IMB1262A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1262I  PIC X(1).
           02  IME1262L    COMP  PIC  S9(4).
           02  IME1262F    PICTURE X.
           02  FILLER REDEFINES IME1262F.
             03 IME1262A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1262I  PIC X(3).
           02  IMB4015L    COMP  PIC  S9(4).
           02  IMB4015F    PICTURE X.
           02  FILLER REDEFINES IMB4015F.
             03 IMB4015A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4015I  PIC X(11).
           02  IMB1136L    COMP  PIC  S9(4).
           02  IMB1136F    PICTURE X.
           02  FILLER REDEFINES IMB1136F.
             03 IMB1136A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1136I  PIC X(1).
           02  IME1136L    COMP  PIC  S9(4).
           02  IME1136F    PICTURE X.
           02  FILLER REDEFINES IME1136F.
             03 IME1136A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IME1136I  PIC X(9).
           02  IMB1137L    COMP  PIC  S9(4).
           02  IMB1137F    PICTURE X.
           02  FILLER REDEFINES IMB1137F.
             03 IMB1137A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB1137I  PIC X(14).
           02  IMB5025L    COMP  PIC  S9(4).
           02  IMB5025F    PICTURE X.
           02  FILLER REDEFINES IMB5025F.
             03 IMB5025A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5025I  PIC X(4).
           02  IMB5026L    COMP  PIC  S9(4).
           02  IMB5026F    PICTURE X.
           02  FILLER REDEFINES IMB5026F.
             03 IMB5026A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5026I  PIC X(4).
           02  IMB5023L    COMP  PIC  S9(4).
           02  IMB5023F    PICTURE X.
           02  FILLER REDEFINES IMB5023F.
             03 IMB5023A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5023I  PIC X(4).
           02  IMB5024L    COMP  PIC  S9(4).
           02  IMB5024F    PICTURE X.
           02  FILLER REDEFINES IMB5024F.
             03 IMB5024A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB5024I  PIC X(4).
           02  IMB4147L    COMP  PIC  S9(4).
           02  IMB4147F    PICTURE X.
           02  FILLER REDEFINES IMB4147F.
             03 IMB4147A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4147I  PIC X(4).
           02  IMB4148L    COMP  PIC  S9(4).
           02  IMB4148F    PICTURE X.
           02  FILLER REDEFINES IMB4148F.
             03 IMB4148A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4148I  PIC X(4).
           02  IMB4149L    COMP  PIC  S9(4).
           02  IMB4149F    PICTURE X.
           02  FILLER REDEFINES IMB4149F.
             03 IMB4149A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4149I  PIC X(4).
           02  IMB4150L    COMP  PIC  S9(4).
           02  IMB4150F    PICTURE X.
           02  FILLER REDEFINES IMB4150F.
             03 IMB4150A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMB4150I  PIC X(4).
           02  IMPFS36L    COMP  PIC  S9(4).
           02  IMPFS36F    PICTURE X.
           02  FILLER REDEFINES IMPFS36F.
             03 IMPFS36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS36I  PIC X(79).
           02  IMERR36L    COMP  PIC  S9(4).
           02  IMERR36F    PICTURE X.
           02  FILLER REDEFINES IMERR36F.
             03 IMERR36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR36I  PIC X(79).
       01  IMB1M36O REDEFINES IMB1M36I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN35C    PICTURE X.
           02  IMTRN35P    PICTURE X.
           02  IMTRN35H    PICTURE X.
           02  IMTRN35V    PICTURE X.
           02  IMTRN35O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  BDATE37C    PICTURE X.
           02  BDATE37P    PICTURE X.
           02  BDATE37H    PICTURE X.
           02  BDATE37V    PICTURE X.
           02  BDATE37O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BTIME37C    PICTURE X.
           02  BTIME37P    PICTURE X.
           02  BTIME37H    PICTURE X.
           02  BTIME37V    PICTURE X.
           02  BTIME37O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMPGE37C    PICTURE X.
           02  IMPGE37P    PICTURE X.
           02  IMPGE37H    PICTURE X.
           02  IMPGE37V    PICTURE X.
           02  IMPGE37O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL1037C    PICTURE X.
           02  CTL1037P    PICTURE X.
           02  CTL1037H    PICTURE X.
           02  CTL1037V    PICTURE X.
           02  CTL1037O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2037C    PICTURE X.
           02  CTL2037P    PICTURE X.
           02  CTL2037H    PICTURE X.
           02  CTL2037V    PICTURE X.
           02  CTL2037O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3037C    PICTURE X.
           02  CTL3037P    PICTURE X.
           02  CTL3037H    PICTURE X.
           02  CTL3037V    PICTURE X.
           02  CTL3037O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  B2022D1C    PICTURE X.
           02  B2022D1P    PICTURE X.
           02  B2022D1H    PICTURE X.
           02  B2022D1V    PICTURE X.
           02  B2022D1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2022D2C    PICTURE X.
           02  B2022D2P    PICTURE X.
           02  B2022D2H    PICTURE X.
           02  B2022D2V    PICTURE X.
           02  B2022D2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2022D3C    PICTURE X.
           02  B2022D3P    PICTURE X.
           02  B2022D3H    PICTURE X.
           02  B2022D3V    PICTURE X.
           02  B2022D3O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2022D4C    PICTURE X.
           02  B2022D4P    PICTURE X.
           02  B2022D4H    PICTURE X.
           02  B2022D4V    PICTURE X.
           02  B2022D4O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2022D5C    PICTURE X.
           02  B2022D5P    PICTURE X.
           02  B2022D5H    PICTURE X.
           02  B2022D5V    PICTURE X.
           02  B2022D5O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2022D6C    PICTURE X.
           02  B2022D6P    PICTURE X.
           02  B2022D6H    PICTURE X.
           02  B2022D6V    PICTURE X.
           02  B2022D6O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2022D7C    PICTURE X.
           02  B2022D7P    PICTURE X.
           02  B2022D7H    PICTURE X.
           02  B2022D7V    PICTURE X.
           02  B2022D7O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2022D8C    PICTURE X.
           02  B2022D8P    PICTURE X.
           02  B2022D8H    PICTURE X.
           02  B2022D8V    PICTURE X.
           02  B2022D8O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2023D1C    PICTURE X.
           02  B2023D1P    PICTURE X.
           02  B2023D1H    PICTURE X.
           02  B2023D1V    PICTURE X.
           02  B2023D1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2023D2C    PICTURE X.
           02  B2023D2P    PICTURE X.
           02  B2023D2H    PICTURE X.
           02  B2023D2V    PICTURE X.
           02  B2023D2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2023D3C    PICTURE X.
           02  B2023D3P    PICTURE X.
           02  B2023D3H    PICTURE X.
           02  B2023D3V    PICTURE X.
           02  B2023D3O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2023D4C    PICTURE X.
           02  B2023D4P    PICTURE X.
           02  B2023D4H    PICTURE X.
           02  B2023D4V    PICTURE X.
           02  B2023D4O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2023D5C    PICTURE X.
           02  B2023D5P    PICTURE X.
           02  B2023D5H    PICTURE X.
           02  B2023D5V    PICTURE X.
           02  B2023D5O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2023D6C    PICTURE X.
           02  B2023D6P    PICTURE X.
           02  B2023D6H    PICTURE X.
           02  B2023D6V    PICTURE X.
           02  B2023D6O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  B2024D1C    PICTURE X.
           02  B2024D1P    PICTURE X.
           02  B2024D1H    PICTURE X.
           02  B2024D1V    PICTURE X.
           02  B2024D1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2024D2C    PICTURE X.
           02  B2024D2P    PICTURE X.
           02  B2024D2H    PICTURE X.
           02  B2024D2V    PICTURE X.
           02  B2024D2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2024D3C    PICTURE X.
           02  B2024D3P    PICTURE X.
           02  B2024D3H    PICTURE X.
           02  B2024D3V    PICTURE X.
           02  B2024D3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2024D4C    PICTURE X.
           02  B2024D4P    PICTURE X.
           02  B2024D4H    PICTURE X.
           02  B2024D4V    PICTURE X.
           02  B2024D4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2024D5C    PICTURE X.
           02  B2024D5P    PICTURE X.
           02  B2024D5H    PICTURE X.
           02  B2024D5V    PICTURE X.
           02  B2024D5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2024D6C    PICTURE X.
           02  B2024D6P    PICTURE X.
           02  B2024D6H    PICTURE X.
           02  B2024D6V    PICTURE X.
           02  B2024D6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2025D1C    PICTURE X.
           02  B2025D1P    PICTURE X.
           02  B2025D1H    PICTURE X.
           02  B2025D1V    PICTURE X.
           02  B2025D1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2025D2C    PICTURE X.
           02  B2025D2P    PICTURE X.
           02  B2025D2H    PICTURE X.
           02  B2025D2V    PICTURE X.
           02  B2025D2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2025D3C    PICTURE X.
           02  B2025D3P    PICTURE X.
           02  B2025D3H    PICTURE X.
           02  B2025D3V    PICTURE X.
           02  B2025D3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2025D4C    PICTURE X.
           02  B2025D4P    PICTURE X.
           02  B2025D4H    PICTURE X.
           02  B2025D4V    PICTURE X.
           02  B2025D4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2025D5C    PICTURE X.
           02  B2025D5P    PICTURE X.
           02  B2025D5H    PICTURE X.
           02  B2025D5V    PICTURE X.
           02  B2025D5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  B2025D6C    PICTURE X.
           02  B2025D6P    PICTURE X.
           02  B2025D6H    PICTURE X.
           02  B2025D6V    PICTURE X.
           02  B2025D6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMB1257C    PICTURE X.
           02  IMB1257P    PICTURE X.
           02  IMB1257H    PICTURE X.
           02  IMB1257V    PICTURE X.
           02  IMB1257O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1257C    PICTURE X.
           02  IME1257P    PICTURE X.
           02  IME1257H    PICTURE X.
           02  IME1257V    PICTURE X.
           02  IME1257O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1256C    PICTURE X.
           02  IMB1256P    PICTURE X.
           02  IMB1256H    PICTURE X.
           02  IMB1256V    PICTURE X.
           02  IMB1256O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1256C    PICTURE X.
           02  IME1256P    PICTURE X.
           02  IME1256H    PICTURE X.
           02  IME1256V    PICTURE X.
           02  IME1256O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1258C    PICTURE X.
           02  IMB1258P    PICTURE X.
           02  IMB1258H    PICTURE X.
           02  IMB1258V    PICTURE X.
           02  IMB1258O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1258C    PICTURE X.
           02  IME1258P    PICTURE X.
           02  IME1258H    PICTURE X.
           02  IME1258V    PICTURE X.
           02  IME1258O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1259C    PICTURE X.
           02  IMB1259P    PICTURE X.
           02  IMB1259H    PICTURE X.
           02  IMB1259V    PICTURE X.
           02  IMB1259O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1259C    PICTURE X.
           02  IME1259P    PICTURE X.
           02  IME1259H    PICTURE X.
           02  IME1259V    PICTURE X.
           02  IME1259O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1261C    PICTURE X.
           02  IMB1261P    PICTURE X.
           02  IMB1261H    PICTURE X.
           02  IMB1261V    PICTURE X.
           02  IMB1261O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1261C    PICTURE X.
           02  IME1261P    PICTURE X.
           02  IME1261H    PICTURE X.
           02  IME1261V    PICTURE X.
           02  IME1261O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1260C    PICTURE X.
           02  IMB1260P    PICTURE X.
           02  IMB1260H    PICTURE X.
           02  IMB1260V    PICTURE X.
           02  IMB1260O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1260C    PICTURE X.
           02  IME1260P    PICTURE X.
           02  IME1260H    PICTURE X.
           02  IME1260V    PICTURE X.
           02  IME1260O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB1262C    PICTURE X.
           02  IMB1262P    PICTURE X.
           02  IMB1262H    PICTURE X.
           02  IMB1262V    PICTURE X.
           02  IMB1262O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1262C    PICTURE X.
           02  IME1262P    PICTURE X.
           02  IME1262H    PICTURE X.
           02  IME1262V    PICTURE X.
           02  IME1262O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMB4015C    PICTURE X.
           02  IMB4015P    PICTURE X.
           02  IMB4015H    PICTURE X.
           02  IMB4015V    PICTURE X.
           02  IMB4015O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  IMB1136C    PICTURE X.
           02  IMB1136P    PICTURE X.
           02  IMB1136H    PICTURE X.
           02  IMB1136V    PICTURE X.
           02  IMB1136O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IME1136C    PICTURE X.
           02  IME1136P    PICTURE X.
           02  IME1136H    PICTURE X.
           02  IME1136V    PICTURE X.
           02  IME1136O  PIC X(9).
           02  FILLER PICTURE X(3).
           02  IMB1137C    PICTURE X.
           02  IMB1137P    PICTURE X.
           02  IMB1137H    PICTURE X.
           02  IMB1137V    PICTURE X.
           02  IMB1137O  PIC X(14).
           02  FILLER PICTURE X(3).
           02  IMB5025C    PICTURE X.
           02  IMB5025P    PICTURE X.
           02  IMB5025H    PICTURE X.
           02  IMB5025V    PICTURE X.
           02  IMB5025O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5026C    PICTURE X.
           02  IMB5026P    PICTURE X.
           02  IMB5026H    PICTURE X.
           02  IMB5026V    PICTURE X.
           02  IMB5026O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5023C    PICTURE X.
           02  IMB5023P    PICTURE X.
           02  IMB5023H    PICTURE X.
           02  IMB5023V    PICTURE X.
           02  IMB5023O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB5024C    PICTURE X.
           02  IMB5024P    PICTURE X.
           02  IMB5024H    PICTURE X.
           02  IMB5024V    PICTURE X.
           02  IMB5024O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4147C    PICTURE X.
           02  IMB4147P    PICTURE X.
           02  IMB4147H    PICTURE X.
           02  IMB4147V    PICTURE X.
           02  IMB4147O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4148C    PICTURE X.
           02  IMB4148P    PICTURE X.
           02  IMB4148H    PICTURE X.
           02  IMB4148V    PICTURE X.
           02  IMB4148O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4149C    PICTURE X.
           02  IMB4149P    PICTURE X.
           02  IMB4149H    PICTURE X.
           02  IMB4149V    PICTURE X.
           02  IMB4149O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMB4150C    PICTURE X.
           02  IMB4150P    PICTURE X.
           02  IMB4150H    PICTURE X.
           02  IMB4150V    PICTURE X.
           02  IMB4150O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMPFS36C    PICTURE X.
           02  IMPFS36P    PICTURE X.
           02  IMPFS36H    PICTURE X.
           02  IMPFS36V    PICTURE X.
           02  IMPFS36O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR36C    PICTURE X.
           02  IMERR36P    PICTURE X.
           02  IMERR36H    PICTURE X.
           02  IMERR36V    PICTURE X.
           02  IMERR36O  PIC X(79).