       01  FIIMBHAI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMBRNCHL    COMP  PIC  S9(4).
           02  IMBRNCHF    PICTURE X.
           02  FILLER REDEFINES IMBRNCHF.
             03 IMBRNCHA    PICTURE X.
           02  IMBRNCHI  PIC X(3).
           02  IMBATCHL    COMP  PIC  S9(4).
           02  IMBATCHF    PICTURE X.
           02  FILLER REDEFINES IMBATCHF.
             03 IMBATCHA    PICTURE X.
           02  IMBATCHI  PIC X(4).
           02  IMCTL2AL    COMP  PIC  S9(4).
           02  IMCTL2AF    PICTURE X.
           02  FILLER REDEFINES IMCTL2AF.
             03 IMCTL2AA    PICTURE X.
           02  IMCTL2AI  PIC X(3).
           02  IMCTL3AL    COMP  PIC  S9(4).
           02  IMCTL3AF    PICTURE X.
           02  FILLER REDEFINES IMCTL3AF.
             03 IMCTL3AA    PICTURE X.
           02  IMCTL3AI  PIC X(3).
           02  IMCTL4AL    COMP  PIC  S9(4).
           02  IMCTL4AF    PICTURE X.
           02  FILLER REDEFINES IMCTL4AF.
             03 IMCTL4AA    PICTURE X.
           02  IMCTL4AI  PIC X(4).
           02  IMACCTAL    COMP  PIC  S9(4).
           02  IMACCTAF    PICTURE X.
           02  FILLER REDEFINES IMACCTAF.
             03 IMACCTAA    PICTURE X.
           02  IMACCTAI  PIC X(10).
           02  IMUSERAL    COMP  PIC  S9(4).
           02  IMUSERAF    PICTURE X.
           02  FILLER REDEFINES IMUSERAF.
             03 IMUSERAA    PICTURE X.
           02  IMUSERAI  PIC X(4).
           02  IMAMTAL    COMP  PIC  S9(4).
           02  IMAMTAF    PICTURE X.
           02  FILLER REDEFINES IMAMTAF.
             03 IMAMTAA    PICTURE X.
           02  IMAMTAI  PIC X(16).
           02  IMCHCKAL    COMP  PIC  S9(4).
           02  IMCHCKAF    PICTURE X.
           02  FILLER REDEFINES IMCHCKAF.
             03 IMCHCKAA    PICTURE X.
           02  IMCHCKAI  PIC X(10).
           02  IMDESCAL    COMP  PIC  S9(4).
           02  IMDESCAF    PICTURE X.
           02  FILLER REDEFINES IMDESCAF.
             03 IMDESCAA    PICTURE X.
           02  IMDESCAI  PIC X(12).
           02  IMCTL2BL    COMP  PIC  S9(4).
           02  IMCTL2BF    PICTURE X.
           02  FILLER REDEFINES IMCTL2BF.
             03 IMCTL2BA    PICTURE X.
           02  IMCTL2BI  PIC X(3).
           02  IMCTL3BL    COMP  PIC  S9(4).
           02  IMCTL3BF    PICTURE X.
           02  FILLER REDEFINES IMCTL3BF.
             03 IMCTL3BA    PICTURE X.
           02  IMCTL3BI  PIC X(3).
           02  IMCTL4BL    COMP  PIC  S9(4).
           02  IMCTL4BF    PICTURE X.
           02  FILLER REDEFINES IMCTL4BF.
             03 IMCTL4BA    PICTURE X.
           02  IMCTL4BI  PIC X(4).
           02  IMACCTBL    COMP  PIC  S9(4).
           02  IMACCTBF    PICTURE X.
           02  FILLER REDEFINES IMACCTBF.
             03 IMACCTBA    PICTURE X.
           02  IMACCTBI  PIC X(10).
           02  IMUSERBL    COMP  PIC  S9(4).
           02  IMUSERBF    PICTURE X.
           02  FILLER REDEFINES IMUSERBF.
             03 IMUSERBA    PICTURE X.
           02  IMUSERBI  PIC X(4).
           02  IMAMTBL    COMP  PIC  S9(4).
           02  IMAMTBF    PICTURE X.
           02  FILLER REDEFINES IMAMTBF.
             03 IMAMTBA    PICTURE X.
           02  IMAMTBI  PIC X(16).
           02  IMCHCKBL    COMP  PIC  S9(4).
           02  IMCHCKBF    PICTURE X.
           02  FILLER REDEFINES IMCHCKBF.
             03 IMCHCKBA    PICTURE X.
           02  IMCHCKBI  PIC X(10).
           02  IMDESCBL    COMP  PIC  S9(4).
           02  IMDESCBF    PICTURE X.
           02  FILLER REDEFINES IMDESCBF.
             03 IMDESCBA    PICTURE X.
           02  IMDESCBI  PIC X(12).
           02  IMCTL2CL    COMP  PIC  S9(4).
           02  IMCTL2CF    PICTURE X.
           02  FILLER REDEFINES IMCTL2CF.
             03 IMCTL2CA    PICTURE X.
           02  IMCTL2CI  PIC X(3).
           02  IMCTL3CL    COMP  PIC  S9(4).
           02  IMCTL3CF    PICTURE X.
           02  FILLER REDEFINES IMCTL3CF.
             03 IMCTL3CA    PICTURE X.
           02  IMCTL3CI  PIC X(3).
           02  IMCTL4CL    COMP  PIC  S9(4).
           02  IMCTL4CF    PICTURE X.
           02  FILLER REDEFINES IMCTL4CF.
             03 IMCTL4CA    PICTURE X.
           02  IMCTL4CI  PIC X(4).
           02  IMACCTCL    COMP  PIC  S9(4).
           02  IMACCTCF    PICTURE X.
           02  FILLER REDEFINES IMACCTCF.
             03 IMACCTCA    PICTURE X.
           02  IMACCTCI  PIC X(10).
           02  IMUSERCL    COMP  PIC  S9(4).
           02  IMUSERCF    PICTURE X.
           02  FILLER REDEFINES IMUSERCF.
             03 IMUSERCA    PICTURE X.
           02  IMUSERCI  PIC X(4).
           02  IMAMTCL    COMP  PIC  S9(4).
           02  IMAMTCF    PICTURE X.
           02  FILLER REDEFINES IMAMTCF.
             03 IMAMTCA    PICTURE X.
           02  IMAMTCI  PIC X(16).
           02  IMCHCKCL    COMP  PIC  S9(4).
           02  IMCHCKCF    PICTURE X.
           02  FILLER REDEFINES IMCHCKCF.
             03 IMCHCKCA    PICTURE X.
           02  IMCHCKCI  PIC X(10).
           02  IMDESCCL    COMP  PIC  S9(4).
           02  IMDESCCF    PICTURE X.
           02  FILLER REDEFINES IMDESCCF.
             03 IMDESCCA    PICTURE X.
           02  IMDESCCI  PIC X(12).
           02  IMCTL2DL    COMP  PIC  S9(4).
           02  IMCTL2DF    PICTURE X.
           02  FILLER REDEFINES IMCTL2DF.
             03 IMCTL2DA    PICTURE X.
           02  IMCTL2DI  PIC X(3).
           02  IMCTL3DL    COMP  PIC  S9(4).
           02  IMCTL3DF    PICTURE X.
           02  FILLER REDEFINES IMCTL3DF.
             03 IMCTL3DA    PICTURE X.
           02  IMCTL3DI  PIC X(3).
           02  IMCTL4DL    COMP  PIC  S9(4).
           02  IMCTL4DF    PICTURE X.
           02  FILLER REDEFINES IMCTL4DF.
             03 IMCTL4DA    PICTURE X.
           02  IMCTL4DI  PIC X(4).
           02  IMACCTDL    COMP  PIC  S9(4).
           02  IMACCTDF    PICTURE X.
           02  FILLER REDEFINES IMACCTDF.
             03 IMACCTDA    PICTURE X.
           02  IMACCTDI  PIC X(10).
           02  IMUSERDL    COMP  PIC  S9(4).
           02  IMUSERDF    PICTURE X.
           02  FILLER REDEFINES IMUSERDF.
             03 IMUSERDA    PICTURE X.
           02  IMUSERDI  PIC X(4).
           02  IMAMTDL    COMP  PIC  S9(4).
           02  IMAMTDF    PICTURE X.
           02  FILLER REDEFINES IMAMTDF.
             03 IMAMTDA    PICTURE X.
           02  IMAMTDI  PIC X(16).
           02  IMCHCKDL    COMP  PIC  S9(4).
           02  IMCHCKDF    PICTURE X.
           02  FILLER REDEFINES IMCHCKDF.
             03 IMCHCKDA    PICTURE X.
           02  IMCHCKDI  PIC X(10).
           02  IMDESCDL    COMP  PIC  S9(4).
           02  IMDESCDF    PICTURE X.
           02  FILLER REDEFINES IMDESCDF.
             03 IMDESCDA    PICTURE X.
           02  IMDESCDI  PIC X(12).
           02  IMCTL2EL    COMP  PIC  S9(4).
           02  IMCTL2EF    PICTURE X.
           02  FILLER REDEFINES IMCTL2EF.
             03 IMCTL2EA    PICTURE X.
           02  IMCTL2EI  PIC X(3).
           02  IMCTL3EL    COMP  PIC  S9(4).
           02  IMCTL3EF    PICTURE X.
           02  FILLER REDEFINES IMCTL3EF.
             03 IMCTL3EA    PICTURE X.
           02  IMCTL3EI  PIC X(3).
           02  IMCTL4EL    COMP  PIC  S9(4).
           02  IMCTL4EF    PICTURE X.
           02  FILLER REDEFINES IMCTL4EF.
             03 IMCTL4EA    PICTURE X.
           02  IMCTL4EI  PIC X(4).
           02  IMACCTEL    COMP  PIC  S9(4).
           02  IMACCTEF    PICTURE X.
           02  FILLER REDEFINES IMACCTEF.
             03 IMACCTEA    PICTURE X.
           02  IMACCTEI  PIC X(10).
           02  IMUSEREL    COMP  PIC  S9(4).
           02  IMUSEREF    PICTURE X.
           02  FILLER REDEFINES IMUSEREF.
             03 IMUSEREA    PICTURE X.
           02  IMUSEREI  PIC X(4).
           02  IMAMTEL    COMP  PIC  S9(4).
           02  IMAMTEF    PICTURE X.
           02  FILLER REDEFINES IMAMTEF.
             03 IMAMTEA    PICTURE X.
           02  IMAMTEI  PIC X(16).
           02  IMCHCKEL    COMP  PIC  S9(4).
           02  IMCHCKEF    PICTURE X.
           02  FILLER REDEFINES IMCHCKEF.
             03 IMCHCKEA    PICTURE X.
           02  IMCHCKEI  PIC X(10).
           02  IMDESCEL    COMP  PIC  S9(4).
           02  IMDESCEF    PICTURE X.
           02  FILLER REDEFINES IMDESCEF.
             03 IMDESCEA    PICTURE X.
           02  IMDESCEI  PIC X(12).
           02  IMCTL2FL    COMP  PIC  S9(4).
           02  IMCTL2FF    PICTURE X.
           02  FILLER REDEFINES IMCTL2FF.
             03 IMCTL2FA    PICTURE X.
           02  IMCTL2FI  PIC X(3).
           02  IMCTL3FL    COMP  PIC  S9(4).
           02  IMCTL3FF    PICTURE X.
           02  FILLER REDEFINES IMCTL3FF.
             03 IMCTL3FA    PICTURE X.
           02  IMCTL3FI  PIC X(3).
           02  IMCTL4FL    COMP  PIC  S9(4).
           02  IMCTL4FF    PICTURE X.
           02  FILLER REDEFINES IMCTL4FF.
             03 IMCTL4FA    PICTURE X.
           02  IMCTL4FI  PIC X(4).
           02  IMACCTFL    COMP  PIC  S9(4).
           02  IMACCTFF    PICTURE X.
           02  FILLER REDEFINES IMACCTFF.
             03 IMACCTFA    PICTURE X.
           02  IMACCTFI  PIC X(10).
           02  IMUSERFL    COMP  PIC  S9(4).
           02  IMUSERFF    PICTURE X.
           02  FILLER REDEFINES IMUSERFF.
             03 IMUSERFA    PICTURE X.
           02  IMUSERFI  PIC X(4).
           02  IMAMTFL    COMP  PIC  S9(4).
           02  IMAMTFF    PICTURE X.
           02  FILLER REDEFINES IMAMTFF.
             03 IMAMTFA    PICTURE X.
           02  IMAMTFI  PIC X(16).
           02  IMCHCKFL    COMP  PIC  S9(4).
           02  IMCHCKFF    PICTURE X.
           02  FILLER REDEFINES IMCHCKFF.
             03 IMCHCKFA    PICTURE X.
           02  IMCHCKFI  PIC X(10).
           02  IMDESCFL    COMP  PIC  S9(4).
           02  IMDESCFF    PICTURE X.
           02  FILLER REDEFINES IMDESCFF.
             03 IMDESCFA    PICTURE X.
           02  IMDESCFI  PIC X(12).
           02  IMCTL2GL    COMP  PIC  S9(4).
           02  IMCTL2GF    PICTURE X.
           02  FILLER REDEFINES IMCTL2GF.
             03 IMCTL2GA    PICTURE X.
           02  IMCTL2GI  PIC X(3).
           02  IMCTL3GL    COMP  PIC  S9(4).
           02  IMCTL3GF    PICTURE X.
           02  FILLER REDEFINES IMCTL3GF.
             03 IMCTL3GA    PICTURE X.
           02  IMCTL3GI  PIC X(3).
           02  IMCTL4GL    COMP  PIC  S9(4).
           02  IMCTL4GF    PICTURE X.
           02  FILLER REDEFINES IMCTL4GF.
             03 IMCTL4GA    PICTURE X.
           02  IMCTL4GI  PIC X(4).
           02  IMACCTGL    COMP  PIC  S9(4).
           02  IMACCTGF    PICTURE X.
           02  FILLER REDEFINES IMACCTGF.
             03 IMACCTGA    PICTURE X.
           02  IMACCTGI  PIC X(10).
           02  IMUSERGL    COMP  PIC  S9(4).
           02  IMUSERGF    PICTURE X.
           02  FILLER REDEFINES IMUSERGF.
             03 IMUSERGA    PICTURE X.
           02  IMUSERGI  PIC X(4).
           02  IMAMTGL    COMP  PIC  S9(4).
           02  IMAMTGF    PICTURE X.
           02  FILLER REDEFINES IMAMTGF.
             03 IMAMTGA    PICTURE X.
           02  IMAMTGI  PIC X(16).
           02  IMCHCKGL    COMP  PIC  S9(4).
           02  IMCHCKGF    PICTURE X.
           02  FILLER REDEFINES IMCHCKGF.
             03 IMCHCKGA    PICTURE X.
           02  IMCHCKGI  PIC X(10).
           02  IMDESCGL    COMP  PIC  S9(4).
           02  IMDESCGF    PICTURE X.
           02  FILLER REDEFINES IMDESCGF.
             03 IMDESCGA    PICTURE X.
           02  IMDESCGI  PIC X(12).
           02  IMCTL2HL    COMP  PIC  S9(4).
           02  IMCTL2HF    PICTURE X.
           02  FILLER REDEFINES IMCTL2HF.
             03 IMCTL2HA    PICTURE X.
           02  IMCTL2HI  PIC X(3).
           02  IMCTL3HL    COMP  PIC  S9(4).
           02  IMCTL3HF    PICTURE X.
           02  FILLER REDEFINES IMCTL3HF.
             03 IMCTL3HA    PICTURE X.
           02  IMCTL3HI  PIC X(3).
           02  IMCTL4HL    COMP  PIC  S9(4).
           02  IMCTL4HF    PICTURE X.
           02  FILLER REDEFINES IMCTL4HF.
             03 IMCTL4HA    PICTURE X.
           02  IMCTL4HI  PIC X(4).
           02  IMACCTHL    COMP  PIC  S9(4).
           02  IMACCTHF    PICTURE X.
           02  FILLER REDEFINES IMACCTHF.
             03 IMACCTHA    PICTURE X.
           02  IMACCTHI  PIC X(10).
           02  IMUSERHL    COMP  PIC  S9(4).
           02  IMUSERHF    PICTURE X.
           02  FILLER REDEFINES IMUSERHF.
             03 IMUSERHA    PICTURE X.
           02  IMUSERHI  PIC X(4).
           02  IMAMTHL    COMP  PIC  S9(4).
           02  IMAMTHF    PICTURE X.
           02  FILLER REDEFINES IMAMTHF.
             03 IMAMTHA    PICTURE X.
           02  IMAMTHI  PIC X(16).
           02  IMCHCKHL    COMP  PIC  S9(4).
           02  IMCHCKHF    PICTURE X.
           02  FILLER REDEFINES IMCHCKHF.
             03 IMCHCKHA    PICTURE X.
           02  IMCHCKHI  PIC X(10).
           02  IMDESCHL    COMP  PIC  S9(4).
           02  IMDESCHF    PICTURE X.
           02  FILLER REDEFINES IMDESCHF.
             03 IMDESCHA    PICTURE X.
           02  IMDESCHI  PIC X(12).
           02  IMCTL2IL    COMP  PIC  S9(4).
           02  IMCTL2IF    PICTURE X.
           02  FILLER REDEFINES IMCTL2IF.
             03 IMCTL2IA    PICTURE X.
           02  IMCTL2II  PIC X(3).
           02  IMCTL3IL    COMP  PIC  S9(4).
           02  IMCTL3IF    PICTURE X.
           02  FILLER REDEFINES IMCTL3IF.
             03 IMCTL3IA    PICTURE X.
           02  IMCTL3II  PIC X(3).
           02  IMCTL4IL    COMP  PIC  S9(4).
           02  IMCTL4IF    PICTURE X.
           02  FILLER REDEFINES IMCTL4IF.
             03 IMCTL4IA    PICTURE X.
           02  IMCTL4II  PIC X(4).
           02  IMACCTIL    COMP  PIC  S9(4).
           02  IMACCTIF    PICTURE X.
           02  FILLER REDEFINES IMACCTIF.
             03 IMACCTIA    PICTURE X.
           02  IMACCTII  PIC X(10).
           02  IMUSERIL    COMP  PIC  S9(4).
           02  IMUSERIF    PICTURE X.
           02  FILLER REDEFINES IMUSERIF.
             03 IMUSERIA    PICTURE X.
           02  IMUSERII  PIC X(4).
           02  IMAMTIL    COMP  PIC  S9(4).
           02  IMAMTIF    PICTURE X.
           02  FILLER REDEFINES IMAMTIF.
             03 IMAMTIA    PICTURE X.
           02  IMAMTII  PIC X(16).
           02  IMCHCKIL    COMP  PIC  S9(4).
           02  IMCHCKIF    PICTURE X.
           02  FILLER REDEFINES IMCHCKIF.
             03 IMCHCKIA    PICTURE X.
           02  IMCHCKII  PIC X(10).
           02  IMDESCIL    COMP  PIC  S9(4).
           02  IMDESCIF    PICTURE X.
           02  FILLER REDEFINES IMDESCIF.
             03 IMDESCIA    PICTURE X.
           02  IMDESCII  PIC X(12).
           02  IMCTL2JL    COMP  PIC  S9(4).
           02  IMCTL2JF    PICTURE X.
           02  FILLER REDEFINES IMCTL2JF.
             03 IMCTL2JA    PICTURE X.
           02  IMCTL2JI  PIC X(3).
           02  IMCTL3JL    COMP  PIC  S9(4).
           02  IMCTL3JF    PICTURE X.
           02  FILLER REDEFINES IMCTL3JF.
             03 IMCTL3JA    PICTURE X.
           02  IMCTL3JI  PIC X(3).
           02  IMCTL4JL    COMP  PIC  S9(4).
           02  IMCTL4JF    PICTURE X.
           02  FILLER REDEFINES IMCTL4JF.
             03 IMCTL4JA    PICTURE X.
           02  IMCTL4JI  PIC X(4).
           02  IMACCTJL    COMP  PIC  S9(4).
           02  IMACCTJF    PICTURE X.
           02  FILLER REDEFINES IMACCTJF.
             03 IMACCTJA    PICTURE X.
           02  IMACCTJI  PIC X(10).
           02  IMUSERJL    COMP  PIC  S9(4).
           02  IMUSERJF    PICTURE X.
           02  FILLER REDEFINES IMUSERJF.
             03 IMUSERJA    PICTURE X.
           02  IMUSERJI  PIC X(4).
           02  IMAMTJL    COMP  PIC  S9(4).
           02  IMAMTJF    PICTURE X.
           02  FILLER REDEFINES IMAMTJF.
             03 IMAMTJA    PICTURE X.
           02  IMAMTJI  PIC X(16).
           02  IMCHCKJL    COMP  PIC  S9(4).
           02  IMCHCKJF    PICTURE X.
           02  FILLER REDEFINES IMCHCKJF.
             03 IMCHCKJA    PICTURE X.
           02  IMCHCKJI  PIC X(10).
           02  IMDESCJL    COMP  PIC  S9(4).
           02  IMDESCJF    PICTURE X.
           02  FILLER REDEFINES IMDESCJF.
             03 IMDESCJA    PICTURE X.
           02  IMDESCJI  PIC X(12).
           02  IMCTL2KL    COMP  PIC  S9(4).
           02  IMCTL2KF    PICTURE X.
           02  FILLER REDEFINES IMCTL2KF.
             03 IMCTL2KA    PICTURE X.
           02  IMCTL2KI  PIC X(3).
           02  IMCTL3KL    COMP  PIC  S9(4).
           02  IMCTL3KF    PICTURE X.
           02  FILLER REDEFINES IMCTL3KF.
             03 IMCTL3KA    PICTURE X.
           02  IMCTL3KI  PIC X(3).
           02  IMCTL4KL    COMP  PIC  S9(4).
           02  IMCTL4KF    PICTURE X.
           02  FILLER REDEFINES IMCTL4KF.
             03 IMCTL4KA    PICTURE X.
           02  IMCTL4KI  PIC X(4).
           02  IMACCTKL    COMP  PIC  S9(4).
           02  IMACCTKF    PICTURE X.
           02  FILLER REDEFINES IMACCTKF.
             03 IMACCTKA    PICTURE X.
           02  IMACCTKI  PIC X(10).
           02  IMUSERKL    COMP  PIC  S9(4).
           02  IMUSERKF    PICTURE X.
           02  FILLER REDEFINES IMUSERKF.
             03 IMUSERKA    PICTURE X.
           02  IMUSERKI  PIC X(4).
           02  IMAMTKL    COMP  PIC  S9(4).
           02  IMAMTKF    PICTURE X.
           02  FILLER REDEFINES IMAMTKF.
             03 IMAMTKA    PICTURE X.
           02  IMAMTKI  PIC X(16).
           02  IMCHCKKL    COMP  PIC  S9(4).
           02  IMCHCKKF    PICTURE X.
           02  FILLER REDEFINES IMCHCKKF.
             03 IMCHCKKA    PICTURE X.
           02  IMCHCKKI  PIC X(10).
           02  IMDESCKL    COMP  PIC  S9(4).
           02  IMDESCKF    PICTURE X.
           02  FILLER REDEFINES IMDESCKF.
             03 IMDESCKA    PICTURE X.
           02  IMDESCKI  PIC X(12).
           02  IMCTL2LL    COMP  PIC  S9(4).
           02  IMCTL2LF    PICTURE X.
           02  FILLER REDEFINES IMCTL2LF.
             03 IMCTL2LA    PICTURE X.
           02  IMCTL2LI  PIC X(3).
           02  IMCTL3LL    COMP  PIC  S9(4).
           02  IMCTL3LF    PICTURE X.
           02  FILLER REDEFINES IMCTL3LF.
             03 IMCTL3LA    PICTURE X.
           02  IMCTL3LI  PIC X(3).
           02  IMCTL4LL    COMP  PIC  S9(4).
           02  IMCTL4LF    PICTURE X.
           02  FILLER REDEFINES IMCTL4LF.
             03 IMCTL4LA    PICTURE X.
           02  IMCTL4LI  PIC X(4).
           02  IMACCTLL    COMP  PIC  S9(4).
           02  IMACCTLF    PICTURE X.
           02  FILLER REDEFINES IMACCTLF.
             03 IMACCTLA    PICTURE X.
           02  IMACCTLI  PIC X(10).
           02  IMUSERLL    COMP  PIC  S9(4).
           02  IMUSERLF    PICTURE X.
           02  FILLER REDEFINES IMUSERLF.
             03 IMUSERLA    PICTURE X.
           02  IMUSERLI  PIC X(4).
           02  IMAMTLL    COMP  PIC  S9(4).
           02  IMAMTLF    PICTURE X.
           02  FILLER REDEFINES IMAMTLF.
             03 IMAMTLA    PICTURE X.
           02  IMAMTLI  PIC X(16).
           02  IMCHCKLL    COMP  PIC  S9(4).
           02  IMCHCKLF    PICTURE X.
           02  FILLER REDEFINES IMCHCKLF.
             03 IMCHCKLA    PICTURE X.
           02  IMCHCKLI  PIC X(10).
           02  IMDESCLL    COMP  PIC  S9(4).
           02  IMDESCLF    PICTURE X.
           02  FILLER REDEFINES IMDESCLF.
             03 IMDESCLA    PICTURE X.
           02  IMDESCLI  PIC X(12).
           02  IMCTL2ML    COMP  PIC  S9(4).
           02  IMCTL2MF    PICTURE X.
           02  FILLER REDEFINES IMCTL2MF.
             03 IMCTL2MA    PICTURE X.
           02  IMCTL2MI  PIC X(3).
           02  IMCTL3ML    COMP  PIC  S9(4).
           02  IMCTL3MF    PICTURE X.
           02  FILLER REDEFINES IMCTL3MF.
             03 IMCTL3MA    PICTURE X.
           02  IMCTL3MI  PIC X(3).
           02  IMCTL4ML    COMP  PIC  S9(4).
           02  IMCTL4MF    PICTURE X.
           02  FILLER REDEFINES IMCTL4MF.
             03 IMCTL4MA    PICTURE X.
           02  IMCTL4MI  PIC X(4).
           02  IMACCTML    COMP  PIC  S9(4).
           02  IMACCTMF    PICTURE X.
           02  FILLER REDEFINES IMACCTMF.
             03 IMACCTMA    PICTURE X.
           02  IMACCTMI  PIC X(10).
           02  IMUSERML    COMP  PIC  S9(4).
           02  IMUSERMF    PICTURE X.
           02  FILLER REDEFINES IMUSERMF.
             03 IMUSERMA    PICTURE X.
           02  IMUSERMI  PIC X(4).
           02  IMAMTML    COMP  PIC  S9(4).
           02  IMAMTMF    PICTURE X.
           02  FILLER REDEFINES IMAMTMF.
             03 IMAMTMA    PICTURE X.
           02  IMAMTMI  PIC X(16).
           02  IMCHCKML    COMP  PIC  S9(4).
           02  IMCHCKMF    PICTURE X.
           02  FILLER REDEFINES IMCHCKMF.
             03 IMCHCKMA    PICTURE X.
           02  IMCHCKMI  PIC X(10).
           02  IMDESCML    COMP  PIC  S9(4).
           02  IMDESCMF    PICTURE X.
           02  FILLER REDEFINES IMDESCMF.
             03 IMDESCMA    PICTURE X.
           02  IMDESCMI  PIC X(12).
           02  IMCTL2NL    COMP  PIC  S9(4).
           02  IMCTL2NF    PICTURE X.
           02  FILLER REDEFINES IMCTL2NF.
             03 IMCTL2NA    PICTURE X.
           02  IMCTL2NI  PIC X(3).
           02  IMCTL3NL    COMP  PIC  S9(4).
           02  IMCTL3NF    PICTURE X.
           02  FILLER REDEFINES IMCTL3NF.
             03 IMCTL3NA    PICTURE X.
           02  IMCTL3NI  PIC X(3).
           02  IMCTL4NL    COMP  PIC  S9(4).
           02  IMCTL4NF    PICTURE X.
           02  FILLER REDEFINES IMCTL4NF.
             03 IMCTL4NA    PICTURE X.
           02  IMCTL4NI  PIC X(4).
           02  IMACCTNL    COMP  PIC  S9(4).
           02  IMACCTNF    PICTURE X.
           02  FILLER REDEFINES IMACCTNF.
             03 IMACCTNA    PICTURE X.
           02  IMACCTNI  PIC X(10).
           02  IMUSERNL    COMP  PIC  S9(4).
           02  IMUSERNF    PICTURE X.
           02  FILLER REDEFINES IMUSERNF.
             03 IMUSERNA    PICTURE X.
           02  IMUSERNI  PIC X(4).
           02  IMAMTNL    COMP  PIC  S9(4).
           02  IMAMTNF    PICTURE X.
           02  FILLER REDEFINES IMAMTNF.
             03 IMAMTNA    PICTURE X.
           02  IMAMTNI  PIC X(16).
           02  IMCHCKNL    COMP  PIC  S9(4).
           02  IMCHCKNF    PICTURE X.
           02  FILLER REDEFINES IMCHCKNF.
             03 IMCHCKNA    PICTURE X.
           02  IMCHCKNI  PIC X(10).
           02  IMDESCNL    COMP  PIC  S9(4).
           02  IMDESCNF    PICTURE X.
           02  FILLER REDEFINES IMDESCNF.
             03 IMDESCNA    PICTURE X.
           02  IMDESCNI  PIC X(12).
           02  IMCTL2OL    COMP  PIC  S9(4).
           02  IMCTL2OF    PICTURE X.
           02  FILLER REDEFINES IMCTL2OF.
             03 IMCTL2OA    PICTURE X.
           02  IMCTL2OI  PIC X(3).
           02  IMCTL3OL    COMP  PIC  S9(4).
           02  IMCTL3OF    PICTURE X.
           02  FILLER REDEFINES IMCTL3OF.
             03 IMCTL3OA    PICTURE X.
           02  IMCTL3OI  PIC X(3).
           02  IMCTL4OL    COMP  PIC  S9(4).
           02  IMCTL4OF    PICTURE X.
           02  FILLER REDEFINES IMCTL4OF.
             03 IMCTL4OA    PICTURE X.
           02  IMCTL4OI  PIC X(4).
           02  IMACCTOL    COMP  PIC  S9(4).
           02  IMACCTOF    PICTURE X.
           02  FILLER REDEFINES IMACCTOF.
             03 IMACCTOA    PICTURE X.
           02  IMACCTOI  PIC X(10).
           02  IMUSEROL    COMP  PIC  S9(4).
           02  IMUSEROF    PICTURE X.
           02  FILLER REDEFINES IMUSEROF.
             03 IMUSEROA    PICTURE X.
           02  IMUSEROI  PIC X(4).
           02  IMAMTOL    COMP  PIC  S9(4).
           02  IMAMTOF    PICTURE X.
           02  FILLER REDEFINES IMAMTOF.
             03 IMAMTOA    PICTURE X.
           02  IMAMTOI  PIC X(16).
           02  IMCHCKOL    COMP  PIC  S9(4).
           02  IMCHCKOF    PICTURE X.
           02  FILLER REDEFINES IMCHCKOF.
             03 IMCHCKOA    PICTURE X.
           02  IMCHCKOI  PIC X(10).
           02  IMDESCOL    COMP  PIC  S9(4).
           02  IMDESCOF    PICTURE X.
           02  FILLER REDEFINES IMDESCOF.
             03 IMDESCOA    PICTURE X.
           02  IMDESCOI  PIC X(12).
           02  IMHEADL    COMP  PIC  S9(4).
           02  IMHEADF    PICTURE X.
           02  FILLER REDEFINES IMHEADF.
             03 IMHEADA    PICTURE X.
           02  IMHEADI  PIC X(13).
           02  IMDRHD1L    COMP  PIC  S9(4).
           02  IMDRHD1F    PICTURE X.
           02  FILLER REDEFINES IMDRHD1F.
             03 IMDRHD1A    PICTURE X.
           02  IMDRHD1I  PIC X(2).
           02  IMDRCNTL    COMP  PIC  S9(4).
           02  IMDRCNTF    PICTURE X.
           02  FILLER REDEFINES IMDRCNTF.
             03 IMDRCNTA    PICTURE X.
           02  IMDRCNTI  PIC X(6).
           02  IMDRHD2L    COMP  PIC  S9(4).
           02  IMDRHD2F    PICTURE X.
           02  FILLER REDEFINES IMDRHD2F.
             03 IMDRHD2A    PICTURE X.
           02  IMDRHD2I  PIC X(3).
           02  IMDRAMTL    COMP  PIC  S9(4).
           02  IMDRAMTF    PICTURE X.
           02  FILLER REDEFINES IMDRAMTF.
             03 IMDRAMTA    PICTURE X.
           02  IMDRAMTI  PIC X(17).
           02  IMCRHD1L    COMP  PIC  S9(4).
           02  IMCRHD1F    PICTURE X.
           02  FILLER REDEFINES IMCRHD1F.
             03 IMCRHD1A    PICTURE X.
           02  IMCRHD1I  PIC X(2).
           02  IMCRCNTL    COMP  PIC  S9(4).
           02  IMCRCNTF    PICTURE X.
           02  FILLER REDEFINES IMCRCNTF.
             03 IMCRCNTA    PICTURE X.
           02  IMCRCNTI  PIC X(6).
           02  IMCRHD2L    COMP  PIC  S9(4).
           02  IMCRHD2F    PICTURE X.
           02  FILLER REDEFINES IMCRHD2F.
             03 IMCRHD2A    PICTURE X.
           02  IMCRHD2I  PIC X(3).
           02  IMCRAMTL    COMP  PIC  S9(4).
           02  IMCRAMTF    PICTURE X.
           02  FILLER REDEFINES IMCRAMTF.
             03 IMCRAMTA    PICTURE X.
           02  IMCRAMTI  PIC X(17).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIMBHAO REDEFINES FIIMBHAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMBRNCHO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBATCHO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMCTL2AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4AO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTAO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCAO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4BO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTBO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCBO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2CO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3CO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4CO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERCO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTCO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCCO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2DO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3DO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4DO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTDO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTDO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKDO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCDO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2EO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3EO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4EO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTEO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSEREO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTEO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKEO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCEO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2FO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3FO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4FO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTFO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERFO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTFO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKFO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCFO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2GO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3GO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4GO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTGO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERGO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTGO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKGO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCGO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2HO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3HO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4HO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTHO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERHO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTHO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKHO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCHO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2IO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3IO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4IO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTIO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERIO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTIO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKIO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCIO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2JO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3JO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4JO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTJO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERJO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTJO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKJO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCJO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2KO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3KO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4KO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTKO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERKO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTKO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKKO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCKO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2LO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3LO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4LO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTLO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERLO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTLO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKLO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCLO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2MO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3MO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4MO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTMO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERMO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTMO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKMO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCMO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2NO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3NO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4NO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTNO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSERNO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTNO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKNO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCNO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMCTL2OO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL3OO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCTL4OO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACCTOO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMUSEROO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMAMTOO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  IMCHCKOO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMDESCOO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMHEADO  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IMDRHD1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMDRCNTO PIC ZZ,ZZ9.
           02  FILLER PICTURE X(3).
           02  IMDRHD2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMDRAMTO PIC Z(10),ZZ9.99.
           02  FILLER PICTURE X(3).
           02  IMCRHD1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMCRCNTO PIC ZZ,ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCRHD2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCRAMTO PIC Z(10),ZZ9.99.
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).