       01  FIIMI2AO.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(2).
           02  IMTRANA    PICTURE X.
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMDATEA    PICTURE X.
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTIMEA    PICTURE X.
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMPGNOA    PICTURE X.
           02  IMPGNOO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMKEYA    PICTURE X.
           02  IMKEYO  PIC X(26).
           02  FILLER PICTURE X(2).
           02  IMAHCT2A    PICTURE X.
           02  IMAHCT2O  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMAHCT3A    PICTURE X.
           02  IMAHCT3O  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMAHCT4A    PICTURE X.
           02  IMAHCT4O  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMAHACTA    PICTURE X.
           02  IMAHACTO  PIC X(10).
           02  IMAHNQ1D OCCURS 16 TIMES.
             03  FILLER PICTURE X(2).
             03  IMAHNQ1A    PICTURE X.
             03  IMAHNQ1O  PIC X(79).
           02  FILLER PICTURE X(2).
           02  IMPAGEFA    PICTURE X.
           02  IMPAGEFO  PIC X(19).
           02  FILLER PICTURE X(2).
           02  IMPAGEBA    PICTURE X.
           02  IMPAGEBO  PIC X(19).
           02  FILLER PICTURE X(2).
           02  IMERRORA    PICTURE X.
           02  IMERRORO  PIC X(79).