       01  FIIMIAAO.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(2).
           02  IMTRANA    PICTURE X.
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMDATEA    PICTURE X.
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTIMEA    PICTURE X.
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMKEYA    PICTURE X.
           02  IMKEYO  PIC X(23).
           02  FILLER PICTURE X(2).
           02  IMACCTA    PICTURE X.
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(2).
           02  IMNAMEA    PICTURE X.
           02  IMNAMEO  PIC X(13).
           02  FILLER PICTURE X(2).
           02  IMAPP01A    PICTURE X.
           02  IMAPP01O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL01A    PICTURE X.
           02  IMCTL01O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP02A    PICTURE X.
           02  IMAPP02O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL02A    PICTURE X.
           02  IMCTL02O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP03A    PICTURE X.
           02  IMAPP03O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL03A    PICTURE X.
           02  IMCTL03O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP04A    PICTURE X.
           02  IMAPP04O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL04A    PICTURE X.
           02  IMCTL04O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP05A    PICTURE X.
           02  IMAPP05O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL05A    PICTURE X.
           02  IMCTL05O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP06A    PICTURE X.
           02  IMAPP06O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL06A    PICTURE X.
           02  IMCTL06O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP07A    PICTURE X.
           02  IMAPP07O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL07A    PICTURE X.
           02  IMCTL07O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP08A    PICTURE X.
           02  IMAPP08O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL08A    PICTURE X.
           02  IMCTL08O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP09A    PICTURE X.
           02  IMAPP09O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL09A    PICTURE X.
           02  IMCTL09O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP10A    PICTURE X.
           02  IMAPP10O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL10A    PICTURE X.
           02  IMCTL10O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP11A    PICTURE X.
           02  IMAPP11O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL11A    PICTURE X.
           02  IMCTL11O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP12A    PICTURE X.
           02  IMAPP12O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL12A    PICTURE X.
           02  IMCTL12O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP13A    PICTURE X.
           02  IMAPP13O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL13A    PICTURE X.
           02  IMCTL13O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP14A    PICTURE X.
           02  IMAPP14O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL14A    PICTURE X.
           02  IMCTL14O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMAPP15A    PICTURE X.
           02  IMAPP15O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMCTL15A    PICTURE X.
           02  IMCTL15O  PIC X(35).
           02  FILLER PICTURE X(2).
           02  IMERRORA    PICTURE X.
           02  IMERRORO  PIC X(79).