       01  FIIMIGAO.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(2).
           02  IMTRANA    PICTURE X.
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMDATEA    PICTURE X.
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTIMEA    PICTURE X.
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMKEYA    PICTURE X.
           02  IMKEYO  PIC X(23).
           02  FILLER PICTURE X(2).
           02  IMACCTA    PICTURE X.
           02  IMACCTO  PIC X(10).
           02  FILLER PICTURE X(2).
           02  IMNAMEA    PICTURE X.
           02  IMNAMEO  PIC X(13).
           02  FILLER PICTURE X(2).
           02  IMCALCA    PICTURE X.
           02  IMCALCO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMINTSCA    PICTURE X.
           02  IMINTSCO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMINTWAA    PICTURE X.
           02  IMINTWAO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMBHOPTA    PICTURE X.
           02  IMBHOPTO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMBHRETA    PICTURE X.
           02  IMBHRETO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMNDXUSA    PICTURE X.
           02  IMNDXUSO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMACCAA    PICTURE X.
           02  IMACCAO  PIC Z(10)9.9(6)-.
           02  FILLER PICTURE X(2).
           02  IMACCDA    PICTURE X.
           02  IMACCDO  PIC Z(10)9.9(6)-.
           02  FILLER PICTURE X(2).
           02  IMCYCAA    PICTURE X.
           02  IMCYCAO  PIC Z(10)9.9(6)-.
           02  FILLER PICTURE X(2).
           02  IMCYCCA    PICTURE X.
           02  IMCYCCO  PIC Z(10)9.99-.
           02  FILLER PICTURE X(2).
           02  IMMTDAA    PICTURE X.
           02  IMMTDAO  PIC Z(10)9.99-.
           02  FILLER PICTURE X(2).
           02  IMMTDCA    PICTURE X.
           02  IMMTDCO  PIC Z(10)9.99-.
           02  FILLER PICTURE X(2).
           02  IMYTDCA    PICTURE X.
           02  IMYTDCO  PIC Z(12)9.99-.
           02  FILLER PICTURE X(2).
           02  IMYTDRA    PICTURE X.
           02  IMYTDRO  PIC Z(12)9.99-.
           02  FILLER PICTURE X(2).
           02  IMACCBA    PICTURE X.
           02  IMACCBO  PIC Z(12)9.99-.
           02  FILLER PICTURE X(2).
           02  IMPTR1A    PICTURE X.
           02  IMPTR1O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPRM1A    PICTURE X.
           02  IMPRM1O  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMPRAC1A    PICTURE X.
           02  IMPRAC1O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLIM1A    PICTURE X.
           02  IMLIM1O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLAMT1A    PICTURE X.
           02  IMLAMT1O  PIC Z(12)9-.
           02  FILLER PICTURE X(2).
           02  IMPTR2A    PICTURE X.
           02  IMPTR2O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPRM2A    PICTURE X.
           02  IMPRM2O  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMPRAC2A    PICTURE X.
           02  IMPRAC2O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLIM2A    PICTURE X.
           02  IMLIM2O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLAMT2A    PICTURE X.
           02  IMLAMT2O  PIC Z(12)9-.
           02  FILLER PICTURE X(2).
           02  IMPTR3A    PICTURE X.
           02  IMPTR3O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPRM3A    PICTURE X.
           02  IMPRM3O  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMPRAC3A    PICTURE X.
           02  IMPRAC3O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLIM3A    PICTURE X.
           02  IMLIM3O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLAMT3A    PICTURE X.
           02  IMLAMT3O  PIC Z(12)9-.
           02  FILLER PICTURE X(2).
           02  IMPTR4A    PICTURE X.
           02  IMPTR4O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPRM4A    PICTURE X.
           02  IMPRM4O  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMPRAC4A    PICTURE X.
           02  IMPRAC4O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLIM4A    PICTURE X.
           02  IMLIM4O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLAMT4A    PICTURE X.
           02  IMLAMT4O  PIC Z(12)9-.
           02  FILLER PICTURE X(2).
           02  IMPTR5A    PICTURE X.
           02  IMPTR5O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPRM5A    PICTURE X.
           02  IMPRM5O  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMPRAC5A    PICTURE X.
           02  IMPRAC5O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLIM5A    PICTURE X.
           02  IMLIM5O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLAMT5A    PICTURE X.
           02  IMLAMT5O  PIC Z(12)9-.
           02  FILLER PICTURE X(2).
           02  IMPTR6A    PICTURE X.
           02  IMPTR6O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPRM6A    PICTURE X.
           02  IMPRM6O  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMPRAC6A    PICTURE X.
           02  IMPRAC6O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLIM6A    PICTURE X.
           02  IMLIM6O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLAMT6A    PICTURE X.
           02  IMLAMT6O  PIC Z(12)9-.
           02  FILLER PICTURE X(2).
           02  IMPTR7A    PICTURE X.
           02  IMPTR7O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPRM7A    PICTURE X.
           02  IMPRM7O  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMPRAC7A    PICTURE X.
           02  IMPRAC7O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLIM7A    PICTURE X.
           02  IMLIM7O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLAMT7A    PICTURE X.
           02  IMLAMT7O  PIC Z(12)9-.
           02  FILLER PICTURE X(2).
           02  IMPTR8A    PICTURE X.
           02  IMPTR8O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPRM8A    PICTURE X.
           02  IMPRM8O  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMPRAC8A    PICTURE X.
           02  IMPRAC8O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLIM8A    PICTURE X.
           02  IMLIM8O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLAMT8A    PICTURE X.
           02  IMLAMT8O  PIC Z(12)9-.
           02  FILLER PICTURE X(2).
           02  IMPTR9A    PICTURE X.
           02  IMPTR9O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPRM9A    PICTURE X.
           02  IMPRM9O  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMPRAC9A    PICTURE X.
           02  IMPRAC9O  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMERRORA    PICTURE X.
           02  IMERRORO  PIC X(79).