       01  FIIMNBAI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMBANKL    COMP  PIC  S9(4).
           02  IMBANKF    PICTURE X.
           02  FILLER REDEFINES IMBANKF.
             03 IMBANKA    PICTURE X.
           02  IMBANKI  PIC X(2).
           02  IMBKNAML    COMP  PIC  S9(4).
           02  IMBKNAMF    PICTURE X.
           02  FILLER REDEFINES IMBKNAMF.
             03 IMBKNAMA    PICTURE X.
           02  IMBKNAMI  PIC X(40).
           02  IMBROFFL    COMP  PIC  S9(4).
           02  IMBROFFF    PICTURE X.
           02  FILLER REDEFINES IMBROFFF.
             03 IMBROFFA    PICTURE X.
           02  IMBROFFI  PIC X(1).
           02  IMBRLOCL    COMP  PIC  S9(4).
           02  IMBRLOCF    PICTURE X.
           02  FILLER REDEFINES IMBRLOCF.
             03 IMBRLOCA    PICTURE X.
           02  IMBRLOCI  PIC X(1).
           02  IMBOLOCL    COMP  PIC  S9(4).
           02  IMBOLOCF    PICTURE X.
           02  FILLER REDEFINES IMBOLOCF.
             03 IMBOLOCA    PICTURE X.
           02  IMBOLOCI  PIC X(1).
           02  IMCUTALL    COMP  PIC  S9(4).
           02  IMCUTALF    PICTURE X.
           02  FILLER REDEFINES IMCUTALF.
             03 IMCUTALA    PICTURE X.
           02  IMCUTALI  PIC X(1).
           02  IMCUTIML    COMP  PIC  S9(4).
           02  IMCUTIMF    PICTURE X.
           02  FILLER REDEFINES IMCUTIMF.
             03 IMCUTIMA    PICTURE X.
           02  IMCUTIMI  PIC X(4).
           02  IMRPTOPL    COMP  PIC  S9(4).
           02  IMRPTOPF    PICTURE X.
           02  FILLER REDEFINES IMRPTOPF.
             03 IMRPTOPA    PICTURE X.
           02  IMRPTOPI  PIC X(1).
           02  IMTRDEBL    COMP  PIC  S9(4).
           02  IMTRDEBF    PICTURE X.
           02  FILLER REDEFINES IMTRDEBF.
             03 IMTRDEBA    PICTURE X.
           02  IMTRDEBI  PIC X(4).
           02  IMTRCRDL    COMP  PIC  S9(4).
           02  IMTRCRDF    PICTURE X.
           02  FILLER REDEFINES IMTRCRDF.
             03 IMTRCRDA    PICTURE X.
           02  IMTRCRDI  PIC X(4).
           02  IMATMDRL    COMP  PIC  S9(4).
           02  IMATMDRF    PICTURE X.
           02  FILLER REDEFINES IMATMDRF.
             03 IMATMDRA    PICTURE X.
           02  IMATMDRI  PIC X(4).
           02  IMATMCRL    COMP  PIC  S9(4).
           02  IMATMCRF    PICTURE X.
           02  FILLER REDEFINES IMATMCRF.
             03 IMATMCRA    PICTURE X.
           02  IMATMCRI  PIC X(4).
           02  IMTRCHKL    COMP  PIC  S9(4).
           02  IMTRCHKF    PICTURE X.
           02  FILLER REDEFINES IMTRCHKF.
             03 IMTRCHKA    PICTURE X.
           02  IMTRCHKI  PIC X(4).
           02  IMTRCHGL    COMP  PIC  S9(4).
           02  IMTRCHGF    PICTURE X.
           02  FILLER REDEFINES IMTRCHGF.
             03 IMTRCHGA    PICTURE X.
           02  IMTRCHGI  PIC X(4).
           02  IMACHDRL    COMP  PIC  S9(4).
           02  IMACHDRF    PICTURE X.
           02  FILLER REDEFINES IMACHDRF.
             03 IMACHDRA    PICTURE X.
           02  IMACHDRI  PIC X(4).
           02  IMACHCRL    COMP  PIC  S9(4).
           02  IMACHCRF    PICTURE X.
           02  FILLER REDEFINES IMACHCRF.
             03 IMACHCRA    PICTURE X.
           02  IMACHCRI  PIC X(4).
           02  IMSOPERL    COMP  PIC  S9(4).
           02  IMSOPERF    PICTURE X.
           02  FILLER REDEFINES IMSOPERF.
             03 IMSOPERA    PICTURE X.
           02  IMSOPERI  PIC X(3).
           02  IMOPCD1L    COMP  PIC  S9(4).
           02  IMOPCD1F    PICTURE X.
           02  FILLER REDEFINES IMOPCD1F.
             03 IMOPCD1A    PICTURE X.
           02  IMOPCD1I  PIC X(1).
           02  IMOPER1L    COMP  PIC  S9(4).
           02  IMOPER1F    PICTURE X.
           02  FILLER REDEFINES IMOPER1F.
             03 IMOPER1A    PICTURE X.
           02  IMOPER1I  PIC X(3).
           02  IMOPCD2L    COMP  PIC  S9(4).
           02  IMOPCD2F    PICTURE X.
           02  FILLER REDEFINES IMOPCD2F.
             03 IMOPCD2A    PICTURE X.
           02  IMOPCD2I  PIC X(1).
           02  IMOPER2L    COMP  PIC  S9(4).
           02  IMOPER2F    PICTURE X.
           02  FILLER REDEFINES IMOPER2F.
             03 IMOPER2A    PICTURE X.
           02  IMOPER2I  PIC X(3).
           02  IMOPCD3L    COMP  PIC  S9(4).
           02  IMOPCD3F    PICTURE X.
           02  FILLER REDEFINES IMOPCD3F.
             03 IMOPCD3A    PICTURE X.
           02  IMOPCD3I  PIC X(1).
           02  IMOPER3L    COMP  PIC  S9(4).
           02  IMOPER3F    PICTURE X.
           02  FILLER REDEFINES IMOPER3F.
             03 IMOPER3A    PICTURE X.
           02  IMOPER3I  PIC X(3).
           02  IMOPCD4L    COMP  PIC  S9(4).
           02  IMOPCD4F    PICTURE X.
           02  FILLER REDEFINES IMOPCD4F.
             03 IMOPCD4A    PICTURE X.
           02  IMOPCD4I  PIC X(1).
           02  IMOPER4L    COMP  PIC  S9(4).
           02  IMOPER4F    PICTURE X.
           02  FILLER REDEFINES IMOPER4F.
             03 IMOPER4A    PICTURE X.
           02  IMOPER4I  PIC X(3).
           02  IMOPCD5L    COMP  PIC  S9(4).
           02  IMOPCD5F    PICTURE X.
           02  FILLER REDEFINES IMOPCD5F.
             03 IMOPCD5A    PICTURE X.
           02  IMOPCD5I  PIC X(1).
           02  IMOPER5L    COMP  PIC  S9(4).
           02  IMOPER5F    PICTURE X.
           02  FILLER REDEFINES IMOPER5F.
             03 IMOPER5A    PICTURE X.
           02  IMOPER5I  PIC X(3).
           02  IMOPCD6L    COMP  PIC  S9(4).
           02  IMOPCD6F    PICTURE X.
           02  FILLER REDEFINES IMOPCD6F.
             03 IMOPCD6A    PICTURE X.
           02  IMOPCD6I  PIC X(1).
           02  IMOPER6L    COMP  PIC  S9(4).
           02  IMOPER6F    PICTURE X.
           02  FILLER REDEFINES IMOPER6F.
             03 IMOPER6A    PICTURE X.
           02  IMOPER6I  PIC X(3).
           02  IMOPCD7L    COMP  PIC  S9(4).
           02  IMOPCD7F    PICTURE X.
           02  FILLER REDEFINES IMOPCD7F.
             03 IMOPCD7A    PICTURE X.
           02  IMOPCD7I  PIC X(1).
           02  IMOPER7L    COMP  PIC  S9(4).
           02  IMOPER7F    PICTURE X.
           02  FILLER REDEFINES IMOPER7F.
             03 IMOPER7A    PICTURE X.
           02  IMOPER7I  PIC X(3).
           02  IMOPCD8L    COMP  PIC  S9(4).
           02  IMOPCD8F    PICTURE X.
           02  FILLER REDEFINES IMOPCD8F.
             03 IMOPCD8A    PICTURE X.
           02  IMOPCD8I  PIC X(1).
           02  IMOPER8L    COMP  PIC  S9(4).
           02  IMOPER8F    PICTURE X.
           02  FILLER REDEFINES IMOPER8F.
             03 IMOPER8A    PICTURE X.
           02  IMOPER8I  PIC X(3).
           02  IMOPCD9L    COMP  PIC  S9(4).
           02  IMOPCD9F    PICTURE X.
           02  FILLER REDEFINES IMOPCD9F.
             03 IMOPCD9A    PICTURE X.
           02  IMOPCD9I  PIC X(1).
           02  IMOPER9L    COMP  PIC  S9(4).
           02  IMOPER9F    PICTURE X.
           02  FILLER REDEFINES IMOPER9F.
             03 IMOPER9A    PICTURE X.
           02  IMOPER9I  PIC X(3).
           02  IMOPCDAL    COMP  PIC  S9(4).
           02  IMOPCDAF    PICTURE X.
           02  FILLER REDEFINES IMOPCDAF.
             03 IMOPCDAA    PICTURE X.
           02  IMOPCDAI  PIC X(1).
           02  IMOPERAL    COMP  PIC  S9(4).
           02  IMOPERAF    PICTURE X.
           02  FILLER REDEFINES IMOPERAF.
             03 IMOPERAA    PICTURE X.
           02  IMOPERAI  PIC X(3).
           02  IMOPCDBL    COMP  PIC  S9(4).
           02  IMOPCDBF    PICTURE X.
           02  FILLER REDEFINES IMOPCDBF.
             03 IMOPCDBA    PICTURE X.
           02  IMOPCDBI  PIC X(1).
           02  IMOPERBL    COMP  PIC  S9(4).
           02  IMOPERBF    PICTURE X.
           02  FILLER REDEFINES IMOPERBF.
             03 IMOPERBA    PICTURE X.
           02  IMOPERBI  PIC X(3).
           02  IMOPCDCL    COMP  PIC  S9(4).
           02  IMOPCDCF    PICTURE X.
           02  FILLER REDEFINES IMOPCDCF.
             03 IMOPCDCA    PICTURE X.
           02  IMOPCDCI  PIC X(1).
           02  IMOPERCL    COMP  PIC  S9(4).
           02  IMOPERCF    PICTURE X.
           02  FILLER REDEFINES IMOPERCF.
             03 IMOPERCA    PICTURE X.
           02  IMOPERCI  PIC X(3).
           02  IMOPCDDL    COMP  PIC  S9(4).
           02  IMOPCDDF    PICTURE X.
           02  FILLER REDEFINES IMOPCDDF.
             03 IMOPCDDA    PICTURE X.
           02  IMOPCDDI  PIC X(1).
           02  IMOPERDL    COMP  PIC  S9(4).
           02  IMOPERDF    PICTURE X.
           02  FILLER REDEFINES IMOPERDF.
             03 IMOPERDA    PICTURE X.
           02  IMOPERDI  PIC X(3).
           02  IMOPCDEL    COMP  PIC  S9(4).
           02  IMOPCDEF    PICTURE X.
           02  FILLER REDEFINES IMOPCDEF.
             03 IMOPCDEA    PICTURE X.
           02  IMOPCDEI  PIC X(1).
           02  IMOPEREL    COMP  PIC  S9(4).
           02  IMOPEREF    PICTURE X.
           02  FILLER REDEFINES IMOPEREF.
             03 IMOPEREA    PICTURE X.
           02  IMOPEREI  PIC X(3).
           02  IMBORECL    COMP  PIC  S9(4).
           02  IMBORECF    PICTURE X.
           02  FILLER REDEFINES IMBORECF.
             03 IMBORECA    PICTURE X.
           02  IMBORECI  PIC X(17).
           02  IMBONAML    COMP  PIC  S9(4).
           02  IMBONAMF    PICTURE X.
           02  FILLER REDEFINES IMBONAMF.
             03 IMBONAMA    PICTURE X.
           02  IMBONAMI  PIC X(12).
           02  IMBRNAML    COMP  PIC  S9(4).
           02  IMBRNAMF    PICTURE X.
           02  FILLER REDEFINES IMBRNAMF.
             03 IMBRNAMA    PICTURE X.
           02  IMBRNAMI  PIC X(40).
           02  IMADDELL    COMP  PIC  S9(4).
           02  IMADDELF    PICTURE X.
           02  FILLER REDEFINES IMADDELF.
             03 IMADDELA    PICTURE X.
           02  IMADDELI  PIC X(1).
           02  IMBCTL2L    COMP  PIC  S9(4).
           02  IMBCTL2F    PICTURE X.
           02  FILLER REDEFINES IMBCTL2F.
             03 IMBCTL2A    PICTURE X.
           02  IMBCTL2I  PIC X(3).
           02  IMBCTL3L    COMP  PIC  S9(4).
           02  IMBCTL3F    PICTURE X.
           02  FILLER REDEFINES IMBCTL3F.
             03 IMBCTL3A    PICTURE X.
           02  IMBCTL3I  PIC X(3).
           02  IMBCTL4L    COMP  PIC  S9(4).
           02  IMBCTL4F    PICTURE X.
           02  FILLER REDEFINES IMBCTL4F.
             03 IMBCTL4A    PICTURE X.
           02  IMBCTL4I  PIC X(4).
           02  IMBRCUTL    COMP  PIC  S9(4).
           02  IMBRCUTF    PICTURE X.
           02  FILLER REDEFINES IMBRCUTF.
             03 IMBRCUTA    PICTURE X.
           02  IMBRCUTI  PIC X(4).
           02  IMBRPSTL    COMP  PIC  S9(4).
           02  IMBRPSTF    PICTURE X.
           02  FILLER REDEFINES IMBRPSTF.
             03 IMBRPSTA    PICTURE X.
           02  IMBRPSTI  PIC X(4).
           02  IMBATCHL    COMP  PIC  S9(4).
           02  IMBATCHF    PICTURE X.
           02  FILLER REDEFINES IMBATCHF.
             03 IMBATCHA    PICTURE X.
           02  IMBATCHI  PIC X(4).
           02  IMBSOPEL    COMP  PIC  S9(4).
           02  IMBSOPEF    PICTURE X.
           02  FILLER REDEFINES IMBSOPEF.
             03 IMBSOPEA    PICTURE X.
           02  IMBSOPEI  PIC X(3).
           02  IMBOPC1L    COMP  PIC  S9(4).
           02  IMBOPC1F    PICTURE X.
           02  FILLER REDEFINES IMBOPC1F.
             03 IMBOPC1A    PICTURE X.
           02  IMBOPC1I  PIC X(1).
           02  IMBOPE1L    COMP  PIC  S9(4).
           02  IMBOPE1F    PICTURE X.
           02  FILLER REDEFINES IMBOPE1F.
             03 IMBOPE1A    PICTURE X.
           02  IMBOPE1I  PIC X(3).
           02  IMBOPC2L    COMP  PIC  S9(4).
           02  IMBOPC2F    PICTURE X.
           02  FILLER REDEFINES IMBOPC2F.
             03 IMBOPC2A    PICTURE X.
           02  IMBOPC2I  PIC X(1).
           02  IMBOPE2L    COMP  PIC  S9(4).
           02  IMBOPE2F    PICTURE X.
           02  FILLER REDEFINES IMBOPE2F.
             03 IMBOPE2A    PICTURE X.
           02  IMBOPE2I  PIC X(3).
           02  IMBOPC3L    COMP  PIC  S9(4).
           02  IMBOPC3F    PICTURE X.
           02  FILLER REDEFINES IMBOPC3F.
             03 IMBOPC3A    PICTURE X.
           02  IMBOPC3I  PIC X(1).
           02  IMBOPE3L    COMP  PIC  S9(4).
           02  IMBOPE3F    PICTURE X.
           02  FILLER REDEFINES IMBOPE3F.
             03 IMBOPE3A    PICTURE X.
           02  IMBOPE3I  PIC X(3).
           02  IMBOPC4L    COMP  PIC  S9(4).
           02  IMBOPC4F    PICTURE X.
           02  FILLER REDEFINES IMBOPC4F.
             03 IMBOPC4A    PICTURE X.
           02  IMBOPC4I  PIC X(1).
           02  IMBOPE4L    COMP  PIC  S9(4).
           02  IMBOPE4F    PICTURE X.
           02  FILLER REDEFINES IMBOPE4F.
             03 IMBOPE4A    PICTURE X.
           02  IMBOPE4I  PIC X(3).
           02  IMBOPC5L    COMP  PIC  S9(4).
           02  IMBOPC5F    PICTURE X.
           02  FILLER REDEFINES IMBOPC5F.
             03 IMBOPC5A    PICTURE X.
           02  IMBOPC5I  PIC X(1).
           02  IMBOPE5L    COMP  PIC  S9(4).
           02  IMBOPE5F    PICTURE X.
           02  FILLER REDEFINES IMBOPE5F.
             03 IMBOPE5A    PICTURE X.
           02  IMBOPE5I  PIC X(3).
           02  IMBOPC6L    COMP  PIC  S9(4).
           02  IMBOPC6F    PICTURE X.
           02  FILLER REDEFINES IMBOPC6F.
             03 IMBOPC6A    PICTURE X.
           02  IMBOPC6I  PIC X(1).
           02  IMBOPE6L    COMP  PIC  S9(4).
           02  IMBOPE6F    PICTURE X.
           02  FILLER REDEFINES IMBOPE6F.
             03 IMBOPE6A    PICTURE X.
           02  IMBOPE6I  PIC X(3).
           02  IMBOPC7L    COMP  PIC  S9(4).
           02  IMBOPC7F    PICTURE X.
           02  FILLER REDEFINES IMBOPC7F.
             03 IMBOPC7A    PICTURE X.
           02  IMBOPC7I  PIC X(1).
           02  IMBOPE7L    COMP  PIC  S9(4).
           02  IMBOPE7F    PICTURE X.
           02  FILLER REDEFINES IMBOPE7F.
             03 IMBOPE7A    PICTURE X.
           02  IMBOPE7I  PIC X(3).
           02  IMBOPC8L    COMP  PIC  S9(4).
           02  IMBOPC8F    PICTURE X.
           02  FILLER REDEFINES IMBOPC8F.
             03 IMBOPC8A    PICTURE X.
           02  IMBOPC8I  PIC X(1).
           02  IMBOPE8L    COMP  PIC  S9(4).
           02  IMBOPE8F    PICTURE X.
           02  FILLER REDEFINES IMBOPE8F.
             03 IMBOPE8A    PICTURE X.
           02  IMBOPE8I  PIC X(3).
           02  IMBOPC9L    COMP  PIC  S9(4).
           02  IMBOPC9F    PICTURE X.
           02  FILLER REDEFINES IMBOPC9F.
             03 IMBOPC9A    PICTURE X.
           02  IMBOPC9I  PIC X(1).
           02  IMBOPE9L    COMP  PIC  S9(4).
           02  IMBOPE9F    PICTURE X.
           02  FILLER REDEFINES IMBOPE9F.
             03 IMBOPE9A    PICTURE X.
           02  IMBOPE9I  PIC X(3).
           02  IMBOPCAL    COMP  PIC  S9(4).
           02  IMBOPCAF    PICTURE X.
           02  FILLER REDEFINES IMBOPCAF.
             03 IMBOPCAA    PICTURE X.
           02  IMBOPCAI  PIC X(1).
           02  IMBOPEAL    COMP  PIC  S9(4).
           02  IMBOPEAF    PICTURE X.
           02  FILLER REDEFINES IMBOPEAF.
             03 IMBOPEAA    PICTURE X.
           02  IMBOPEAI  PIC X(3).
           02  IMBOPCBL    COMP  PIC  S9(4).
           02  IMBOPCBF    PICTURE X.
           02  FILLER REDEFINES IMBOPCBF.
             03 IMBOPCBA    PICTURE X.
           02  IMBOPCBI  PIC X(1).
           02  IMBOPEBL    COMP  PIC  S9(4).
           02  IMBOPEBF    PICTURE X.
           02  FILLER REDEFINES IMBOPEBF.
             03 IMBOPEBA    PICTURE X.
           02  IMBOPEBI  PIC X(3).
           02  IMBOPCCL    COMP  PIC  S9(4).
           02  IMBOPCCF    PICTURE X.
           02  FILLER REDEFINES IMBOPCCF.
             03 IMBOPCCA    PICTURE X.
           02  IMBOPCCI  PIC X(1).
           02  IMBOPECL    COMP  PIC  S9(4).
           02  IMBOPECF    PICTURE X.
           02  FILLER REDEFINES IMBOPECF.
             03 IMBOPECA    PICTURE X.
           02  IMBOPECI  PIC X(3).
           02  IMBOPCDL    COMP  PIC  S9(4).
           02  IMBOPCDF    PICTURE X.
           02  FILLER REDEFINES IMBOPCDF.
             03 IMBOPCDA    PICTURE X.
           02  IMBOPCDI  PIC X(1).
           02  IMBOPEDL    COMP  PIC  S9(4).
           02  IMBOPEDF    PICTURE X.
           02  FILLER REDEFINES IMBOPEDF.
             03 IMBOPEDA    PICTURE X.
           02  IMBOPEDI  PIC X(3).
           02  IMBOPCEL    COMP  PIC  S9(4).
           02  IMBOPCEF    PICTURE X.
           02  FILLER REDEFINES IMBOPCEF.
             03 IMBOPCEA    PICTURE X.
           02  IMBOPCEI  PIC X(1).
           02  IMBOPEEL    COMP  PIC  S9(4).
           02  IMBOPEEF    PICTURE X.
           02  FILLER REDEFINES IMBOPEEF.
             03 IMBOPEEA    PICTURE X.
           02  IMBOPEEI  PIC X(3).
           02  IMBONEWL    COMP  PIC  S9(4).
           02  IMBONEWF    PICTURE X.
           02  FILLER REDEFINES IMBONEWF.
             03 IMBONEWA    PICTURE X.
           02  IMBONEWI  PIC X(8).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIMNBAO REDEFINES FIIMNBAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMBANKO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMBKNAMO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMBROFFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBRLOCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOLOCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCUTALO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMCUTIMO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMRPTOPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMTRDEBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMTRCRDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMATMDRO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMATMCRO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMTRCHKO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMTRCHGO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACHDRO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMACHCRO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMSOPERO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCD1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPER1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCD2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPER2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCD3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPER3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCD4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPER4O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCD5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPER5O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCD6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPER6O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCD7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPER7O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCD8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPER8O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCD9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPER9O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCDAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPERAO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCDBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPERBO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCDCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPERCO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCDDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPERDO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMOPCDEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMOPEREO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBORECO  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IMBONAMO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMBRNAMO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMADDELO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBCTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMBRCUTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMBRPSTO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMBATCHO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMBSOPEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPC1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPE1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPC2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPE2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPC3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPE3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPC4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPE4O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPC5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPE5O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPC6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPE6O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPC7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPE7O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPC8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPE8O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPC9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPE9O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPCAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPEAO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPCBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPEBO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPCCO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPECO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPEDO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBOPCEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMBOPEEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMBONEWO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).