       01  FIIMNTAI.
           02  FILLER PIC X(12).
           02  IMTRANL    COMP  PIC  S9(4).
           02  IMTRANF    PICTURE X.
           02  FILLER REDEFINES IMTRANF.
             03 IMTRANA    PICTURE X.
           02  IMTRANI  PIC X(4).
           02  IMDATEL    COMP  PIC  S9(4).
           02  IMDATEF    PICTURE X.
           02  FILLER REDEFINES IMDATEF.
             03 IMDATEA    PICTURE X.
           02  IMDATEI  PIC X(8).
           02  IMTIMEL    COMP  PIC  S9(4).
           02  IMTIMEF    PICTURE X.
           02  FILLER REDEFINES IMTIMEF.
             03 IMTIMEA    PICTURE X.
           02  IMTIMEI  PIC X(8).
           02  IMITMIDL    COMP  PIC  S9(4).
           02  IMITMIDF    PICTURE X.
           02  FILLER REDEFINES IMITMIDF.
             03 IMITMIDA    PICTURE X.
           02  IMITMIDI  PIC X(2).
           02  IMCNTL2L    COMP  PIC  S9(4).
           02  IMCNTL2F    PICTURE X.
           02  FILLER REDEFINES IMCNTL2F.
             03 IMCNTL2A    PICTURE X.
           02  IMCNTL2I  PIC X(3).
           02  IMCNTL3L    COMP  PIC  S9(4).
           02  IMCNTL3F    PICTURE X.
           02  FILLER REDEFINES IMCNTL3F.
             03 IMCNTL3A    PICTURE X.
           02  IMCNTL3I  PIC X(3).
           02  IMCNTL4L    COMP  PIC  S9(4).
           02  IMCNTL4F    PICTURE X.
           02  FILLER REDEFINES IMCNTL4F.
             03 IMCNTL4A    PICTURE X.
           02  IMCNTL4I  PIC X(4).
           02  IMBRNAML    COMP  PIC  S9(4).
           02  IMBRNAMF    PICTURE X.
           02  FILLER REDEFINES IMBRNAMF.
             03 IMBRNAMA    PICTURE X.
           02  IMBRNAMI  PIC X(40).
           02  IMCUTIML    COMP  PIC  S9(4).
           02  IMCUTIMF    PICTURE X.
           02  FILLER REDEFINES IMCUTIMF.
             03 IMCUTIMA    PICTURE X.
           02  IMCUTIMI  PIC X(4).
           02  IMCUTFLL    COMP  PIC  S9(4).
           02  IMCUTFLF    PICTURE X.
           02  FILLER REDEFINES IMCUTFLF.
             03 IMCUTFLA    PICTURE X.
           02  IMCUTFLI  PIC X(1).
           02  IMEXTNDL    COMP  PIC  S9(4).
           02  IMEXTNDF    PICTURE X.
           02  FILLER REDEFINES IMEXTNDF.
             03 IMEXTNDA    PICTURE X.
           02  IMEXTNDI  PIC X(1).
           02  IMREPTDL    COMP  PIC  S9(4).
           02  IMREPTDF    PICTURE X.
           02  FILLER REDEFINES IMREPTDF.
             03 IMREPTDA    PICTURE X.
           02  IMREPTDI  PIC X(1).
           02  IMDBNM3L    COMP  PIC  S9(4).
           02  IMDBNM3F    PICTURE X.
           02  FILLER REDEFINES IMDBNM3F.
             03 IMDBNM3A    PICTURE X.
           02  IMDBNM3I  PIC X(10).
           02  IMDBAM3L    COMP  PIC  S9(4).
           02  IMDBAM3F    PICTURE X.
           02  FILLER REDEFINES IMDBAM3F.
             03 IMDBAM3A    PICTURE X.
           02  IMDBAM3I  PIC X(19).
           02  IMCRNM3L    COMP  PIC  S9(4).
           02  IMCRNM3F    PICTURE X.
           02  FILLER REDEFINES IMCRNM3F.
             03 IMCRNM3A    PICTURE X.
           02  IMCRNM3I  PIC X(10).
           02  IMCRAM3L    COMP  PIC  S9(4).
           02  IMCRAM3F    PICTURE X.
           02  FILLER REDEFINES IMCRAM3F.
             03 IMCRAM3A    PICTURE X.
           02  IMCRAM3I  PIC X(19).
           02  IMDBNM4L    COMP  PIC  S9(4).
           02  IMDBNM4F    PICTURE X.
           02  FILLER REDEFINES IMDBNM4F.
             03 IMDBNM4A    PICTURE X.
           02  IMDBNM4I  PIC X(10).
           02  IMDBAM4L    COMP  PIC  S9(4).
           02  IMDBAM4F    PICTURE X.
           02  FILLER REDEFINES IMDBAM4F.
             03 IMDBAM4A    PICTURE X.
           02  IMDBAM4I  PIC X(19).
           02  IMCRNM4L    COMP  PIC  S9(4).
           02  IMCRNM4F    PICTURE X.
           02  FILLER REDEFINES IMCRNM4F.
             03 IMCRNM4A    PICTURE X.
           02  IMCRNM4I  PIC X(10).
           02  IMCRAM4L    COMP  PIC  S9(4).
           02  IMCRAM4F    PICTURE X.
           02  FILLER REDEFINES IMCRAM4F.
             03 IMCRAM4A    PICTURE X.
           02  IMCRAM4I  PIC X(19).
           02  IMDBNM5L    COMP  PIC  S9(4).
           02  IMDBNM5F    PICTURE X.
           02  FILLER REDEFINES IMDBNM5F.
             03 IMDBNM5A    PICTURE X.
           02  IMDBNM5I  PIC X(10).
           02  IMDBAM5L    COMP  PIC  S9(4).
           02  IMDBAM5F    PICTURE X.
           02  FILLER REDEFINES IMDBAM5F.
             03 IMDBAM5A    PICTURE X.
           02  IMDBAM5I  PIC X(19).
           02  IMCRNM5L    COMP  PIC  S9(4).
           02  IMCRNM5F    PICTURE X.
           02  FILLER REDEFINES IMCRNM5F.
             03 IMCRNM5A    PICTURE X.
           02  IMCRNM5I  PIC X(10).
           02  IMCRAM5L    COMP  PIC  S9(4).
           02  IMCRAM5F    PICTURE X.
           02  FILLER REDEFINES IMCRAM5F.
             03 IMCRAM5A    PICTURE X.
           02  IMCRAM5I  PIC X(19).
           02  IMDBNM6L    COMP  PIC  S9(4).
           02  IMDBNM6F    PICTURE X.
           02  FILLER REDEFINES IMDBNM6F.
             03 IMDBNM6A    PICTURE X.
           02  IMDBNM6I  PIC X(10).
           02  IMDBAM6L    COMP  PIC  S9(4).
           02  IMDBAM6F    PICTURE X.
           02  FILLER REDEFINES IMDBAM6F.
             03 IMDBAM6A    PICTURE X.
           02  IMDBAM6I  PIC X(19).
           02  IMCRNM6L    COMP  PIC  S9(4).
           02  IMCRNM6F    PICTURE X.
           02  FILLER REDEFINES IMCRNM6F.
             03 IMCRNM6A    PICTURE X.
           02  IMCRNM6I  PIC X(10).
           02  IMCRAM6L    COMP  PIC  S9(4).
           02  IMCRAM6F    PICTURE X.
           02  FILLER REDEFINES IMCRAM6F.
             03 IMCRAM6A    PICTURE X.
           02  IMCRAM6I  PIC X(19).
           02  IMDBNM7L    COMP  PIC  S9(4).
           02  IMDBNM7F    PICTURE X.
           02  FILLER REDEFINES IMDBNM7F.
             03 IMDBNM7A    PICTURE X.
           02  IMDBNM7I  PIC X(10).
           02  IMDBAM7L    COMP  PIC  S9(4).
           02  IMDBAM7F    PICTURE X.
           02  FILLER REDEFINES IMDBAM7F.
             03 IMDBAM7A    PICTURE X.
           02  IMDBAM7I  PIC X(19).
           02  IMCRNM7L    COMP  PIC  S9(4).
           02  IMCRNM7F    PICTURE X.
           02  FILLER REDEFINES IMCRNM7F.
             03 IMCRNM7A    PICTURE X.
           02  IMCRNM7I  PIC X(10).
           02  IMCRAM7L    COMP  PIC  S9(4).
           02  IMCRAM7F    PICTURE X.
           02  FILLER REDEFINES IMCRAM7F.
             03 IMCRAM7A    PICTURE X.
           02  IMCRAM7I  PIC X(19).
           02  IMDBNM8L    COMP  PIC  S9(4).
           02  IMDBNM8F    PICTURE X.
           02  FILLER REDEFINES IMDBNM8F.
             03 IMDBNM8A    PICTURE X.
           02  IMDBNM8I  PIC X(10).
           02  IMDBAM8L    COMP  PIC  S9(4).
           02  IMDBAM8F    PICTURE X.
           02  FILLER REDEFINES IMDBAM8F.
             03 IMDBAM8A    PICTURE X.
           02  IMDBAM8I  PIC X(19).
           02  IMCRNM8L    COMP  PIC  S9(4).
           02  IMCRNM8F    PICTURE X.
           02  FILLER REDEFINES IMCRNM8F.
             03 IMCRNM8A    PICTURE X.
           02  IMCRNM8I  PIC X(10).
           02  IMCRAM8L    COMP  PIC  S9(4).
           02  IMCRAM8F    PICTURE X.
           02  FILLER REDEFINES IMCRAM8F.
             03 IMCRAM8A    PICTURE X.
           02  IMCRAM8I  PIC X(19).
           02  IMDBNM9L    COMP  PIC  S9(4).
           02  IMDBNM9F    PICTURE X.
           02  FILLER REDEFINES IMDBNM9F.
             03 IMDBNM9A    PICTURE X.
           02  IMDBNM9I  PIC X(10).
           02  IMDBAM9L    COMP  PIC  S9(4).
           02  IMDBAM9F    PICTURE X.
           02  FILLER REDEFINES IMDBAM9F.
             03 IMDBAM9A    PICTURE X.
           02  IMDBAM9I  PIC X(19).
           02  IMCRNM9L    COMP  PIC  S9(4).
           02  IMCRNM9F    PICTURE X.
           02  FILLER REDEFINES IMCRNM9F.
             03 IMCRNM9A    PICTURE X.
           02  IMCRNM9I  PIC X(10).
           02  IMCRAM9L    COMP  PIC  S9(4).
           02  IMCRAM9F    PICTURE X.
           02  FILLER REDEFINES IMCRAM9F.
             03 IMCRAM9A    PICTURE X.
           02  IMCRAM9I  PIC X(19).
           02  IMERRORL    COMP  PIC  S9(4).
           02  IMERRORF    PICTURE X.
           02  FILLER REDEFINES IMERRORF.
             03 IMERRORA    PICTURE X.
           02  IMERRORI  PIC X(79).
       01  FIIMNTAO REDEFINES FIIMNTAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMITMIDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMCNTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMCNTL4O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMBRNAMO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMCUTIMO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMCUTFLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMEXTNDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMREPTDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMDBNM3O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMDBAM3O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMCRNM3O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCRAM3O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMDBNM4O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMDBAM4O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMCRNM4O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCRAM4O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMDBNM5O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMDBAM5O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMCRNM5O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCRAM5O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMDBNM6O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMDBAM6O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMCRNM6O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCRAM6O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMDBNM7O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMDBAM7O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMCRNM7O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCRAM7O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMDBNM8O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMDBAM8O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMCRNM8O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCRAM8O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMDBNM9O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMDBAM9O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMCRNM9O PIC Z(6),ZZ9.
           02  FILLER PICTURE X(3).
           02  IMCRAM9O PIC Z(12),ZZZ.99.
           02  FILLER PICTURE X(3).
           02  IMERRORO  PIC X(79).