       01  IMR1M02I.
           02  FILLER PIC X(12).
           02  IMTRN01L    COMP  PIC  S9(4).
           02  IMTRN01F    PICTURE X.
           02  FILLER REDEFINES IMTRN01F.
             03 IMTRN01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN01I  PIC X(4).
           02  IMDATE2L    COMP  PIC  S9(4).
           02  IMDATE2F    PICTURE X.
           02  FILLER REDEFINES IMDATE2F.
             03 IMDATE2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDATE2I  PIC X(8).
           02  IMTIME2L    COMP  PIC  S9(4).
           02  IMTIME2F    PICTURE X.
           02  FILLER REDEFINES IMTIME2F.
             03 IMTIME2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTIME2I  PIC X(8).
           02  IMRNUM1L    COMP  PIC  S9(4).
           02  IMRNUM1F    PICTURE X.
           02  FILLER REDEFINES IMRNUM1F.
             03 IMRNUM1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMRNUM1I  PIC X(2).
           02  IMR1001L    COMP  PIC  S9(4).
           02  IMR1001F    PICTURE X.
           02  FILLER REDEFINES IMR1001F.
             03 IMR1001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMR1001I  PIC X(2).
           02  IMR1002L    COMP  PIC  S9(4).
           02  IMR1002F    PICTURE X.
           02  FILLER REDEFINES IMR1002F.
             03 IMR1002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMR1002I  PIC X(3).
           02  IMR1003L    COMP  PIC  S9(4).
           02  IMR1003F    PICTURE X.
           02  FILLER REDEFINES IMR1003F.
             03 IMR1003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMR1003I  PIC X(3).
           02  IMTBLN1L    COMP  PIC  S9(4).
           02  IMTBLN1F    PICTURE X.
           02  FILLER REDEFINES IMTBLN1F.
             03 IMTBLN1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTBLN1I  PIC X(8).
           02  IMTBLE1L    COMP  PIC  S9(4).
           02  IMTBLE1F    PICTURE X.
           02  FILLER REDEFINES IMTBLE1F.
             03 IMTBLE1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTBLE1I  PIC X(8).
           02  IMRNAM1L    COMP  PIC  S9(4).
           02  IMRNAM1F    PICTURE X.
           02  FILLER REDEFINES IMRNAM1F.
             03 IMRNAM1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMRNAM1I  PIC X(20).
           02  IMEXC01L    COMP  PIC  S9(4).
           02  IMEXC01F    PICTURE X.
           02  FILLER REDEFINES IMEXC01F.
             03 IMEXC01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC01I  PIC X(2).
           02  IMEXC02L    COMP  PIC  S9(4).
           02  IMEXC02F    PICTURE X.
           02  FILLER REDEFINES IMEXC02F.
             03 IMEXC02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC02I  PIC X(2).
           02  IMEXC03L    COMP  PIC  S9(4).
           02  IMEXC03F    PICTURE X.
           02  FILLER REDEFINES IMEXC03F.
             03 IMEXC03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC03I  PIC X(2).
           02  IMEXC04L    COMP  PIC  S9(4).
           02  IMEXC04F    PICTURE X.
           02  FILLER REDEFINES IMEXC04F.
             03 IMEXC04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC04I  PIC X(2).
           02  IMEXC05L    COMP  PIC  S9(4).
           02  IMEXC05F    PICTURE X.
           02  FILLER REDEFINES IMEXC05F.
             03 IMEXC05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC05I  PIC X(2).
           02  IMEXC06L    COMP  PIC  S9(4).
           02  IMEXC06F    PICTURE X.
           02  FILLER REDEFINES IMEXC06F.
             03 IMEXC06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC06I  PIC X(2).
           02  IMEXC07L    COMP  PIC  S9(4).
           02  IMEXC07F    PICTURE X.
           02  FILLER REDEFINES IMEXC07F.
             03 IMEXC07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC07I  PIC X(2).
           02  IMEXC08L    COMP  PIC  S9(4).
           02  IMEXC08F    PICTURE X.
           02  FILLER REDEFINES IMEXC08F.
             03 IMEXC08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC08I  PIC X(2).
           02  IMEXC09L    COMP  PIC  S9(4).
           02  IMEXC09F    PICTURE X.
           02  FILLER REDEFINES IMEXC09F.
             03 IMEXC09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC09I  PIC X(2).
           02  IMEXC10L    COMP  PIC  S9(4).
           02  IMEXC10F    PICTURE X.
           02  FILLER REDEFINES IMEXC10F.
             03 IMEXC10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMEXC10I  PIC X(2).
           02  IMFREQ1L    COMP  PIC  S9(4).
           02  IMFREQ1F    PICTURE X.
           02  FILLER REDEFINES IMFREQ1F.
             03 IMFREQ1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFREQ1I  PIC X(1).
           02  IMFREQDL    COMP  PIC  S9(4).
           02  IMFREQDF    PICTURE X.
           02  FILLER REDEFINES IMFREQDF.
             03 IMFREQDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFREQDI  PIC X(10).
           02  IMFRMCDL    COMP  PIC  S9(4).
           02  IMFRMCDF    PICTURE X.
           02  FILLER REDEFINES IMFRMCDF.
             03 IMFRMCDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRMCDI  PIC X(1).
           02  IMPRIORL    COMP  PIC  S9(4).
           02  IMPRIORF    PICTURE X.
           02  FILLER REDEFINES IMPRIORF.
             03 IMPRIORA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPRIORI  PIC X(1).
           02  IMPGMNML    COMP  PIC  S9(4).
           02  IMPGMNMF    PICTURE X.
           02  FILLER REDEFINES IMPGMNMF.
             03 IMPGMNMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPGMNMI  PIC X(4).
           02  IMPROT1L    COMP  PIC  S9(4).
           02  IMPROT1F    PICTURE X.
           02  FILLER REDEFINES IMPROT1F.
             03 IMPROT1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPROT1I  PIC X(1).
           02  IMPROTDL    COMP  PIC  S9(4).
           02  IMPROTDF    PICTURE X.
           02  FILLER REDEFINES IMPROTDF.
             03 IMPROTDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPROTDI  PIC X(5).
           02  IMFILELL    COMP  PIC  S9(4).
           02  IMFILELF    PICTURE X.
           02  FILLER REDEFINES IMFILELF.
             03 IMFILELA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFILELI  PIC X(1).
           02  IMFILEDL    COMP  PIC  S9(4).
           02  IMFILEDF    PICTURE X.
           02  FILLER REDEFINES IMFILEDF.
             03 IMFILEDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFILEDI  PIC X(5).
           02  IMSRTMAL    COMP  PIC  S9(4).
           02  IMSRTMAF    PICTURE X.
           02  FILLER REDEFINES IMSRTMAF.
             03 IMSRTMAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSRTMAI  PIC X(1).
           02  IMSRTINL    COMP  PIC  S9(4).
           02  IMSRTINF    PICTURE X.
           02  FILLER REDEFINES IMSRTINF.
             03 IMSRTINA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSRTINI  PIC X(1).
           02  IMSRTMIL    COMP  PIC  S9(4).
           02  IMSRTMIF    PICTURE X.
           02  FILLER REDEFINES IMSRTMIF.
             03 IMSRTMIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSRTMII  PIC X(1).
           02  IMSPL01L    COMP  PIC  S9(4).
           02  IMSPL01F    PICTURE X.
           02  FILLER REDEFINES IMSPL01F.
             03 IMSPL01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSPL01I  PIC X(1).
           02  IMSPLD1L    COMP  PIC  S9(4).
           02  IMSPLD1F    PICTURE X.
           02  FILLER REDEFINES IMSPLD1F.
             03 IMSPLD1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSPLD1I  PIC X(20).
           02  IMSPL02L    COMP  PIC  S9(4).
           02  IMSPL02F    PICTURE X.
           02  FILLER REDEFINES IMSPL02F.
             03 IMSPL02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSPL02I  PIC X(1).
           02  IMSPLD2L    COMP  PIC  S9(4).
           02  IMSPLD2F    PICTURE X.
           02  FILLER REDEFINES IMSPLD2F.
             03 IMSPLD2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSPLD2I  PIC X(20).
           02  IMFORSPL    COMP  PIC  S9(4).
           02  IMFORSPF    PICTURE X.
           02  FILLER REDEFINES IMFORSPF.
             03 IMFORSPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFORSPI  PIC X(1).
           02  IMPFS02L    COMP  PIC  S9(4).
           02  IMPFS02F    PICTURE X.
           02  FILLER REDEFINES IMPFS02F.
             03 IMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS02I  PIC X(79).
           02  IMERR02L    COMP  PIC  S9(4).
           02  IMERR02F    PICTURE X.
           02  FILLER REDEFINES IMERR02F.
             03 IMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR02I  PIC X(79).
       01  IMR1M02O REDEFINES IMR1M02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN01C    PICTURE X.
           02  IMTRN01P    PICTURE X.
           02  IMTRN01H    PICTURE X.
           02  IMTRN01V    PICTURE X.
           02  IMTRN01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATE2C    PICTURE X.
           02  IMDATE2P    PICTURE X.
           02  IMDATE2H    PICTURE X.
           02  IMDATE2V    PICTURE X.
           02  IMDATE2O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMTIME2C    PICTURE X.
           02  IMTIME2P    PICTURE X.
           02  IMTIME2H    PICTURE X.
           02  IMTIME2V    PICTURE X.
           02  IMTIME2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMRNUM1C    PICTURE X.
           02  IMRNUM1P    PICTURE X.
           02  IMRNUM1H    PICTURE X.
           02  IMRNUM1V    PICTURE X.
           02  IMRNUM1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMR1001C    PICTURE X.
           02  IMR1001P    PICTURE X.
           02  IMR1001H    PICTURE X.
           02  IMR1001V    PICTURE X.
           02  IMR1001O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMR1002C    PICTURE X.
           02  IMR1002P    PICTURE X.
           02  IMR1002H    PICTURE X.
           02  IMR1002V    PICTURE X.
           02  IMR1002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMR1003C    PICTURE X.
           02  IMR1003P    PICTURE X.
           02  IMR1003H    PICTURE X.
           02  IMR1003V    PICTURE X.
           02  IMR1003O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMTBLN1C    PICTURE X.
           02  IMTBLN1P    PICTURE X.
           02  IMTBLN1H    PICTURE X.
           02  IMTBLN1V    PICTURE X.
           02  IMTBLN1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTBLE1C    PICTURE X.
           02  IMTBLE1P    PICTURE X.
           02  IMTBLE1H    PICTURE X.
           02  IMTBLE1V    PICTURE X.
           02  IMTBLE1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMRNAM1C    PICTURE X.
           02  IMRNAM1P    PICTURE X.
           02  IMRNAM1H    PICTURE X.
           02  IMRNAM1V    PICTURE X.
           02  IMRNAM1O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  IMEXC01C    PICTURE X.
           02  IMEXC01P    PICTURE X.
           02  IMEXC01H    PICTURE X.
           02  IMEXC01V    PICTURE X.
           02  IMEXC01O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEXC02C    PICTURE X.
           02  IMEXC02P    PICTURE X.
           02  IMEXC02H    PICTURE X.
           02  IMEXC02V    PICTURE X.
           02  IMEXC02O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEXC03C    PICTURE X.
           02  IMEXC03P    PICTURE X.
           02  IMEXC03H    PICTURE X.
           02  IMEXC03V    PICTURE X.
           02  IMEXC03O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEXC04C    PICTURE X.
           02  IMEXC04P    PICTURE X.
           02  IMEXC04H    PICTURE X.
           02  IMEXC04V    PICTURE X.
           02  IMEXC04O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEXC05C    PICTURE X.
           02  IMEXC05P    PICTURE X.
           02  IMEXC05H    PICTURE X.
           02  IMEXC05V    PICTURE X.
           02  IMEXC05O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEXC06C    PICTURE X.
           02  IMEXC06P    PICTURE X.
           02  IMEXC06H    PICTURE X.
           02  IMEXC06V    PICTURE X.
           02  IMEXC06O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEXC07C    PICTURE X.
           02  IMEXC07P    PICTURE X.
           02  IMEXC07H    PICTURE X.
           02  IMEXC07V    PICTURE X.
           02  IMEXC07O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEXC08C    PICTURE X.
           02  IMEXC08P    PICTURE X.
           02  IMEXC08H    PICTURE X.
           02  IMEXC08V    PICTURE X.
           02  IMEXC08O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEXC09C    PICTURE X.
           02  IMEXC09P    PICTURE X.
           02  IMEXC09H    PICTURE X.
           02  IMEXC09V    PICTURE X.
           02  IMEXC09O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMEXC10C    PICTURE X.
           02  IMEXC10P    PICTURE X.
           02  IMEXC10H    PICTURE X.
           02  IMEXC10V    PICTURE X.
           02  IMEXC10O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMFREQ1C    PICTURE X.
           02  IMFREQ1P    PICTURE X.
           02  IMFREQ1H    PICTURE X.
           02  IMFREQ1V    PICTURE X.
           02  IMFREQ1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFREQDC    PICTURE X.
           02  IMFREQDP    PICTURE X.
           02  IMFREQDH    PICTURE X.
           02  IMFREQDV    PICTURE X.
           02  IMFREQDO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IMFRMCDC    PICTURE X.
           02  IMFRMCDP    PICTURE X.
           02  IMFRMCDH    PICTURE X.
           02  IMFRMCDV    PICTURE X.
           02  IMFRMCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPRIORC    PICTURE X.
           02  IMPRIORP    PICTURE X.
           02  IMPRIORH    PICTURE X.
           02  IMPRIORV    PICTURE X.
           02  IMPRIORO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPGMNMC    PICTURE X.
           02  IMPGMNMP    PICTURE X.
           02  IMPGMNMH    PICTURE X.
           02  IMPGMNMV    PICTURE X.
           02  IMPGMNMO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMPROT1C    PICTURE X.
           02  IMPROT1P    PICTURE X.
           02  IMPROT1H    PICTURE X.
           02  IMPROT1V    PICTURE X.
           02  IMPROT1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPROTDC    PICTURE X.
           02  IMPROTDP    PICTURE X.
           02  IMPROTDH    PICTURE X.
           02  IMPROTDV    PICTURE X.
           02  IMPROTDO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMFILELC    PICTURE X.
           02  IMFILELP    PICTURE X.
           02  IMFILELH    PICTURE X.
           02  IMFILELV    PICTURE X.
           02  IMFILELO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFILEDC    PICTURE X.
           02  IMFILEDP    PICTURE X.
           02  IMFILEDH    PICTURE X.
           02  IMFILEDV    PICTURE X.
           02  IMFILEDO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  IMSRTMAC    PICTURE X.
           02  IMSRTMAP    PICTURE X.
           02  IMSRTMAH    PICTURE X.
           02  IMSRTMAV    PICTURE X.
           02  IMSRTMAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSRTINC    PICTURE X.
           02  IMSRTINP    PICTURE X.
           02  IMSRTINH    PICTURE X.
           02  IMSRTINV    PICTURE X.
           02  IMSRTINO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSRTMIC    PICTURE X.
           02  IMSRTMIP    PICTURE X.
           02  IMSRTMIH    PICTURE X.
           02  IMSRTMIV    PICTURE X.
           02  IMSRTMIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSPL01C    PICTURE X.
           02  IMSPL01P    PICTURE X.
           02  IMSPL01H    PICTURE X.
           02  IMSPL01V    PICTURE X.
           02  IMSPL01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSPLD1C    PICTURE X.
           02  IMSPLD1P    PICTURE X.
           02  IMSPLD1H    PICTURE X.
           02  IMSPLD1V    PICTURE X.
           02  IMSPLD1O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  IMSPL02C    PICTURE X.
           02  IMSPL02P    PICTURE X.
           02  IMSPL02H    PICTURE X.
           02  IMSPL02V    PICTURE X.
           02  IMSPL02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSPLD2C    PICTURE X.
           02  IMSPLD2P    PICTURE X.
           02  IMSPLD2H    PICTURE X.
           02  IMSPLD2V    PICTURE X.
           02  IMSPLD2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  IMFORSPC    PICTURE X.
           02  IMFORSPP    PICTURE X.
           02  IMFORSPH    PICTURE X.
           02  IMFORSPV    PICTURE X.
           02  IMFORSPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS02C    PICTURE X.
           02  IMPFS02P    PICTURE X.
           02  IMPFS02H    PICTURE X.
           02  IMPFS02V    PICTURE X.
           02  IMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR02C    PICTURE X.
           02  IMERR02P    PICTURE X.
           02  IMERR02H    PICTURE X.
           02  IMERR02V    PICTURE X.
           02  IMERR02O  PIC X(79).
       01  IMR1M01I REDEFINES IMR1M02I.
           02  FILLER PIC X(12).
           02  IMTRN00L    COMP  PIC  S9(4).
           02  IMTRN00F    PICTURE X.
           02  FILLER REDEFINES IMTRN00F.
             03 IMTRN00A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN00I  PIC X(4).
           02  IMDATE1L    COMP  PIC  S9(4).
           02  IMDATE1F    PICTURE X.
           02  FILLER REDEFINES IMDATE1F.
             03 IMDATE1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDATE1I  PIC X(8).
           02  IMTIME1L    COMP  PIC  S9(4).
           02  IMTIME1F    PICTURE X.
           02  FILLER REDEFINES IMTIME1F.
             03 IMTIME1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTIME1I  PIC X(8).
           02  IMRNUMBL    COMP  PIC  S9(4).
           02  IMRNUMBF    PICTURE X.
           02  FILLER REDEFINES IMRNUMBF.
             03 IMRNUMBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMRNUMBI  PIC X(2).
           02  IMXCTL1L    COMP  PIC  S9(4).
           02  IMXCTL1F    PICTURE X.
           02  FILLER REDEFINES IMXCTL1F.
             03 IMXCTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL1I  PIC X(2).
           02  IMXCTL2L    COMP  PIC  S9(4).
           02  IMXCTL2F    PICTURE X.
           02  FILLER REDEFINES IMXCTL2F.
             03 IMXCTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL2I  PIC X(3).
           02  IMXCTL3L    COMP  PIC  S9(4).
           02  IMXCTL3F    PICTURE X.
           02  FILLER REDEFINES IMXCTL3F.
             03 IMXCTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL3I  PIC X(3).
           02  IMPFS01L    COMP  PIC  S9(4).
           02  IMPFS01F    PICTURE X.
           02  FILLER REDEFINES IMPFS01F.
             03 IMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS01I  PIC X(79).
           02  IMERR01L    COMP  PIC  S9(4).
           02  IMERR01F    PICTURE X.
           02  FILLER REDEFINES IMERR01F.
             03 IMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR01I  PIC X(79).
       01  IMR1M01O REDEFINES IMR1M01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN00C    PICTURE X.
           02  IMTRN00P    PICTURE X.
           02  IMTRN00H    PICTURE X.
           02  IMTRN00V    PICTURE X.
           02  IMTRN00O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATE1C    PICTURE X.
           02  IMDATE1P    PICTURE X.
           02  IMDATE1H    PICTURE X.
           02  IMDATE1V    PICTURE X.
           02  IMDATE1O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMTIME1C    PICTURE X.
           02  IMTIME1P    PICTURE X.
           02  IMTIME1H    PICTURE X.
           02  IMTIME1V    PICTURE X.
           02  IMTIME1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMRNUMBC    PICTURE X.
           02  IMRNUMBP    PICTURE X.
           02  IMRNUMBH    PICTURE X.
           02  IMRNUMBV    PICTURE X.
           02  IMRNUMBO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMXCTL1C    PICTURE X.
           02  IMXCTL1P    PICTURE X.
           02  IMXCTL1H    PICTURE X.
           02  IMXCTL1V    PICTURE X.
           02  IMXCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMXCTL2C    PICTURE X.
           02  IMXCTL2P    PICTURE X.
           02  IMXCTL2H    PICTURE X.
           02  IMXCTL2V    PICTURE X.
           02  IMXCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL3C    PICTURE X.
           02  IMXCTL3P    PICTURE X.
           02  IMXCTL3H    PICTURE X.
           02  IMXCTL3V    PICTURE X.
           02  IMXCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMPFS01C    PICTURE X.
           02  IMPFS01P    PICTURE X.
           02  IMPFS01H    PICTURE X.
           02  IMPFS01V    PICTURE X.
           02  IMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR01C    PICTURE X.
           02  IMERR01P    PICTURE X.
           02  IMERR01H    PICTURE X.
           02  IMERR01V    PICTURE X.
           02  IMERR01O  PIC X(79).