       01  IMR2M02I.
           02  FILLER PIC X(12).
           02  IMTRANBL    COMP  PIC  S9(4).
           02  IMTRANBF    PICTURE X.
           02  FILLER REDEFINES IMTRANBF.
             03 IMTRANBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRANBI  PIC X(4).
           02  IMDATE2L    COMP  PIC  S9(4).
           02  IMDATE2F    PICTURE X.
           02  FILLER REDEFINES IMDATE2F.
             03 IMDATE2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDATE2I  PIC X(8).
           02  IMTIME2L    COMP  PIC  S9(4).
           02  IMTIME2F    PICTURE X.
           02  FILLER REDEFINES IMTIME2F.
             03 IMTIME2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTIME2I  PIC X(8).
           02  IMR2011L    COMP  PIC  S9(4).
           02  IMR2011F    PICTURE X.
           02  FILLER REDEFINES IMR2011F.
             03 IMR2011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMR2011I  PIC X(2).
           02  IMR2012L    COMP  PIC  S9(4).
           02  IMR2012F    PICTURE X.
           02  FILLER REDEFINES IMR2012F.
             03 IMR2012A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMR2012I  PIC X(3).
           02  IMR2013L    COMP  PIC  S9(4).
           02  IMR2013F    PICTURE X.
           02  FILLER REDEFINES IMR2013F.
             03 IMR2013A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMR2013I  PIC X(3).
           02  IMTBLN2L    COMP  PIC  S9(4).
           02  IMTBLN2F    PICTURE X.
           02  FILLER REDEFINES IMTBLN2F.
             03 IMTBLN2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTBLN2I  PIC X(8).
           02  IMMAJ01L    COMP  PIC  S9(4).
           02  IMMAJ01F    PICTURE X.
           02  FILLER REDEFINES IMMAJ01F.
             03 IMMAJ01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJ01I  PIC X(1).
           02  IMDST11L    COMP  PIC  S9(4).
           02  IMDST11F    PICTURE X.
           02  FILLER REDEFINES IMDST11F.
             03 IMDST11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDST11I  PIC X(1).
           02  IMMAJ11L    COMP  PIC  S9(4).
           02  IMMAJ11F    PICTURE X.
           02  FILLER REDEFINES IMMAJ11F.
             03 IMMAJ11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJ11I  PIC X(3).
           02  IMMAJ12L    COMP  PIC  S9(4).
           02  IMMAJ12F    PICTURE X.
           02  FILLER REDEFINES IMMAJ12F.
             03 IMMAJ12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJ12I  PIC X(1).
           02  IMMAJDAL    COMP  PIC  S9(4).
           02  IMMAJDAF    PICTURE X.
           02  FILLER REDEFINES IMMAJDAF.
             03 IMMAJDAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJDAI  PIC X(40).
           02  IMMAJ21L    COMP  PIC  S9(4).
           02  IMMAJ21F    PICTURE X.
           02  FILLER REDEFINES IMMAJ21F.
             03 IMMAJ21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJ21I  PIC X(3).
           02  IMMAJ22L    COMP  PIC  S9(4).
           02  IMMAJ22F    PICTURE X.
           02  FILLER REDEFINES IMMAJ22F.
             03 IMMAJ22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJ22I  PIC X(1).
           02  IMMAJDBL    COMP  PIC  S9(4).
           02  IMMAJDBF    PICTURE X.
           02  FILLER REDEFINES IMMAJDBF.
             03 IMMAJDBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJDBI  PIC X(40).
           02  IMMAJ31L    COMP  PIC  S9(4).
           02  IMMAJ31F    PICTURE X.
           02  FILLER REDEFINES IMMAJ31F.
             03 IMMAJ31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJ31I  PIC X(3).
           02  IMMAJ32L    COMP  PIC  S9(4).
           02  IMMAJ32F    PICTURE X.
           02  FILLER REDEFINES IMMAJ32F.
             03 IMMAJ32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJ32I  PIC X(1).
           02  IMMAJDCL    COMP  PIC  S9(4).
           02  IMMAJDCF    PICTURE X.
           02  FILLER REDEFINES IMMAJDCF.
             03 IMMAJDCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJDCI  PIC X(40).
           02  IMMAJ41L    COMP  PIC  S9(4).
           02  IMMAJ41F    PICTURE X.
           02  FILLER REDEFINES IMMAJ41F.
             03 IMMAJ41A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJ41I  PIC X(3).
           02  IMMAJ42L    COMP  PIC  S9(4).
           02  IMMAJ42F    PICTURE X.
           02  FILLER REDEFINES IMMAJ42F.
             03 IMMAJ42A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJ42I  PIC X(1).
           02  IMMAJDDL    COMP  PIC  S9(4).
           02  IMMAJDDF    PICTURE X.
           02  FILLER REDEFINES IMMAJDDF.
             03 IMMAJDDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMAJDDI  PIC X(40).
           02  IMINT01L    COMP  PIC  S9(4).
           02  IMINT01F    PICTURE X.
           02  FILLER REDEFINES IMINT01F.
             03 IMINT01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINT01I  PIC X(1).
           02  IMINT11L    COMP  PIC  S9(4).
           02  IMINT11F    PICTURE X.
           02  FILLER REDEFINES IMINT11F.
             03 IMINT11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINT11I  PIC X(3).
           02  IMINT12L    COMP  PIC  S9(4).
           02  IMINT12F    PICTURE X.
           02  FILLER REDEFINES IMINT12F.
             03 IMINT12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINT12I  PIC X(1).
           02  IMINTDAL    COMP  PIC  S9(4).
           02  IMINTDAF    PICTURE X.
           02  FILLER REDEFINES IMINTDAF.
             03 IMINTDAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINTDAI  PIC X(40).
           02  IMINT21L    COMP  PIC  S9(4).
           02  IMINT21F    PICTURE X.
           02  FILLER REDEFINES IMINT21F.
             03 IMINT21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINT21I  PIC X(3).
           02  IMINT22L    COMP  PIC  S9(4).
           02  IMINT22F    PICTURE X.
           02  FILLER REDEFINES IMINT22F.
             03 IMINT22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINT22I  PIC X(1).
           02  IMINTDBL    COMP  PIC  S9(4).
           02  IMINTDBF    PICTURE X.
           02  FILLER REDEFINES IMINTDBF.
             03 IMINTDBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINTDBI  PIC X(40).
           02  IMINT31L    COMP  PIC  S9(4).
           02  IMINT31F    PICTURE X.
           02  FILLER REDEFINES IMINT31F.
             03 IMINT31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINT31I  PIC X(3).
           02  IMINT32L    COMP  PIC  S9(4).
           02  IMINT32F    PICTURE X.
           02  FILLER REDEFINES IMINT32F.
             03 IMINT32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINT32I  PIC X(1).
           02  IMINTDCL    COMP  PIC  S9(4).
           02  IMINTDCF    PICTURE X.
           02  FILLER REDEFINES IMINTDCF.
             03 IMINTDCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMINTDCI  PIC X(40).
           02  IMMIN01L    COMP  PIC  S9(4).
           02  IMMIN01F    PICTURE X.
           02  FILLER REDEFINES IMMIN01F.
             03 IMMIN01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMIN01I  PIC X(1).
           02  IMMIN11L    COMP  PIC  S9(4).
           02  IMMIN11F    PICTURE X.
           02  FILLER REDEFINES IMMIN11F.
             03 IMMIN11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMIN11I  PIC X(3).
           02  IMMIN12L    COMP  PIC  S9(4).
           02  IMMIN12F    PICTURE X.
           02  FILLER REDEFINES IMMIN12F.
             03 IMMIN12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMIN12I  PIC X(1).
           02  IMMINDAL    COMP  PIC  S9(4).
           02  IMMINDAF    PICTURE X.
           02  FILLER REDEFINES IMMINDAF.
             03 IMMINDAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMINDAI  PIC X(40).
           02  IMMIN21L    COMP  PIC  S9(4).
           02  IMMIN21F    PICTURE X.
           02  FILLER REDEFINES IMMIN21F.
             03 IMMIN21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMIN21I  PIC X(3).
           02  IMMIN22L    COMP  PIC  S9(4).
           02  IMMIN22F    PICTURE X.
           02  FILLER REDEFINES IMMIN22F.
             03 IMMIN22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMIN22I  PIC X(1).
           02  IMMINDBL    COMP  PIC  S9(4).
           02  IMMINDBF    PICTURE X.
           02  FILLER REDEFINES IMMINDBF.
             03 IMMINDBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMINDBI  PIC X(40).
           02  IMMIN31L    COMP  PIC  S9(4).
           02  IMMIN31F    PICTURE X.
           02  FILLER REDEFINES IMMIN31F.
             03 IMMIN31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMIN31I  PIC X(3).
           02  IMMIN32L    COMP  PIC  S9(4).
           02  IMMIN32F    PICTURE X.
           02  FILLER REDEFINES IMMIN32F.
             03 IMMIN32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMIN32I  PIC X(1).
           02  IMMINDCL    COMP  PIC  S9(4).
           02  IMMINDCF    PICTURE X.
           02  FILLER REDEFINES IMMINDCF.
             03 IMMINDCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMINDCI  PIC X(40).
           02  IMPFS02L    COMP  PIC  S9(4).
           02  IMPFS02F    PICTURE X.
           02  FILLER REDEFINES IMPFS02F.
             03 IMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS02I  PIC X(79).
           02  IMERR02L    COMP  PIC  S9(4).
           02  IMERR02F    PICTURE X.
           02  FILLER REDEFINES IMERR02F.
             03 IMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR02I  PIC X(79).
       01  IMR2M02O REDEFINES IMR2M02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANBC    PICTURE X.
           02  IMTRANBP    PICTURE X.
           02  IMTRANBH    PICTURE X.
           02  IMTRANBV    PICTURE X.
           02  IMTRANBO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATE2C    PICTURE X.
           02  IMDATE2P    PICTURE X.
           02  IMDATE2H    PICTURE X.
           02  IMDATE2V    PICTURE X.
           02  IMDATE2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIME2C    PICTURE X.
           02  IMTIME2P    PICTURE X.
           02  IMTIME2H    PICTURE X.
           02  IMTIME2V    PICTURE X.
           02  IMTIME2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMR2011C    PICTURE X.
           02  IMR2011P    PICTURE X.
           02  IMR2011H    PICTURE X.
           02  IMR2011V    PICTURE X.
           02  IMR2011O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMR2012C    PICTURE X.
           02  IMR2012P    PICTURE X.
           02  IMR2012H    PICTURE X.
           02  IMR2012V    PICTURE X.
           02  IMR2012O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMR2013C    PICTURE X.
           02  IMR2013P    PICTURE X.
           02  IMR2013H    PICTURE X.
           02  IMR2013V    PICTURE X.
           02  IMR2013O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMTBLN2C    PICTURE X.
           02  IMTBLN2P    PICTURE X.
           02  IMTBLN2H    PICTURE X.
           02  IMTBLN2V    PICTURE X.
           02  IMTBLN2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMMAJ01C    PICTURE X.
           02  IMMAJ01P    PICTURE X.
           02  IMMAJ01H    PICTURE X.
           02  IMMAJ01V    PICTURE X.
           02  IMMAJ01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMDST11C    PICTURE X.
           02  IMDST11P    PICTURE X.
           02  IMDST11H    PICTURE X.
           02  IMDST11V    PICTURE X.
           02  IMDST11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMAJ11C    PICTURE X.
           02  IMMAJ11P    PICTURE X.
           02  IMMAJ11H    PICTURE X.
           02  IMMAJ11V    PICTURE X.
           02  IMMAJ11O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMMAJ12C    PICTURE X.
           02  IMMAJ12P    PICTURE X.
           02  IMMAJ12H    PICTURE X.
           02  IMMAJ12V    PICTURE X.
           02  IMMAJ12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMAJDAC    PICTURE X.
           02  IMMAJDAP    PICTURE X.
           02  IMMAJDAH    PICTURE X.
           02  IMMAJDAV    PICTURE X.
           02  IMMAJDAO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMMAJ21C    PICTURE X.
           02  IMMAJ21P    PICTURE X.
           02  IMMAJ21H    PICTURE X.
           02  IMMAJ21V    PICTURE X.
           02  IMMAJ21O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMMAJ22C    PICTURE X.
           02  IMMAJ22P    PICTURE X.
           02  IMMAJ22H    PICTURE X.
           02  IMMAJ22V    PICTURE X.
           02  IMMAJ22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMAJDBC    PICTURE X.
           02  IMMAJDBP    PICTURE X.
           02  IMMAJDBH    PICTURE X.
           02  IMMAJDBV    PICTURE X.
           02  IMMAJDBO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMMAJ31C    PICTURE X.
           02  IMMAJ31P    PICTURE X.
           02  IMMAJ31H    PICTURE X.
           02  IMMAJ31V    PICTURE X.
           02  IMMAJ31O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMMAJ32C    PICTURE X.
           02  IMMAJ32P    PICTURE X.
           02  IMMAJ32H    PICTURE X.
           02  IMMAJ32V    PICTURE X.
           02  IMMAJ32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMAJDCC    PICTURE X.
           02  IMMAJDCP    PICTURE X.
           02  IMMAJDCH    PICTURE X.
           02  IMMAJDCV    PICTURE X.
           02  IMMAJDCO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMMAJ41C    PICTURE X.
           02  IMMAJ41P    PICTURE X.
           02  IMMAJ41H    PICTURE X.
           02  IMMAJ41V    PICTURE X.
           02  IMMAJ41O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMMAJ42C    PICTURE X.
           02  IMMAJ42P    PICTURE X.
           02  IMMAJ42H    PICTURE X.
           02  IMMAJ42V    PICTURE X.
           02  IMMAJ42O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMAJDDC    PICTURE X.
           02  IMMAJDDP    PICTURE X.
           02  IMMAJDDH    PICTURE X.
           02  IMMAJDDV    PICTURE X.
           02  IMMAJDDO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMINT01C    PICTURE X.
           02  IMINT01P    PICTURE X.
           02  IMINT01H    PICTURE X.
           02  IMINT01V    PICTURE X.
           02  IMINT01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMINT11C    PICTURE X.
           02  IMINT11P    PICTURE X.
           02  IMINT11H    PICTURE X.
           02  IMINT11V    PICTURE X.
           02  IMINT11O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMINT12C    PICTURE X.
           02  IMINT12P    PICTURE X.
           02  IMINT12H    PICTURE X.
           02  IMINT12V    PICTURE X.
           02  IMINT12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMINTDAC    PICTURE X.
           02  IMINTDAP    PICTURE X.
           02  IMINTDAH    PICTURE X.
           02  IMINTDAV    PICTURE X.
           02  IMINTDAO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMINT21C    PICTURE X.
           02  IMINT21P    PICTURE X.
           02  IMINT21H    PICTURE X.
           02  IMINT21V    PICTURE X.
           02  IMINT21O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMINT22C    PICTURE X.
           02  IMINT22P    PICTURE X.
           02  IMINT22H    PICTURE X.
           02  IMINT22V    PICTURE X.
           02  IMINT22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMINTDBC    PICTURE X.
           02  IMINTDBP    PICTURE X.
           02  IMINTDBH    PICTURE X.
           02  IMINTDBV    PICTURE X.
           02  IMINTDBO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMINT31C    PICTURE X.
           02  IMINT31P    PICTURE X.
           02  IMINT31H    PICTURE X.
           02  IMINT31V    PICTURE X.
           02  IMINT31O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMINT32C    PICTURE X.
           02  IMINT32P    PICTURE X.
           02  IMINT32H    PICTURE X.
           02  IMINT32V    PICTURE X.
           02  IMINT32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMINTDCC    PICTURE X.
           02  IMINTDCP    PICTURE X.
           02  IMINTDCH    PICTURE X.
           02  IMINTDCV    PICTURE X.
           02  IMINTDCO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMMIN01C    PICTURE X.
           02  IMMIN01P    PICTURE X.
           02  IMMIN01H    PICTURE X.
           02  IMMIN01V    PICTURE X.
           02  IMMIN01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMIN11C    PICTURE X.
           02  IMMIN11P    PICTURE X.
           02  IMMIN11H    PICTURE X.
           02  IMMIN11V    PICTURE X.
           02  IMMIN11O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMMIN12C    PICTURE X.
           02  IMMIN12P    PICTURE X.
           02  IMMIN12H    PICTURE X.
           02  IMMIN12V    PICTURE X.
           02  IMMIN12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMINDAC    PICTURE X.
           02  IMMINDAP    PICTURE X.
           02  IMMINDAH    PICTURE X.
           02  IMMINDAV    PICTURE X.
           02  IMMINDAO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMMIN21C    PICTURE X.
           02  IMMIN21P    PICTURE X.
           02  IMMIN21H    PICTURE X.
           02  IMMIN21V    PICTURE X.
           02  IMMIN21O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMMIN22C    PICTURE X.
           02  IMMIN22P    PICTURE X.
           02  IMMIN22H    PICTURE X.
           02  IMMIN22V    PICTURE X.
           02  IMMIN22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMINDBC    PICTURE X.
           02  IMMINDBP    PICTURE X.
           02  IMMINDBH    PICTURE X.
           02  IMMINDBV    PICTURE X.
           02  IMMINDBO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMMIN31C    PICTURE X.
           02  IMMIN31P    PICTURE X.
           02  IMMIN31H    PICTURE X.
           02  IMMIN31V    PICTURE X.
           02  IMMIN31O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMMIN32C    PICTURE X.
           02  IMMIN32P    PICTURE X.
           02  IMMIN32H    PICTURE X.
           02  IMMIN32V    PICTURE X.
           02  IMMIN32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMMINDCC    PICTURE X.
           02  IMMINDCP    PICTURE X.
           02  IMMINDCH    PICTURE X.
           02  IMMINDCV    PICTURE X.
           02  IMMINDCO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  IMPFS02C    PICTURE X.
           02  IMPFS02P    PICTURE X.
           02  IMPFS02H    PICTURE X.
           02  IMPFS02V    PICTURE X.
           02  IMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR02C    PICTURE X.
           02  IMERR02P    PICTURE X.
           02  IMERR02H    PICTURE X.
           02  IMERR02V    PICTURE X.
           02  IMERR02O  PIC X(79).
       01  IMR2M01I REDEFINES IMR2M02I.
           02  FILLER PIC X(12).
           02  IMTRANAL    COMP  PIC  S9(4).
           02  IMTRANAF    PICTURE X.
           02  FILLER REDEFINES IMTRANAF.
             03 IMTRANAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRANAI  PIC X(4).
           02  IMDATE1L    COMP  PIC  S9(4).
           02  IMDATE1F    PICTURE X.
           02  FILLER REDEFINES IMDATE1F.
             03 IMDATE1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDATE1I  PIC X(8).
           02  IMTIME1L    COMP  PIC  S9(4).
           02  IMTIME1F    PICTURE X.
           02  FILLER REDEFINES IMTIME1F.
             03 IMTIME1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTIME1I  PIC X(8).
           02  IMXCTL1L    COMP  PIC  S9(4).
           02  IMXCTL1F    PICTURE X.
           02  FILLER REDEFINES IMXCTL1F.
             03 IMXCTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL1I  PIC X(2).
           02  IMXCTL2L    COMP  PIC  S9(4).
           02  IMXCTL2F    PICTURE X.
           02  FILLER REDEFINES IMXCTL2F.
             03 IMXCTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL2I  PIC X(3).
           02  IMXCTL3L    COMP  PIC  S9(4).
           02  IMXCTL3F    PICTURE X.
           02  FILLER REDEFINES IMXCTL3F.
             03 IMXCTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL3I  PIC X(3).
           02  IMSRTMAL    COMP  PIC  S9(4).
           02  IMSRTMAF    PICTURE X.
           02  FILLER REDEFINES IMSRTMAF.
             03 IMSRTMAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSRTMAI  PIC X(1).
           02  IMSRTINL    COMP  PIC  S9(4).
           02  IMSRTINF    PICTURE X.
           02  FILLER REDEFINES IMSRTINF.
             03 IMSRTINA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSRTINI  PIC X(1).
           02  IMSRTMIL    COMP  PIC  S9(4).
           02  IMSRTMIF    PICTURE X.
           02  FILLER REDEFINES IMSRTMIF.
             03 IMSRTMIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSRTMII  PIC X(1).
           02  IMPFS01L    COMP  PIC  S9(4).
           02  IMPFS01F    PICTURE X.
           02  FILLER REDEFINES IMPFS01F.
             03 IMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS01I  PIC X(79).
           02  IMERR01L    COMP  PIC  S9(4).
           02  IMERR01F    PICTURE X.
           02  FILLER REDEFINES IMERR01F.
             03 IMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR01I  PIC X(79).
       01  IMR2M01O REDEFINES IMR2M01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRANAC    PICTURE X.
           02  IMTRANAP    PICTURE X.
           02  IMTRANAH    PICTURE X.
           02  IMTRANAV    PICTURE X.
           02  IMTRANAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATE1C    PICTURE X.
           02  IMDATE1P    PICTURE X.
           02  IMDATE1H    PICTURE X.
           02  IMDATE1V    PICTURE X.
           02  IMDATE1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIME1C    PICTURE X.
           02  IMTIME1P    PICTURE X.
           02  IMTIME1H    PICTURE X.
           02  IMTIME1V    PICTURE X.
           02  IMTIME1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMXCTL1C    PICTURE X.
           02  IMXCTL1P    PICTURE X.
           02  IMXCTL1H    PICTURE X.
           02  IMXCTL1V    PICTURE X.
           02  IMXCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMXCTL2C    PICTURE X.
           02  IMXCTL2P    PICTURE X.
           02  IMXCTL2H    PICTURE X.
           02  IMXCTL2V    PICTURE X.
           02  IMXCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL3C    PICTURE X.
           02  IMXCTL3P    PICTURE X.
           02  IMXCTL3H    PICTURE X.
           02  IMXCTL3V    PICTURE X.
           02  IMXCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMSRTMAC    PICTURE X.
           02  IMSRTMAP    PICTURE X.
           02  IMSRTMAH    PICTURE X.
           02  IMSRTMAV    PICTURE X.
           02  IMSRTMAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSRTINC    PICTURE X.
           02  IMSRTINP    PICTURE X.
           02  IMSRTINH    PICTURE X.
           02  IMSRTINV    PICTURE X.
           02  IMSRTINO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSRTMIC    PICTURE X.
           02  IMSRTMIP    PICTURE X.
           02  IMSRTMIH    PICTURE X.
           02  IMSRTMIV    PICTURE X.
           02  IMSRTMIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS01C    PICTURE X.
           02  IMPFS01P    PICTURE X.
           02  IMPFS01H    PICTURE X.
           02  IMPFS01V    PICTURE X.
           02  IMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR01C    PICTURE X.
           02  IMERR01P    PICTURE X.
           02  IMERR01H    PICTURE X.
           02  IMERR01V    PICTURE X.
           02  IMERR01O  PIC X(79).