       01  IMR3M02I.
           02  FILLER PIC X(12).
           02  IMTRN01L    COMP  PIC  S9(4).
           02  IMTRN01F    PICTURE X.
           02  FILLER REDEFINES IMTRN01F.
             03 IMTRN01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN01I  PIC X(4).
           02  IMDAT01L    COMP  PIC  S9(4).
           02  IMDAT01F    PICTURE X.
           02  FILLER REDEFINES IMDAT01F.
             03 IMDAT01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDAT01I  PIC X(8).
           02  IMTIM01L    COMP  PIC  S9(4).
           02  IMTIM01F    PICTURE X.
           02  FILLER REDEFINES IMTIM01F.
             03 IMTIM01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTIM01I  PIC X(8).
           02  IMR3011L    COMP  PIC  S9(4).
           02  IMR3011F    PICTURE X.
           02  FILLER REDEFINES IMR3011F.
             03 IMR3011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMR3011I  PIC X(2).
           02  IMR3012L    COMP  PIC  S9(4).
           02  IMR3012F    PICTURE X.
           02  FILLER REDEFINES IMR3012F.
             03 IMR3012A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMR3012I  PIC X(3).
           02  IMR3013L    COMP  PIC  S9(4).
           02  IMR3013F    PICTURE X.
           02  FILLER REDEFINES IMR3013F.
             03 IMR3013A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMR3013I  PIC X(3).
           02  IMTBL02L    COMP  PIC  S9(4).
           02  IMTBL02F    PICTURE X.
           02  FILLER REDEFINES IMTBL02F.
             03 IMTBL02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTBL02I  PIC X(8).
           02  IMFRQ01L    COMP  PIC  S9(4).
           02  IMFRQ01F    PICTURE X.
           02  FILLER REDEFINES IMFRQ01F.
             03 IMFRQ01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ01I  PIC X(1).
           02  IMSCB01L    COMP  PIC  S9(4).
           02  IMSCB01F    PICTURE X.
           02  FILLER REDEFINES IMSCB01F.
             03 IMSCB01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB01I  PIC X(1).
           02  IMSDY11L    COMP  PIC  S9(4).
           02  IMSDY11F    PICTURE X.
           02  FILLER REDEFINES IMSDY11F.
             03 IMSDY11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY11I  PIC X(2).
           02  IMSDY21L    COMP  PIC  S9(4).
           02  IMSDY21F    PICTURE X.
           02  FILLER REDEFINES IMSDY21F.
             03 IMSDY21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY21I  PIC X(2).
           02  IMMFQ01L    COMP  PIC  S9(4).
           02  IMMFQ01F    PICTURE X.
           02  FILLER REDEFINES IMMFQ01F.
             03 IMMFQ01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ01I  PIC X(1).
           02  IMFMN01L    COMP  PIC  S9(4).
           02  IMFMN01F    PICTURE X.
           02  FILLER REDEFINES IMFMN01F.
             03 IMFMN01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN01I  PIC X(1).
           02  IMFRQ02L    COMP  PIC  S9(4).
           02  IMFRQ02F    PICTURE X.
           02  FILLER REDEFINES IMFRQ02F.
             03 IMFRQ02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ02I  PIC X(1).
           02  IMSCB02L    COMP  PIC  S9(4).
           02  IMSCB02F    PICTURE X.
           02  FILLER REDEFINES IMSCB02F.
             03 IMSCB02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB02I  PIC X(1).
           02  IMSDY12L    COMP  PIC  S9(4).
           02  IMSDY12F    PICTURE X.
           02  FILLER REDEFINES IMSDY12F.
             03 IMSDY12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY12I  PIC X(2).
           02  IMSDY22L    COMP  PIC  S9(4).
           02  IMSDY22F    PICTURE X.
           02  FILLER REDEFINES IMSDY22F.
             03 IMSDY22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY22I  PIC X(2).
           02  IMMFQ02L    COMP  PIC  S9(4).
           02  IMMFQ02F    PICTURE X.
           02  FILLER REDEFINES IMMFQ02F.
             03 IMMFQ02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ02I  PIC X(1).
           02  IMFMN02L    COMP  PIC  S9(4).
           02  IMFMN02F    PICTURE X.
           02  FILLER REDEFINES IMFMN02F.
             03 IMFMN02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN02I  PIC X(1).
           02  IMFRQ03L    COMP  PIC  S9(4).
           02  IMFRQ03F    PICTURE X.
           02  FILLER REDEFINES IMFRQ03F.
             03 IMFRQ03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ03I  PIC X(1).
           02  IMSCB03L    COMP  PIC  S9(4).
           02  IMSCB03F    PICTURE X.
           02  FILLER REDEFINES IMSCB03F.
             03 IMSCB03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB03I  PIC X(1).
           02  IMSDY13L    COMP  PIC  S9(4).
           02  IMSDY13F    PICTURE X.
           02  FILLER REDEFINES IMSDY13F.
             03 IMSDY13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY13I  PIC X(2).
           02  IMSDY23L    COMP  PIC  S9(4).
           02  IMSDY23F    PICTURE X.
           02  FILLER REDEFINES IMSDY23F.
             03 IMSDY23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY23I  PIC X(2).
           02  IMMFQ03L    COMP  PIC  S9(4).
           02  IMMFQ03F    PICTURE X.
           02  FILLER REDEFINES IMMFQ03F.
             03 IMMFQ03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ03I  PIC X(1).
           02  IMFMN03L    COMP  PIC  S9(4).
           02  IMFMN03F    PICTURE X.
           02  FILLER REDEFINES IMFMN03F.
             03 IMFMN03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN03I  PIC X(1).
           02  IMFRQ04L    COMP  PIC  S9(4).
           02  IMFRQ04F    PICTURE X.
           02  FILLER REDEFINES IMFRQ04F.
             03 IMFRQ04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ04I  PIC X(1).
           02  IMSCB04L    COMP  PIC  S9(4).
           02  IMSCB04F    PICTURE X.
           02  FILLER REDEFINES IMSCB04F.
             03 IMSCB04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB04I  PIC X(1).
           02  IMSDY14L    COMP  PIC  S9(4).
           02  IMSDY14F    PICTURE X.
           02  FILLER REDEFINES IMSDY14F.
             03 IMSDY14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY14I  PIC X(2).
           02  IMSDY24L    COMP  PIC  S9(4).
           02  IMSDY24F    PICTURE X.
           02  FILLER REDEFINES IMSDY24F.
             03 IMSDY24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY24I  PIC X(2).
           02  IMMFQ04L    COMP  PIC  S9(4).
           02  IMMFQ04F    PICTURE X.
           02  FILLER REDEFINES IMMFQ04F.
             03 IMMFQ04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ04I  PIC X(1).
           02  IMFMN04L    COMP  PIC  S9(4).
           02  IMFMN04F    PICTURE X.
           02  FILLER REDEFINES IMFMN04F.
             03 IMFMN04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN04I  PIC X(1).
           02  IMFRQ05L    COMP  PIC  S9(4).
           02  IMFRQ05F    PICTURE X.
           02  FILLER REDEFINES IMFRQ05F.
             03 IMFRQ05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ05I  PIC X(1).
           02  IMSCB05L    COMP  PIC  S9(4).
           02  IMSCB05F    PICTURE X.
           02  FILLER REDEFINES IMSCB05F.
             03 IMSCB05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB05I  PIC X(1).
           02  IMSDY15L    COMP  PIC  S9(4).
           02  IMSDY15F    PICTURE X.
           02  FILLER REDEFINES IMSDY15F.
             03 IMSDY15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY15I  PIC X(2).
           02  IMSDY25L    COMP  PIC  S9(4).
           02  IMSDY25F    PICTURE X.
           02  FILLER REDEFINES IMSDY25F.
             03 IMSDY25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY25I  PIC X(2).
           02  IMMFQ05L    COMP  PIC  S9(4).
           02  IMMFQ05F    PICTURE X.
           02  FILLER REDEFINES IMMFQ05F.
             03 IMMFQ05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ05I  PIC X(1).
           02  IMFMN05L    COMP  PIC  S9(4).
           02  IMFMN05F    PICTURE X.
           02  FILLER REDEFINES IMFMN05F.
             03 IMFMN05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN05I  PIC X(1).
           02  IMFRQ06L    COMP  PIC  S9(4).
           02  IMFRQ06F    PICTURE X.
           02  FILLER REDEFINES IMFRQ06F.
             03 IMFRQ06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ06I  PIC X(1).
           02  IMSCB06L    COMP  PIC  S9(4).
           02  IMSCB06F    PICTURE X.
           02  FILLER REDEFINES IMSCB06F.
             03 IMSCB06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB06I  PIC X(1).
           02  IMSDY16L    COMP  PIC  S9(4).
           02  IMSDY16F    PICTURE X.
           02  FILLER REDEFINES IMSDY16F.
             03 IMSDY16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY16I  PIC X(2).
           02  IMSDY26L    COMP  PIC  S9(4).
           02  IMSDY26F    PICTURE X.
           02  FILLER REDEFINES IMSDY26F.
             03 IMSDY26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY26I  PIC X(2).
           02  IMMFQ06L    COMP  PIC  S9(4).
           02  IMMFQ06F    PICTURE X.
           02  FILLER REDEFINES IMMFQ06F.
             03 IMMFQ06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ06I  PIC X(1).
           02  IMFMN06L    COMP  PIC  S9(4).
           02  IMFMN06F    PICTURE X.
           02  FILLER REDEFINES IMFMN06F.
             03 IMFMN06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN06I  PIC X(1).
           02  IMFRQ07L    COMP  PIC  S9(4).
           02  IMFRQ07F    PICTURE X.
           02  FILLER REDEFINES IMFRQ07F.
             03 IMFRQ07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ07I  PIC X(1).
           02  IMSCB07L    COMP  PIC  S9(4).
           02  IMSCB07F    PICTURE X.
           02  FILLER REDEFINES IMSCB07F.
             03 IMSCB07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB07I  PIC X(1).
           02  IMSDY17L    COMP  PIC  S9(4).
           02  IMSDY17F    PICTURE X.
           02  FILLER REDEFINES IMSDY17F.
             03 IMSDY17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY17I  PIC X(2).
           02  IMSDY27L    COMP  PIC  S9(4).
           02  IMSDY27F    PICTURE X.
           02  FILLER REDEFINES IMSDY27F.
             03 IMSDY27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY27I  PIC X(2).
           02  IMMFQ07L    COMP  PIC  S9(4).
           02  IMMFQ07F    PICTURE X.
           02  FILLER REDEFINES IMMFQ07F.
             03 IMMFQ07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ07I  PIC X(1).
           02  IMFMN07L    COMP  PIC  S9(4).
           02  IMFMN07F    PICTURE X.
           02  FILLER REDEFINES IMFMN07F.
             03 IMFMN07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN07I  PIC X(1).
           02  IMFRQ08L    COMP  PIC  S9(4).
           02  IMFRQ08F    PICTURE X.
           02  FILLER REDEFINES IMFRQ08F.
             03 IMFRQ08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ08I  PIC X(1).
           02  IMSCB08L    COMP  PIC  S9(4).
           02  IMSCB08F    PICTURE X.
           02  FILLER REDEFINES IMSCB08F.
             03 IMSCB08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB08I  PIC X(1).
           02  IMSDY18L    COMP  PIC  S9(4).
           02  IMSDY18F    PICTURE X.
           02  FILLER REDEFINES IMSDY18F.
             03 IMSDY18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY18I  PIC X(2).
           02  IMSDY28L    COMP  PIC  S9(4).
           02  IMSDY28F    PICTURE X.
           02  FILLER REDEFINES IMSDY28F.
             03 IMSDY28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY28I  PIC X(2).
           02  IMMFQ08L    COMP  PIC  S9(4).
           02  IMMFQ08F    PICTURE X.
           02  FILLER REDEFINES IMMFQ08F.
             03 IMMFQ08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ08I  PIC X(1).
           02  IMFMN08L    COMP  PIC  S9(4).
           02  IMFMN08F    PICTURE X.
           02  FILLER REDEFINES IMFMN08F.
             03 IMFMN08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN08I  PIC X(1).
           02  IMFRQ09L    COMP  PIC  S9(4).
           02  IMFRQ09F    PICTURE X.
           02  FILLER REDEFINES IMFRQ09F.
             03 IMFRQ09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ09I  PIC X(1).
           02  IMSCB09L    COMP  PIC  S9(4).
           02  IMSCB09F    PICTURE X.
           02  FILLER REDEFINES IMSCB09F.
             03 IMSCB09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB09I  PIC X(1).
           02  IMSDY19L    COMP  PIC  S9(4).
           02  IMSDY19F    PICTURE X.
           02  FILLER REDEFINES IMSDY19F.
             03 IMSDY19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY19I  PIC X(2).
           02  IMSDY29L    COMP  PIC  S9(4).
           02  IMSDY29F    PICTURE X.
           02  FILLER REDEFINES IMSDY29F.
             03 IMSDY29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY29I  PIC X(2).
           02  IMMFQ09L    COMP  PIC  S9(4).
           02  IMMFQ09F    PICTURE X.
           02  FILLER REDEFINES IMMFQ09F.
             03 IMMFQ09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ09I  PIC X(1).
           02  IMFMN09L    COMP  PIC  S9(4).
           02  IMFMN09F    PICTURE X.
           02  FILLER REDEFINES IMFMN09F.
             03 IMFMN09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN09I  PIC X(1).
           02  IMFRQ10L    COMP  PIC  S9(4).
           02  IMFRQ10F    PICTURE X.
           02  FILLER REDEFINES IMFRQ10F.
             03 IMFRQ10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFRQ10I  PIC X(1).
           02  IMSCB10L    COMP  PIC  S9(4).
           02  IMSCB10F    PICTURE X.
           02  FILLER REDEFINES IMSCB10F.
             03 IMSCB10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSCB10I  PIC X(1).
           02  IMSDY10L    COMP  PIC  S9(4).
           02  IMSDY10F    PICTURE X.
           02  FILLER REDEFINES IMSDY10F.
             03 IMSDY10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY10I  PIC X(2).
           02  IMSDY20L    COMP  PIC  S9(4).
           02  IMSDY20F    PICTURE X.
           02  FILLER REDEFINES IMSDY20F.
             03 IMSDY20A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMSDY20I  PIC X(2).
           02  IMMFQ10L    COMP  PIC  S9(4).
           02  IMMFQ10F    PICTURE X.
           02  FILLER REDEFINES IMMFQ10F.
             03 IMMFQ10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMMFQ10I  PIC X(1).
           02  IMFMN10L    COMP  PIC  S9(4).
           02  IMFMN10F    PICTURE X.
           02  FILLER REDEFINES IMFMN10F.
             03 IMFMN10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMFMN10I  PIC X(1).
           02  IMPFS02L    COMP  PIC  S9(4).
           02  IMPFS02F    PICTURE X.
           02  FILLER REDEFINES IMPFS02F.
             03 IMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS02I  PIC X(79).
           02  IMERR02L    COMP  PIC  S9(4).
           02  IMERR02F    PICTURE X.
           02  FILLER REDEFINES IMERR02F.
             03 IMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR02I  PIC X(79).
       01  IMR3M02O REDEFINES IMR3M02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN01C    PICTURE X.
           02  IMTRN01P    PICTURE X.
           02  IMTRN01H    PICTURE X.
           02  IMTRN01V    PICTURE X.
           02  IMTRN01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDAT01C    PICTURE X.
           02  IMDAT01P    PICTURE X.
           02  IMDAT01H    PICTURE X.
           02  IMDAT01V    PICTURE X.
           02  IMDAT01O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMTIM01C    PICTURE X.
           02  IMTIM01P    PICTURE X.
           02  IMTIM01H    PICTURE X.
           02  IMTIM01V    PICTURE X.
           02  IMTIM01O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMR3011C    PICTURE X.
           02  IMR3011P    PICTURE X.
           02  IMR3011H    PICTURE X.
           02  IMR3011V    PICTURE X.
           02  IMR3011O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMR3012C    PICTURE X.
           02  IMR3012P    PICTURE X.
           02  IMR3012H    PICTURE X.
           02  IMR3012V    PICTURE X.
           02  IMR3012O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMR3013C    PICTURE X.
           02  IMR3013P    PICTURE X.
           02  IMR3013H    PICTURE X.
           02  IMR3013V    PICTURE X.
           02  IMR3013O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMTBL02C    PICTURE X.
           02  IMTBL02P    PICTURE X.
           02  IMTBL02H    PICTURE X.
           02  IMTBL02V    PICTURE X.
           02  IMTBL02O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMFRQ01C    PICTURE X.
           02  IMFRQ01P    PICTURE X.
           02  IMFRQ01H    PICTURE X.
           02  IMFRQ01V    PICTURE X.
           02  IMFRQ01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB01C    PICTURE X.
           02  IMSCB01P    PICTURE X.
           02  IMSCB01H    PICTURE X.
           02  IMSCB01V    PICTURE X.
           02  IMSCB01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY11C    PICTURE X.
           02  IMSDY11P    PICTURE X.
           02  IMSDY11H    PICTURE X.
           02  IMSDY11V    PICTURE X.
           02  IMSDY11O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY21C    PICTURE X.
           02  IMSDY21P    PICTURE X.
           02  IMSDY21H    PICTURE X.
           02  IMSDY21V    PICTURE X.
           02  IMSDY21O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ01C    PICTURE X.
           02  IMMFQ01P    PICTURE X.
           02  IMMFQ01H    PICTURE X.
           02  IMMFQ01V    PICTURE X.
           02  IMMFQ01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN01C    PICTURE X.
           02  IMFMN01P    PICTURE X.
           02  IMFMN01H    PICTURE X.
           02  IMFMN01V    PICTURE X.
           02  IMFMN01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFRQ02C    PICTURE X.
           02  IMFRQ02P    PICTURE X.
           02  IMFRQ02H    PICTURE X.
           02  IMFRQ02V    PICTURE X.
           02  IMFRQ02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB02C    PICTURE X.
           02  IMSCB02P    PICTURE X.
           02  IMSCB02H    PICTURE X.
           02  IMSCB02V    PICTURE X.
           02  IMSCB02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY12C    PICTURE X.
           02  IMSDY12P    PICTURE X.
           02  IMSDY12H    PICTURE X.
           02  IMSDY12V    PICTURE X.
           02  IMSDY12O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY22C    PICTURE X.
           02  IMSDY22P    PICTURE X.
           02  IMSDY22H    PICTURE X.
           02  IMSDY22V    PICTURE X.
           02  IMSDY22O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ02C    PICTURE X.
           02  IMMFQ02P    PICTURE X.
           02  IMMFQ02H    PICTURE X.
           02  IMMFQ02V    PICTURE X.
           02  IMMFQ02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN02C    PICTURE X.
           02  IMFMN02P    PICTURE X.
           02  IMFMN02H    PICTURE X.
           02  IMFMN02V    PICTURE X.
           02  IMFMN02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFRQ03C    PICTURE X.
           02  IMFRQ03P    PICTURE X.
           02  IMFRQ03H    PICTURE X.
           02  IMFRQ03V    PICTURE X.
           02  IMFRQ03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB03C    PICTURE X.
           02  IMSCB03P    PICTURE X.
           02  IMSCB03H    PICTURE X.
           02  IMSCB03V    PICTURE X.
           02  IMSCB03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY13C    PICTURE X.
           02  IMSDY13P    PICTURE X.
           02  IMSDY13H    PICTURE X.
           02  IMSDY13V    PICTURE X.
           02  IMSDY13O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY23C    PICTURE X.
           02  IMSDY23P    PICTURE X.
           02  IMSDY23H    PICTURE X.
           02  IMSDY23V    PICTURE X.
           02  IMSDY23O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ03C    PICTURE X.
           02  IMMFQ03P    PICTURE X.
           02  IMMFQ03H    PICTURE X.
           02  IMMFQ03V    PICTURE X.
           02  IMMFQ03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN03C    PICTURE X.
           02  IMFMN03P    PICTURE X.
           02  IMFMN03H    PICTURE X.
           02  IMFMN03V    PICTURE X.
           02  IMFMN03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFRQ04C    PICTURE X.
           02  IMFRQ04P    PICTURE X.
           02  IMFRQ04H    PICTURE X.
           02  IMFRQ04V    PICTURE X.
           02  IMFRQ04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB04C    PICTURE X.
           02  IMSCB04P    PICTURE X.
           02  IMSCB04H    PICTURE X.
           02  IMSCB04V    PICTURE X.
           02  IMSCB04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY14C    PICTURE X.
           02  IMSDY14P    PICTURE X.
           02  IMSDY14H    PICTURE X.
           02  IMSDY14V    PICTURE X.
           02  IMSDY14O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY24C    PICTURE X.
           02  IMSDY24P    PICTURE X.
           02  IMSDY24H    PICTURE X.
           02  IMSDY24V    PICTURE X.
           02  IMSDY24O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ04C    PICTURE X.
           02  IMMFQ04P    PICTURE X.
           02  IMMFQ04H    PICTURE X.
           02  IMMFQ04V    PICTURE X.
           02  IMMFQ04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN04C    PICTURE X.
           02  IMFMN04P    PICTURE X.
           02  IMFMN04H    PICTURE X.
           02  IMFMN04V    PICTURE X.
           02  IMFMN04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFRQ05C    PICTURE X.
           02  IMFRQ05P    PICTURE X.
           02  IMFRQ05H    PICTURE X.
           02  IMFRQ05V    PICTURE X.
           02  IMFRQ05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB05C    PICTURE X.
           02  IMSCB05P    PICTURE X.
           02  IMSCB05H    PICTURE X.
           02  IMSCB05V    PICTURE X.
           02  IMSCB05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY15C    PICTURE X.
           02  IMSDY15P    PICTURE X.
           02  IMSDY15H    PICTURE X.
           02  IMSDY15V    PICTURE X.
           02  IMSDY15O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY25C    PICTURE X.
           02  IMSDY25P    PICTURE X.
           02  IMSDY25H    PICTURE X.
           02  IMSDY25V    PICTURE X.
           02  IMSDY25O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ05C    PICTURE X.
           02  IMMFQ05P    PICTURE X.
           02  IMMFQ05H    PICTURE X.
           02  IMMFQ05V    PICTURE X.
           02  IMMFQ05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN05C    PICTURE X.
           02  IMFMN05P    PICTURE X.
           02  IMFMN05H    PICTURE X.
           02  IMFMN05V    PICTURE X.
           02  IMFMN05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFRQ06C    PICTURE X.
           02  IMFRQ06P    PICTURE X.
           02  IMFRQ06H    PICTURE X.
           02  IMFRQ06V    PICTURE X.
           02  IMFRQ06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB06C    PICTURE X.
           02  IMSCB06P    PICTURE X.
           02  IMSCB06H    PICTURE X.
           02  IMSCB06V    PICTURE X.
           02  IMSCB06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY16C    PICTURE X.
           02  IMSDY16P    PICTURE X.
           02  IMSDY16H    PICTURE X.
           02  IMSDY16V    PICTURE X.
           02  IMSDY16O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY26C    PICTURE X.
           02  IMSDY26P    PICTURE X.
           02  IMSDY26H    PICTURE X.
           02  IMSDY26V    PICTURE X.
           02  IMSDY26O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ06C    PICTURE X.
           02  IMMFQ06P    PICTURE X.
           02  IMMFQ06H    PICTURE X.
           02  IMMFQ06V    PICTURE X.
           02  IMMFQ06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN06C    PICTURE X.
           02  IMFMN06P    PICTURE X.
           02  IMFMN06H    PICTURE X.
           02  IMFMN06V    PICTURE X.
           02  IMFMN06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFRQ07C    PICTURE X.
           02  IMFRQ07P    PICTURE X.
           02  IMFRQ07H    PICTURE X.
           02  IMFRQ07V    PICTURE X.
           02  IMFRQ07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB07C    PICTURE X.
           02  IMSCB07P    PICTURE X.
           02  IMSCB07H    PICTURE X.
           02  IMSCB07V    PICTURE X.
           02  IMSCB07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY17C    PICTURE X.
           02  IMSDY17P    PICTURE X.
           02  IMSDY17H    PICTURE X.
           02  IMSDY17V    PICTURE X.
           02  IMSDY17O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY27C    PICTURE X.
           02  IMSDY27P    PICTURE X.
           02  IMSDY27H    PICTURE X.
           02  IMSDY27V    PICTURE X.
           02  IMSDY27O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ07C    PICTURE X.
           02  IMMFQ07P    PICTURE X.
           02  IMMFQ07H    PICTURE X.
           02  IMMFQ07V    PICTURE X.
           02  IMMFQ07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN07C    PICTURE X.
           02  IMFMN07P    PICTURE X.
           02  IMFMN07H    PICTURE X.
           02  IMFMN07V    PICTURE X.
           02  IMFMN07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFRQ08C    PICTURE X.
           02  IMFRQ08P    PICTURE X.
           02  IMFRQ08H    PICTURE X.
           02  IMFRQ08V    PICTURE X.
           02  IMFRQ08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB08C    PICTURE X.
           02  IMSCB08P    PICTURE X.
           02  IMSCB08H    PICTURE X.
           02  IMSCB08V    PICTURE X.
           02  IMSCB08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY18C    PICTURE X.
           02  IMSDY18P    PICTURE X.
           02  IMSDY18H    PICTURE X.
           02  IMSDY18V    PICTURE X.
           02  IMSDY18O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY28C    PICTURE X.
           02  IMSDY28P    PICTURE X.
           02  IMSDY28H    PICTURE X.
           02  IMSDY28V    PICTURE X.
           02  IMSDY28O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ08C    PICTURE X.
           02  IMMFQ08P    PICTURE X.
           02  IMMFQ08H    PICTURE X.
           02  IMMFQ08V    PICTURE X.
           02  IMMFQ08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN08C    PICTURE X.
           02  IMFMN08P    PICTURE X.
           02  IMFMN08H    PICTURE X.
           02  IMFMN08V    PICTURE X.
           02  IMFMN08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFRQ09C    PICTURE X.
           02  IMFRQ09P    PICTURE X.
           02  IMFRQ09H    PICTURE X.
           02  IMFRQ09V    PICTURE X.
           02  IMFRQ09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB09C    PICTURE X.
           02  IMSCB09P    PICTURE X.
           02  IMSCB09H    PICTURE X.
           02  IMSCB09V    PICTURE X.
           02  IMSCB09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY19C    PICTURE X.
           02  IMSDY19P    PICTURE X.
           02  IMSDY19H    PICTURE X.
           02  IMSDY19V    PICTURE X.
           02  IMSDY19O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY29C    PICTURE X.
           02  IMSDY29P    PICTURE X.
           02  IMSDY29H    PICTURE X.
           02  IMSDY29V    PICTURE X.
           02  IMSDY29O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ09C    PICTURE X.
           02  IMMFQ09P    PICTURE X.
           02  IMMFQ09H    PICTURE X.
           02  IMMFQ09V    PICTURE X.
           02  IMMFQ09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN09C    PICTURE X.
           02  IMFMN09P    PICTURE X.
           02  IMFMN09H    PICTURE X.
           02  IMFMN09V    PICTURE X.
           02  IMFMN09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFRQ10C    PICTURE X.
           02  IMFRQ10P    PICTURE X.
           02  IMFRQ10H    PICTURE X.
           02  IMFRQ10V    PICTURE X.
           02  IMFRQ10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSCB10C    PICTURE X.
           02  IMSCB10P    PICTURE X.
           02  IMSCB10H    PICTURE X.
           02  IMSCB10V    PICTURE X.
           02  IMSCB10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMSDY10C    PICTURE X.
           02  IMSDY10P    PICTURE X.
           02  IMSDY10H    PICTURE X.
           02  IMSDY10V    PICTURE X.
           02  IMSDY10O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMSDY20C    PICTURE X.
           02  IMSDY20P    PICTURE X.
           02  IMSDY20H    PICTURE X.
           02  IMSDY20V    PICTURE X.
           02  IMSDY20O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMMFQ10C    PICTURE X.
           02  IMMFQ10P    PICTURE X.
           02  IMMFQ10H    PICTURE X.
           02  IMMFQ10V    PICTURE X.
           02  IMMFQ10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMFMN10C    PICTURE X.
           02  IMFMN10P    PICTURE X.
           02  IMFMN10H    PICTURE X.
           02  IMFMN10V    PICTURE X.
           02  IMFMN10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS02C    PICTURE X.
           02  IMPFS02P    PICTURE X.
           02  IMPFS02H    PICTURE X.
           02  IMPFS02V    PICTURE X.
           02  IMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR02C    PICTURE X.
           02  IMERR02P    PICTURE X.
           02  IMERR02H    PICTURE X.
           02  IMERR02V    PICTURE X.
           02  IMERR02O  PIC X(79).
       01  IMR3M01I REDEFINES IMR3M02I.
           02  FILLER PIC X(12).
           02  IMTRN00L    COMP  PIC  S9(4).
           02  IMTRN00F    PICTURE X.
           02  FILLER REDEFINES IMTRN00F.
             03 IMTRN00A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN00I  PIC X(4).
           02  IMDATE1L    COMP  PIC  S9(4).
           02  IMDATE1F    PICTURE X.
           02  FILLER REDEFINES IMDATE1F.
             03 IMDATE1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDATE1I  PIC X(8).
           02  IMTIME1L    COMP  PIC  S9(4).
           02  IMTIME1F    PICTURE X.
           02  FILLER REDEFINES IMTIME1F.
             03 IMTIME1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTIME1I  PIC X(8).
           02  IMXCTL1L    COMP  PIC  S9(4).
           02  IMXCTL1F    PICTURE X.
           02  FILLER REDEFINES IMXCTL1F.
             03 IMXCTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL1I  PIC X(2).
           02  IMXCTL2L    COMP  PIC  S9(4).
           02  IMXCTL2F    PICTURE X.
           02  FILLER REDEFINES IMXCTL2F.
             03 IMXCTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL2I  PIC X(3).
           02  IMXCTL3L    COMP  PIC  S9(4).
           02  IMXCTL3F    PICTURE X.
           02  FILLER REDEFINES IMXCTL3F.
             03 IMXCTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL3I  PIC X(3).
           02  IMPFS01L    COMP  PIC  S9(4).
           02  IMPFS01F    PICTURE X.
           02  FILLER REDEFINES IMPFS01F.
             03 IMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS01I  PIC X(79).
           02  IMERR01L    COMP  PIC  S9(4).
           02  IMERR01F    PICTURE X.
           02  FILLER REDEFINES IMERR01F.
             03 IMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR01I  PIC X(79).
       01  IMR3M01O REDEFINES IMR3M01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN00C    PICTURE X.
           02  IMTRN00P    PICTURE X.
           02  IMTRN00H    PICTURE X.
           02  IMTRN00V    PICTURE X.
           02  IMTRN00O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATE1C    PICTURE X.
           02  IMDATE1P    PICTURE X.
           02  IMDATE1H    PICTURE X.
           02  IMDATE1V    PICTURE X.
           02  IMDATE1O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMTIME1C    PICTURE X.
           02  IMTIME1P    PICTURE X.
           02  IMTIME1H    PICTURE X.
           02  IMTIME1V    PICTURE X.
           02  IMTIME1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMXCTL1C    PICTURE X.
           02  IMXCTL1P    PICTURE X.
           02  IMXCTL1H    PICTURE X.
           02  IMXCTL1V    PICTURE X.
           02  IMXCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMXCTL2C    PICTURE X.
           02  IMXCTL2P    PICTURE X.
           02  IMXCTL2H    PICTURE X.
           02  IMXCTL2V    PICTURE X.
           02  IMXCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL3C    PICTURE X.
           02  IMXCTL3P    PICTURE X.
           02  IMXCTL3H    PICTURE X.
           02  IMXCTL3V    PICTURE X.
           02  IMXCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMPFS01C    PICTURE X.
           02  IMPFS01P    PICTURE X.
           02  IMPFS01H    PICTURE X.
           02  IMPFS01V    PICTURE X.
           02  IMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR01C    PICTURE X.
           02  IMERR01P    PICTURE X.
           02  IMERR01H    PICTURE X.
           02  IMERR01V    PICTURE X.
           02  IMERR01O  PIC X(79).