       01  IMSBM02I.
           02  FILLER PIC X(12).
           02  IMTRN01L    COMP  PIC  S9(4).
           02  IMTRN01F    PICTURE X.
           02  FILLER REDEFINES IMTRN01F.
             03 IMTRN01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN01I  PIC X(4).
           02  DATE002L    COMP  PIC  S9(4).
           02  DATE002F    PICTURE X.
           02  FILLER REDEFINES DATE002F.
             03 DATE002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DATE002I  PIC X(8).
           02  TIME002L    COMP  PIC  S9(4).
           02  TIME002F    PICTURE X.
           02  FILLER REDEFINES TIME002F.
             03 TIME002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TIME002I  PIC X(8).
           02  CTL1002L    COMP  PIC  S9(4).
           02  CTL1002F    PICTURE X.
           02  FILLER REDEFINES CTL1002F.
             03 CTL1002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1002I  PIC X(2).
           02  CTL2002L    COMP  PIC  S9(4).
           02  CTL2002F    PICTURE X.
           02  FILLER REDEFINES CTL2002F.
             03 CTL2002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2002I  PIC X(3).
           02  CTL3002L    COMP  PIC  S9(4).
           02  CTL3002F    PICTURE X.
           02  FILLER REDEFINES CTL3002F.
             03 CTL3002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3002I  PIC X(3).
           02  FRMT002L    COMP  PIC  S9(4).
           02  FRMT002F    PICTURE X.
           02  FILLER REDEFINES FRMT002F.
             03 FRMT002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FRMT002I  PIC X(1).
           02  FORM002L    COMP  PIC  S9(4).
           02  FORM002F    PICTURE X.
           02  FILLER REDEFINES FORM002F.
             03 FORM002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FORM002I  PIC X(1).
           02  VALUE02L    COMP  PIC  S9(4).
           02  VALUE02F    PICTURE X.
           02  FILLER REDEFINES VALUE02F.
             03 VALUE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  VALUE02I  PIC X(3).
           02  ALTER02L    COMP  PIC  S9(4).
           02  ALTER02F    PICTURE X.
           02  FILLER REDEFINES ALTER02F.
             03 ALTER02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ALTER02I  PIC X(1).
           02  ACTN001L    COMP  PIC  S9(4).
           02  ACTN001F    PICTURE X.
           02  FILLER REDEFINES ACTN001F.
             03 ACTN001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN001I  PIC X(1).
           02  LINE01AL    COMP  PIC  S9(4).
           02  LINE01AF    PICTURE X.
           02  FILLER REDEFINES LINE01AF.
             03 LINE01AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE01AI  PIC X(75).
           02  LINE01BL    COMP  PIC  S9(4).
           02  LINE01BF    PICTURE X.
           02  FILLER REDEFINES LINE01BF.
             03 LINE01BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE01BI  PIC X(60).
           02  LINE01CL    COMP  PIC  S9(4).
           02  LINE01CF    PICTURE X.
           02  FILLER REDEFINES LINE01CF.
             03 LINE01CA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE01CI  PIC X(60).
           02  ACTN002L    COMP  PIC  S9(4).
           02  ACTN002F    PICTURE X.
           02  FILLER REDEFINES ACTN002F.
             03 ACTN002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN002I  PIC X(1).
           02  LINE02AL    COMP  PIC  S9(4).
           02  LINE02AF    PICTURE X.
           02  FILLER REDEFINES LINE02AF.
             03 LINE02AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE02AI  PIC X(75).
           02  LINE02BL    COMP  PIC  S9(4).
           02  LINE02BF    PICTURE X.
           02  FILLER REDEFINES LINE02BF.
             03 LINE02BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE02BI  PIC X(60).
           02  LINE02CL    COMP  PIC  S9(4).
           02  LINE02CF    PICTURE X.
           02  FILLER REDEFINES LINE02CF.
             03 LINE02CA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE02CI  PIC X(60).
           02  ACTN003L    COMP  PIC  S9(4).
           02  ACTN003F    PICTURE X.
           02  FILLER REDEFINES ACTN003F.
             03 ACTN003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN003I  PIC X(1).
           02  LINE03AL    COMP  PIC  S9(4).
           02  LINE03AF    PICTURE X.
           02  FILLER REDEFINES LINE03AF.
             03 LINE03AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE03AI  PIC X(75).
           02  LINE03BL    COMP  PIC  S9(4).
           02  LINE03BF    PICTURE X.
           02  FILLER REDEFINES LINE03BF.
             03 LINE03BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE03BI  PIC X(60).
           02  LINE03CL    COMP  PIC  S9(4).
           02  LINE03CF    PICTURE X.
           02  FILLER REDEFINES LINE03CF.
             03 LINE03CA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE03CI  PIC X(60).
           02  ACTN004L    COMP  PIC  S9(4).
           02  ACTN004F    PICTURE X.
           02  FILLER REDEFINES ACTN004F.
             03 ACTN004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN004I  PIC X(1).
           02  LINE04AL    COMP  PIC  S9(4).
           02  LINE04AF    PICTURE X.
           02  FILLER REDEFINES LINE04AF.
             03 LINE04AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE04AI  PIC X(75).
           02  LINE04BL    COMP  PIC  S9(4).
           02  LINE04BF    PICTURE X.
           02  FILLER REDEFINES LINE04BF.
             03 LINE04BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE04BI  PIC X(60).
           02  LINE04CL    COMP  PIC  S9(4).
           02  LINE04CF    PICTURE X.
           02  FILLER REDEFINES LINE04CF.
             03 LINE04CA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE04CI  PIC X(60).
           02  IMPFS02L    COMP  PIC  S9(4).
           02  IMPFS02F    PICTURE X.
           02  FILLER REDEFINES IMPFS02F.
             03 IMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS02I  PIC X(79).
           02  IMERR02L    COMP  PIC  S9(4).
           02  IMERR02F    PICTURE X.
           02  FILLER REDEFINES IMERR02F.
             03 IMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR02I  PIC X(79).
       01  IMSBM02O REDEFINES IMSBM02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN01C    PICTURE X.
           02  IMTRN01P    PICTURE X.
           02  IMTRN01H    PICTURE X.
           02  IMTRN01V    PICTURE X.
           02  IMTRN01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DATE002C    PICTURE X.
           02  DATE002P    PICTURE X.
           02  DATE002H    PICTURE X.
           02  DATE002V    PICTURE X.
           02  DATE002O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TIME002C    PICTURE X.
           02  TIME002P    PICTURE X.
           02  TIME002H    PICTURE X.
           02  TIME002V    PICTURE X.
           02  TIME002O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  CTL1002C    PICTURE X.
           02  CTL1002P    PICTURE X.
           02  CTL1002H    PICTURE X.
           02  CTL1002V    PICTURE X.
           02  CTL1002O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2002C    PICTURE X.
           02  CTL2002P    PICTURE X.
           02  CTL2002H    PICTURE X.
           02  CTL2002V    PICTURE X.
           02  CTL2002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3002C    PICTURE X.
           02  CTL3002P    PICTURE X.
           02  CTL3002H    PICTURE X.
           02  CTL3002V    PICTURE X.
           02  CTL3002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FRMT002C    PICTURE X.
           02  FRMT002P    PICTURE X.
           02  FRMT002H    PICTURE X.
           02  FRMT002V    PICTURE X.
           02  FRMT002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FORM002C    PICTURE X.
           02  FORM002P    PICTURE X.
           02  FORM002H    PICTURE X.
           02  FORM002V    PICTURE X.
           02  FORM002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  VALUE02C    PICTURE X.
           02  VALUE02P    PICTURE X.
           02  VALUE02H    PICTURE X.
           02  VALUE02V    PICTURE X.
           02  VALUE02O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ALTER02C    PICTURE X.
           02  ALTER02P    PICTURE X.
           02  ALTER02H    PICTURE X.
           02  ALTER02V    PICTURE X.
           02  ALTER02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACTN001C    PICTURE X.
           02  ACTN001P    PICTURE X.
           02  ACTN001H    PICTURE X.
           02  ACTN001V    PICTURE X.
           02  ACTN001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE01AC    PICTURE X.
           02  LINE01AP    PICTURE X.
           02  LINE01AH    PICTURE X.
           02  LINE01AV    PICTURE X.
           02  LINE01AO  PIC X(75).
           02  FILLER PICTURE X(3).
           02  LINE01BC    PICTURE X.
           02  LINE01BP    PICTURE X.
           02  LINE01BH    PICTURE X.
           02  LINE01BV    PICTURE X.
           02  LINE01BO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  LINE01CC    PICTURE X.
           02  LINE01CP    PICTURE X.
           02  LINE01CH    PICTURE X.
           02  LINE01CV    PICTURE X.
           02  LINE01CO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  ACTN002C    PICTURE X.
           02  ACTN002P    PICTURE X.
           02  ACTN002H    PICTURE X.
           02  ACTN002V    PICTURE X.
           02  ACTN002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE02AC    PICTURE X.
           02  LINE02AP    PICTURE X.
           02  LINE02AH    PICTURE X.
           02  LINE02AV    PICTURE X.
           02  LINE02AO  PIC X(75).
           02  FILLER PICTURE X(3).
           02  LINE02BC    PICTURE X.
           02  LINE02BP    PICTURE X.
           02  LINE02BH    PICTURE X.
           02  LINE02BV    PICTURE X.
           02  LINE02BO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  LINE02CC    PICTURE X.
           02  LINE02CP    PICTURE X.
           02  LINE02CH    PICTURE X.
           02  LINE02CV    PICTURE X.
           02  LINE02CO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  ACTN003C    PICTURE X.
           02  ACTN003P    PICTURE X.
           02  ACTN003H    PICTURE X.
           02  ACTN003V    PICTURE X.
           02  ACTN003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE03AC    PICTURE X.
           02  LINE03AP    PICTURE X.
           02  LINE03AH    PICTURE X.
           02  LINE03AV    PICTURE X.
           02  LINE03AO  PIC X(75).
           02  FILLER PICTURE X(3).
           02  LINE03BC    PICTURE X.
           02  LINE03BP    PICTURE X.
           02  LINE03BH    PICTURE X.
           02  LINE03BV    PICTURE X.
           02  LINE03BO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  LINE03CC    PICTURE X.
           02  LINE03CP    PICTURE X.
           02  LINE03CH    PICTURE X.
           02  LINE03CV    PICTURE X.
           02  LINE03CO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  ACTN004C    PICTURE X.
           02  ACTN004P    PICTURE X.
           02  ACTN004H    PICTURE X.
           02  ACTN004V    PICTURE X.
           02  ACTN004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE04AC    PICTURE X.
           02  LINE04AP    PICTURE X.
           02  LINE04AH    PICTURE X.
           02  LINE04AV    PICTURE X.
           02  LINE04AO  PIC X(75).
           02  FILLER PICTURE X(3).
           02  LINE04BC    PICTURE X.
           02  LINE04BP    PICTURE X.
           02  LINE04BH    PICTURE X.
           02  LINE04BV    PICTURE X.
           02  LINE04BO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  LINE04CC    PICTURE X.
           02  LINE04CP    PICTURE X.
           02  LINE04CH    PICTURE X.
           02  LINE04CV    PICTURE X.
           02  LINE04CO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  IMPFS02C    PICTURE X.
           02  IMPFS02P    PICTURE X.
           02  IMPFS02H    PICTURE X.
           02  IMPFS02V    PICTURE X.
           02  IMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR02C    PICTURE X.
           02  IMERR02P    PICTURE X.
           02  IMERR02H    PICTURE X.
           02  IMERR02V    PICTURE X.
           02  IMERR02O  PIC X(79).
       01  IMSBM01I REDEFINES IMSBM02I.
           02  FILLER PIC X(12).
           02  IMTRN00L    COMP  PIC  S9(4).
           02  IMTRN00F    PICTURE X.
           02  FILLER REDEFINES IMTRN00F.
             03 IMTRN00A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN00I  PIC X(4).
           02  DATE001L    COMP  PIC  S9(4).
           02  DATE001F    PICTURE X.
           02  FILLER REDEFINES DATE001F.
             03 DATE001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DATE001I  PIC X(8).
           02  TIME001L    COMP  PIC  S9(4).
           02  TIME001F    PICTURE X.
           02  FILLER REDEFINES TIME001F.
             03 TIME001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TIME001I  PIC X(8).
           02  IMXCTL1L    COMP  PIC  S9(4).
           02  IMXCTL1F    PICTURE X.
           02  FILLER REDEFINES IMXCTL1F.
             03 IMXCTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL1I  PIC X(2).
           02  IMXCTL2L    COMP  PIC  S9(4).
           02  IMXCTL2F    PICTURE X.
           02  FILLER REDEFINES IMXCTL2F.
             03 IMXCTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL2I  PIC X(3).
           02  IMXCTL3L    COMP  PIC  S9(4).
           02  IMXCTL3F    PICTURE X.
           02  FILLER REDEFINES IMXCTL3F.
             03 IMXCTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL3I  PIC X(3).
           02  FRMT001L    COMP  PIC  S9(4).
           02  FRMT001F    PICTURE X.
           02  FILLER REDEFINES FRMT001F.
             03 FRMT001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FRMT001I  PIC X(1).
           02  FORM001L    COMP  PIC  S9(4).
           02  FORM001F    PICTURE X.
           02  FILLER REDEFINES FORM001F.
             03 FORM001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FORM001I  PIC X(1).
           02  VALUE01L    COMP  PIC  S9(4).
           02  VALUE01F    PICTURE X.
           02  FILLER REDEFINES VALUE01F.
             03 VALUE01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  VALUE01I  PIC X(3).
           02  ALTER01L    COMP  PIC  S9(4).
           02  ALTER01F    PICTURE X.
           02  FILLER REDEFINES ALTER01F.
             03 ALTER01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ALTER01I  PIC X(1).
           02  IMPFS01L    COMP  PIC  S9(4).
           02  IMPFS01F    PICTURE X.
           02  FILLER REDEFINES IMPFS01F.
             03 IMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS01I  PIC X(79).
           02  IMERR01L    COMP  PIC  S9(4).
           02  IMERR01F    PICTURE X.
           02  FILLER REDEFINES IMERR01F.
             03 IMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR01I  PIC X(79).
       01  IMSBM01O REDEFINES IMSBM01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN00C    PICTURE X.
           02  IMTRN00P    PICTURE X.
           02  IMTRN00H    PICTURE X.
           02  IMTRN00V    PICTURE X.
           02  IMTRN00O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DATE001C    PICTURE X.
           02  DATE001P    PICTURE X.
           02  DATE001H    PICTURE X.
           02  DATE001V    PICTURE X.
           02  DATE001O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TIME001C    PICTURE X.
           02  TIME001P    PICTURE X.
           02  TIME001H    PICTURE X.
           02  TIME001V    PICTURE X.
           02  TIME001O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMXCTL1C    PICTURE X.
           02  IMXCTL1P    PICTURE X.
           02  IMXCTL1H    PICTURE X.
           02  IMXCTL1V    PICTURE X.
           02  IMXCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMXCTL2C    PICTURE X.
           02  IMXCTL2P    PICTURE X.
           02  IMXCTL2H    PICTURE X.
           02  IMXCTL2V    PICTURE X.
           02  IMXCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL3C    PICTURE X.
           02  IMXCTL3P    PICTURE X.
           02  IMXCTL3H    PICTURE X.
           02  IMXCTL3V    PICTURE X.
           02  IMXCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  FRMT001C    PICTURE X.
           02  FRMT001P    PICTURE X.
           02  FRMT001H    PICTURE X.
           02  FRMT001V    PICTURE X.
           02  FRMT001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  FORM001C    PICTURE X.
           02  FORM001P    PICTURE X.
           02  FORM001H    PICTURE X.
           02  FORM001V    PICTURE X.
           02  FORM001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  VALUE01C    PICTURE X.
           02  VALUE01P    PICTURE X.
           02  VALUE01H    PICTURE X.
           02  VALUE01V    PICTURE X.
           02  VALUE01O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ALTER01C    PICTURE X.
           02  ALTER01P    PICTURE X.
           02  ALTER01H    PICTURE X.
           02  ALTER01V    PICTURE X.
           02  ALTER01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS01C    PICTURE X.
           02  IMPFS01P    PICTURE X.
           02  IMPFS01H    PICTURE X.
           02  IMPFS01V    PICTURE X.
           02  IMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR01C    PICTURE X.
           02  IMERR01P    PICTURE X.
           02  IMERR01H    PICTURE X.
           02  IMERR01V    PICTURE X.
           02  IMERR01O  PIC X(79).