       01  IMTBM02I.
           02  FILLER PIC X(12).
           02  IMTRN01L    COMP  PIC  S9(4).
           02  IMTRN01F    PICTURE X.
           02  FILLER REDEFINES IMTRN01F.
             03 IMTRN01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN01I  PIC X(4).
           02  IMDATE2L    COMP  PIC  S9(4).
           02  IMDATE2F    PICTURE X.
           02  FILLER REDEFINES IMDATE2F.
             03 IMDATE2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDATE2I  PIC X(8).
           02  IMTIME2L    COMP  PIC  S9(4).
           02  IMTIME2F    PICTURE X.
           02  FILLER REDEFINES IMTIME2F.
             03 IMTIME2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTIME2I  PIC X(8).
           02  CTL1002L    COMP  PIC  S9(4).
           02  CTL1002F    PICTURE X.
           02  FILLER REDEFINES CTL1002F.
             03 CTL1002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1002I  PIC X(2).
           02  CTL2002L    COMP  PIC  S9(4).
           02  CTL2002F    PICTURE X.
           02  FILLER REDEFINES CTL2002F.
             03 CTL2002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2002I  PIC X(3).
           02  CTL3002L    COMP  PIC  S9(4).
           02  CTL3002F    PICTURE X.
           02  FILLER REDEFINES CTL3002F.
             03 CTL3002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3002I  PIC X(3).
           02  TABLE02L    COMP  PIC  S9(4).
           02  TABLE02F    PICTURE X.
           02  FILLER REDEFINES TABLE02F.
             03 TABLE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TABLE02I  PIC X(8).
           02  ACTN001L    COMP  PIC  S9(4).
           02  ACTN001F    PICTURE X.
           02  FILLER REDEFINES ACTN001F.
             03 ACTN001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN001I  PIC X(1).
           02  LINE001L    COMP  PIC  S9(4).
           02  LINE001F    PICTURE X.
           02  FILLER REDEFINES LINE001F.
             03 LINE001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE001I  PIC X(72).
           02  ACTN002L    COMP  PIC  S9(4).
           02  ACTN002F    PICTURE X.
           02  FILLER REDEFINES ACTN002F.
             03 ACTN002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN002I  PIC X(1).
           02  LINE002L    COMP  PIC  S9(4).
           02  LINE002F    PICTURE X.
           02  FILLER REDEFINES LINE002F.
             03 LINE002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE002I  PIC X(72).
           02  ACTN003L    COMP  PIC  S9(4).
           02  ACTN003F    PICTURE X.
           02  FILLER REDEFINES ACTN003F.
             03 ACTN003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN003I  PIC X(1).
           02  LINE003L    COMP  PIC  S9(4).
           02  LINE003F    PICTURE X.
           02  FILLER REDEFINES LINE003F.
             03 LINE003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE003I  PIC X(72).
           02  ACTN004L    COMP  PIC  S9(4).
           02  ACTN004F    PICTURE X.
           02  FILLER REDEFINES ACTN004F.
             03 ACTN004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN004I  PIC X(1).
           02  LINE004L    COMP  PIC  S9(4).
           02  LINE004F    PICTURE X.
           02  FILLER REDEFINES LINE004F.
             03 LINE004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE004I  PIC X(72).
           02  ACTN005L    COMP  PIC  S9(4).
           02  ACTN005F    PICTURE X.
           02  FILLER REDEFINES ACTN005F.
             03 ACTN005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN005I  PIC X(1).
           02  LINE005L    COMP  PIC  S9(4).
           02  LINE005F    PICTURE X.
           02  FILLER REDEFINES LINE005F.
             03 LINE005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE005I  PIC X(72).
           02  ACTN006L    COMP  PIC  S9(4).
           02  ACTN006F    PICTURE X.
           02  FILLER REDEFINES ACTN006F.
             03 ACTN006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN006I  PIC X(1).
           02  LINE006L    COMP  PIC  S9(4).
           02  LINE006F    PICTURE X.
           02  FILLER REDEFINES LINE006F.
             03 LINE006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE006I  PIC X(72).
           02  ACTN007L    COMP  PIC  S9(4).
           02  ACTN007F    PICTURE X.
           02  FILLER REDEFINES ACTN007F.
             03 ACTN007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN007I  PIC X(1).
           02  LINE007L    COMP  PIC  S9(4).
           02  LINE007F    PICTURE X.
           02  FILLER REDEFINES LINE007F.
             03 LINE007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE007I  PIC X(72).
           02  ACTN008L    COMP  PIC  S9(4).
           02  ACTN008F    PICTURE X.
           02  FILLER REDEFINES ACTN008F.
             03 ACTN008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN008I  PIC X(1).
           02  LINE008L    COMP  PIC  S9(4).
           02  LINE008F    PICTURE X.
           02  FILLER REDEFINES LINE008F.
             03 LINE008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE008I  PIC X(72).
           02  ACTN009L    COMP  PIC  S9(4).
           02  ACTN009F    PICTURE X.
           02  FILLER REDEFINES ACTN009F.
             03 ACTN009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN009I  PIC X(1).
           02  LINE009L    COMP  PIC  S9(4).
           02  LINE009F    PICTURE X.
           02  FILLER REDEFINES LINE009F.
             03 LINE009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE009I  PIC X(72).
           02  ACTN010L    COMP  PIC  S9(4).
           02  ACTN010F    PICTURE X.
           02  FILLER REDEFINES ACTN010F.
             03 ACTN010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTN010I  PIC X(1).
           02  LINE010L    COMP  PIC  S9(4).
           02  LINE010F    PICTURE X.
           02  FILLER REDEFINES LINE010F.
             03 LINE010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LINE010I  PIC X(72).
           02  IMPFS02L    COMP  PIC  S9(4).
           02  IMPFS02F    PICTURE X.
           02  FILLER REDEFINES IMPFS02F.
             03 IMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS02I  PIC X(79).
           02  IMERR02L    COMP  PIC  S9(4).
           02  IMERR02F    PICTURE X.
           02  FILLER REDEFINES IMERR02F.
             03 IMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR02I  PIC X(79).
       01  IMTBM02O REDEFINES IMTBM02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN01C    PICTURE X.
           02  IMTRN01P    PICTURE X.
           02  IMTRN01H    PICTURE X.
           02  IMTRN01V    PICTURE X.
           02  IMTRN01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATE2C    PICTURE X.
           02  IMDATE2P    PICTURE X.
           02  IMDATE2H    PICTURE X.
           02  IMDATE2V    PICTURE X.
           02  IMDATE2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIME2C    PICTURE X.
           02  IMTIME2P    PICTURE X.
           02  IMTIME2H    PICTURE X.
           02  IMTIME2V    PICTURE X.
           02  IMTIME2O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  CTL1002C    PICTURE X.
           02  CTL1002P    PICTURE X.
           02  CTL1002H    PICTURE X.
           02  CTL1002V    PICTURE X.
           02  CTL1002O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2002C    PICTURE X.
           02  CTL2002P    PICTURE X.
           02  CTL2002H    PICTURE X.
           02  CTL2002V    PICTURE X.
           02  CTL2002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3002C    PICTURE X.
           02  CTL3002P    PICTURE X.
           02  CTL3002H    PICTURE X.
           02  CTL3002V    PICTURE X.
           02  CTL3002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  TABLE02C    PICTURE X.
           02  TABLE02P    PICTURE X.
           02  TABLE02H    PICTURE X.
           02  TABLE02V    PICTURE X.
           02  TABLE02O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ACTN001C    PICTURE X.
           02  ACTN001P    PICTURE X.
           02  ACTN001H    PICTURE X.
           02  ACTN001V    PICTURE X.
           02  ACTN001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE001C    PICTURE X.
           02  LINE001P    PICTURE X.
           02  LINE001H    PICTURE X.
           02  LINE001V    PICTURE X.
           02  LINE001O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  ACTN002C    PICTURE X.
           02  ACTN002P    PICTURE X.
           02  ACTN002H    PICTURE X.
           02  ACTN002V    PICTURE X.
           02  ACTN002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE002C    PICTURE X.
           02  LINE002P    PICTURE X.
           02  LINE002H    PICTURE X.
           02  LINE002V    PICTURE X.
           02  LINE002O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  ACTN003C    PICTURE X.
           02  ACTN003P    PICTURE X.
           02  ACTN003H    PICTURE X.
           02  ACTN003V    PICTURE X.
           02  ACTN003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE003C    PICTURE X.
           02  LINE003P    PICTURE X.
           02  LINE003H    PICTURE X.
           02  LINE003V    PICTURE X.
           02  LINE003O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  ACTN004C    PICTURE X.
           02  ACTN004P    PICTURE X.
           02  ACTN004H    PICTURE X.
           02  ACTN004V    PICTURE X.
           02  ACTN004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE004C    PICTURE X.
           02  LINE004P    PICTURE X.
           02  LINE004H    PICTURE X.
           02  LINE004V    PICTURE X.
           02  LINE004O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  ACTN005C    PICTURE X.
           02  ACTN005P    PICTURE X.
           02  ACTN005H    PICTURE X.
           02  ACTN005V    PICTURE X.
           02  ACTN005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE005C    PICTURE X.
           02  LINE005P    PICTURE X.
           02  LINE005H    PICTURE X.
           02  LINE005V    PICTURE X.
           02  LINE005O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  ACTN006C    PICTURE X.
           02  ACTN006P    PICTURE X.
           02  ACTN006H    PICTURE X.
           02  ACTN006V    PICTURE X.
           02  ACTN006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE006C    PICTURE X.
           02  LINE006P    PICTURE X.
           02  LINE006H    PICTURE X.
           02  LINE006V    PICTURE X.
           02  LINE006O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  ACTN007C    PICTURE X.
           02  ACTN007P    PICTURE X.
           02  ACTN007H    PICTURE X.
           02  ACTN007V    PICTURE X.
           02  ACTN007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE007C    PICTURE X.
           02  LINE007P    PICTURE X.
           02  LINE007H    PICTURE X.
           02  LINE007V    PICTURE X.
           02  LINE007O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  ACTN008C    PICTURE X.
           02  ACTN008P    PICTURE X.
           02  ACTN008H    PICTURE X.
           02  ACTN008V    PICTURE X.
           02  ACTN008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE008C    PICTURE X.
           02  LINE008P    PICTURE X.
           02  LINE008H    PICTURE X.
           02  LINE008V    PICTURE X.
           02  LINE008O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  ACTN009C    PICTURE X.
           02  ACTN009P    PICTURE X.
           02  ACTN009H    PICTURE X.
           02  ACTN009V    PICTURE X.
           02  ACTN009O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE009C    PICTURE X.
           02  LINE009P    PICTURE X.
           02  LINE009H    PICTURE X.
           02  LINE009V    PICTURE X.
           02  LINE009O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  ACTN010C    PICTURE X.
           02  ACTN010P    PICTURE X.
           02  ACTN010H    PICTURE X.
           02  ACTN010V    PICTURE X.
           02  ACTN010O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  LINE010C    PICTURE X.
           02  LINE010P    PICTURE X.
           02  LINE010H    PICTURE X.
           02  LINE010V    PICTURE X.
           02  LINE010O  PIC X(72).
           02  FILLER PICTURE X(3).
           02  IMPFS02C    PICTURE X.
           02  IMPFS02P    PICTURE X.
           02  IMPFS02H    PICTURE X.
           02  IMPFS02V    PICTURE X.
           02  IMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR02C    PICTURE X.
           02  IMERR02P    PICTURE X.
           02  IMERR02H    PICTURE X.
           02  IMERR02V    PICTURE X.
           02  IMERR02O  PIC X(79).
       01  IMTBM01I REDEFINES IMTBM02I.
           02  FILLER PIC X(12).
           02  IMTRN00L    COMP  PIC  S9(4).
           02  IMTRN00F    PICTURE X.
           02  FILLER REDEFINES IMTRN00F.
             03 IMTRN00A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTRN00I  PIC X(4).
           02  IMDATE1L    COMP  PIC  S9(4).
           02  IMDATE1F    PICTURE X.
           02  FILLER REDEFINES IMDATE1F.
             03 IMDATE1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMDATE1I  PIC X(8).
           02  IMTIME1L    COMP  PIC  S9(4).
           02  IMTIME1F    PICTURE X.
           02  FILLER REDEFINES IMTIME1F.
             03 IMTIME1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMTIME1I  PIC X(8).
           02  IMXCTL1L    COMP  PIC  S9(4).
           02  IMXCTL1F    PICTURE X.
           02  FILLER REDEFINES IMXCTL1F.
             03 IMXCTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL1I  PIC X(2).
           02  IMXCTL2L    COMP  PIC  S9(4).
           02  IMXCTL2F    PICTURE X.
           02  FILLER REDEFINES IMXCTL2F.
             03 IMXCTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL2I  PIC X(3).
           02  IMXCTL3L    COMP  PIC  S9(4).
           02  IMXCTL3F    PICTURE X.
           02  FILLER REDEFINES IMXCTL3F.
             03 IMXCTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL3I  PIC X(3).
           02  TABLE01L    COMP  PIC  S9(4).
           02  TABLE01F    PICTURE X.
           02  FILLER REDEFINES TABLE01F.
             03 TABLE01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TABLE01I  PIC X(8).
           02  TRAN001L    COMP  PIC  S9(4).
           02  TRAN001F    PICTURE X.
           02  FILLER REDEFINES TRAN001F.
             03 TRAN001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRAN001I  PIC X(4).
           02  IMPFS01L    COMP  PIC  S9(4).
           02  IMPFS01F    PICTURE X.
           02  FILLER REDEFINES IMPFS01F.
             03 IMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS01I  PIC X(79).
           02  IMERR01L    COMP  PIC  S9(4).
           02  IMERR01F    PICTURE X.
           02  FILLER REDEFINES IMERR01F.
             03 IMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR01I  PIC X(79).
       01  IMTBM01O REDEFINES IMTBM01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMTRN00C    PICTURE X.
           02  IMTRN00P    PICTURE X.
           02  IMTRN00H    PICTURE X.
           02  IMTRN00V    PICTURE X.
           02  IMTRN00O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMDATE1C    PICTURE X.
           02  IMDATE1P    PICTURE X.
           02  IMDATE1H    PICTURE X.
           02  IMDATE1V    PICTURE X.
           02  IMDATE1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMTIME1C    PICTURE X.
           02  IMTIME1P    PICTURE X.
           02  IMTIME1H    PICTURE X.
           02  IMTIME1V    PICTURE X.
           02  IMTIME1O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMXCTL1C    PICTURE X.
           02  IMXCTL1P    PICTURE X.
           02  IMXCTL1H    PICTURE X.
           02  IMXCTL1V    PICTURE X.
           02  IMXCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMXCTL2C    PICTURE X.
           02  IMXCTL2P    PICTURE X.
           02  IMXCTL2H    PICTURE X.
           02  IMXCTL2V    PICTURE X.
           02  IMXCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL3C    PICTURE X.
           02  IMXCTL3P    PICTURE X.
           02  IMXCTL3H    PICTURE X.
           02  IMXCTL3V    PICTURE X.
           02  IMXCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  TABLE01C    PICTURE X.
           02  TABLE01P    PICTURE X.
           02  TABLE01H    PICTURE X.
           02  TABLE01V    PICTURE X.
           02  TABLE01O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TRAN001C    PICTURE X.
           02  TRAN001P    PICTURE X.
           02  TRAN001H    PICTURE X.
           02  TRAN001V    PICTURE X.
           02  TRAN001O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMPFS01C    PICTURE X.
           02  IMPFS01P    PICTURE X.
           02  IMPFS01H    PICTURE X.
           02  IMPFS01V    PICTURE X.
           02  IMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR01C    PICTURE X.
           02  IMERR01P    PICTURE X.
           02  IMERR01H    PICTURE X.
           02  IMERR01V    PICTURE X.
           02  IMERR01O  PIC X(79).