       01  IMX1M07I.
           02  FILLER PIC X(12).
           02  IMITR07L    COMP  PIC  S9(4).
           02  IMITR07F    PICTURE X.
           02  FILLER REDEFINES IMITR07F.
             03 IMITR07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITR07I  PIC X(4).
           02  IMIDT07L    COMP  PIC  S9(4).
           02  IMIDT07F    PICTURE X.
           02  FILLER REDEFINES IMIDT07F.
             03 IMIDT07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMIDT07I  PIC X(8).
           02  IMITM07L    COMP  PIC  S9(4).
           02  IMITM07F    PICTURE X.
           02  FILLER REDEFINES IMITM07F.
             03 IMITM07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITM07I  PIC X(8).
           02  TYPE007L    COMP  PIC  S9(4).
           02  TYPE007F    PICTURE X.
           02  FILLER REDEFINES TYPE007F.
             03 TYPE007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TYPE007I  PIC X(1).
           02  INDEX07L    COMP  PIC  S9(4).
           02  INDEX07F    PICTURE X.
           02  FILLER REDEFINES INDEX07F.
             03 INDEX07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INDEX07I  PIC X(1).
           02  PROD007L    COMP  PIC  S9(4).
           02  PROD007F    PICTURE X.
           02  FILLER REDEFINES PROD007F.
             03 PROD007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PROD007I  PIC X(3).
           02  CTL1007L    COMP  PIC  S9(4).
           02  CTL1007F    PICTURE X.
           02  FILLER REDEFINES CTL1007F.
             03 CTL1007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1007I  PIC X(2).
           02  CTL2007L    COMP  PIC  S9(4).
           02  CTL2007F    PICTURE X.
           02  FILLER REDEFINES CTL2007F.
             03 CTL2007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2007I  PIC X(3).
           02  CTL3007L    COMP  PIC  S9(4).
           02  CTL3007F    PICTURE X.
           02  FILLER REDEFINES CTL3007F.
             03 CTL3007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3007I  PIC X(3).
           02  I030098L    COMP  PIC  S9(4).
           02  I030098F    PICTURE X.
           02  FILLER REDEFINES I030098F.
             03 I030098A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030098I  PIC X(2).
           02  I004502L    COMP  PIC  S9(4).
           02  I004502F    PICTURE X.
           02  FILLER REDEFINES I004502F.
             03 I004502A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004502I  PIC X(10).
           02  I004702L    COMP  PIC  S9(4).
           02  I004702F    PICTURE X.
           02  FILLER REDEFINES I004702F.
             03 I004702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004702I  PIC X(13).
           02  I004802L    COMP  PIC  S9(4).
           02  I004802F    PICTURE X.
           02  FILLER REDEFINES I004802F.
             03 I004802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004802I  PIC X(10).
           02  I005002L    COMP  PIC  S9(4).
           02  I005002F    PICTURE X.
           02  FILLER REDEFINES I005002F.
             03 I005002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005002I  PIC X(13).
           02  I005102L    COMP  PIC  S9(4).
           02  I005102F    PICTURE X.
           02  FILLER REDEFINES I005102F.
             03 I005102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005102I  PIC X(10).
           02  I018102L    COMP  PIC  S9(4).
           02  I018102F    PICTURE X.
           02  FILLER REDEFINES I018102F.
             03 I018102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018102I  PIC X(6).
           02  I030099L    COMP  PIC  S9(4).
           02  I030099F    PICTURE X.
           02  FILLER REDEFINES I030099F.
             03 I030099A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030099I  PIC X(2).
           02  I004501L    COMP  PIC  S9(4).
           02  I004501F    PICTURE X.
           02  FILLER REDEFINES I004501F.
             03 I004501A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004501I  PIC X(10).
           02  I004701L    COMP  PIC  S9(4).
           02  I004701F    PICTURE X.
           02  FILLER REDEFINES I004701F.
             03 I004701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004701I  PIC X(13).
           02  I004801L    COMP  PIC  S9(4).
           02  I004801F    PICTURE X.
           02  FILLER REDEFINES I004801F.
             03 I004801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004801I  PIC X(10).
           02  I005001L    COMP  PIC  S9(4).
           02  I005001F    PICTURE X.
           02  FILLER REDEFINES I005001F.
             03 I005001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005001I  PIC X(13).
           02  I005101L    COMP  PIC  S9(4).
           02  I005101F    PICTURE X.
           02  FILLER REDEFINES I005101F.
             03 I005101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005101I  PIC X(10).
           02  I018101L    COMP  PIC  S9(4).
           02  I018101F    PICTURE X.
           02  FILLER REDEFINES I018101F.
             03 I018101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018101I  PIC X(6).
           02  IMCOR07L    COMP  PIC  S9(4).
           02  IMCOR07F    PICTURE X.
           02  FILLER REDEFINES IMCOR07F.
             03 IMCOR07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMCOR07I  PIC X(1).
           02  I030100L    COMP  PIC  S9(4).
           02  I030100F    PICTURE X.
           02  FILLER REDEFINES I030100F.
             03 I030100A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030100I  PIC X(2).
           02  I004503L    COMP  PIC  S9(4).
           02  I004503F    PICTURE X.
           02  FILLER REDEFINES I004503F.
             03 I004503A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004503I  PIC X(10).
           02  I004703L    COMP  PIC  S9(4).
           02  I004703F    PICTURE X.
           02  FILLER REDEFINES I004703F.
             03 I004703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004703I  PIC X(13).
           02  I004803L    COMP  PIC  S9(4).
           02  I004803F    PICTURE X.
           02  FILLER REDEFINES I004803F.
             03 I004803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004803I  PIC X(10).
           02  I005003L    COMP  PIC  S9(4).
           02  I005003F    PICTURE X.
           02  FILLER REDEFINES I005003F.
             03 I005003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005003I  PIC X(13).
           02  I005103L    COMP  PIC  S9(4).
           02  I005103F    PICTURE X.
           02  FILLER REDEFINES I005103F.
             03 I005103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005103I  PIC X(10).
           02  I018103L    COMP  PIC  S9(4).
           02  I018103F    PICTURE X.
           02  FILLER REDEFINES I018103F.
             03 I018103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018103I  PIC X(6).
           02  IMAC100L    COMP  PIC  S9(4).
           02  IMAC100F    PICTURE X.
           02  FILLER REDEFINES IMAC100F.
             03 IMAC100A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMAC100I  PIC X(1).
           02  I018104L    COMP  PIC  S9(4).
           02  I018104F    PICTURE X.
           02  FILLER REDEFINES I018104F.
             03 I018104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018104I  PIC X(6).
           02  I004504L    COMP  PIC  S9(4).
           02  I004504F    PICTURE X.
           02  FILLER REDEFINES I004504F.
             03 I004504A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004504I  PIC X(10).
           02  I004704L    COMP  PIC  S9(4).
           02  I004704F    PICTURE X.
           02  FILLER REDEFINES I004704F.
             03 I004704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004704I  PIC X(13).
           02  I004804L    COMP  PIC  S9(4).
           02  I004804F    PICTURE X.
           02  FILLER REDEFINES I004804F.
             03 I004804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004804I  PIC X(10).
           02  I005004L    COMP  PIC  S9(4).
           02  I005004F    PICTURE X.
           02  FILLER REDEFINES I005004F.
             03 I005004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005004I  PIC X(13).
           02  I005104L    COMP  PIC  S9(4).
           02  I005104F    PICTURE X.
           02  FILLER REDEFINES I005104F.
             03 I005104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005104I  PIC X(10).
           02  I030101L    COMP  PIC  S9(4).
           02  I030101F    PICTURE X.
           02  FILLER REDEFINES I030101F.
             03 I030101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030101I  PIC X(2).
           02  IMAC101L    COMP  PIC  S9(4).
           02  IMAC101F    PICTURE X.
           02  FILLER REDEFINES IMAC101F.
             03 IMAC101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMAC101I  PIC X(1).
           02  I018105L    COMP  PIC  S9(4).
           02  I018105F    PICTURE X.
           02  FILLER REDEFINES I018105F.
             03 I018105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018105I  PIC X(6).
           02  I004505L    COMP  PIC  S9(4).
           02  I004505F    PICTURE X.
           02  FILLER REDEFINES I004505F.
             03 I004505A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004505I  PIC X(10).
           02  I004705L    COMP  PIC  S9(4).
           02  I004705F    PICTURE X.
           02  FILLER REDEFINES I004705F.
             03 I004705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004705I  PIC X(13).
           02  I004805L    COMP  PIC  S9(4).
           02  I004805F    PICTURE X.
           02  FILLER REDEFINES I004805F.
             03 I004805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004805I  PIC X(10).
           02  I005005L    COMP  PIC  S9(4).
           02  I005005F    PICTURE X.
           02  FILLER REDEFINES I005005F.
             03 I005005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005005I  PIC X(13).
           02  I005105L    COMP  PIC  S9(4).
           02  I005105F    PICTURE X.
           02  FILLER REDEFINES I005105F.
             03 I005105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005105I  PIC X(10).
           02  I030102L    COMP  PIC  S9(4).
           02  I030102F    PICTURE X.
           02  FILLER REDEFINES I030102F.
             03 I030102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030102I  PIC X(2).
           02  IMAC102L    COMP  PIC  S9(4).
           02  IMAC102F    PICTURE X.
           02  FILLER REDEFINES IMAC102F.
             03 IMAC102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMAC102I  PIC X(1).
           02  I018106L    COMP  PIC  S9(4).
           02  I018106F    PICTURE X.
           02  FILLER REDEFINES I018106F.
             03 I018106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018106I  PIC X(6).
           02  I004506L    COMP  PIC  S9(4).
           02  I004506F    PICTURE X.
           02  FILLER REDEFINES I004506F.
             03 I004506A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004506I  PIC X(10).
           02  I004706L    COMP  PIC  S9(4).
           02  I004706F    PICTURE X.
           02  FILLER REDEFINES I004706F.
             03 I004706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004706I  PIC X(13).
           02  I004806L    COMP  PIC  S9(4).
           02  I004806F    PICTURE X.
           02  FILLER REDEFINES I004806F.
             03 I004806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004806I  PIC X(10).
           02  I005006L    COMP  PIC  S9(4).
           02  I005006F    PICTURE X.
           02  FILLER REDEFINES I005006F.
             03 I005006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005006I  PIC X(13).
           02  I005106L    COMP  PIC  S9(4).
           02  I005106F    PICTURE X.
           02  FILLER REDEFINES I005106F.
             03 I005106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005106I  PIC X(10).
           02  I030103L    COMP  PIC  S9(4).
           02  I030103F    PICTURE X.
           02  FILLER REDEFINES I030103F.
             03 I030103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030103I  PIC X(2).
           02  IMAC103L    COMP  PIC  S9(4).
           02  IMAC103F    PICTURE X.
           02  FILLER REDEFINES IMAC103F.
             03 IMAC103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMAC103I  PIC X(1).
           02  I018107L    COMP  PIC  S9(4).
           02  I018107F    PICTURE X.
           02  FILLER REDEFINES I018107F.
             03 I018107A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018107I  PIC X(6).
           02  I004507L    COMP  PIC  S9(4).
           02  I004507F    PICTURE X.
           02  FILLER REDEFINES I004507F.
             03 I004507A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004507I  PIC X(10).
           02  I004707L    COMP  PIC  S9(4).
           02  I004707F    PICTURE X.
           02  FILLER REDEFINES I004707F.
             03 I004707A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004707I  PIC X(13).
           02  I004807L    COMP  PIC  S9(4).
           02  I004807F    PICTURE X.
           02  FILLER REDEFINES I004807F.
             03 I004807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004807I  PIC X(10).
           02  I005007L    COMP  PIC  S9(4).
           02  I005007F    PICTURE X.
           02  FILLER REDEFINES I005007F.
             03 I005007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005007I  PIC X(13).
           02  I005107L    COMP  PIC  S9(4).
           02  I005107F    PICTURE X.
           02  FILLER REDEFINES I005107F.
             03 I005107A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005107I  PIC X(10).
           02  I030104L    COMP  PIC  S9(4).
           02  I030104F    PICTURE X.
           02  FILLER REDEFINES I030104F.
             03 I030104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030104I  PIC X(2).
           02  IMAC104L    COMP  PIC  S9(4).
           02  IMAC104F    PICTURE X.
           02  FILLER REDEFINES IMAC104F.
             03 IMAC104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMAC104I  PIC X(1).
           02  I018108L    COMP  PIC  S9(4).
           02  I018108F    PICTURE X.
           02  FILLER REDEFINES I018108F.
             03 I018108A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018108I  PIC X(6).
           02  I004508L    COMP  PIC  S9(4).
           02  I004508F    PICTURE X.
           02  FILLER REDEFINES I004508F.
             03 I004508A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004508I  PIC X(10).
           02  I004708L    COMP  PIC  S9(4).
           02  I004708F    PICTURE X.
           02  FILLER REDEFINES I004708F.
             03 I004708A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004708I  PIC X(13).
           02  I004808L    COMP  PIC  S9(4).
           02  I004808F    PICTURE X.
           02  FILLER REDEFINES I004808F.
             03 I004808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004808I  PIC X(10).
           02  I005008L    COMP  PIC  S9(4).
           02  I005008F    PICTURE X.
           02  FILLER REDEFINES I005008F.
             03 I005008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005008I  PIC X(13).
           02  I005108L    COMP  PIC  S9(4).
           02  I005108F    PICTURE X.
           02  FILLER REDEFINES I005108F.
             03 I005108A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005108I  PIC X(10).
           02  I030105L    COMP  PIC  S9(4).
           02  I030105F    PICTURE X.
           02  FILLER REDEFINES I030105F.
             03 I030105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030105I  PIC X(2).
           02  IMAC105L    COMP  PIC  S9(4).
           02  IMAC105F    PICTURE X.
           02  FILLER REDEFINES IMAC105F.
             03 IMAC105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMAC105I  PIC X(1).
           02  I018109L    COMP  PIC  S9(4).
           02  I018109F    PICTURE X.
           02  FILLER REDEFINES I018109F.
             03 I018109A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018109I  PIC X(6).
           02  I004509L    COMP  PIC  S9(4).
           02  I004509F    PICTURE X.
           02  FILLER REDEFINES I004509F.
             03 I004509A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004509I  PIC X(10).
           02  I004709L    COMP  PIC  S9(4).
           02  I004709F    PICTURE X.
           02  FILLER REDEFINES I004709F.
             03 I004709A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004709I  PIC X(13).
           02  I004809L    COMP  PIC  S9(4).
           02  I004809F    PICTURE X.
           02  FILLER REDEFINES I004809F.
             03 I004809A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004809I  PIC X(10).
           02  I005009L    COMP  PIC  S9(4).
           02  I005009F    PICTURE X.
           02  FILLER REDEFINES I005009F.
             03 I005009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005009I  PIC X(13).
           02  I005109L    COMP  PIC  S9(4).
           02  I005109F    PICTURE X.
           02  FILLER REDEFINES I005109F.
             03 I005109A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005109I  PIC X(10).
           02  I030106L    COMP  PIC  S9(4).
           02  I030106F    PICTURE X.
           02  FILLER REDEFINES I030106F.
             03 I030106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030106I  PIC X(2).
           02  IMAC106L    COMP  PIC  S9(4).
           02  IMAC106F    PICTURE X.
           02  FILLER REDEFINES IMAC106F.
             03 IMAC106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMAC106I  PIC X(1).
           02  I018110L    COMP  PIC  S9(4).
           02  I018110F    PICTURE X.
           02  FILLER REDEFINES I018110F.
             03 I018110A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018110I  PIC X(6).
           02  I004510L    COMP  PIC  S9(4).
           02  I004510F    PICTURE X.
           02  FILLER REDEFINES I004510F.
             03 I004510A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004510I  PIC X(10).
           02  I004710L    COMP  PIC  S9(4).
           02  I004710F    PICTURE X.
           02  FILLER REDEFINES I004710F.
             03 I004710A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004710I  PIC X(13).
           02  I004810L    COMP  PIC  S9(4).
           02  I004810F    PICTURE X.
           02  FILLER REDEFINES I004810F.
             03 I004810A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004810I  PIC X(10).
           02  I005010L    COMP  PIC  S9(4).
           02  I005010F    PICTURE X.
           02  FILLER REDEFINES I005010F.
             03 I005010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005010I  PIC X(13).
           02  I005110L    COMP  PIC  S9(4).
           02  I005110F    PICTURE X.
           02  FILLER REDEFINES I005110F.
             03 I005110A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005110I  PIC X(10).
           02  I030107L    COMP  PIC  S9(4).
           02  I030107F    PICTURE X.
           02  FILLER REDEFINES I030107F.
             03 I030107A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030107I  PIC X(2).
           02  IMAC107L    COMP  PIC  S9(4).
           02  IMAC107F    PICTURE X.
           02  FILLER REDEFINES IMAC107F.
             03 IMAC107A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMAC107I  PIC X(1).
           02  I018111L    COMP  PIC  S9(4).
           02  I018111F    PICTURE X.
           02  FILLER REDEFINES I018111F.
             03 I018111A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I018111I  PIC X(6).
           02  I004511L    COMP  PIC  S9(4).
           02  I004511F    PICTURE X.
           02  FILLER REDEFINES I004511F.
             03 I004511A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004511I  PIC X(10).
           02  I004711L    COMP  PIC  S9(4).
           02  I004711F    PICTURE X.
           02  FILLER REDEFINES I004711F.
             03 I004711A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004711I  PIC X(13).
           02  I004811L    COMP  PIC  S9(4).
           02  I004811F    PICTURE X.
           02  FILLER REDEFINES I004811F.
             03 I004811A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004811I  PIC X(10).
           02  I005011L    COMP  PIC  S9(4).
           02  I005011F    PICTURE X.
           02  FILLER REDEFINES I005011F.
             03 I005011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005011I  PIC X(13).
           02  I005111L    COMP  PIC  S9(4).
           02  I005111F    PICTURE X.
           02  FILLER REDEFINES I005111F.
             03 I005111A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005111I  PIC X(10).
           02  I030108L    COMP  PIC  S9(4).
           02  I030108F    PICTURE X.
           02  FILLER REDEFINES I030108F.
             03 I030108A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I030108I  PIC X(2).
           02  IMPFS07L    COMP  PIC  S9(4).
           02  IMPFS07F    PICTURE X.
           02  FILLER REDEFINES IMPFS07F.
             03 IMPFS07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS07I  PIC X(79).
           02  IMERR07L    COMP  PIC  S9(4).
           02  IMERR07F    PICTURE X.
           02  FILLER REDEFINES IMERR07F.
             03 IMERR07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR07I  PIC X(79).
       01  IMX1M07O REDEFINES IMX1M07I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMITR07C    PICTURE X.
           02  IMITR07P    PICTURE X.
           02  IMITR07H    PICTURE X.
           02  IMITR07V    PICTURE X.
           02  IMITR07O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMIDT07C    PICTURE X.
           02  IMIDT07P    PICTURE X.
           02  IMIDT07H    PICTURE X.
           02  IMIDT07V    PICTURE X.
           02  IMIDT07O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMITM07C    PICTURE X.
           02  IMITM07P    PICTURE X.
           02  IMITM07H    PICTURE X.
           02  IMITM07V    PICTURE X.
           02  IMITM07O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TYPE007C    PICTURE X.
           02  TYPE007P    PICTURE X.
           02  TYPE007H    PICTURE X.
           02  TYPE007V    PICTURE X.
           02  TYPE007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INDEX07C    PICTURE X.
           02  INDEX07P    PICTURE X.
           02  INDEX07H    PICTURE X.
           02  INDEX07V    PICTURE X.
           02  INDEX07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PROD007C    PICTURE X.
           02  PROD007P    PICTURE X.
           02  PROD007H    PICTURE X.
           02  PROD007V    PICTURE X.
           02  PROD007O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL1007C    PICTURE X.
           02  CTL1007P    PICTURE X.
           02  CTL1007H    PICTURE X.
           02  CTL1007V    PICTURE X.
           02  CTL1007O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2007C    PICTURE X.
           02  CTL2007P    PICTURE X.
           02  CTL2007H    PICTURE X.
           02  CTL2007V    PICTURE X.
           02  CTL2007O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3007C    PICTURE X.
           02  CTL3007P    PICTURE X.
           02  CTL3007H    PICTURE X.
           02  CTL3007V    PICTURE X.
           02  CTL3007O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  I030098C    PICTURE X.
           02  I030098P    PICTURE X.
           02  I030098H    PICTURE X.
           02  I030098V    PICTURE X.
           02  I030098O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004502C    PICTURE X.
           02  I004502P    PICTURE X.
           02  I004502H    PICTURE X.
           02  I004502V    PICTURE X.
           02  I004502O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004702C    PICTURE X.
           02  I004702P    PICTURE X.
           02  I004702H    PICTURE X.
           02  I004702V    PICTURE X.
           02  I004702O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004802C    PICTURE X.
           02  I004802P    PICTURE X.
           02  I004802H    PICTURE X.
           02  I004802V    PICTURE X.
           02  I004802O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005002C    PICTURE X.
           02  I005002P    PICTURE X.
           02  I005002H    PICTURE X.
           02  I005002V    PICTURE X.
           02  I005002O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005102C    PICTURE X.
           02  I005102P    PICTURE X.
           02  I005102H    PICTURE X.
           02  I005102V    PICTURE X.
           02  I005102O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I018102C    PICTURE X.
           02  I018102P    PICTURE X.
           02  I018102H    PICTURE X.
           02  I018102V    PICTURE X.
           02  I018102O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I030099C    PICTURE X.
           02  I030099P    PICTURE X.
           02  I030099H    PICTURE X.
           02  I030099V    PICTURE X.
           02  I030099O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004501C    PICTURE X.
           02  I004501P    PICTURE X.
           02  I004501H    PICTURE X.
           02  I004501V    PICTURE X.
           02  I004501O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004701C    PICTURE X.
           02  I004701P    PICTURE X.
           02  I004701H    PICTURE X.
           02  I004701V    PICTURE X.
           02  I004701O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004801C    PICTURE X.
           02  I004801P    PICTURE X.
           02  I004801H    PICTURE X.
           02  I004801V    PICTURE X.
           02  I004801O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005001C    PICTURE X.
           02  I005001P    PICTURE X.
           02  I005001H    PICTURE X.
           02  I005001V    PICTURE X.
           02  I005001O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005101C    PICTURE X.
           02  I005101P    PICTURE X.
           02  I005101H    PICTURE X.
           02  I005101V    PICTURE X.
           02  I005101O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I018101C    PICTURE X.
           02  I018101P    PICTURE X.
           02  I018101H    PICTURE X.
           02  I018101V    PICTURE X.
           02  I018101O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMCOR07C    PICTURE X.
           02  IMCOR07P    PICTURE X.
           02  IMCOR07H    PICTURE X.
           02  IMCOR07V    PICTURE X.
           02  IMCOR07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I030100C    PICTURE X.
           02  I030100P    PICTURE X.
           02  I030100H    PICTURE X.
           02  I030100V    PICTURE X.
           02  I030100O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004503C    PICTURE X.
           02  I004503P    PICTURE X.
           02  I004503H    PICTURE X.
           02  I004503V    PICTURE X.
           02  I004503O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004703C    PICTURE X.
           02  I004703P    PICTURE X.
           02  I004703H    PICTURE X.
           02  I004703V    PICTURE X.
           02  I004703O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004803C    PICTURE X.
           02  I004803P    PICTURE X.
           02  I004803H    PICTURE X.
           02  I004803V    PICTURE X.
           02  I004803O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005003C    PICTURE X.
           02  I005003P    PICTURE X.
           02  I005003H    PICTURE X.
           02  I005003V    PICTURE X.
           02  I005003O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005103C    PICTURE X.
           02  I005103P    PICTURE X.
           02  I005103H    PICTURE X.
           02  I005103V    PICTURE X.
           02  I005103O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I018103C    PICTURE X.
           02  I018103P    PICTURE X.
           02  I018103H    PICTURE X.
           02  I018103V    PICTURE X.
           02  I018103O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMAC100C    PICTURE X.
           02  IMAC100P    PICTURE X.
           02  IMAC100H    PICTURE X.
           02  IMAC100V    PICTURE X.
           02  IMAC100O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I018104C    PICTURE X.
           02  I018104P    PICTURE X.
           02  I018104H    PICTURE X.
           02  I018104V    PICTURE X.
           02  I018104O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004504C    PICTURE X.
           02  I004504P    PICTURE X.
           02  I004504H    PICTURE X.
           02  I004504V    PICTURE X.
           02  I004504O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004704C    PICTURE X.
           02  I004704P    PICTURE X.
           02  I004704H    PICTURE X.
           02  I004704V    PICTURE X.
           02  I004704O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004804C    PICTURE X.
           02  I004804P    PICTURE X.
           02  I004804H    PICTURE X.
           02  I004804V    PICTURE X.
           02  I004804O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005004C    PICTURE X.
           02  I005004P    PICTURE X.
           02  I005004H    PICTURE X.
           02  I005004V    PICTURE X.
           02  I005004O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005104C    PICTURE X.
           02  I005104P    PICTURE X.
           02  I005104H    PICTURE X.
           02  I005104V    PICTURE X.
           02  I005104O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I030101C    PICTURE X.
           02  I030101P    PICTURE X.
           02  I030101H    PICTURE X.
           02  I030101V    PICTURE X.
           02  I030101O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAC101C    PICTURE X.
           02  IMAC101P    PICTURE X.
           02  IMAC101H    PICTURE X.
           02  IMAC101V    PICTURE X.
           02  IMAC101O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I018105C    PICTURE X.
           02  I018105P    PICTURE X.
           02  I018105H    PICTURE X.
           02  I018105V    PICTURE X.
           02  I018105O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004505C    PICTURE X.
           02  I004505P    PICTURE X.
           02  I004505H    PICTURE X.
           02  I004505V    PICTURE X.
           02  I004505O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004705C    PICTURE X.
           02  I004705P    PICTURE X.
           02  I004705H    PICTURE X.
           02  I004705V    PICTURE X.
           02  I004705O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004805C    PICTURE X.
           02  I004805P    PICTURE X.
           02  I004805H    PICTURE X.
           02  I004805V    PICTURE X.
           02  I004805O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005005C    PICTURE X.
           02  I005005P    PICTURE X.
           02  I005005H    PICTURE X.
           02  I005005V    PICTURE X.
           02  I005005O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005105C    PICTURE X.
           02  I005105P    PICTURE X.
           02  I005105H    PICTURE X.
           02  I005105V    PICTURE X.
           02  I005105O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I030102C    PICTURE X.
           02  I030102P    PICTURE X.
           02  I030102H    PICTURE X.
           02  I030102V    PICTURE X.
           02  I030102O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAC102C    PICTURE X.
           02  IMAC102P    PICTURE X.
           02  IMAC102H    PICTURE X.
           02  IMAC102V    PICTURE X.
           02  IMAC102O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I018106C    PICTURE X.
           02  I018106P    PICTURE X.
           02  I018106H    PICTURE X.
           02  I018106V    PICTURE X.
           02  I018106O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004506C    PICTURE X.
           02  I004506P    PICTURE X.
           02  I004506H    PICTURE X.
           02  I004506V    PICTURE X.
           02  I004506O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004706C    PICTURE X.
           02  I004706P    PICTURE X.
           02  I004706H    PICTURE X.
           02  I004706V    PICTURE X.
           02  I004706O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004806C    PICTURE X.
           02  I004806P    PICTURE X.
           02  I004806H    PICTURE X.
           02  I004806V    PICTURE X.
           02  I004806O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005006C    PICTURE X.
           02  I005006P    PICTURE X.
           02  I005006H    PICTURE X.
           02  I005006V    PICTURE X.
           02  I005006O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005106C    PICTURE X.
           02  I005106P    PICTURE X.
           02  I005106H    PICTURE X.
           02  I005106V    PICTURE X.
           02  I005106O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I030103C    PICTURE X.
           02  I030103P    PICTURE X.
           02  I030103H    PICTURE X.
           02  I030103V    PICTURE X.
           02  I030103O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAC103C    PICTURE X.
           02  IMAC103P    PICTURE X.
           02  IMAC103H    PICTURE X.
           02  IMAC103V    PICTURE X.
           02  IMAC103O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I018107C    PICTURE X.
           02  I018107P    PICTURE X.
           02  I018107H    PICTURE X.
           02  I018107V    PICTURE X.
           02  I018107O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004507C    PICTURE X.
           02  I004507P    PICTURE X.
           02  I004507H    PICTURE X.
           02  I004507V    PICTURE X.
           02  I004507O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004707C    PICTURE X.
           02  I004707P    PICTURE X.
           02  I004707H    PICTURE X.
           02  I004707V    PICTURE X.
           02  I004707O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004807C    PICTURE X.
           02  I004807P    PICTURE X.
           02  I004807H    PICTURE X.
           02  I004807V    PICTURE X.
           02  I004807O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005007C    PICTURE X.
           02  I005007P    PICTURE X.
           02  I005007H    PICTURE X.
           02  I005007V    PICTURE X.
           02  I005007O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005107C    PICTURE X.
           02  I005107P    PICTURE X.
           02  I005107H    PICTURE X.
           02  I005107V    PICTURE X.
           02  I005107O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I030104C    PICTURE X.
           02  I030104P    PICTURE X.
           02  I030104H    PICTURE X.
           02  I030104V    PICTURE X.
           02  I030104O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAC104C    PICTURE X.
           02  IMAC104P    PICTURE X.
           02  IMAC104H    PICTURE X.
           02  IMAC104V    PICTURE X.
           02  IMAC104O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I018108C    PICTURE X.
           02  I018108P    PICTURE X.
           02  I018108H    PICTURE X.
           02  I018108V    PICTURE X.
           02  I018108O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004508C    PICTURE X.
           02  I004508P    PICTURE X.
           02  I004508H    PICTURE X.
           02  I004508V    PICTURE X.
           02  I004508O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004708C    PICTURE X.
           02  I004708P    PICTURE X.
           02  I004708H    PICTURE X.
           02  I004708V    PICTURE X.
           02  I004708O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004808C    PICTURE X.
           02  I004808P    PICTURE X.
           02  I004808H    PICTURE X.
           02  I004808V    PICTURE X.
           02  I004808O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005008C    PICTURE X.
           02  I005008P    PICTURE X.
           02  I005008H    PICTURE X.
           02  I005008V    PICTURE X.
           02  I005008O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005108C    PICTURE X.
           02  I005108P    PICTURE X.
           02  I005108H    PICTURE X.
           02  I005108V    PICTURE X.
           02  I005108O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I030105C    PICTURE X.
           02  I030105P    PICTURE X.
           02  I030105H    PICTURE X.
           02  I030105V    PICTURE X.
           02  I030105O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAC105C    PICTURE X.
           02  IMAC105P    PICTURE X.
           02  IMAC105H    PICTURE X.
           02  IMAC105V    PICTURE X.
           02  IMAC105O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I018109C    PICTURE X.
           02  I018109P    PICTURE X.
           02  I018109H    PICTURE X.
           02  I018109V    PICTURE X.
           02  I018109O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004509C    PICTURE X.
           02  I004509P    PICTURE X.
           02  I004509H    PICTURE X.
           02  I004509V    PICTURE X.
           02  I004509O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004709C    PICTURE X.
           02  I004709P    PICTURE X.
           02  I004709H    PICTURE X.
           02  I004709V    PICTURE X.
           02  I004709O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004809C    PICTURE X.
           02  I004809P    PICTURE X.
           02  I004809H    PICTURE X.
           02  I004809V    PICTURE X.
           02  I004809O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005009C    PICTURE X.
           02  I005009P    PICTURE X.
           02  I005009H    PICTURE X.
           02  I005009V    PICTURE X.
           02  I005009O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005109C    PICTURE X.
           02  I005109P    PICTURE X.
           02  I005109H    PICTURE X.
           02  I005109V    PICTURE X.
           02  I005109O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I030106C    PICTURE X.
           02  I030106P    PICTURE X.
           02  I030106H    PICTURE X.
           02  I030106V    PICTURE X.
           02  I030106O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAC106C    PICTURE X.
           02  IMAC106P    PICTURE X.
           02  IMAC106H    PICTURE X.
           02  IMAC106V    PICTURE X.
           02  IMAC106O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I018110C    PICTURE X.
           02  I018110P    PICTURE X.
           02  I018110H    PICTURE X.
           02  I018110V    PICTURE X.
           02  I018110O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004510C    PICTURE X.
           02  I004510P    PICTURE X.
           02  I004510H    PICTURE X.
           02  I004510V    PICTURE X.
           02  I004510O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004710C    PICTURE X.
           02  I004710P    PICTURE X.
           02  I004710H    PICTURE X.
           02  I004710V    PICTURE X.
           02  I004710O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004810C    PICTURE X.
           02  I004810P    PICTURE X.
           02  I004810H    PICTURE X.
           02  I004810V    PICTURE X.
           02  I004810O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005010C    PICTURE X.
           02  I005010P    PICTURE X.
           02  I005010H    PICTURE X.
           02  I005010V    PICTURE X.
           02  I005010O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005110C    PICTURE X.
           02  I005110P    PICTURE X.
           02  I005110H    PICTURE X.
           02  I005110V    PICTURE X.
           02  I005110O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I030107C    PICTURE X.
           02  I030107P    PICTURE X.
           02  I030107H    PICTURE X.
           02  I030107V    PICTURE X.
           02  I030107O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMAC107C    PICTURE X.
           02  IMAC107P    PICTURE X.
           02  IMAC107H    PICTURE X.
           02  IMAC107V    PICTURE X.
           02  IMAC107O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I018111C    PICTURE X.
           02  I018111P    PICTURE X.
           02  I018111H    PICTURE X.
           02  I018111V    PICTURE X.
           02  I018111O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004511C    PICTURE X.
           02  I004511P    PICTURE X.
           02  I004511H    PICTURE X.
           02  I004511V    PICTURE X.
           02  I004511O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I004711C    PICTURE X.
           02  I004711P    PICTURE X.
           02  I004711H    PICTURE X.
           02  I004711V    PICTURE X.
           02  I004711O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I004811C    PICTURE X.
           02  I004811P    PICTURE X.
           02  I004811H    PICTURE X.
           02  I004811V    PICTURE X.
           02  I004811O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005011C    PICTURE X.
           02  I005011P    PICTURE X.
           02  I005011H    PICTURE X.
           02  I005011V    PICTURE X.
           02  I005011O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I005111C    PICTURE X.
           02  I005111P    PICTURE X.
           02  I005111H    PICTURE X.
           02  I005111V    PICTURE X.
           02  I005111O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I030108C    PICTURE X.
           02  I030108P    PICTURE X.
           02  I030108H    PICTURE X.
           02  I030108V    PICTURE X.
           02  I030108O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMPFS07C    PICTURE X.
           02  IMPFS07P    PICTURE X.
           02  IMPFS07H    PICTURE X.
           02  IMPFS07V    PICTURE X.
           02  IMPFS07O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR07C    PICTURE X.
           02  IMERR07P    PICTURE X.
           02  IMERR07H    PICTURE X.
           02  IMERR07V    PICTURE X.
           02  IMERR07O  PIC X(79).
       01  IMX1M01I REDEFINES IMX1M07I.
           02  FILLER PIC X(12).
           02  IMXTR01L    COMP  PIC  S9(4).
           02  IMXTR01F    PICTURE X.
           02  FILLER REDEFINES IMXTR01F.
             03 IMXTR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXTR01I  PIC X(4).
           02  IMXDT01L    COMP  PIC  S9(4).
           02  IMXDT01F    PICTURE X.
           02  FILLER REDEFINES IMXDT01F.
             03 IMXDT01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXDT01I  PIC X(8).
           02  IMXTM01L    COMP  PIC  S9(4).
           02  IMXTM01F    PICTURE X.
           02  FILLER REDEFINES IMXTM01F.
             03 IMXTM01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXTM01I  PIC X(8).
           02  TYPE001L    COMP  PIC  S9(4).
           02  TYPE001F    PICTURE X.
           02  FILLER REDEFINES TYPE001F.
             03 TYPE001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TYPE001I  PIC X(1).
           02  INDEX01L    COMP  PIC  S9(4).
           02  INDEX01F    PICTURE X.
           02  FILLER REDEFINES INDEX01F.
             03 INDEX01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INDEX01I  PIC X(1).
           02  PROD001L    COMP  PIC  S9(4).
           02  PROD001F    PICTURE X.
           02  FILLER REDEFINES PROD001F.
             03 PROD001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PROD001I  PIC X(3).
           02  IMXCTL1L    COMP  PIC  S9(4).
           02  IMXCTL1F    PICTURE X.
           02  FILLER REDEFINES IMXCTL1F.
             03 IMXCTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL1I  PIC X(2).
           02  IMXCTL2L    COMP  PIC  S9(4).
           02  IMXCTL2F    PICTURE X.
           02  FILLER REDEFINES IMXCTL2F.
             03 IMXCTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL2I  PIC X(3).
           02  IMXCTL3L    COMP  PIC  S9(4).
           02  IMXCTL3F    PICTURE X.
           02  FILLER REDEFINES IMXCTL3F.
             03 IMXCTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL3I  PIC X(3).
           02  IMPFS01L    COMP  PIC  S9(4).
           02  IMPFS01F    PICTURE X.
           02  FILLER REDEFINES IMPFS01F.
             03 IMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS01I  PIC X(79).
           02  IMERR01L    COMP  PIC  S9(4).
           02  IMERR01F    PICTURE X.
           02  FILLER REDEFINES IMERR01F.
             03 IMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR01I  PIC X(79).
       01  IMX1M01O REDEFINES IMX1M01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMXTR01C    PICTURE X.
           02  IMXTR01P    PICTURE X.
           02  IMXTR01H    PICTURE X.
           02  IMXTR01V    PICTURE X.
           02  IMXTR01O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMXDT01C    PICTURE X.
           02  IMXDT01P    PICTURE X.
           02  IMXDT01H    PICTURE X.
           02  IMXDT01V    PICTURE X.
           02  IMXDT01O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMXTM01C    PICTURE X.
           02  IMXTM01P    PICTURE X.
           02  IMXTM01H    PICTURE X.
           02  IMXTM01V    PICTURE X.
           02  IMXTM01O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TYPE001C    PICTURE X.
           02  TYPE001P    PICTURE X.
           02  TYPE001H    PICTURE X.
           02  TYPE001V    PICTURE X.
           02  TYPE001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INDEX01C    PICTURE X.
           02  INDEX01P    PICTURE X.
           02  INDEX01H    PICTURE X.
           02  INDEX01V    PICTURE X.
           02  INDEX01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PROD001C    PICTURE X.
           02  PROD001P    PICTURE X.
           02  PROD001H    PICTURE X.
           02  PROD001V    PICTURE X.
           02  PROD001O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL1C    PICTURE X.
           02  IMXCTL1P    PICTURE X.
           02  IMXCTL1H    PICTURE X.
           02  IMXCTL1V    PICTURE X.
           02  IMXCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMXCTL2C    PICTURE X.
           02  IMXCTL2P    PICTURE X.
           02  IMXCTL2H    PICTURE X.
           02  IMXCTL2V    PICTURE X.
           02  IMXCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL3C    PICTURE X.
           02  IMXCTL3P    PICTURE X.
           02  IMXCTL3H    PICTURE X.
           02  IMXCTL3V    PICTURE X.
           02  IMXCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMPFS01C    PICTURE X.
           02  IMPFS01P    PICTURE X.
           02  IMPFS01H    PICTURE X.
           02  IMPFS01V    PICTURE X.
           02  IMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR01C    PICTURE X.
           02  IMERR01P    PICTURE X.
           02  IMERR01H    PICTURE X.
           02  IMERR01V    PICTURE X.
           02  IMERR01O  PIC X(79).
       01  IMX1M02I REDEFINES IMX1M07I.
           02  FILLER PIC X(12).
           02  IMXTR02L    COMP  PIC  S9(4).
           02  IMXTR02F    PICTURE X.
           02  FILLER REDEFINES IMXTR02F.
             03 IMXTR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXTR02I  PIC X(4).
           02  IMXDT02L    COMP  PIC  S9(4).
           02  IMXDT02F    PICTURE X.
           02  FILLER REDEFINES IMXDT02F.
             03 IMXDT02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXDT02I  PIC X(8).
           02  IMXTM02L    COMP  PIC  S9(4).
           02  IMXTM02F    PICTURE X.
           02  FILLER REDEFINES IMXTM02F.
             03 IMXTM02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXTM02I  PIC X(8).
           02  TYPE002L    COMP  PIC  S9(4).
           02  TYPE002F    PICTURE X.
           02  FILLER REDEFINES TYPE002F.
             03 TYPE002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TYPE002I  PIC X(1).
           02  INDEX02L    COMP  PIC  S9(4).
           02  INDEX02F    PICTURE X.
           02  FILLER REDEFINES INDEX02F.
             03 INDEX02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INDEX02I  PIC X(1).
           02  PROD002L    COMP  PIC  S9(4).
           02  PROD002F    PICTURE X.
           02  FILLER REDEFINES PROD002F.
             03 PROD002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PROD002I  PIC X(3).
           02  CTL1002L    COMP  PIC  S9(4).
           02  CTL1002F    PICTURE X.
           02  FILLER REDEFINES CTL1002F.
             03 CTL1002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1002I  PIC X(2).
           02  CTL2002L    COMP  PIC  S9(4).
           02  CTL2002F    PICTURE X.
           02  FILLER REDEFINES CTL2002F.
             03 CTL2002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2002I  PIC X(3).
           02  CTL3002L    COMP  PIC  S9(4).
           02  CTL3002F    PICTURE X.
           02  FILLER REDEFINES CTL3002F.
             03 CTL3002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3002I  PIC X(3).
           02  I001102L    COMP  PIC  S9(4).
           02  I001102F    PICTURE X.
           02  FILLER REDEFINES I001102F.
             03 I001102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001102I  PIC X(2).
           02  I004202L    COMP  PIC  S9(4).
           02  I004202F    PICTURE X.
           02  FILLER REDEFINES I004202F.
             03 I004202A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004202I  PIC X(10).
           02  I001802L    COMP  PIC  S9(4).
           02  I001802F    PICTURE X.
           02  FILLER REDEFINES I001802F.
             03 I001802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001802I  PIC X(6).
           02  I001101L    COMP  PIC  S9(4).
           02  I001101F    PICTURE X.
           02  FILLER REDEFINES I001101F.
             03 I001101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001101I  PIC X(2).
           02  I004201L    COMP  PIC  S9(4).
           02  I004201F    PICTURE X.
           02  FILLER REDEFINES I004201F.
             03 I004201A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004201I  PIC X(10).
           02  I001801L    COMP  PIC  S9(4).
           02  I001801F    PICTURE X.
           02  FILLER REDEFINES I001801F.
             03 I001801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001801I  PIC X(6).
           02  IMCOR02L    COMP  PIC  S9(4).
           02  IMCOR02F    PICTURE X.
           02  FILLER REDEFINES IMCOR02F.
             03 IMCOR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMCOR02I  PIC X(1).
           02  I001103L    COMP  PIC  S9(4).
           02  I001103F    PICTURE X.
           02  FILLER REDEFINES I001103F.
             03 I001103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001103I  PIC X(2).
           02  I004203L    COMP  PIC  S9(4).
           02  I004203F    PICTURE X.
           02  FILLER REDEFINES I004203F.
             03 I004203A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004203I  PIC X(10).
           02  I001803L    COMP  PIC  S9(4).
           02  I001803F    PICTURE X.
           02  FILLER REDEFINES I001803F.
             03 I001803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001803I  PIC X(6).
           02  I001104L    COMP  PIC  S9(4).
           02  I001104F    PICTURE X.
           02  FILLER REDEFINES I001104F.
             03 I001104A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001104I  PIC X(2).
           02  I001804L    COMP  PIC  S9(4).
           02  I001804F    PICTURE X.
           02  FILLER REDEFINES I001804F.
             03 I001804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001804I  PIC X(6).
           02  I004204L    COMP  PIC  S9(4).
           02  I004204F    PICTURE X.
           02  FILLER REDEFINES I004204F.
             03 I004204A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004204I  PIC X(10).
           02  I001105L    COMP  PIC  S9(4).
           02  I001105F    PICTURE X.
           02  FILLER REDEFINES I001105F.
             03 I001105A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001105I  PIC X(2).
           02  I001805L    COMP  PIC  S9(4).
           02  I001805F    PICTURE X.
           02  FILLER REDEFINES I001805F.
             03 I001805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001805I  PIC X(6).
           02  I004205L    COMP  PIC  S9(4).
           02  I004205F    PICTURE X.
           02  FILLER REDEFINES I004205F.
             03 I004205A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004205I  PIC X(10).
           02  I001106L    COMP  PIC  S9(4).
           02  I001106F    PICTURE X.
           02  FILLER REDEFINES I001106F.
             03 I001106A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001106I  PIC X(2).
           02  I001806L    COMP  PIC  S9(4).
           02  I001806F    PICTURE X.
           02  FILLER REDEFINES I001806F.
             03 I001806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001806I  PIC X(6).
           02  I004206L    COMP  PIC  S9(4).
           02  I004206F    PICTURE X.
           02  FILLER REDEFINES I004206F.
             03 I004206A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004206I  PIC X(10).
           02  I001107L    COMP  PIC  S9(4).
           02  I001107F    PICTURE X.
           02  FILLER REDEFINES I001107F.
             03 I001107A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001107I  PIC X(2).
           02  I001807L    COMP  PIC  S9(4).
           02  I001807F    PICTURE X.
           02  FILLER REDEFINES I001807F.
             03 I001807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001807I  PIC X(6).
           02  I004207L    COMP  PIC  S9(4).
           02  I004207F    PICTURE X.
           02  FILLER REDEFINES I004207F.
             03 I004207A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004207I  PIC X(10).
           02  I001108L    COMP  PIC  S9(4).
           02  I001108F    PICTURE X.
           02  FILLER REDEFINES I001108F.
             03 I001108A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001108I  PIC X(2).
           02  I001808L    COMP  PIC  S9(4).
           02  I001808F    PICTURE X.
           02  FILLER REDEFINES I001808F.
             03 I001808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001808I  PIC X(6).
           02  I004208L    COMP  PIC  S9(4).
           02  I004208F    PICTURE X.
           02  FILLER REDEFINES I004208F.
             03 I004208A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004208I  PIC X(10).
           02  I001109L    COMP  PIC  S9(4).
           02  I001109F    PICTURE X.
           02  FILLER REDEFINES I001109F.
             03 I001109A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001109I  PIC X(2).
           02  I001809L    COMP  PIC  S9(4).
           02  I001809F    PICTURE X.
           02  FILLER REDEFINES I001809F.
             03 I001809A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001809I  PIC X(6).
           02  I004209L    COMP  PIC  S9(4).
           02  I004209F    PICTURE X.
           02  FILLER REDEFINES I004209F.
             03 I004209A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004209I  PIC X(10).
           02  I001110L    COMP  PIC  S9(4).
           02  I001110F    PICTURE X.
           02  FILLER REDEFINES I001110F.
             03 I001110A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001110I  PIC X(2).
           02  I001810L    COMP  PIC  S9(4).
           02  I001810F    PICTURE X.
           02  FILLER REDEFINES I001810F.
             03 I001810A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001810I  PIC X(6).
           02  I004210L    COMP  PIC  S9(4).
           02  I004210F    PICTURE X.
           02  FILLER REDEFINES I004210F.
             03 I004210A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004210I  PIC X(10).
           02  I001111L    COMP  PIC  S9(4).
           02  I001111F    PICTURE X.
           02  FILLER REDEFINES I001111F.
             03 I001111A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001111I  PIC X(2).
           02  I001811L    COMP  PIC  S9(4).
           02  I001811F    PICTURE X.
           02  FILLER REDEFINES I001811F.
             03 I001811A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001811I  PIC X(6).
           02  I004211L    COMP  PIC  S9(4).
           02  I004211F    PICTURE X.
           02  FILLER REDEFINES I004211F.
             03 I004211A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004211I  PIC X(10).
           02  I001112L    COMP  PIC  S9(4).
           02  I001112F    PICTURE X.
           02  FILLER REDEFINES I001112F.
             03 I001112A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001112I  PIC X(2).
           02  I001812L    COMP  PIC  S9(4).
           02  I001812F    PICTURE X.
           02  FILLER REDEFINES I001812F.
             03 I001812A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001812I  PIC X(6).
           02  I004212L    COMP  PIC  S9(4).
           02  I004212F    PICTURE X.
           02  FILLER REDEFINES I004212F.
             03 I004212A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004212I  PIC X(10).
           02  I001113L    COMP  PIC  S9(4).
           02  I001113F    PICTURE X.
           02  FILLER REDEFINES I001113F.
             03 I001113A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001113I  PIC X(2).
           02  I001813L    COMP  PIC  S9(4).
           02  I001813F    PICTURE X.
           02  FILLER REDEFINES I001813F.
             03 I001813A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001813I  PIC X(6).
           02  I004213L    COMP  PIC  S9(4).
           02  I004213F    PICTURE X.
           02  FILLER REDEFINES I004213F.
             03 I004213A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004213I  PIC X(10).
           02  I001114L    COMP  PIC  S9(4).
           02  I001114F    PICTURE X.
           02  FILLER REDEFINES I001114F.
             03 I001114A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001114I  PIC X(2).
           02  I001814L    COMP  PIC  S9(4).
           02  I001814F    PICTURE X.
           02  FILLER REDEFINES I001814F.
             03 I001814A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001814I  PIC X(6).
           02  I004214L    COMP  PIC  S9(4).
           02  I004214F    PICTURE X.
           02  FILLER REDEFINES I004214F.
             03 I004214A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004214I  PIC X(10).
           02  I001115L    COMP  PIC  S9(4).
           02  I001115F    PICTURE X.
           02  FILLER REDEFINES I001115F.
             03 I001115A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001115I  PIC X(2).
           02  I001815L    COMP  PIC  S9(4).
           02  I001815F    PICTURE X.
           02  FILLER REDEFINES I001815F.
             03 I001815A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001815I  PIC X(6).
           02  I004215L    COMP  PIC  S9(4).
           02  I004215F    PICTURE X.
           02  FILLER REDEFINES I004215F.
             03 I004215A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004215I  PIC X(10).
           02  I001116L    COMP  PIC  S9(4).
           02  I001116F    PICTURE X.
           02  FILLER REDEFINES I001116F.
             03 I001116A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001116I  PIC X(2).
           02  I001816L    COMP  PIC  S9(4).
           02  I001816F    PICTURE X.
           02  FILLER REDEFINES I001816F.
             03 I001816A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001816I  PIC X(6).
           02  I004216L    COMP  PIC  S9(4).
           02  I004216F    PICTURE X.
           02  FILLER REDEFINES I004216F.
             03 I004216A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004216I  PIC X(10).
           02  I001117L    COMP  PIC  S9(4).
           02  I001117F    PICTURE X.
           02  FILLER REDEFINES I001117F.
             03 I001117A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001117I  PIC X(2).
           02  I001817L    COMP  PIC  S9(4).
           02  I001817F    PICTURE X.
           02  FILLER REDEFINES I001817F.
             03 I001817A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001817I  PIC X(6).
           02  I004217L    COMP  PIC  S9(4).
           02  I004217F    PICTURE X.
           02  FILLER REDEFINES I004217F.
             03 I004217A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004217I  PIC X(10).
           02  I001118L    COMP  PIC  S9(4).
           02  I001118F    PICTURE X.
           02  FILLER REDEFINES I001118F.
             03 I001118A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001118I  PIC X(2).
           02  I001818L    COMP  PIC  S9(4).
           02  I001818F    PICTURE X.
           02  FILLER REDEFINES I001818F.
             03 I001818A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001818I  PIC X(6).
           02  I004218L    COMP  PIC  S9(4).
           02  I004218F    PICTURE X.
           02  FILLER REDEFINES I004218F.
             03 I004218A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004218I  PIC X(10).
           02  I001119L    COMP  PIC  S9(4).
           02  I001119F    PICTURE X.
           02  FILLER REDEFINES I001119F.
             03 I001119A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001119I  PIC X(2).
           02  I001819L    COMP  PIC  S9(4).
           02  I001819F    PICTURE X.
           02  FILLER REDEFINES I001819F.
             03 I001819A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001819I  PIC X(6).
           02  I004219L    COMP  PIC  S9(4).
           02  I004219F    PICTURE X.
           02  FILLER REDEFINES I004219F.
             03 I004219A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004219I  PIC X(10).
           02  I001120L    COMP  PIC  S9(4).
           02  I001120F    PICTURE X.
           02  FILLER REDEFINES I001120F.
             03 I001120A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001120I  PIC X(2).
           02  I001820L    COMP  PIC  S9(4).
           02  I001820F    PICTURE X.
           02  FILLER REDEFINES I001820F.
             03 I001820A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001820I  PIC X(6).
           02  I004220L    COMP  PIC  S9(4).
           02  I004220F    PICTURE X.
           02  FILLER REDEFINES I004220F.
             03 I004220A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004220I  PIC X(10).
           02  I001121L    COMP  PIC  S9(4).
           02  I001121F    PICTURE X.
           02  FILLER REDEFINES I001121F.
             03 I001121A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001121I  PIC X(2).
           02  I001821L    COMP  PIC  S9(4).
           02  I001821F    PICTURE X.
           02  FILLER REDEFINES I001821F.
             03 I001821A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001821I  PIC X(6).
           02  I004221L    COMP  PIC  S9(4).
           02  I004221F    PICTURE X.
           02  FILLER REDEFINES I004221F.
             03 I004221A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004221I  PIC X(10).
           02  I001122L    COMP  PIC  S9(4).
           02  I001122F    PICTURE X.
           02  FILLER REDEFINES I001122F.
             03 I001122A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001122I  PIC X(2).
           02  I001822L    COMP  PIC  S9(4).
           02  I001822F    PICTURE X.
           02  FILLER REDEFINES I001822F.
             03 I001822A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001822I  PIC X(6).
           02  I004222L    COMP  PIC  S9(4).
           02  I004222F    PICTURE X.
           02  FILLER REDEFINES I004222F.
             03 I004222A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004222I  PIC X(10).
           02  I001123L    COMP  PIC  S9(4).
           02  I001123F    PICTURE X.
           02  FILLER REDEFINES I001123F.
             03 I001123A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001123I  PIC X(2).
           02  I001823L    COMP  PIC  S9(4).
           02  I001823F    PICTURE X.
           02  FILLER REDEFINES I001823F.
             03 I001823A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001823I  PIC X(6).
           02  I004223L    COMP  PIC  S9(4).
           02  I004223F    PICTURE X.
           02  FILLER REDEFINES I004223F.
             03 I004223A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004223I  PIC X(10).
           02  I001124L    COMP  PIC  S9(4).
           02  I001124F    PICTURE X.
           02  FILLER REDEFINES I001124F.
             03 I001124A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001124I  PIC X(2).
           02  I001824L    COMP  PIC  S9(4).
           02  I001824F    PICTURE X.
           02  FILLER REDEFINES I001824F.
             03 I001824A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001824I  PIC X(6).
           02  I004224L    COMP  PIC  S9(4).
           02  I004224F    PICTURE X.
           02  FILLER REDEFINES I004224F.
             03 I004224A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004224I  PIC X(10).
           02  I001125L    COMP  PIC  S9(4).
           02  I001125F    PICTURE X.
           02  FILLER REDEFINES I001125F.
             03 I001125A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001125I  PIC X(2).
           02  I001825L    COMP  PIC  S9(4).
           02  I001825F    PICTURE X.
           02  FILLER REDEFINES I001825F.
             03 I001825A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001825I  PIC X(6).
           02  I004225L    COMP  PIC  S9(4).
           02  I004225F    PICTURE X.
           02  FILLER REDEFINES I004225F.
             03 I004225A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004225I  PIC X(10).
           02  I001126L    COMP  PIC  S9(4).
           02  I001126F    PICTURE X.
           02  FILLER REDEFINES I001126F.
             03 I001126A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001126I  PIC X(2).
           02  I001826L    COMP  PIC  S9(4).
           02  I001826F    PICTURE X.
           02  FILLER REDEFINES I001826F.
             03 I001826A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001826I  PIC X(6).
           02  I004226L    COMP  PIC  S9(4).
           02  I004226F    PICTURE X.
           02  FILLER REDEFINES I004226F.
             03 I004226A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004226I  PIC X(10).
           02  I001127L    COMP  PIC  S9(4).
           02  I001127F    PICTURE X.
           02  FILLER REDEFINES I001127F.
             03 I001127A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001127I  PIC X(2).
           02  I001827L    COMP  PIC  S9(4).
           02  I001827F    PICTURE X.
           02  FILLER REDEFINES I001827F.
             03 I001827A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001827I  PIC X(6).
           02  I004227L    COMP  PIC  S9(4).
           02  I004227F    PICTURE X.
           02  FILLER REDEFINES I004227F.
             03 I004227A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004227I  PIC X(10).
           02  I001128L    COMP  PIC  S9(4).
           02  I001128F    PICTURE X.
           02  FILLER REDEFINES I001128F.
             03 I001128A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001128I  PIC X(2).
           02  I001828L    COMP  PIC  S9(4).
           02  I001828F    PICTURE X.
           02  FILLER REDEFINES I001828F.
             03 I001828A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001828I  PIC X(6).
           02  I004228L    COMP  PIC  S9(4).
           02  I004228F    PICTURE X.
           02  FILLER REDEFINES I004228F.
             03 I004228A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004228I  PIC X(10).
           02  I001129L    COMP  PIC  S9(4).
           02  I001129F    PICTURE X.
           02  FILLER REDEFINES I001129F.
             03 I001129A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001129I  PIC X(2).
           02  I001829L    COMP  PIC  S9(4).
           02  I001829F    PICTURE X.
           02  FILLER REDEFINES I001829F.
             03 I001829A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001829I  PIC X(6).
           02  I004229L    COMP  PIC  S9(4).
           02  I004229F    PICTURE X.
           02  FILLER REDEFINES I004229F.
             03 I004229A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004229I  PIC X(10).
           02  I001130L    COMP  PIC  S9(4).
           02  I001130F    PICTURE X.
           02  FILLER REDEFINES I001130F.
             03 I001130A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001130I  PIC X(2).
           02  I001830L    COMP  PIC  S9(4).
           02  I001830F    PICTURE X.
           02  FILLER REDEFINES I001830F.
             03 I001830A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001830I  PIC X(6).
           02  I004230L    COMP  PIC  S9(4).
           02  I004230F    PICTURE X.
           02  FILLER REDEFINES I004230F.
             03 I004230A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004230I  PIC X(10).
           02  IMPFS02L    COMP  PIC  S9(4).
           02  IMPFS02F    PICTURE X.
           02  FILLER REDEFINES IMPFS02F.
             03 IMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS02I  PIC X(79).
           02  IMERR02L    COMP  PIC  S9(4).
           02  IMERR02F    PICTURE X.
           02  FILLER REDEFINES IMERR02F.
             03 IMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR02I  PIC X(79).
       01  IMX1M02O REDEFINES IMX1M02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMXTR02C    PICTURE X.
           02  IMXTR02P    PICTURE X.
           02  IMXTR02H    PICTURE X.
           02  IMXTR02V    PICTURE X.
           02  IMXTR02O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMXDT02C    PICTURE X.
           02  IMXDT02P    PICTURE X.
           02  IMXDT02H    PICTURE X.
           02  IMXDT02V    PICTURE X.
           02  IMXDT02O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMXTM02C    PICTURE X.
           02  IMXTM02P    PICTURE X.
           02  IMXTM02H    PICTURE X.
           02  IMXTM02V    PICTURE X.
           02  IMXTM02O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TYPE002C    PICTURE X.
           02  TYPE002P    PICTURE X.
           02  TYPE002H    PICTURE X.
           02  TYPE002V    PICTURE X.
           02  TYPE002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INDEX02C    PICTURE X.
           02  INDEX02P    PICTURE X.
           02  INDEX02H    PICTURE X.
           02  INDEX02V    PICTURE X.
           02  INDEX02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PROD002C    PICTURE X.
           02  PROD002P    PICTURE X.
           02  PROD002H    PICTURE X.
           02  PROD002V    PICTURE X.
           02  PROD002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL1002C    PICTURE X.
           02  CTL1002P    PICTURE X.
           02  CTL1002H    PICTURE X.
           02  CTL1002V    PICTURE X.
           02  CTL1002O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2002C    PICTURE X.
           02  CTL2002P    PICTURE X.
           02  CTL2002H    PICTURE X.
           02  CTL2002V    PICTURE X.
           02  CTL2002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3002C    PICTURE X.
           02  CTL3002P    PICTURE X.
           02  CTL3002H    PICTURE X.
           02  CTL3002V    PICTURE X.
           02  CTL3002O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  I001102C    PICTURE X.
           02  I001102P    PICTURE X.
           02  I001102H    PICTURE X.
           02  I001102V    PICTURE X.
           02  I001102O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004202C    PICTURE X.
           02  I004202P    PICTURE X.
           02  I004202H    PICTURE X.
           02  I004202V    PICTURE X.
           02  I004202O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001802C    PICTURE X.
           02  I001802P    PICTURE X.
           02  I001802H    PICTURE X.
           02  I001802V    PICTURE X.
           02  I001802O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I001101C    PICTURE X.
           02  I001101P    PICTURE X.
           02  I001101H    PICTURE X.
           02  I001101V    PICTURE X.
           02  I001101O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004201C    PICTURE X.
           02  I004201P    PICTURE X.
           02  I004201H    PICTURE X.
           02  I004201V    PICTURE X.
           02  I004201O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001801C    PICTURE X.
           02  I001801P    PICTURE X.
           02  I001801H    PICTURE X.
           02  I001801V    PICTURE X.
           02  I001801O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMCOR02C    PICTURE X.
           02  IMCOR02P    PICTURE X.
           02  IMCOR02H    PICTURE X.
           02  IMCOR02V    PICTURE X.
           02  IMCOR02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I001103C    PICTURE X.
           02  I001103P    PICTURE X.
           02  I001103H    PICTURE X.
           02  I001103V    PICTURE X.
           02  I001103O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004203C    PICTURE X.
           02  I004203P    PICTURE X.
           02  I004203H    PICTURE X.
           02  I004203V    PICTURE X.
           02  I004203O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001803C    PICTURE X.
           02  I001803P    PICTURE X.
           02  I001803H    PICTURE X.
           02  I001803V    PICTURE X.
           02  I001803O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I001104C    PICTURE X.
           02  I001104P    PICTURE X.
           02  I001104H    PICTURE X.
           02  I001104V    PICTURE X.
           02  I001104O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001804C    PICTURE X.
           02  I001804P    PICTURE X.
           02  I001804H    PICTURE X.
           02  I001804V    PICTURE X.
           02  I001804O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004204C    PICTURE X.
           02  I004204P    PICTURE X.
           02  I004204H    PICTURE X.
           02  I004204V    PICTURE X.
           02  I004204O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001105C    PICTURE X.
           02  I001105P    PICTURE X.
           02  I001105H    PICTURE X.
           02  I001105V    PICTURE X.
           02  I001105O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001805C    PICTURE X.
           02  I001805P    PICTURE X.
           02  I001805H    PICTURE X.
           02  I001805V    PICTURE X.
           02  I001805O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004205C    PICTURE X.
           02  I004205P    PICTURE X.
           02  I004205H    PICTURE X.
           02  I004205V    PICTURE X.
           02  I004205O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001106C    PICTURE X.
           02  I001106P    PICTURE X.
           02  I001106H    PICTURE X.
           02  I001106V    PICTURE X.
           02  I001106O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001806C    PICTURE X.
           02  I001806P    PICTURE X.
           02  I001806H    PICTURE X.
           02  I001806V    PICTURE X.
           02  I001806O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004206C    PICTURE X.
           02  I004206P    PICTURE X.
           02  I004206H    PICTURE X.
           02  I004206V    PICTURE X.
           02  I004206O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001107C    PICTURE X.
           02  I001107P    PICTURE X.
           02  I001107H    PICTURE X.
           02  I001107V    PICTURE X.
           02  I001107O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001807C    PICTURE X.
           02  I001807P    PICTURE X.
           02  I001807H    PICTURE X.
           02  I001807V    PICTURE X.
           02  I001807O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004207C    PICTURE X.
           02  I004207P    PICTURE X.
           02  I004207H    PICTURE X.
           02  I004207V    PICTURE X.
           02  I004207O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001108C    PICTURE X.
           02  I001108P    PICTURE X.
           02  I001108H    PICTURE X.
           02  I001108V    PICTURE X.
           02  I001108O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001808C    PICTURE X.
           02  I001808P    PICTURE X.
           02  I001808H    PICTURE X.
           02  I001808V    PICTURE X.
           02  I001808O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004208C    PICTURE X.
           02  I004208P    PICTURE X.
           02  I004208H    PICTURE X.
           02  I004208V    PICTURE X.
           02  I004208O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001109C    PICTURE X.
           02  I001109P    PICTURE X.
           02  I001109H    PICTURE X.
           02  I001109V    PICTURE X.
           02  I001109O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001809C    PICTURE X.
           02  I001809P    PICTURE X.
           02  I001809H    PICTURE X.
           02  I001809V    PICTURE X.
           02  I001809O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004209C    PICTURE X.
           02  I004209P    PICTURE X.
           02  I004209H    PICTURE X.
           02  I004209V    PICTURE X.
           02  I004209O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001110C    PICTURE X.
           02  I001110P    PICTURE X.
           02  I001110H    PICTURE X.
           02  I001110V    PICTURE X.
           02  I001110O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001810C    PICTURE X.
           02  I001810P    PICTURE X.
           02  I001810H    PICTURE X.
           02  I001810V    PICTURE X.
           02  I001810O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004210C    PICTURE X.
           02  I004210P    PICTURE X.
           02  I004210H    PICTURE X.
           02  I004210V    PICTURE X.
           02  I004210O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001111C    PICTURE X.
           02  I001111P    PICTURE X.
           02  I001111H    PICTURE X.
           02  I001111V    PICTURE X.
           02  I001111O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001811C    PICTURE X.
           02  I001811P    PICTURE X.
           02  I001811H    PICTURE X.
           02  I001811V    PICTURE X.
           02  I001811O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004211C    PICTURE X.
           02  I004211P    PICTURE X.
           02  I004211H    PICTURE X.
           02  I004211V    PICTURE X.
           02  I004211O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001112C    PICTURE X.
           02  I001112P    PICTURE X.
           02  I001112H    PICTURE X.
           02  I001112V    PICTURE X.
           02  I001112O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001812C    PICTURE X.
           02  I001812P    PICTURE X.
           02  I001812H    PICTURE X.
           02  I001812V    PICTURE X.
           02  I001812O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004212C    PICTURE X.
           02  I004212P    PICTURE X.
           02  I004212H    PICTURE X.
           02  I004212V    PICTURE X.
           02  I004212O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001113C    PICTURE X.
           02  I001113P    PICTURE X.
           02  I001113H    PICTURE X.
           02  I001113V    PICTURE X.
           02  I001113O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001813C    PICTURE X.
           02  I001813P    PICTURE X.
           02  I001813H    PICTURE X.
           02  I001813V    PICTURE X.
           02  I001813O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004213C    PICTURE X.
           02  I004213P    PICTURE X.
           02  I004213H    PICTURE X.
           02  I004213V    PICTURE X.
           02  I004213O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001114C    PICTURE X.
           02  I001114P    PICTURE X.
           02  I001114H    PICTURE X.
           02  I001114V    PICTURE X.
           02  I001114O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001814C    PICTURE X.
           02  I001814P    PICTURE X.
           02  I001814H    PICTURE X.
           02  I001814V    PICTURE X.
           02  I001814O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004214C    PICTURE X.
           02  I004214P    PICTURE X.
           02  I004214H    PICTURE X.
           02  I004214V    PICTURE X.
           02  I004214O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001115C    PICTURE X.
           02  I001115P    PICTURE X.
           02  I001115H    PICTURE X.
           02  I001115V    PICTURE X.
           02  I001115O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001815C    PICTURE X.
           02  I001815P    PICTURE X.
           02  I001815H    PICTURE X.
           02  I001815V    PICTURE X.
           02  I001815O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004215C    PICTURE X.
           02  I004215P    PICTURE X.
           02  I004215H    PICTURE X.
           02  I004215V    PICTURE X.
           02  I004215O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001116C    PICTURE X.
           02  I001116P    PICTURE X.
           02  I001116H    PICTURE X.
           02  I001116V    PICTURE X.
           02  I001116O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001816C    PICTURE X.
           02  I001816P    PICTURE X.
           02  I001816H    PICTURE X.
           02  I001816V    PICTURE X.
           02  I001816O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004216C    PICTURE X.
           02  I004216P    PICTURE X.
           02  I004216H    PICTURE X.
           02  I004216V    PICTURE X.
           02  I004216O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001117C    PICTURE X.
           02  I001117P    PICTURE X.
           02  I001117H    PICTURE X.
           02  I001117V    PICTURE X.
           02  I001117O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001817C    PICTURE X.
           02  I001817P    PICTURE X.
           02  I001817H    PICTURE X.
           02  I001817V    PICTURE X.
           02  I001817O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004217C    PICTURE X.
           02  I004217P    PICTURE X.
           02  I004217H    PICTURE X.
           02  I004217V    PICTURE X.
           02  I004217O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001118C    PICTURE X.
           02  I001118P    PICTURE X.
           02  I001118H    PICTURE X.
           02  I001118V    PICTURE X.
           02  I001118O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001818C    PICTURE X.
           02  I001818P    PICTURE X.
           02  I001818H    PICTURE X.
           02  I001818V    PICTURE X.
           02  I001818O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004218C    PICTURE X.
           02  I004218P    PICTURE X.
           02  I004218H    PICTURE X.
           02  I004218V    PICTURE X.
           02  I004218O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001119C    PICTURE X.
           02  I001119P    PICTURE X.
           02  I001119H    PICTURE X.
           02  I001119V    PICTURE X.
           02  I001119O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001819C    PICTURE X.
           02  I001819P    PICTURE X.
           02  I001819H    PICTURE X.
           02  I001819V    PICTURE X.
           02  I001819O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004219C    PICTURE X.
           02  I004219P    PICTURE X.
           02  I004219H    PICTURE X.
           02  I004219V    PICTURE X.
           02  I004219O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001120C    PICTURE X.
           02  I001120P    PICTURE X.
           02  I001120H    PICTURE X.
           02  I001120V    PICTURE X.
           02  I001120O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001820C    PICTURE X.
           02  I001820P    PICTURE X.
           02  I001820H    PICTURE X.
           02  I001820V    PICTURE X.
           02  I001820O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004220C    PICTURE X.
           02  I004220P    PICTURE X.
           02  I004220H    PICTURE X.
           02  I004220V    PICTURE X.
           02  I004220O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001121C    PICTURE X.
           02  I001121P    PICTURE X.
           02  I001121H    PICTURE X.
           02  I001121V    PICTURE X.
           02  I001121O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001821C    PICTURE X.
           02  I001821P    PICTURE X.
           02  I001821H    PICTURE X.
           02  I001821V    PICTURE X.
           02  I001821O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004221C    PICTURE X.
           02  I004221P    PICTURE X.
           02  I004221H    PICTURE X.
           02  I004221V    PICTURE X.
           02  I004221O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001122C    PICTURE X.
           02  I001122P    PICTURE X.
           02  I001122H    PICTURE X.
           02  I001122V    PICTURE X.
           02  I001122O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001822C    PICTURE X.
           02  I001822P    PICTURE X.
           02  I001822H    PICTURE X.
           02  I001822V    PICTURE X.
           02  I001822O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004222C    PICTURE X.
           02  I004222P    PICTURE X.
           02  I004222H    PICTURE X.
           02  I004222V    PICTURE X.
           02  I004222O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001123C    PICTURE X.
           02  I001123P    PICTURE X.
           02  I001123H    PICTURE X.
           02  I001123V    PICTURE X.
           02  I001123O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001823C    PICTURE X.
           02  I001823P    PICTURE X.
           02  I001823H    PICTURE X.
           02  I001823V    PICTURE X.
           02  I001823O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004223C    PICTURE X.
           02  I004223P    PICTURE X.
           02  I004223H    PICTURE X.
           02  I004223V    PICTURE X.
           02  I004223O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001124C    PICTURE X.
           02  I001124P    PICTURE X.
           02  I001124H    PICTURE X.
           02  I001124V    PICTURE X.
           02  I001124O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001824C    PICTURE X.
           02  I001824P    PICTURE X.
           02  I001824H    PICTURE X.
           02  I001824V    PICTURE X.
           02  I001824O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004224C    PICTURE X.
           02  I004224P    PICTURE X.
           02  I004224H    PICTURE X.
           02  I004224V    PICTURE X.
           02  I004224O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001125C    PICTURE X.
           02  I001125P    PICTURE X.
           02  I001125H    PICTURE X.
           02  I001125V    PICTURE X.
           02  I001125O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001825C    PICTURE X.
           02  I001825P    PICTURE X.
           02  I001825H    PICTURE X.
           02  I001825V    PICTURE X.
           02  I001825O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004225C    PICTURE X.
           02  I004225P    PICTURE X.
           02  I004225H    PICTURE X.
           02  I004225V    PICTURE X.
           02  I004225O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001126C    PICTURE X.
           02  I001126P    PICTURE X.
           02  I001126H    PICTURE X.
           02  I001126V    PICTURE X.
           02  I001126O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001826C    PICTURE X.
           02  I001826P    PICTURE X.
           02  I001826H    PICTURE X.
           02  I001826V    PICTURE X.
           02  I001826O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004226C    PICTURE X.
           02  I004226P    PICTURE X.
           02  I004226H    PICTURE X.
           02  I004226V    PICTURE X.
           02  I004226O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001127C    PICTURE X.
           02  I001127P    PICTURE X.
           02  I001127H    PICTURE X.
           02  I001127V    PICTURE X.
           02  I001127O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001827C    PICTURE X.
           02  I001827P    PICTURE X.
           02  I001827H    PICTURE X.
           02  I001827V    PICTURE X.
           02  I001827O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004227C    PICTURE X.
           02  I004227P    PICTURE X.
           02  I004227H    PICTURE X.
           02  I004227V    PICTURE X.
           02  I004227O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001128C    PICTURE X.
           02  I001128P    PICTURE X.
           02  I001128H    PICTURE X.
           02  I001128V    PICTURE X.
           02  I001128O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001828C    PICTURE X.
           02  I001828P    PICTURE X.
           02  I001828H    PICTURE X.
           02  I001828V    PICTURE X.
           02  I001828O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004228C    PICTURE X.
           02  I004228P    PICTURE X.
           02  I004228H    PICTURE X.
           02  I004228V    PICTURE X.
           02  I004228O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001129C    PICTURE X.
           02  I001129P    PICTURE X.
           02  I001129H    PICTURE X.
           02  I001129V    PICTURE X.
           02  I001129O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001829C    PICTURE X.
           02  I001829P    PICTURE X.
           02  I001829H    PICTURE X.
           02  I001829V    PICTURE X.
           02  I001829O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004229C    PICTURE X.
           02  I004229P    PICTURE X.
           02  I004229H    PICTURE X.
           02  I004229V    PICTURE X.
           02  I004229O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001130C    PICTURE X.
           02  I001130P    PICTURE X.
           02  I001130H    PICTURE X.
           02  I001130V    PICTURE X.
           02  I001130O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001830C    PICTURE X.
           02  I001830P    PICTURE X.
           02  I001830H    PICTURE X.
           02  I001830V    PICTURE X.
           02  I001830O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004230C    PICTURE X.
           02  I004230P    PICTURE X.
           02  I004230H    PICTURE X.
           02  I004230V    PICTURE X.
           02  I004230O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IMPFS02C    PICTURE X.
           02  IMPFS02P    PICTURE X.
           02  IMPFS02H    PICTURE X.
           02  IMPFS02V    PICTURE X.
           02  IMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR02C    PICTURE X.
           02  IMERR02P    PICTURE X.
           02  IMERR02H    PICTURE X.
           02  IMERR02V    PICTURE X.
           02  IMERR02O  PIC X(79).
       01  IMX1M03I REDEFINES IMX1M07I.
           02  FILLER PIC X(12).
           02  IMXTR03L    COMP  PIC  S9(4).
           02  IMXTR03F    PICTURE X.
           02  FILLER REDEFINES IMXTR03F.
             03 IMXTR03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXTR03I  PIC X(4).
           02  IMXDT03L    COMP  PIC  S9(4).
           02  IMXDT03F    PICTURE X.
           02  FILLER REDEFINES IMXDT03F.
             03 IMXDT03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXDT03I  PIC X(8).
           02  IMXTM03L    COMP  PIC  S9(4).
           02  IMXTM03F    PICTURE X.
           02  FILLER REDEFINES IMXTM03F.
             03 IMXTM03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXTM03I  PIC X(8).
           02  TYPE003L    COMP  PIC  S9(4).
           02  TYPE003F    PICTURE X.
           02  FILLER REDEFINES TYPE003F.
             03 TYPE003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TYPE003I  PIC X(1).
           02  INDEX03L    COMP  PIC  S9(4).
           02  INDEX03F    PICTURE X.
           02  FILLER REDEFINES INDEX03F.
             03 INDEX03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INDEX03I  PIC X(1).
           02  PROD003L    COMP  PIC  S9(4).
           02  PROD003F    PICTURE X.
           02  FILLER REDEFINES PROD003F.
             03 PROD003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PROD003I  PIC X(3).
           02  CTL1003L    COMP  PIC  S9(4).
           02  CTL1003F    PICTURE X.
           02  FILLER REDEFINES CTL1003F.
             03 CTL1003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1003I  PIC X(2).
           02  CTL2003L    COMP  PIC  S9(4).
           02  CTL2003F    PICTURE X.
           02  FILLER REDEFINES CTL2003F.
             03 CTL2003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2003I  PIC X(3).
           02  CTL3003L    COMP  PIC  S9(4).
           02  CTL3003F    PICTURE X.
           02  FILLER REDEFINES CTL3003F.
             03 CTL3003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3003I  PIC X(3).
           02  I003130L    COMP  PIC  S9(4).
           02  I003130F    PICTURE X.
           02  FILLER REDEFINES I003130F.
             03 I003130A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003130I  PIC X(2).
           02  I004302L    COMP  PIC  S9(4).
           02  I004302F    PICTURE X.
           02  FILLER REDEFINES I004302F.
             03 I004302A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004302I  PIC X(10).
           02  I001902L    COMP  PIC  S9(4).
           02  I001902F    PICTURE X.
           02  FILLER REDEFINES I001902F.
             03 I001902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001902I  PIC X(6).
           02  I003102L    COMP  PIC  S9(4).
           02  I003102F    PICTURE X.
           02  FILLER REDEFINES I003102F.
             03 I003102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003102I  PIC X(2).
           02  I004301L    COMP  PIC  S9(4).
           02  I004301F    PICTURE X.
           02  FILLER REDEFINES I004301F.
             03 I004301A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004301I  PIC X(10).
           02  I001901L    COMP  PIC  S9(4).
           02  I001901F    PICTURE X.
           02  FILLER REDEFINES I001901F.
             03 I001901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001901I  PIC X(6).
           02  IMCOR03L    COMP  PIC  S9(4).
           02  IMCOR03F    PICTURE X.
           02  FILLER REDEFINES IMCOR03F.
             03 IMCOR03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMCOR03I  PIC X(1).
           02  I003103L    COMP  PIC  S9(4).
           02  I003103F    PICTURE X.
           02  FILLER REDEFINES I003103F.
             03 I003103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003103I  PIC X(2).
           02  I004303L    COMP  PIC  S9(4).
           02  I004303F    PICTURE X.
           02  FILLER REDEFINES I004303F.
             03 I004303A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004303I  PIC X(10).
           02  I001903L    COMP  PIC  S9(4).
           02  I001903F    PICTURE X.
           02  FILLER REDEFINES I001903F.
             03 I001903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001903I  PIC X(6).
           02  I003133L    COMP  PIC  S9(4).
           02  I003133F    PICTURE X.
           02  FILLER REDEFINES I003133F.
             03 I003133A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003133I  PIC X(2).
           02  I001904L    COMP  PIC  S9(4).
           02  I001904F    PICTURE X.
           02  FILLER REDEFINES I001904F.
             03 I001904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001904I  PIC X(6).
           02  I004304L    COMP  PIC  S9(4).
           02  I004304F    PICTURE X.
           02  FILLER REDEFINES I004304F.
             03 I004304A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004304I  PIC X(10).
           02  I003134L    COMP  PIC  S9(4).
           02  I003134F    PICTURE X.
           02  FILLER REDEFINES I003134F.
             03 I003134A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003134I  PIC X(2).
           02  I001905L    COMP  PIC  S9(4).
           02  I001905F    PICTURE X.
           02  FILLER REDEFINES I001905F.
             03 I001905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001905I  PIC X(6).
           02  I004305L    COMP  PIC  S9(4).
           02  I004305F    PICTURE X.
           02  FILLER REDEFINES I004305F.
             03 I004305A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004305I  PIC X(10).
           02  I003135L    COMP  PIC  S9(4).
           02  I003135F    PICTURE X.
           02  FILLER REDEFINES I003135F.
             03 I003135A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003135I  PIC X(2).
           02  I001906L    COMP  PIC  S9(4).
           02  I001906F    PICTURE X.
           02  FILLER REDEFINES I001906F.
             03 I001906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001906I  PIC X(6).
           02  I004306L    COMP  PIC  S9(4).
           02  I004306F    PICTURE X.
           02  FILLER REDEFINES I004306F.
             03 I004306A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004306I  PIC X(10).
           02  I003136L    COMP  PIC  S9(4).
           02  I003136F    PICTURE X.
           02  FILLER REDEFINES I003136F.
             03 I003136A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003136I  PIC X(2).
           02  I001907L    COMP  PIC  S9(4).
           02  I001907F    PICTURE X.
           02  FILLER REDEFINES I001907F.
             03 I001907A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001907I  PIC X(6).
           02  I004307L    COMP  PIC  S9(4).
           02  I004307F    PICTURE X.
           02  FILLER REDEFINES I004307F.
             03 I004307A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004307I  PIC X(10).
           02  I003137L    COMP  PIC  S9(4).
           02  I003137F    PICTURE X.
           02  FILLER REDEFINES I003137F.
             03 I003137A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003137I  PIC X(2).
           02  I001908L    COMP  PIC  S9(4).
           02  I001908F    PICTURE X.
           02  FILLER REDEFINES I001908F.
             03 I001908A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001908I  PIC X(6).
           02  I004308L    COMP  PIC  S9(4).
           02  I004308F    PICTURE X.
           02  FILLER REDEFINES I004308F.
             03 I004308A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004308I  PIC X(10).
           02  I003138L    COMP  PIC  S9(4).
           02  I003138F    PICTURE X.
           02  FILLER REDEFINES I003138F.
             03 I003138A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003138I  PIC X(2).
           02  I001909L    COMP  PIC  S9(4).
           02  I001909F    PICTURE X.
           02  FILLER REDEFINES I001909F.
             03 I001909A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001909I  PIC X(6).
           02  I004309L    COMP  PIC  S9(4).
           02  I004309F    PICTURE X.
           02  FILLER REDEFINES I004309F.
             03 I004309A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004309I  PIC X(10).
           02  I003139L    COMP  PIC  S9(4).
           02  I003139F    PICTURE X.
           02  FILLER REDEFINES I003139F.
             03 I003139A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003139I  PIC X(2).
           02  I001910L    COMP  PIC  S9(4).
           02  I001910F    PICTURE X.
           02  FILLER REDEFINES I001910F.
             03 I001910A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001910I  PIC X(6).
           02  I004310L    COMP  PIC  S9(4).
           02  I004310F    PICTURE X.
           02  FILLER REDEFINES I004310F.
             03 I004310A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004310I  PIC X(10).
           02  I003140L    COMP  PIC  S9(4).
           02  I003140F    PICTURE X.
           02  FILLER REDEFINES I003140F.
             03 I003140A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003140I  PIC X(2).
           02  I001911L    COMP  PIC  S9(4).
           02  I001911F    PICTURE X.
           02  FILLER REDEFINES I001911F.
             03 I001911A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001911I  PIC X(6).
           02  I004311L    COMP  PIC  S9(4).
           02  I004311F    PICTURE X.
           02  FILLER REDEFINES I004311F.
             03 I004311A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004311I  PIC X(10).
           02  I003141L    COMP  PIC  S9(4).
           02  I003141F    PICTURE X.
           02  FILLER REDEFINES I003141F.
             03 I003141A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003141I  PIC X(2).
           02  I001912L    COMP  PIC  S9(4).
           02  I001912F    PICTURE X.
           02  FILLER REDEFINES I001912F.
             03 I001912A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001912I  PIC X(6).
           02  I004312L    COMP  PIC  S9(4).
           02  I004312F    PICTURE X.
           02  FILLER REDEFINES I004312F.
             03 I004312A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004312I  PIC X(10).
           02  I003142L    COMP  PIC  S9(4).
           02  I003142F    PICTURE X.
           02  FILLER REDEFINES I003142F.
             03 I003142A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003142I  PIC X(2).
           02  I001913L    COMP  PIC  S9(4).
           02  I001913F    PICTURE X.
           02  FILLER REDEFINES I001913F.
             03 I001913A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001913I  PIC X(6).
           02  I004313L    COMP  PIC  S9(4).
           02  I004313F    PICTURE X.
           02  FILLER REDEFINES I004313F.
             03 I004313A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004313I  PIC X(10).
           02  I003143L    COMP  PIC  S9(4).
           02  I003143F    PICTURE X.
           02  FILLER REDEFINES I003143F.
             03 I003143A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003143I  PIC X(2).
           02  I001914L    COMP  PIC  S9(4).
           02  I001914F    PICTURE X.
           02  FILLER REDEFINES I001914F.
             03 I001914A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001914I  PIC X(6).
           02  I004314L    COMP  PIC  S9(4).
           02  I004314F    PICTURE X.
           02  FILLER REDEFINES I004314F.
             03 I004314A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004314I  PIC X(10).
           02  I003144L    COMP  PIC  S9(4).
           02  I003144F    PICTURE X.
           02  FILLER REDEFINES I003144F.
             03 I003144A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003144I  PIC X(2).
           02  I001915L    COMP  PIC  S9(4).
           02  I001915F    PICTURE X.
           02  FILLER REDEFINES I001915F.
             03 I001915A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001915I  PIC X(6).
           02  I004315L    COMP  PIC  S9(4).
           02  I004315F    PICTURE X.
           02  FILLER REDEFINES I004315F.
             03 I004315A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004315I  PIC X(10).
           02  I003145L    COMP  PIC  S9(4).
           02  I003145F    PICTURE X.
           02  FILLER REDEFINES I003145F.
             03 I003145A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003145I  PIC X(2).
           02  I001916L    COMP  PIC  S9(4).
           02  I001916F    PICTURE X.
           02  FILLER REDEFINES I001916F.
             03 I001916A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001916I  PIC X(6).
           02  I004316L    COMP  PIC  S9(4).
           02  I004316F    PICTURE X.
           02  FILLER REDEFINES I004316F.
             03 I004316A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004316I  PIC X(10).
           02  I003146L    COMP  PIC  S9(4).
           02  I003146F    PICTURE X.
           02  FILLER REDEFINES I003146F.
             03 I003146A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003146I  PIC X(2).
           02  I001917L    COMP  PIC  S9(4).
           02  I001917F    PICTURE X.
           02  FILLER REDEFINES I001917F.
             03 I001917A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001917I  PIC X(6).
           02  I004317L    COMP  PIC  S9(4).
           02  I004317F    PICTURE X.
           02  FILLER REDEFINES I004317F.
             03 I004317A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004317I  PIC X(10).
           02  I003147L    COMP  PIC  S9(4).
           02  I003147F    PICTURE X.
           02  FILLER REDEFINES I003147F.
             03 I003147A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003147I  PIC X(2).
           02  I001918L    COMP  PIC  S9(4).
           02  I001918F    PICTURE X.
           02  FILLER REDEFINES I001918F.
             03 I001918A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001918I  PIC X(6).
           02  I004318L    COMP  PIC  S9(4).
           02  I004318F    PICTURE X.
           02  FILLER REDEFINES I004318F.
             03 I004318A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004318I  PIC X(10).
           02  I003148L    COMP  PIC  S9(4).
           02  I003148F    PICTURE X.
           02  FILLER REDEFINES I003148F.
             03 I003148A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003148I  PIC X(2).
           02  I001919L    COMP  PIC  S9(4).
           02  I001919F    PICTURE X.
           02  FILLER REDEFINES I001919F.
             03 I001919A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001919I  PIC X(6).
           02  I004319L    COMP  PIC  S9(4).
           02  I004319F    PICTURE X.
           02  FILLER REDEFINES I004319F.
             03 I004319A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004319I  PIC X(10).
           02  I003149L    COMP  PIC  S9(4).
           02  I003149F    PICTURE X.
           02  FILLER REDEFINES I003149F.
             03 I003149A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003149I  PIC X(2).
           02  I001920L    COMP  PIC  S9(4).
           02  I001920F    PICTURE X.
           02  FILLER REDEFINES I001920F.
             03 I001920A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001920I  PIC X(6).
           02  I004320L    COMP  PIC  S9(4).
           02  I004320F    PICTURE X.
           02  FILLER REDEFINES I004320F.
             03 I004320A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004320I  PIC X(10).
           02  I003150L    COMP  PIC  S9(4).
           02  I003150F    PICTURE X.
           02  FILLER REDEFINES I003150F.
             03 I003150A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003150I  PIC X(2).
           02  I001921L    COMP  PIC  S9(4).
           02  I001921F    PICTURE X.
           02  FILLER REDEFINES I001921F.
             03 I001921A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001921I  PIC X(6).
           02  I004321L    COMP  PIC  S9(4).
           02  I004321F    PICTURE X.
           02  FILLER REDEFINES I004321F.
             03 I004321A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004321I  PIC X(10).
           02  I003151L    COMP  PIC  S9(4).
           02  I003151F    PICTURE X.
           02  FILLER REDEFINES I003151F.
             03 I003151A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003151I  PIC X(2).
           02  I001922L    COMP  PIC  S9(4).
           02  I001922F    PICTURE X.
           02  FILLER REDEFINES I001922F.
             03 I001922A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001922I  PIC X(6).
           02  I004322L    COMP  PIC  S9(4).
           02  I004322F    PICTURE X.
           02  FILLER REDEFINES I004322F.
             03 I004322A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004322I  PIC X(10).
           02  I003152L    COMP  PIC  S9(4).
           02  I003152F    PICTURE X.
           02  FILLER REDEFINES I003152F.
             03 I003152A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003152I  PIC X(2).
           02  I001923L    COMP  PIC  S9(4).
           02  I001923F    PICTURE X.
           02  FILLER REDEFINES I001923F.
             03 I001923A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001923I  PIC X(6).
           02  I004323L    COMP  PIC  S9(4).
           02  I004323F    PICTURE X.
           02  FILLER REDEFINES I004323F.
             03 I004323A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004323I  PIC X(10).
           02  I003153L    COMP  PIC  S9(4).
           02  I003153F    PICTURE X.
           02  FILLER REDEFINES I003153F.
             03 I003153A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003153I  PIC X(2).
           02  I001924L    COMP  PIC  S9(4).
           02  I001924F    PICTURE X.
           02  FILLER REDEFINES I001924F.
             03 I001924A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001924I  PIC X(6).
           02  I004324L    COMP  PIC  S9(4).
           02  I004324F    PICTURE X.
           02  FILLER REDEFINES I004324F.
             03 I004324A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004324I  PIC X(10).
           02  I003154L    COMP  PIC  S9(4).
           02  I003154F    PICTURE X.
           02  FILLER REDEFINES I003154F.
             03 I003154A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003154I  PIC X(2).
           02  I001925L    COMP  PIC  S9(4).
           02  I001925F    PICTURE X.
           02  FILLER REDEFINES I001925F.
             03 I001925A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001925I  PIC X(6).
           02  I004325L    COMP  PIC  S9(4).
           02  I004325F    PICTURE X.
           02  FILLER REDEFINES I004325F.
             03 I004325A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004325I  PIC X(10).
           02  I003155L    COMP  PIC  S9(4).
           02  I003155F    PICTURE X.
           02  FILLER REDEFINES I003155F.
             03 I003155A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003155I  PIC X(2).
           02  I001926L    COMP  PIC  S9(4).
           02  I001926F    PICTURE X.
           02  FILLER REDEFINES I001926F.
             03 I001926A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001926I  PIC X(6).
           02  I004326L    COMP  PIC  S9(4).
           02  I004326F    PICTURE X.
           02  FILLER REDEFINES I004326F.
             03 I004326A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004326I  PIC X(10).
           02  I003156L    COMP  PIC  S9(4).
           02  I003156F    PICTURE X.
           02  FILLER REDEFINES I003156F.
             03 I003156A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003156I  PIC X(2).
           02  I001927L    COMP  PIC  S9(4).
           02  I001927F    PICTURE X.
           02  FILLER REDEFINES I001927F.
             03 I001927A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001927I  PIC X(6).
           02  I004327L    COMP  PIC  S9(4).
           02  I004327F    PICTURE X.
           02  FILLER REDEFINES I004327F.
             03 I004327A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004327I  PIC X(10).
           02  I003157L    COMP  PIC  S9(4).
           02  I003157F    PICTURE X.
           02  FILLER REDEFINES I003157F.
             03 I003157A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003157I  PIC X(2).
           02  I001928L    COMP  PIC  S9(4).
           02  I001928F    PICTURE X.
           02  FILLER REDEFINES I001928F.
             03 I001928A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001928I  PIC X(6).
           02  I004328L    COMP  PIC  S9(4).
           02  I004328F    PICTURE X.
           02  FILLER REDEFINES I004328F.
             03 I004328A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004328I  PIC X(10).
           02  I003158L    COMP  PIC  S9(4).
           02  I003158F    PICTURE X.
           02  FILLER REDEFINES I003158F.
             03 I003158A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003158I  PIC X(2).
           02  I001929L    COMP  PIC  S9(4).
           02  I001929F    PICTURE X.
           02  FILLER REDEFINES I001929F.
             03 I001929A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001929I  PIC X(6).
           02  I004329L    COMP  PIC  S9(4).
           02  I004329F    PICTURE X.
           02  FILLER REDEFINES I004329F.
             03 I004329A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004329I  PIC X(10).
           02  I003159L    COMP  PIC  S9(4).
           02  I003159F    PICTURE X.
           02  FILLER REDEFINES I003159F.
             03 I003159A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003159I  PIC X(2).
           02  I001930L    COMP  PIC  S9(4).
           02  I001930F    PICTURE X.
           02  FILLER REDEFINES I001930F.
             03 I001930A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001930I  PIC X(6).
           02  I004330L    COMP  PIC  S9(4).
           02  I004330F    PICTURE X.
           02  FILLER REDEFINES I004330F.
             03 I004330A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004330I  PIC X(10).
           02  IMPFS03L    COMP  PIC  S9(4).
           02  IMPFS03F    PICTURE X.
           02  FILLER REDEFINES IMPFS03F.
             03 IMPFS03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS03I  PIC X(79).
           02  IMERR03L    COMP  PIC  S9(4).
           02  IMERR03F    PICTURE X.
           02  FILLER REDEFINES IMERR03F.
             03 IMERR03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR03I  PIC X(79).
       01  IMX1M03O REDEFINES IMX1M03I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMXTR03C    PICTURE X.
           02  IMXTR03P    PICTURE X.
           02  IMXTR03H    PICTURE X.
           02  IMXTR03V    PICTURE X.
           02  IMXTR03O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMXDT03C    PICTURE X.
           02  IMXDT03P    PICTURE X.
           02  IMXDT03H    PICTURE X.
           02  IMXDT03V    PICTURE X.
           02  IMXDT03O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMXTM03C    PICTURE X.
           02  IMXTM03P    PICTURE X.
           02  IMXTM03H    PICTURE X.
           02  IMXTM03V    PICTURE X.
           02  IMXTM03O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TYPE003C    PICTURE X.
           02  TYPE003P    PICTURE X.
           02  TYPE003H    PICTURE X.
           02  TYPE003V    PICTURE X.
           02  TYPE003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INDEX03C    PICTURE X.
           02  INDEX03P    PICTURE X.
           02  INDEX03H    PICTURE X.
           02  INDEX03V    PICTURE X.
           02  INDEX03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PROD003C    PICTURE X.
           02  PROD003P    PICTURE X.
           02  PROD003H    PICTURE X.
           02  PROD003V    PICTURE X.
           02  PROD003O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL1003C    PICTURE X.
           02  CTL1003P    PICTURE X.
           02  CTL1003H    PICTURE X.
           02  CTL1003V    PICTURE X.
           02  CTL1003O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2003C    PICTURE X.
           02  CTL2003P    PICTURE X.
           02  CTL2003H    PICTURE X.
           02  CTL2003V    PICTURE X.
           02  CTL2003O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3003C    PICTURE X.
           02  CTL3003P    PICTURE X.
           02  CTL3003H    PICTURE X.
           02  CTL3003V    PICTURE X.
           02  CTL3003O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  I003130C    PICTURE X.
           02  I003130P    PICTURE X.
           02  I003130H    PICTURE X.
           02  I003130V    PICTURE X.
           02  I003130O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004302C    PICTURE X.
           02  I004302P    PICTURE X.
           02  I004302H    PICTURE X.
           02  I004302V    PICTURE X.
           02  I004302O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001902C    PICTURE X.
           02  I001902P    PICTURE X.
           02  I001902H    PICTURE X.
           02  I001902V    PICTURE X.
           02  I001902O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I003102C    PICTURE X.
           02  I003102P    PICTURE X.
           02  I003102H    PICTURE X.
           02  I003102V    PICTURE X.
           02  I003102O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004301C    PICTURE X.
           02  I004301P    PICTURE X.
           02  I004301H    PICTURE X.
           02  I004301V    PICTURE X.
           02  I004301O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001901C    PICTURE X.
           02  I001901P    PICTURE X.
           02  I001901H    PICTURE X.
           02  I001901V    PICTURE X.
           02  I001901O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMCOR03C    PICTURE X.
           02  IMCOR03P    PICTURE X.
           02  IMCOR03H    PICTURE X.
           02  IMCOR03V    PICTURE X.
           02  IMCOR03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I003103C    PICTURE X.
           02  I003103P    PICTURE X.
           02  I003103H    PICTURE X.
           02  I003103V    PICTURE X.
           02  I003103O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004303C    PICTURE X.
           02  I004303P    PICTURE X.
           02  I004303H    PICTURE X.
           02  I004303V    PICTURE X.
           02  I004303O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001903C    PICTURE X.
           02  I001903P    PICTURE X.
           02  I001903H    PICTURE X.
           02  I001903V    PICTURE X.
           02  I001903O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I003133C    PICTURE X.
           02  I003133P    PICTURE X.
           02  I003133H    PICTURE X.
           02  I003133V    PICTURE X.
           02  I003133O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001904C    PICTURE X.
           02  I001904P    PICTURE X.
           02  I001904H    PICTURE X.
           02  I001904V    PICTURE X.
           02  I001904O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004304C    PICTURE X.
           02  I004304P    PICTURE X.
           02  I004304H    PICTURE X.
           02  I004304V    PICTURE X.
           02  I004304O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003134C    PICTURE X.
           02  I003134P    PICTURE X.
           02  I003134H    PICTURE X.
           02  I003134V    PICTURE X.
           02  I003134O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001905C    PICTURE X.
           02  I001905P    PICTURE X.
           02  I001905H    PICTURE X.
           02  I001905V    PICTURE X.
           02  I001905O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004305C    PICTURE X.
           02  I004305P    PICTURE X.
           02  I004305H    PICTURE X.
           02  I004305V    PICTURE X.
           02  I004305O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003135C    PICTURE X.
           02  I003135P    PICTURE X.
           02  I003135H    PICTURE X.
           02  I003135V    PICTURE X.
           02  I003135O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001906C    PICTURE X.
           02  I001906P    PICTURE X.
           02  I001906H    PICTURE X.
           02  I001906V    PICTURE X.
           02  I001906O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004306C    PICTURE X.
           02  I004306P    PICTURE X.
           02  I004306H    PICTURE X.
           02  I004306V    PICTURE X.
           02  I004306O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003136C    PICTURE X.
           02  I003136P    PICTURE X.
           02  I003136H    PICTURE X.
           02  I003136V    PICTURE X.
           02  I003136O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001907C    PICTURE X.
           02  I001907P    PICTURE X.
           02  I001907H    PICTURE X.
           02  I001907V    PICTURE X.
           02  I001907O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004307C    PICTURE X.
           02  I004307P    PICTURE X.
           02  I004307H    PICTURE X.
           02  I004307V    PICTURE X.
           02  I004307O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003137C    PICTURE X.
           02  I003137P    PICTURE X.
           02  I003137H    PICTURE X.
           02  I003137V    PICTURE X.
           02  I003137O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001908C    PICTURE X.
           02  I001908P    PICTURE X.
           02  I001908H    PICTURE X.
           02  I001908V    PICTURE X.
           02  I001908O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004308C    PICTURE X.
           02  I004308P    PICTURE X.
           02  I004308H    PICTURE X.
           02  I004308V    PICTURE X.
           02  I004308O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003138C    PICTURE X.
           02  I003138P    PICTURE X.
           02  I003138H    PICTURE X.
           02  I003138V    PICTURE X.
           02  I003138O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001909C    PICTURE X.
           02  I001909P    PICTURE X.
           02  I001909H    PICTURE X.
           02  I001909V    PICTURE X.
           02  I001909O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004309C    PICTURE X.
           02  I004309P    PICTURE X.
           02  I004309H    PICTURE X.
           02  I004309V    PICTURE X.
           02  I004309O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003139C    PICTURE X.
           02  I003139P    PICTURE X.
           02  I003139H    PICTURE X.
           02  I003139V    PICTURE X.
           02  I003139O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001910C    PICTURE X.
           02  I001910P    PICTURE X.
           02  I001910H    PICTURE X.
           02  I001910V    PICTURE X.
           02  I001910O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004310C    PICTURE X.
           02  I004310P    PICTURE X.
           02  I004310H    PICTURE X.
           02  I004310V    PICTURE X.
           02  I004310O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003140C    PICTURE X.
           02  I003140P    PICTURE X.
           02  I003140H    PICTURE X.
           02  I003140V    PICTURE X.
           02  I003140O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001911C    PICTURE X.
           02  I001911P    PICTURE X.
           02  I001911H    PICTURE X.
           02  I001911V    PICTURE X.
           02  I001911O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004311C    PICTURE X.
           02  I004311P    PICTURE X.
           02  I004311H    PICTURE X.
           02  I004311V    PICTURE X.
           02  I004311O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003141C    PICTURE X.
           02  I003141P    PICTURE X.
           02  I003141H    PICTURE X.
           02  I003141V    PICTURE X.
           02  I003141O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001912C    PICTURE X.
           02  I001912P    PICTURE X.
           02  I001912H    PICTURE X.
           02  I001912V    PICTURE X.
           02  I001912O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004312C    PICTURE X.
           02  I004312P    PICTURE X.
           02  I004312H    PICTURE X.
           02  I004312V    PICTURE X.
           02  I004312O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003142C    PICTURE X.
           02  I003142P    PICTURE X.
           02  I003142H    PICTURE X.
           02  I003142V    PICTURE X.
           02  I003142O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001913C    PICTURE X.
           02  I001913P    PICTURE X.
           02  I001913H    PICTURE X.
           02  I001913V    PICTURE X.
           02  I001913O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004313C    PICTURE X.
           02  I004313P    PICTURE X.
           02  I004313H    PICTURE X.
           02  I004313V    PICTURE X.
           02  I004313O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003143C    PICTURE X.
           02  I003143P    PICTURE X.
           02  I003143H    PICTURE X.
           02  I003143V    PICTURE X.
           02  I003143O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001914C    PICTURE X.
           02  I001914P    PICTURE X.
           02  I001914H    PICTURE X.
           02  I001914V    PICTURE X.
           02  I001914O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004314C    PICTURE X.
           02  I004314P    PICTURE X.
           02  I004314H    PICTURE X.
           02  I004314V    PICTURE X.
           02  I004314O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003144C    PICTURE X.
           02  I003144P    PICTURE X.
           02  I003144H    PICTURE X.
           02  I003144V    PICTURE X.
           02  I003144O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001915C    PICTURE X.
           02  I001915P    PICTURE X.
           02  I001915H    PICTURE X.
           02  I001915V    PICTURE X.
           02  I001915O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004315C    PICTURE X.
           02  I004315P    PICTURE X.
           02  I004315H    PICTURE X.
           02  I004315V    PICTURE X.
           02  I004315O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003145C    PICTURE X.
           02  I003145P    PICTURE X.
           02  I003145H    PICTURE X.
           02  I003145V    PICTURE X.
           02  I003145O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001916C    PICTURE X.
           02  I001916P    PICTURE X.
           02  I001916H    PICTURE X.
           02  I001916V    PICTURE X.
           02  I001916O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004316C    PICTURE X.
           02  I004316P    PICTURE X.
           02  I004316H    PICTURE X.
           02  I004316V    PICTURE X.
           02  I004316O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003146C    PICTURE X.
           02  I003146P    PICTURE X.
           02  I003146H    PICTURE X.
           02  I003146V    PICTURE X.
           02  I003146O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001917C    PICTURE X.
           02  I001917P    PICTURE X.
           02  I001917H    PICTURE X.
           02  I001917V    PICTURE X.
           02  I001917O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004317C    PICTURE X.
           02  I004317P    PICTURE X.
           02  I004317H    PICTURE X.
           02  I004317V    PICTURE X.
           02  I004317O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003147C    PICTURE X.
           02  I003147P    PICTURE X.
           02  I003147H    PICTURE X.
           02  I003147V    PICTURE X.
           02  I003147O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001918C    PICTURE X.
           02  I001918P    PICTURE X.
           02  I001918H    PICTURE X.
           02  I001918V    PICTURE X.
           02  I001918O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004318C    PICTURE X.
           02  I004318P    PICTURE X.
           02  I004318H    PICTURE X.
           02  I004318V    PICTURE X.
           02  I004318O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003148C    PICTURE X.
           02  I003148P    PICTURE X.
           02  I003148H    PICTURE X.
           02  I003148V    PICTURE X.
           02  I003148O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001919C    PICTURE X.
           02  I001919P    PICTURE X.
           02  I001919H    PICTURE X.
           02  I001919V    PICTURE X.
           02  I001919O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004319C    PICTURE X.
           02  I004319P    PICTURE X.
           02  I004319H    PICTURE X.
           02  I004319V    PICTURE X.
           02  I004319O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003149C    PICTURE X.
           02  I003149P    PICTURE X.
           02  I003149H    PICTURE X.
           02  I003149V    PICTURE X.
           02  I003149O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001920C    PICTURE X.
           02  I001920P    PICTURE X.
           02  I001920H    PICTURE X.
           02  I001920V    PICTURE X.
           02  I001920O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004320C    PICTURE X.
           02  I004320P    PICTURE X.
           02  I004320H    PICTURE X.
           02  I004320V    PICTURE X.
           02  I004320O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003150C    PICTURE X.
           02  I003150P    PICTURE X.
           02  I003150H    PICTURE X.
           02  I003150V    PICTURE X.
           02  I003150O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001921C    PICTURE X.
           02  I001921P    PICTURE X.
           02  I001921H    PICTURE X.
           02  I001921V    PICTURE X.
           02  I001921O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004321C    PICTURE X.
           02  I004321P    PICTURE X.
           02  I004321H    PICTURE X.
           02  I004321V    PICTURE X.
           02  I004321O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003151C    PICTURE X.
           02  I003151P    PICTURE X.
           02  I003151H    PICTURE X.
           02  I003151V    PICTURE X.
           02  I003151O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001922C    PICTURE X.
           02  I001922P    PICTURE X.
           02  I001922H    PICTURE X.
           02  I001922V    PICTURE X.
           02  I001922O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004322C    PICTURE X.
           02  I004322P    PICTURE X.
           02  I004322H    PICTURE X.
           02  I004322V    PICTURE X.
           02  I004322O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003152C    PICTURE X.
           02  I003152P    PICTURE X.
           02  I003152H    PICTURE X.
           02  I003152V    PICTURE X.
           02  I003152O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001923C    PICTURE X.
           02  I001923P    PICTURE X.
           02  I001923H    PICTURE X.
           02  I001923V    PICTURE X.
           02  I001923O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004323C    PICTURE X.
           02  I004323P    PICTURE X.
           02  I004323H    PICTURE X.
           02  I004323V    PICTURE X.
           02  I004323O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003153C    PICTURE X.
           02  I003153P    PICTURE X.
           02  I003153H    PICTURE X.
           02  I003153V    PICTURE X.
           02  I003153O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001924C    PICTURE X.
           02  I001924P    PICTURE X.
           02  I001924H    PICTURE X.
           02  I001924V    PICTURE X.
           02  I001924O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004324C    PICTURE X.
           02  I004324P    PICTURE X.
           02  I004324H    PICTURE X.
           02  I004324V    PICTURE X.
           02  I004324O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003154C    PICTURE X.
           02  I003154P    PICTURE X.
           02  I003154H    PICTURE X.
           02  I003154V    PICTURE X.
           02  I003154O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001925C    PICTURE X.
           02  I001925P    PICTURE X.
           02  I001925H    PICTURE X.
           02  I001925V    PICTURE X.
           02  I001925O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004325C    PICTURE X.
           02  I004325P    PICTURE X.
           02  I004325H    PICTURE X.
           02  I004325V    PICTURE X.
           02  I004325O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003155C    PICTURE X.
           02  I003155P    PICTURE X.
           02  I003155H    PICTURE X.
           02  I003155V    PICTURE X.
           02  I003155O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001926C    PICTURE X.
           02  I001926P    PICTURE X.
           02  I001926H    PICTURE X.
           02  I001926V    PICTURE X.
           02  I001926O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004326C    PICTURE X.
           02  I004326P    PICTURE X.
           02  I004326H    PICTURE X.
           02  I004326V    PICTURE X.
           02  I004326O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003156C    PICTURE X.
           02  I003156P    PICTURE X.
           02  I003156H    PICTURE X.
           02  I003156V    PICTURE X.
           02  I003156O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001927C    PICTURE X.
           02  I001927P    PICTURE X.
           02  I001927H    PICTURE X.
           02  I001927V    PICTURE X.
           02  I001927O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004327C    PICTURE X.
           02  I004327P    PICTURE X.
           02  I004327H    PICTURE X.
           02  I004327V    PICTURE X.
           02  I004327O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003157C    PICTURE X.
           02  I003157P    PICTURE X.
           02  I003157H    PICTURE X.
           02  I003157V    PICTURE X.
           02  I003157O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001928C    PICTURE X.
           02  I001928P    PICTURE X.
           02  I001928H    PICTURE X.
           02  I001928V    PICTURE X.
           02  I001928O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004328C    PICTURE X.
           02  I004328P    PICTURE X.
           02  I004328H    PICTURE X.
           02  I004328V    PICTURE X.
           02  I004328O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003158C    PICTURE X.
           02  I003158P    PICTURE X.
           02  I003158H    PICTURE X.
           02  I003158V    PICTURE X.
           02  I003158O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001929C    PICTURE X.
           02  I001929P    PICTURE X.
           02  I001929H    PICTURE X.
           02  I001929V    PICTURE X.
           02  I001929O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004329C    PICTURE X.
           02  I004329P    PICTURE X.
           02  I004329H    PICTURE X.
           02  I004329V    PICTURE X.
           02  I004329O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003159C    PICTURE X.
           02  I003159P    PICTURE X.
           02  I003159H    PICTURE X.
           02  I003159V    PICTURE X.
           02  I003159O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001930C    PICTURE X.
           02  I001930P    PICTURE X.
           02  I001930H    PICTURE X.
           02  I001930V    PICTURE X.
           02  I001930O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004330C    PICTURE X.
           02  I004330P    PICTURE X.
           02  I004330H    PICTURE X.
           02  I004330V    PICTURE X.
           02  I004330O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IMPFS03C    PICTURE X.
           02  IMPFS03P    PICTURE X.
           02  IMPFS03H    PICTURE X.
           02  IMPFS03V    PICTURE X.
           02  IMPFS03O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR03C    PICTURE X.
           02  IMERR03P    PICTURE X.
           02  IMERR03H    PICTURE X.
           02  IMERR03V    PICTURE X.
           02  IMERR03O  PIC X(79).
       01  IMX1M04I REDEFINES IMX1M07I.
           02  FILLER PIC X(12).
           02  IMITR04L    COMP  PIC  S9(4).
           02  IMITR04F    PICTURE X.
           02  FILLER REDEFINES IMITR04F.
             03 IMITR04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITR04I  PIC X(4).
           02  IMIDT04L    COMP  PIC  S9(4).
           02  IMIDT04F    PICTURE X.
           02  FILLER REDEFINES IMIDT04F.
             03 IMIDT04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMIDT04I  PIC X(8).
           02  IMITM04L    COMP  PIC  S9(4).
           02  IMITM04F    PICTURE X.
           02  FILLER REDEFINES IMITM04F.
             03 IMITM04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITM04I  PIC X(8).
           02  TYPE004L    COMP  PIC  S9(4).
           02  TYPE004F    PICTURE X.
           02  FILLER REDEFINES TYPE004F.
             03 TYPE004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TYPE004I  PIC X(1).
           02  INDEX04L    COMP  PIC  S9(4).
           02  INDEX04F    PICTURE X.
           02  FILLER REDEFINES INDEX04F.
             03 INDEX04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INDEX04I  PIC X(1).
           02  PROD004L    COMP  PIC  S9(4).
           02  PROD004F    PICTURE X.
           02  FILLER REDEFINES PROD004F.
             03 PROD004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PROD004I  PIC X(3).
           02  CTL1004L    COMP  PIC  S9(4).
           02  CTL1004F    PICTURE X.
           02  FILLER REDEFINES CTL1004F.
             03 CTL1004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1004I  PIC X(2).
           02  CTL2004L    COMP  PIC  S9(4).
           02  CTL2004F    PICTURE X.
           02  FILLER REDEFINES CTL2004F.
             03 CTL2004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2004I  PIC X(3).
           02  CTL3004L    COMP  PIC  S9(4).
           02  CTL3004F    PICTURE X.
           02  FILLER REDEFINES CTL3004F.
             03 CTL3004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3004I  PIC X(3).
           02  I001991L    COMP  PIC  S9(4).
           02  I001991F    PICTURE X.
           02  FILLER REDEFINES I001991F.
             03 I001991A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001991I  PIC X(2).
           02  I001992L    COMP  PIC  S9(4).
           02  I001992F    PICTURE X.
           02  FILLER REDEFINES I001992F.
             03 I001992A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001992I  PIC X(2).
           02  I001993L    COMP  PIC  S9(4).
           02  I001993F    PICTURE X.
           02  FILLER REDEFINES I001993F.
             03 I001993A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001993I  PIC X(2).
           02  I001888L    COMP  PIC  S9(4).
           02  I001888F    PICTURE X.
           02  FILLER REDEFINES I001888F.
             03 I001888A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001888I  PIC X(6).
           02  I001889L    COMP  PIC  S9(4).
           02  I001889F    PICTURE X.
           02  FILLER REDEFINES I001889F.
             03 I001889A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001889I  PIC X(6).
           02  IMCOR04L    COMP  PIC  S9(4).
           02  IMCOR04F    PICTURE X.
           02  FILLER REDEFINES IMCOR04F.
             03 IMCOR04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMCOR04I  PIC X(1).
           02  I001890L    COMP  PIC  S9(4).
           02  I001890F    PICTURE X.
           02  FILLER REDEFINES I001890F.
             03 I001890A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001890I  PIC X(6).
           02  I003801L    COMP  PIC  S9(4).
           02  I003801F    PICTURE X.
           02  FILLER REDEFINES I003801F.
             03 I003801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003801I  PIC X(10).
           02  L003801L    COMP  PIC  S9(4).
           02  L003801F    PICTURE X.
           02  FILLER REDEFINES L003801F.
             03 L003801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003801I  PIC X(13).
           02  I003810L    COMP  PIC  S9(4).
           02  I003810F    PICTURE X.
           02  FILLER REDEFINES I003810F.
             03 I003810A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003810I  PIC X(10).
           02  L003809L    COMP  PIC  S9(4).
           02  L003809F    PICTURE X.
           02  FILLER REDEFINES L003809F.
             03 L003809A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003809I  PIC X(13).
           02  I003819L    COMP  PIC  S9(4).
           02  I003819F    PICTURE X.
           02  FILLER REDEFINES I003819F.
             03 I003819A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003819I  PIC X(10).
           02  L003817L    COMP  PIC  S9(4).
           02  L003817F    PICTURE X.
           02  FILLER REDEFINES L003817F.
             03 L003817A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003817I  PIC X(13).
           02  I003802L    COMP  PIC  S9(4).
           02  I003802F    PICTURE X.
           02  FILLER REDEFINES I003802F.
             03 I003802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003802I  PIC X(10).
           02  L003802L    COMP  PIC  S9(4).
           02  L003802F    PICTURE X.
           02  FILLER REDEFINES L003802F.
             03 L003802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003802I  PIC X(13).
           02  I003811L    COMP  PIC  S9(4).
           02  I003811F    PICTURE X.
           02  FILLER REDEFINES I003811F.
             03 I003811A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003811I  PIC X(10).
           02  L003810L    COMP  PIC  S9(4).
           02  L003810F    PICTURE X.
           02  FILLER REDEFINES L003810F.
             03 L003810A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003810I  PIC X(13).
           02  I003820L    COMP  PIC  S9(4).
           02  I003820F    PICTURE X.
           02  FILLER REDEFINES I003820F.
             03 I003820A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003820I  PIC X(10).
           02  L003818L    COMP  PIC  S9(4).
           02  L003818F    PICTURE X.
           02  FILLER REDEFINES L003818F.
             03 L003818A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003818I  PIC X(13).
           02  I003803L    COMP  PIC  S9(4).
           02  I003803F    PICTURE X.
           02  FILLER REDEFINES I003803F.
             03 I003803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003803I  PIC X(10).
           02  L003803L    COMP  PIC  S9(4).
           02  L003803F    PICTURE X.
           02  FILLER REDEFINES L003803F.
             03 L003803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003803I  PIC X(13).
           02  I003812L    COMP  PIC  S9(4).
           02  I003812F    PICTURE X.
           02  FILLER REDEFINES I003812F.
             03 I003812A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003812I  PIC X(10).
           02  L003811L    COMP  PIC  S9(4).
           02  L003811F    PICTURE X.
           02  FILLER REDEFINES L003811F.
             03 L003811A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003811I  PIC X(13).
           02  I003821L    COMP  PIC  S9(4).
           02  I003821F    PICTURE X.
           02  FILLER REDEFINES I003821F.
             03 I003821A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003821I  PIC X(10).
           02  L003819L    COMP  PIC  S9(4).
           02  L003819F    PICTURE X.
           02  FILLER REDEFINES L003819F.
             03 L003819A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003819I  PIC X(13).
           02  I003804L    COMP  PIC  S9(4).
           02  I003804F    PICTURE X.
           02  FILLER REDEFINES I003804F.
             03 I003804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003804I  PIC X(10).
           02  L003804L    COMP  PIC  S9(4).
           02  L003804F    PICTURE X.
           02  FILLER REDEFINES L003804F.
             03 L003804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003804I  PIC X(13).
           02  I003813L    COMP  PIC  S9(4).
           02  I003813F    PICTURE X.
           02  FILLER REDEFINES I003813F.
             03 I003813A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003813I  PIC X(10).
           02  L003812L    COMP  PIC  S9(4).
           02  L003812F    PICTURE X.
           02  FILLER REDEFINES L003812F.
             03 L003812A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003812I  PIC X(13).
           02  I003822L    COMP  PIC  S9(4).
           02  I003822F    PICTURE X.
           02  FILLER REDEFINES I003822F.
             03 I003822A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003822I  PIC X(10).
           02  L003820L    COMP  PIC  S9(4).
           02  L003820F    PICTURE X.
           02  FILLER REDEFINES L003820F.
             03 L003820A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003820I  PIC X(13).
           02  I003805L    COMP  PIC  S9(4).
           02  I003805F    PICTURE X.
           02  FILLER REDEFINES I003805F.
             03 I003805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003805I  PIC X(10).
           02  L003805L    COMP  PIC  S9(4).
           02  L003805F    PICTURE X.
           02  FILLER REDEFINES L003805F.
             03 L003805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003805I  PIC X(13).
           02  I003814L    COMP  PIC  S9(4).
           02  I003814F    PICTURE X.
           02  FILLER REDEFINES I003814F.
             03 I003814A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003814I  PIC X(10).
           02  L003813L    COMP  PIC  S9(4).
           02  L003813F    PICTURE X.
           02  FILLER REDEFINES L003813F.
             03 L003813A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003813I  PIC X(13).
           02  I003823L    COMP  PIC  S9(4).
           02  I003823F    PICTURE X.
           02  FILLER REDEFINES I003823F.
             03 I003823A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003823I  PIC X(10).
           02  L003821L    COMP  PIC  S9(4).
           02  L003821F    PICTURE X.
           02  FILLER REDEFINES L003821F.
             03 L003821A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003821I  PIC X(13).
           02  I003806L    COMP  PIC  S9(4).
           02  I003806F    PICTURE X.
           02  FILLER REDEFINES I003806F.
             03 I003806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003806I  PIC X(10).
           02  L003806L    COMP  PIC  S9(4).
           02  L003806F    PICTURE X.
           02  FILLER REDEFINES L003806F.
             03 L003806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003806I  PIC X(13).
           02  I003815L    COMP  PIC  S9(4).
           02  I003815F    PICTURE X.
           02  FILLER REDEFINES I003815F.
             03 I003815A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003815I  PIC X(10).
           02  L003814L    COMP  PIC  S9(4).
           02  L003814F    PICTURE X.
           02  FILLER REDEFINES L003814F.
             03 L003814A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003814I  PIC X(13).
           02  I003824L    COMP  PIC  S9(4).
           02  I003824F    PICTURE X.
           02  FILLER REDEFINES I003824F.
             03 I003824A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003824I  PIC X(10).
           02  L003822L    COMP  PIC  S9(4).
           02  L003822F    PICTURE X.
           02  FILLER REDEFINES L003822F.
             03 L003822A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003822I  PIC X(13).
           02  I003807L    COMP  PIC  S9(4).
           02  I003807F    PICTURE X.
           02  FILLER REDEFINES I003807F.
             03 I003807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003807I  PIC X(10).
           02  L003807L    COMP  PIC  S9(4).
           02  L003807F    PICTURE X.
           02  FILLER REDEFINES L003807F.
             03 L003807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003807I  PIC X(13).
           02  I003816L    COMP  PIC  S9(4).
           02  I003816F    PICTURE X.
           02  FILLER REDEFINES I003816F.
             03 I003816A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003816I  PIC X(10).
           02  L003815L    COMP  PIC  S9(4).
           02  L003815F    PICTURE X.
           02  FILLER REDEFINES L003815F.
             03 L003815A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003815I  PIC X(13).
           02  I003825L    COMP  PIC  S9(4).
           02  I003825F    PICTURE X.
           02  FILLER REDEFINES I003825F.
             03 I003825A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003825I  PIC X(10).
           02  L003823L    COMP  PIC  S9(4).
           02  L003823F    PICTURE X.
           02  FILLER REDEFINES L003823F.
             03 L003823A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003823I  PIC X(13).
           02  I003808L    COMP  PIC  S9(4).
           02  I003808F    PICTURE X.
           02  FILLER REDEFINES I003808F.
             03 I003808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003808I  PIC X(10).
           02  L003808L    COMP  PIC  S9(4).
           02  L003808F    PICTURE X.
           02  FILLER REDEFINES L003808F.
             03 L003808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003808I  PIC X(13).
           02  I003817L    COMP  PIC  S9(4).
           02  I003817F    PICTURE X.
           02  FILLER REDEFINES I003817F.
             03 I003817A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003817I  PIC X(10).
           02  L003816L    COMP  PIC  S9(4).
           02  L003816F    PICTURE X.
           02  FILLER REDEFINES L003816F.
             03 L003816A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003816I  PIC X(13).
           02  IM03826L    COMP  PIC  S9(4).
           02  IM03826F    PICTURE X.
           02  FILLER REDEFINES IM03826F.
             03 IM03826A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM03826I  PIC X(10).
           02  IMW2014L    COMP  PIC  S9(4).
           02  IMW2014F    PICTURE X.
           02  FILLER REDEFINES IMW2014F.
             03 IMW2014A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMW2014I  PIC X(13).
           02  I003809L    COMP  PIC  S9(4).
           02  I003809F    PICTURE X.
           02  FILLER REDEFINES I003809F.
             03 I003809A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003809I  PIC X(10).
           02  L003897L    COMP  PIC  S9(4).
           02  L003897F    PICTURE X.
           02  FILLER REDEFINES L003897F.
             03 L003897A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003897I  PIC X(13).
           02  I003818L    COMP  PIC  S9(4).
           02  I003818F    PICTURE X.
           02  FILLER REDEFINES I003818F.
             03 I003818A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003818I  PIC X(10).
           02  L003898L    COMP  PIC  S9(4).
           02  L003898F    PICTURE X.
           02  FILLER REDEFINES L003898F.
             03 L003898A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003898I  PIC X(13).
           02  I003827L    COMP  PIC  S9(4).
           02  I003827F    PICTURE X.
           02  FILLER REDEFINES I003827F.
             03 I003827A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003827I  PIC X(10).
           02  L003899L    COMP  PIC  S9(4).
           02  L003899F    PICTURE X.
           02  FILLER REDEFINES L003899F.
             03 L003899A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003899I  PIC X(13).
           02  IMPFS04L    COMP  PIC  S9(4).
           02  IMPFS04F    PICTURE X.
           02  FILLER REDEFINES IMPFS04F.
             03 IMPFS04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS04I  PIC X(79).
           02  IMERR04L    COMP  PIC  S9(4).
           02  IMERR04F    PICTURE X.
           02  FILLER REDEFINES IMERR04F.
             03 IMERR04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR04I  PIC X(79).
       01  IMX1M04O REDEFINES IMX1M04I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMITR04C    PICTURE X.
           02  IMITR04P    PICTURE X.
           02  IMITR04H    PICTURE X.
           02  IMITR04V    PICTURE X.
           02  IMITR04O PIC ZZZ9.
           02  FILLER PICTURE X(3).
           02  IMIDT04C    PICTURE X.
           02  IMIDT04P    PICTURE X.
           02  IMIDT04H    PICTURE X.
           02  IMIDT04V    PICTURE X.
           02  IMIDT04O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMITM04C    PICTURE X.
           02  IMITM04P    PICTURE X.
           02  IMITM04H    PICTURE X.
           02  IMITM04V    PICTURE X.
           02  IMITM04O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TYPE004C    PICTURE X.
           02  TYPE004P    PICTURE X.
           02  TYPE004H    PICTURE X.
           02  TYPE004V    PICTURE X.
           02  TYPE004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INDEX04C    PICTURE X.
           02  INDEX04P    PICTURE X.
           02  INDEX04H    PICTURE X.
           02  INDEX04V    PICTURE X.
           02  INDEX04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PROD004C    PICTURE X.
           02  PROD004P    PICTURE X.
           02  PROD004H    PICTURE X.
           02  PROD004V    PICTURE X.
           02  PROD004O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL1004C    PICTURE X.
           02  CTL1004P    PICTURE X.
           02  CTL1004H    PICTURE X.
           02  CTL1004V    PICTURE X.
           02  CTL1004O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2004C    PICTURE X.
           02  CTL2004P    PICTURE X.
           02  CTL2004H    PICTURE X.
           02  CTL2004V    PICTURE X.
           02  CTL2004O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3004C    PICTURE X.
           02  CTL3004P    PICTURE X.
           02  CTL3004H    PICTURE X.
           02  CTL3004V    PICTURE X.
           02  CTL3004O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  I001991C    PICTURE X.
           02  I001991P    PICTURE X.
           02  I001991H    PICTURE X.
           02  I001991V    PICTURE X.
           02  I001991O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001992C    PICTURE X.
           02  I001992P    PICTURE X.
           02  I001992H    PICTURE X.
           02  I001992V    PICTURE X.
           02  I001992O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001993C    PICTURE X.
           02  I001993P    PICTURE X.
           02  I001993H    PICTURE X.
           02  I001993V    PICTURE X.
           02  I001993O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001888C    PICTURE X.
           02  I001888P    PICTURE X.
           02  I001888H    PICTURE X.
           02  I001888V    PICTURE X.
           02  I001888O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I001889C    PICTURE X.
           02  I001889P    PICTURE X.
           02  I001889H    PICTURE X.
           02  I001889V    PICTURE X.
           02  I001889O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMCOR04C    PICTURE X.
           02  IMCOR04P    PICTURE X.
           02  IMCOR04H    PICTURE X.
           02  IMCOR04V    PICTURE X.
           02  IMCOR04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I001890C    PICTURE X.
           02  I001890P    PICTURE X.
           02  I001890H    PICTURE X.
           02  I001890V    PICTURE X.
           02  I001890O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I003801C    PICTURE X.
           02  I003801P    PICTURE X.
           02  I003801H    PICTURE X.
           02  I003801V    PICTURE X.
           02  I003801O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003801C    PICTURE X.
           02  L003801P    PICTURE X.
           02  L003801H    PICTURE X.
           02  L003801V    PICTURE X.
           02  L003801O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003810C    PICTURE X.
           02  I003810P    PICTURE X.
           02  I003810H    PICTURE X.
           02  I003810V    PICTURE X.
           02  I003810O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003809C    PICTURE X.
           02  L003809P    PICTURE X.
           02  L003809H    PICTURE X.
           02  L003809V    PICTURE X.
           02  L003809O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003819C    PICTURE X.
           02  I003819P    PICTURE X.
           02  I003819H    PICTURE X.
           02  I003819V    PICTURE X.
           02  I003819O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003817C    PICTURE X.
           02  L003817P    PICTURE X.
           02  L003817H    PICTURE X.
           02  L003817V    PICTURE X.
           02  L003817O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003802C    PICTURE X.
           02  I003802P    PICTURE X.
           02  I003802H    PICTURE X.
           02  I003802V    PICTURE X.
           02  I003802O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003802C    PICTURE X.
           02  L003802P    PICTURE X.
           02  L003802H    PICTURE X.
           02  L003802V    PICTURE X.
           02  L003802O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003811C    PICTURE X.
           02  I003811P    PICTURE X.
           02  I003811H    PICTURE X.
           02  I003811V    PICTURE X.
           02  I003811O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003810C    PICTURE X.
           02  L003810P    PICTURE X.
           02  L003810H    PICTURE X.
           02  L003810V    PICTURE X.
           02  L003810O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003820C    PICTURE X.
           02  I003820P    PICTURE X.
           02  I003820H    PICTURE X.
           02  I003820V    PICTURE X.
           02  I003820O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003818C    PICTURE X.
           02  L003818P    PICTURE X.
           02  L003818H    PICTURE X.
           02  L003818V    PICTURE X.
           02  L003818O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003803C    PICTURE X.
           02  I003803P    PICTURE X.
           02  I003803H    PICTURE X.
           02  I003803V    PICTURE X.
           02  I003803O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003803C    PICTURE X.
           02  L003803P    PICTURE X.
           02  L003803H    PICTURE X.
           02  L003803V    PICTURE X.
           02  L003803O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003812C    PICTURE X.
           02  I003812P    PICTURE X.
           02  I003812H    PICTURE X.
           02  I003812V    PICTURE X.
           02  I003812O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003811C    PICTURE X.
           02  L003811P    PICTURE X.
           02  L003811H    PICTURE X.
           02  L003811V    PICTURE X.
           02  L003811O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003821C    PICTURE X.
           02  I003821P    PICTURE X.
           02  I003821H    PICTURE X.
           02  I003821V    PICTURE X.
           02  I003821O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003819C    PICTURE X.
           02  L003819P    PICTURE X.
           02  L003819H    PICTURE X.
           02  L003819V    PICTURE X.
           02  L003819O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003804C    PICTURE X.
           02  I003804P    PICTURE X.
           02  I003804H    PICTURE X.
           02  I003804V    PICTURE X.
           02  I003804O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003804C    PICTURE X.
           02  L003804P    PICTURE X.
           02  L003804H    PICTURE X.
           02  L003804V    PICTURE X.
           02  L003804O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003813C    PICTURE X.
           02  I003813P    PICTURE X.
           02  I003813H    PICTURE X.
           02  I003813V    PICTURE X.
           02  I003813O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003812C    PICTURE X.
           02  L003812P    PICTURE X.
           02  L003812H    PICTURE X.
           02  L003812V    PICTURE X.
           02  L003812O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003822C    PICTURE X.
           02  I003822P    PICTURE X.
           02  I003822H    PICTURE X.
           02  I003822V    PICTURE X.
           02  I003822O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003820C    PICTURE X.
           02  L003820P    PICTURE X.
           02  L003820H    PICTURE X.
           02  L003820V    PICTURE X.
           02  L003820O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003805C    PICTURE X.
           02  I003805P    PICTURE X.
           02  I003805H    PICTURE X.
           02  I003805V    PICTURE X.
           02  I003805O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003805C    PICTURE X.
           02  L003805P    PICTURE X.
           02  L003805H    PICTURE X.
           02  L003805V    PICTURE X.
           02  L003805O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003814C    PICTURE X.
           02  I003814P    PICTURE X.
           02  I003814H    PICTURE X.
           02  I003814V    PICTURE X.
           02  I003814O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003813C    PICTURE X.
           02  L003813P    PICTURE X.
           02  L003813H    PICTURE X.
           02  L003813V    PICTURE X.
           02  L003813O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003823C    PICTURE X.
           02  I003823P    PICTURE X.
           02  I003823H    PICTURE X.
           02  I003823V    PICTURE X.
           02  I003823O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003821C    PICTURE X.
           02  L003821P    PICTURE X.
           02  L003821H    PICTURE X.
           02  L003821V    PICTURE X.
           02  L003821O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003806C    PICTURE X.
           02  I003806P    PICTURE X.
           02  I003806H    PICTURE X.
           02  I003806V    PICTURE X.
           02  I003806O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003806C    PICTURE X.
           02  L003806P    PICTURE X.
           02  L003806H    PICTURE X.
           02  L003806V    PICTURE X.
           02  L003806O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003815C    PICTURE X.
           02  I003815P    PICTURE X.
           02  I003815H    PICTURE X.
           02  I003815V    PICTURE X.
           02  I003815O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003814C    PICTURE X.
           02  L003814P    PICTURE X.
           02  L003814H    PICTURE X.
           02  L003814V    PICTURE X.
           02  L003814O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003824C    PICTURE X.
           02  I003824P    PICTURE X.
           02  I003824H    PICTURE X.
           02  I003824V    PICTURE X.
           02  I003824O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003822C    PICTURE X.
           02  L003822P    PICTURE X.
           02  L003822H    PICTURE X.
           02  L003822V    PICTURE X.
           02  L003822O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003807C    PICTURE X.
           02  I003807P    PICTURE X.
           02  I003807H    PICTURE X.
           02  I003807V    PICTURE X.
           02  I003807O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003807C    PICTURE X.
           02  L003807P    PICTURE X.
           02  L003807H    PICTURE X.
           02  L003807V    PICTURE X.
           02  L003807O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003816C    PICTURE X.
           02  I003816P    PICTURE X.
           02  I003816H    PICTURE X.
           02  I003816V    PICTURE X.
           02  I003816O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003815C    PICTURE X.
           02  L003815P    PICTURE X.
           02  L003815H    PICTURE X.
           02  L003815V    PICTURE X.
           02  L003815O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003825C    PICTURE X.
           02  I003825P    PICTURE X.
           02  I003825H    PICTURE X.
           02  I003825V    PICTURE X.
           02  I003825O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003823C    PICTURE X.
           02  L003823P    PICTURE X.
           02  L003823H    PICTURE X.
           02  L003823V    PICTURE X.
           02  L003823O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003808C    PICTURE X.
           02  I003808P    PICTURE X.
           02  I003808H    PICTURE X.
           02  I003808V    PICTURE X.
           02  I003808O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003808C    PICTURE X.
           02  L003808P    PICTURE X.
           02  L003808H    PICTURE X.
           02  L003808V    PICTURE X.
           02  L003808O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003817C    PICTURE X.
           02  I003817P    PICTURE X.
           02  I003817H    PICTURE X.
           02  I003817V    PICTURE X.
           02  I003817O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003816C    PICTURE X.
           02  L003816P    PICTURE X.
           02  L003816H    PICTURE X.
           02  L003816V    PICTURE X.
           02  L003816O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  IM03826C    PICTURE X.
           02  IM03826P    PICTURE X.
           02  IM03826H    PICTURE X.
           02  IM03826V    PICTURE X.
           02  IM03826O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IMW2014C    PICTURE X.
           02  IMW2014P    PICTURE X.
           02  IMW2014H    PICTURE X.
           02  IMW2014V    PICTURE X.
           02  IMW2014O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003809C    PICTURE X.
           02  I003809P    PICTURE X.
           02  I003809H    PICTURE X.
           02  I003809V    PICTURE X.
           02  I003809O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003897C    PICTURE X.
           02  L003897P    PICTURE X.
           02  L003897H    PICTURE X.
           02  L003897V    PICTURE X.
           02  L003897O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  I003818C    PICTURE X.
           02  I003818P    PICTURE X.
           02  I003818H    PICTURE X.
           02  I003818V    PICTURE X.
           02  I003818O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003898C    PICTURE X.
           02  L003898P    PICTURE X.
           02  L003898H    PICTURE X.
           02  L003898V    PICTURE X.
           02  L003898O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  I003827C    PICTURE X.
           02  I003827P    PICTURE X.
           02  I003827H    PICTURE X.
           02  I003827V    PICTURE X.
           02  I003827O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003899C    PICTURE X.
           02  L003899P    PICTURE X.
           02  L003899H    PICTURE X.
           02  L003899V    PICTURE X.
           02  L003899O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  IMPFS04C    PICTURE X.
           02  IMPFS04P    PICTURE X.
           02  IMPFS04H    PICTURE X.
           02  IMPFS04V    PICTURE X.
           02  IMPFS04O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR04C    PICTURE X.
           02  IMERR04P    PICTURE X.
           02  IMERR04H    PICTURE X.
           02  IMERR04V    PICTURE X.
           02  IMERR04O  PIC X(79).
       01  IMX1M05I REDEFINES IMX1M07I.
           02  FILLER PIC X(12).
           02  IMITR05L    COMP  PIC  S9(4).
           02  IMITR05F    PICTURE X.
           02  FILLER REDEFINES IMITR05F.
             03 IMITR05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITR05I  PIC X(4).
           02  IMIDT05L    COMP  PIC  S9(4).
           02  IMIDT05F    PICTURE X.
           02  FILLER REDEFINES IMIDT05F.
             03 IMIDT05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMIDT05I  PIC X(8).
           02  IMITM05L    COMP  PIC  S9(4).
           02  IMITM05F    PICTURE X.
           02  FILLER REDEFINES IMITM05F.
             03 IMITM05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITM05I  PIC X(8).
           02  TYPE005L    COMP  PIC  S9(4).
           02  TYPE005F    PICTURE X.
           02  FILLER REDEFINES TYPE005F.
             03 TYPE005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TYPE005I  PIC X(1).
           02  INDEX05L    COMP  PIC  S9(4).
           02  INDEX05F    PICTURE X.
           02  FILLER REDEFINES INDEX05F.
             03 INDEX05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INDEX05I  PIC X(1).
           02  PROD005L    COMP  PIC  S9(4).
           02  PROD005F    PICTURE X.
           02  FILLER REDEFINES PROD005F.
             03 PROD005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PROD005I  PIC X(3).
           02  CTL1005L    COMP  PIC  S9(4).
           02  CTL1005F    PICTURE X.
           02  FILLER REDEFINES CTL1005F.
             03 CTL1005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1005I  PIC X(2).
           02  CTL2005L    COMP  PIC  S9(4).
           02  CTL2005F    PICTURE X.
           02  FILLER REDEFINES CTL2005F.
             03 CTL2005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2005I  PIC X(3).
           02  CTL3005L    COMP  PIC  S9(4).
           02  CTL3005F    PICTURE X.
           02  FILLER REDEFINES CTL3005F.
             03 CTL3005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3005I  PIC X(3).
           02  I003070L    COMP  PIC  S9(4).
           02  I003070F    PICTURE X.
           02  FILLER REDEFINES I003070F.
             03 I003070A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003070I  PIC X(2).
           02  I004402L    COMP  PIC  S9(4).
           02  I004402F    PICTURE X.
           02  FILLER REDEFINES I004402F.
             03 I004402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004402I  PIC X(10).
           02  I001702L    COMP  PIC  S9(4).
           02  I001702F    PICTURE X.
           02  FILLER REDEFINES I001702F.
             03 I001702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001702I  PIC X(6).
           02  I003071L    COMP  PIC  S9(4).
           02  I003071F    PICTURE X.
           02  FILLER REDEFINES I003071F.
             03 I003071A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003071I  PIC X(2).
           02  I004401L    COMP  PIC  S9(4).
           02  I004401F    PICTURE X.
           02  FILLER REDEFINES I004401F.
             03 I004401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004401I  PIC X(10).
           02  I001701L    COMP  PIC  S9(4).
           02  I001701F    PICTURE X.
           02  FILLER REDEFINES I001701F.
             03 I001701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001701I  PIC X(6).
           02  IMCOR05L    COMP  PIC  S9(4).
           02  IMCOR05F    PICTURE X.
           02  FILLER REDEFINES IMCOR05F.
             03 IMCOR05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMCOR05I  PIC X(1).
           02  I003172L    COMP  PIC  S9(4).
           02  I003172F    PICTURE X.
           02  FILLER REDEFINES I003172F.
             03 I003172A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003172I  PIC X(2).
           02  I004403L    COMP  PIC  S9(4).
           02  I004403F    PICTURE X.
           02  FILLER REDEFINES I004403F.
             03 I004403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004403I  PIC X(10).
           02  I001703L    COMP  PIC  S9(4).
           02  I001703F    PICTURE X.
           02  FILLER REDEFINES I001703F.
             03 I001703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001703I  PIC X(6).
           02  I003073L    COMP  PIC  S9(4).
           02  I003073F    PICTURE X.
           02  FILLER REDEFINES I003073F.
             03 I003073A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003073I  PIC X(2).
           02  I001704L    COMP  PIC  S9(4).
           02  I001704F    PICTURE X.
           02  FILLER REDEFINES I001704F.
             03 I001704A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001704I  PIC X(6).
           02  I004404L    COMP  PIC  S9(4).
           02  I004404F    PICTURE X.
           02  FILLER REDEFINES I004404F.
             03 I004404A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004404I  PIC X(10).
           02  I003074L    COMP  PIC  S9(4).
           02  I003074F    PICTURE X.
           02  FILLER REDEFINES I003074F.
             03 I003074A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003074I  PIC X(2).
           02  I001705L    COMP  PIC  S9(4).
           02  I001705F    PICTURE X.
           02  FILLER REDEFINES I001705F.
             03 I001705A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001705I  PIC X(6).
           02  I004405L    COMP  PIC  S9(4).
           02  I004405F    PICTURE X.
           02  FILLER REDEFINES I004405F.
             03 I004405A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004405I  PIC X(10).
           02  I003075L    COMP  PIC  S9(4).
           02  I003075F    PICTURE X.
           02  FILLER REDEFINES I003075F.
             03 I003075A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003075I  PIC X(2).
           02  I001706L    COMP  PIC  S9(4).
           02  I001706F    PICTURE X.
           02  FILLER REDEFINES I001706F.
             03 I001706A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001706I  PIC X(6).
           02  I004406L    COMP  PIC  S9(4).
           02  I004406F    PICTURE X.
           02  FILLER REDEFINES I004406F.
             03 I004406A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004406I  PIC X(10).
           02  I003076L    COMP  PIC  S9(4).
           02  I003076F    PICTURE X.
           02  FILLER REDEFINES I003076F.
             03 I003076A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003076I  PIC X(2).
           02  I001707L    COMP  PIC  S9(4).
           02  I001707F    PICTURE X.
           02  FILLER REDEFINES I001707F.
             03 I001707A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001707I  PIC X(6).
           02  I004407L    COMP  PIC  S9(4).
           02  I004407F    PICTURE X.
           02  FILLER REDEFINES I004407F.
             03 I004407A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004407I  PIC X(10).
           02  I003077L    COMP  PIC  S9(4).
           02  I003077F    PICTURE X.
           02  FILLER REDEFINES I003077F.
             03 I003077A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003077I  PIC X(2).
           02  I001708L    COMP  PIC  S9(4).
           02  I001708F    PICTURE X.
           02  FILLER REDEFINES I001708F.
             03 I001708A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001708I  PIC X(6).
           02  I004408L    COMP  PIC  S9(4).
           02  I004408F    PICTURE X.
           02  FILLER REDEFINES I004408F.
             03 I004408A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004408I  PIC X(10).
           02  I003078L    COMP  PIC  S9(4).
           02  I003078F    PICTURE X.
           02  FILLER REDEFINES I003078F.
             03 I003078A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003078I  PIC X(2).
           02  I001709L    COMP  PIC  S9(4).
           02  I001709F    PICTURE X.
           02  FILLER REDEFINES I001709F.
             03 I001709A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001709I  PIC X(6).
           02  I004409L    COMP  PIC  S9(4).
           02  I004409F    PICTURE X.
           02  FILLER REDEFINES I004409F.
             03 I004409A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004409I  PIC X(10).
           02  I003079L    COMP  PIC  S9(4).
           02  I003079F    PICTURE X.
           02  FILLER REDEFINES I003079F.
             03 I003079A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003079I  PIC X(2).
           02  I001710L    COMP  PIC  S9(4).
           02  I001710F    PICTURE X.
           02  FILLER REDEFINES I001710F.
             03 I001710A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001710I  PIC X(6).
           02  I004410L    COMP  PIC  S9(4).
           02  I004410F    PICTURE X.
           02  FILLER REDEFINES I004410F.
             03 I004410A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004410I  PIC X(10).
           02  I003080L    COMP  PIC  S9(4).
           02  I003080F    PICTURE X.
           02  FILLER REDEFINES I003080F.
             03 I003080A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003080I  PIC X(2).
           02  I001711L    COMP  PIC  S9(4).
           02  I001711F    PICTURE X.
           02  FILLER REDEFINES I001711F.
             03 I001711A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001711I  PIC X(6).
           02  I004411L    COMP  PIC  S9(4).
           02  I004411F    PICTURE X.
           02  FILLER REDEFINES I004411F.
             03 I004411A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004411I  PIC X(10).
           02  I003081L    COMP  PIC  S9(4).
           02  I003081F    PICTURE X.
           02  FILLER REDEFINES I003081F.
             03 I003081A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003081I  PIC X(2).
           02  I001712L    COMP  PIC  S9(4).
           02  I001712F    PICTURE X.
           02  FILLER REDEFINES I001712F.
             03 I001712A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001712I  PIC X(6).
           02  I004412L    COMP  PIC  S9(4).
           02  I004412F    PICTURE X.
           02  FILLER REDEFINES I004412F.
             03 I004412A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004412I  PIC X(10).
           02  I003082L    COMP  PIC  S9(4).
           02  I003082F    PICTURE X.
           02  FILLER REDEFINES I003082F.
             03 I003082A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003082I  PIC X(2).
           02  I001713L    COMP  PIC  S9(4).
           02  I001713F    PICTURE X.
           02  FILLER REDEFINES I001713F.
             03 I001713A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001713I  PIC X(6).
           02  I004413L    COMP  PIC  S9(4).
           02  I004413F    PICTURE X.
           02  FILLER REDEFINES I004413F.
             03 I004413A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004413I  PIC X(10).
           02  I003083L    COMP  PIC  S9(4).
           02  I003083F    PICTURE X.
           02  FILLER REDEFINES I003083F.
             03 I003083A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003083I  PIC X(2).
           02  I001714L    COMP  PIC  S9(4).
           02  I001714F    PICTURE X.
           02  FILLER REDEFINES I001714F.
             03 I001714A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001714I  PIC X(6).
           02  I004414L    COMP  PIC  S9(4).
           02  I004414F    PICTURE X.
           02  FILLER REDEFINES I004414F.
             03 I004414A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004414I  PIC X(10).
           02  I003084L    COMP  PIC  S9(4).
           02  I003084F    PICTURE X.
           02  FILLER REDEFINES I003084F.
             03 I003084A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003084I  PIC X(2).
           02  I001715L    COMP  PIC  S9(4).
           02  I001715F    PICTURE X.
           02  FILLER REDEFINES I001715F.
             03 I001715A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001715I  PIC X(6).
           02  I004415L    COMP  PIC  S9(4).
           02  I004415F    PICTURE X.
           02  FILLER REDEFINES I004415F.
             03 I004415A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004415I  PIC X(10).
           02  I003085L    COMP  PIC  S9(4).
           02  I003085F    PICTURE X.
           02  FILLER REDEFINES I003085F.
             03 I003085A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003085I  PIC X(2).
           02  I001716L    COMP  PIC  S9(4).
           02  I001716F    PICTURE X.
           02  FILLER REDEFINES I001716F.
             03 I001716A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001716I  PIC X(6).
           02  I004416L    COMP  PIC  S9(4).
           02  I004416F    PICTURE X.
           02  FILLER REDEFINES I004416F.
             03 I004416A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004416I  PIC X(10).
           02  I003086L    COMP  PIC  S9(4).
           02  I003086F    PICTURE X.
           02  FILLER REDEFINES I003086F.
             03 I003086A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003086I  PIC X(2).
           02  I001717L    COMP  PIC  S9(4).
           02  I001717F    PICTURE X.
           02  FILLER REDEFINES I001717F.
             03 I001717A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001717I  PIC X(6).
           02  I004417L    COMP  PIC  S9(4).
           02  I004417F    PICTURE X.
           02  FILLER REDEFINES I004417F.
             03 I004417A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004417I  PIC X(10).
           02  I003087L    COMP  PIC  S9(4).
           02  I003087F    PICTURE X.
           02  FILLER REDEFINES I003087F.
             03 I003087A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003087I  PIC X(2).
           02  I001718L    COMP  PIC  S9(4).
           02  I001718F    PICTURE X.
           02  FILLER REDEFINES I001718F.
             03 I001718A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001718I  PIC X(6).
           02  I004418L    COMP  PIC  S9(4).
           02  I004418F    PICTURE X.
           02  FILLER REDEFINES I004418F.
             03 I004418A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004418I  PIC X(10).
           02  I003088L    COMP  PIC  S9(4).
           02  I003088F    PICTURE X.
           02  FILLER REDEFINES I003088F.
             03 I003088A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003088I  PIC X(2).
           02  I001719L    COMP  PIC  S9(4).
           02  I001719F    PICTURE X.
           02  FILLER REDEFINES I001719F.
             03 I001719A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001719I  PIC X(6).
           02  I004419L    COMP  PIC  S9(4).
           02  I004419F    PICTURE X.
           02  FILLER REDEFINES I004419F.
             03 I004419A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004419I  PIC X(10).
           02  I003089L    COMP  PIC  S9(4).
           02  I003089F    PICTURE X.
           02  FILLER REDEFINES I003089F.
             03 I003089A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003089I  PIC X(2).
           02  I001720L    COMP  PIC  S9(4).
           02  I001720F    PICTURE X.
           02  FILLER REDEFINES I001720F.
             03 I001720A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001720I  PIC X(6).
           02  I004420L    COMP  PIC  S9(4).
           02  I004420F    PICTURE X.
           02  FILLER REDEFINES I004420F.
             03 I004420A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004420I  PIC X(10).
           02  I003090L    COMP  PIC  S9(4).
           02  I003090F    PICTURE X.
           02  FILLER REDEFINES I003090F.
             03 I003090A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003090I  PIC X(2).
           02  I001721L    COMP  PIC  S9(4).
           02  I001721F    PICTURE X.
           02  FILLER REDEFINES I001721F.
             03 I001721A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001721I  PIC X(6).
           02  I004421L    COMP  PIC  S9(4).
           02  I004421F    PICTURE X.
           02  FILLER REDEFINES I004421F.
             03 I004421A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004421I  PIC X(10).
           02  I003091L    COMP  PIC  S9(4).
           02  I003091F    PICTURE X.
           02  FILLER REDEFINES I003091F.
             03 I003091A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003091I  PIC X(2).
           02  I001722L    COMP  PIC  S9(4).
           02  I001722F    PICTURE X.
           02  FILLER REDEFINES I001722F.
             03 I001722A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001722I  PIC X(6).
           02  I004422L    COMP  PIC  S9(4).
           02  I004422F    PICTURE X.
           02  FILLER REDEFINES I004422F.
             03 I004422A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004422I  PIC X(10).
           02  I003092L    COMP  PIC  S9(4).
           02  I003092F    PICTURE X.
           02  FILLER REDEFINES I003092F.
             03 I003092A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003092I  PIC X(2).
           02  I001723L    COMP  PIC  S9(4).
           02  I001723F    PICTURE X.
           02  FILLER REDEFINES I001723F.
             03 I001723A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001723I  PIC X(6).
           02  I004423L    COMP  PIC  S9(4).
           02  I004423F    PICTURE X.
           02  FILLER REDEFINES I004423F.
             03 I004423A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004423I  PIC X(10).
           02  I003093L    COMP  PIC  S9(4).
           02  I003093F    PICTURE X.
           02  FILLER REDEFINES I003093F.
             03 I003093A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003093I  PIC X(2).
           02  I001724L    COMP  PIC  S9(4).
           02  I001724F    PICTURE X.
           02  FILLER REDEFINES I001724F.
             03 I001724A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001724I  PIC X(6).
           02  I004424L    COMP  PIC  S9(4).
           02  I004424F    PICTURE X.
           02  FILLER REDEFINES I004424F.
             03 I004424A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004424I  PIC X(10).
           02  I003094L    COMP  PIC  S9(4).
           02  I003094F    PICTURE X.
           02  FILLER REDEFINES I003094F.
             03 I003094A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003094I  PIC X(2).
           02  I001725L    COMP  PIC  S9(4).
           02  I001725F    PICTURE X.
           02  FILLER REDEFINES I001725F.
             03 I001725A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001725I  PIC X(6).
           02  I004425L    COMP  PIC  S9(4).
           02  I004425F    PICTURE X.
           02  FILLER REDEFINES I004425F.
             03 I004425A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004425I  PIC X(10).
           02  I003095L    COMP  PIC  S9(4).
           02  I003095F    PICTURE X.
           02  FILLER REDEFINES I003095F.
             03 I003095A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003095I  PIC X(2).
           02  I001726L    COMP  PIC  S9(4).
           02  I001726F    PICTURE X.
           02  FILLER REDEFINES I001726F.
             03 I001726A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001726I  PIC X(6).
           02  I004426L    COMP  PIC  S9(4).
           02  I004426F    PICTURE X.
           02  FILLER REDEFINES I004426F.
             03 I004426A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004426I  PIC X(10).
           02  I003096L    COMP  PIC  S9(4).
           02  I003096F    PICTURE X.
           02  FILLER REDEFINES I003096F.
             03 I003096A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003096I  PIC X(2).
           02  I001727L    COMP  PIC  S9(4).
           02  I001727F    PICTURE X.
           02  FILLER REDEFINES I001727F.
             03 I001727A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001727I  PIC X(6).
           02  I004427L    COMP  PIC  S9(4).
           02  I004427F    PICTURE X.
           02  FILLER REDEFINES I004427F.
             03 I004427A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004427I  PIC X(10).
           02  I003097L    COMP  PIC  S9(4).
           02  I003097F    PICTURE X.
           02  FILLER REDEFINES I003097F.
             03 I003097A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003097I  PIC X(2).
           02  I001728L    COMP  PIC  S9(4).
           02  I001728F    PICTURE X.
           02  FILLER REDEFINES I001728F.
             03 I001728A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001728I  PIC X(6).
           02  I004428L    COMP  PIC  S9(4).
           02  I004428F    PICTURE X.
           02  FILLER REDEFINES I004428F.
             03 I004428A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004428I  PIC X(10).
           02  I003098L    COMP  PIC  S9(4).
           02  I003098F    PICTURE X.
           02  FILLER REDEFINES I003098F.
             03 I003098A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003098I  PIC X(2).
           02  I001729L    COMP  PIC  S9(4).
           02  I001729F    PICTURE X.
           02  FILLER REDEFINES I001729F.
             03 I001729A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001729I  PIC X(6).
           02  I004429L    COMP  PIC  S9(4).
           02  I004429F    PICTURE X.
           02  FILLER REDEFINES I004429F.
             03 I004429A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004429I  PIC X(10).
           02  I003099L    COMP  PIC  S9(4).
           02  I003099F    PICTURE X.
           02  FILLER REDEFINES I003099F.
             03 I003099A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003099I  PIC X(2).
           02  I001730L    COMP  PIC  S9(4).
           02  I001730F    PICTURE X.
           02  FILLER REDEFINES I001730F.
             03 I001730A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001730I  PIC X(6).
           02  I004430L    COMP  PIC  S9(4).
           02  I004430F    PICTURE X.
           02  FILLER REDEFINES I004430F.
             03 I004430A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004430I  PIC X(10).
           02  IMPFS05L    COMP  PIC  S9(4).
           02  IMPFS05F    PICTURE X.
           02  FILLER REDEFINES IMPFS05F.
             03 IMPFS05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS05I  PIC X(79).
           02  IMERR05L    COMP  PIC  S9(4).
           02  IMERR05F    PICTURE X.
           02  FILLER REDEFINES IMERR05F.
             03 IMERR05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR05I  PIC X(79).
       01  IMX1M05O REDEFINES IMX1M05I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMITR05C    PICTURE X.
           02  IMITR05P    PICTURE X.
           02  IMITR05H    PICTURE X.
           02  IMITR05V    PICTURE X.
           02  IMITR05O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMIDT05C    PICTURE X.
           02  IMIDT05P    PICTURE X.
           02  IMIDT05H    PICTURE X.
           02  IMIDT05V    PICTURE X.
           02  IMIDT05O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMITM05C    PICTURE X.
           02  IMITM05P    PICTURE X.
           02  IMITM05H    PICTURE X.
           02  IMITM05V    PICTURE X.
           02  IMITM05O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TYPE005C    PICTURE X.
           02  TYPE005P    PICTURE X.
           02  TYPE005H    PICTURE X.
           02  TYPE005V    PICTURE X.
           02  TYPE005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INDEX05C    PICTURE X.
           02  INDEX05P    PICTURE X.
           02  INDEX05H    PICTURE X.
           02  INDEX05V    PICTURE X.
           02  INDEX05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PROD005C    PICTURE X.
           02  PROD005P    PICTURE X.
           02  PROD005H    PICTURE X.
           02  PROD005V    PICTURE X.
           02  PROD005O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL1005C    PICTURE X.
           02  CTL1005P    PICTURE X.
           02  CTL1005H    PICTURE X.
           02  CTL1005V    PICTURE X.
           02  CTL1005O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2005C    PICTURE X.
           02  CTL2005P    PICTURE X.
           02  CTL2005H    PICTURE X.
           02  CTL2005V    PICTURE X.
           02  CTL2005O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3005C    PICTURE X.
           02  CTL3005P    PICTURE X.
           02  CTL3005H    PICTURE X.
           02  CTL3005V    PICTURE X.
           02  CTL3005O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  I003070C    PICTURE X.
           02  I003070P    PICTURE X.
           02  I003070H    PICTURE X.
           02  I003070V    PICTURE X.
           02  I003070O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004402C    PICTURE X.
           02  I004402P    PICTURE X.
           02  I004402H    PICTURE X.
           02  I004402V    PICTURE X.
           02  I004402O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001702C    PICTURE X.
           02  I001702P    PICTURE X.
           02  I001702H    PICTURE X.
           02  I001702V    PICTURE X.
           02  I001702O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I003071C    PICTURE X.
           02  I003071P    PICTURE X.
           02  I003071H    PICTURE X.
           02  I003071V    PICTURE X.
           02  I003071O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004401C    PICTURE X.
           02  I004401P    PICTURE X.
           02  I004401H    PICTURE X.
           02  I004401V    PICTURE X.
           02  I004401O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001701C    PICTURE X.
           02  I001701P    PICTURE X.
           02  I001701H    PICTURE X.
           02  I001701V    PICTURE X.
           02  I001701O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMCOR05C    PICTURE X.
           02  IMCOR05P    PICTURE X.
           02  IMCOR05H    PICTURE X.
           02  IMCOR05V    PICTURE X.
           02  IMCOR05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I003172C    PICTURE X.
           02  I003172P    PICTURE X.
           02  I003172H    PICTURE X.
           02  I003172V    PICTURE X.
           02  I003172O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004403C    PICTURE X.
           02  I004403P    PICTURE X.
           02  I004403H    PICTURE X.
           02  I004403V    PICTURE X.
           02  I004403O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I001703C    PICTURE X.
           02  I001703P    PICTURE X.
           02  I001703H    PICTURE X.
           02  I001703V    PICTURE X.
           02  I001703O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I003073C    PICTURE X.
           02  I003073P    PICTURE X.
           02  I003073H    PICTURE X.
           02  I003073V    PICTURE X.
           02  I003073O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001704C    PICTURE X.
           02  I001704P    PICTURE X.
           02  I001704H    PICTURE X.
           02  I001704V    PICTURE X.
           02  I001704O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004404C    PICTURE X.
           02  I004404P    PICTURE X.
           02  I004404H    PICTURE X.
           02  I004404V    PICTURE X.
           02  I004404O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003074C    PICTURE X.
           02  I003074P    PICTURE X.
           02  I003074H    PICTURE X.
           02  I003074V    PICTURE X.
           02  I003074O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001705C    PICTURE X.
           02  I001705P    PICTURE X.
           02  I001705H    PICTURE X.
           02  I001705V    PICTURE X.
           02  I001705O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004405C    PICTURE X.
           02  I004405P    PICTURE X.
           02  I004405H    PICTURE X.
           02  I004405V    PICTURE X.
           02  I004405O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003075C    PICTURE X.
           02  I003075P    PICTURE X.
           02  I003075H    PICTURE X.
           02  I003075V    PICTURE X.
           02  I003075O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001706C    PICTURE X.
           02  I001706P    PICTURE X.
           02  I001706H    PICTURE X.
           02  I001706V    PICTURE X.
           02  I001706O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004406C    PICTURE X.
           02  I004406P    PICTURE X.
           02  I004406H    PICTURE X.
           02  I004406V    PICTURE X.
           02  I004406O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003076C    PICTURE X.
           02  I003076P    PICTURE X.
           02  I003076H    PICTURE X.
           02  I003076V    PICTURE X.
           02  I003076O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001707C    PICTURE X.
           02  I001707P    PICTURE X.
           02  I001707H    PICTURE X.
           02  I001707V    PICTURE X.
           02  I001707O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004407C    PICTURE X.
           02  I004407P    PICTURE X.
           02  I004407H    PICTURE X.
           02  I004407V    PICTURE X.
           02  I004407O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003077C    PICTURE X.
           02  I003077P    PICTURE X.
           02  I003077H    PICTURE X.
           02  I003077V    PICTURE X.
           02  I003077O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001708C    PICTURE X.
           02  I001708P    PICTURE X.
           02  I001708H    PICTURE X.
           02  I001708V    PICTURE X.
           02  I001708O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004408C    PICTURE X.
           02  I004408P    PICTURE X.
           02  I004408H    PICTURE X.
           02  I004408V    PICTURE X.
           02  I004408O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003078C    PICTURE X.
           02  I003078P    PICTURE X.
           02  I003078H    PICTURE X.
           02  I003078V    PICTURE X.
           02  I003078O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001709C    PICTURE X.
           02  I001709P    PICTURE X.
           02  I001709H    PICTURE X.
           02  I001709V    PICTURE X.
           02  I001709O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004409C    PICTURE X.
           02  I004409P    PICTURE X.
           02  I004409H    PICTURE X.
           02  I004409V    PICTURE X.
           02  I004409O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003079C    PICTURE X.
           02  I003079P    PICTURE X.
           02  I003079H    PICTURE X.
           02  I003079V    PICTURE X.
           02  I003079O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001710C    PICTURE X.
           02  I001710P    PICTURE X.
           02  I001710H    PICTURE X.
           02  I001710V    PICTURE X.
           02  I001710O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004410C    PICTURE X.
           02  I004410P    PICTURE X.
           02  I004410H    PICTURE X.
           02  I004410V    PICTURE X.
           02  I004410O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003080C    PICTURE X.
           02  I003080P    PICTURE X.
           02  I003080H    PICTURE X.
           02  I003080V    PICTURE X.
           02  I003080O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001711C    PICTURE X.
           02  I001711P    PICTURE X.
           02  I001711H    PICTURE X.
           02  I001711V    PICTURE X.
           02  I001711O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004411C    PICTURE X.
           02  I004411P    PICTURE X.
           02  I004411H    PICTURE X.
           02  I004411V    PICTURE X.
           02  I004411O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003081C    PICTURE X.
           02  I003081P    PICTURE X.
           02  I003081H    PICTURE X.
           02  I003081V    PICTURE X.
           02  I003081O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001712C    PICTURE X.
           02  I001712P    PICTURE X.
           02  I001712H    PICTURE X.
           02  I001712V    PICTURE X.
           02  I001712O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004412C    PICTURE X.
           02  I004412P    PICTURE X.
           02  I004412H    PICTURE X.
           02  I004412V    PICTURE X.
           02  I004412O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003082C    PICTURE X.
           02  I003082P    PICTURE X.
           02  I003082H    PICTURE X.
           02  I003082V    PICTURE X.
           02  I003082O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001713C    PICTURE X.
           02  I001713P    PICTURE X.
           02  I001713H    PICTURE X.
           02  I001713V    PICTURE X.
           02  I001713O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004413C    PICTURE X.
           02  I004413P    PICTURE X.
           02  I004413H    PICTURE X.
           02  I004413V    PICTURE X.
           02  I004413O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003083C    PICTURE X.
           02  I003083P    PICTURE X.
           02  I003083H    PICTURE X.
           02  I003083V    PICTURE X.
           02  I003083O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001714C    PICTURE X.
           02  I001714P    PICTURE X.
           02  I001714H    PICTURE X.
           02  I001714V    PICTURE X.
           02  I001714O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004414C    PICTURE X.
           02  I004414P    PICTURE X.
           02  I004414H    PICTURE X.
           02  I004414V    PICTURE X.
           02  I004414O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003084C    PICTURE X.
           02  I003084P    PICTURE X.
           02  I003084H    PICTURE X.
           02  I003084V    PICTURE X.
           02  I003084O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001715C    PICTURE X.
           02  I001715P    PICTURE X.
           02  I001715H    PICTURE X.
           02  I001715V    PICTURE X.
           02  I001715O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004415C    PICTURE X.
           02  I004415P    PICTURE X.
           02  I004415H    PICTURE X.
           02  I004415V    PICTURE X.
           02  I004415O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003085C    PICTURE X.
           02  I003085P    PICTURE X.
           02  I003085H    PICTURE X.
           02  I003085V    PICTURE X.
           02  I003085O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001716C    PICTURE X.
           02  I001716P    PICTURE X.
           02  I001716H    PICTURE X.
           02  I001716V    PICTURE X.
           02  I001716O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004416C    PICTURE X.
           02  I004416P    PICTURE X.
           02  I004416H    PICTURE X.
           02  I004416V    PICTURE X.
           02  I004416O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003086C    PICTURE X.
           02  I003086P    PICTURE X.
           02  I003086H    PICTURE X.
           02  I003086V    PICTURE X.
           02  I003086O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001717C    PICTURE X.
           02  I001717P    PICTURE X.
           02  I001717H    PICTURE X.
           02  I001717V    PICTURE X.
           02  I001717O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004417C    PICTURE X.
           02  I004417P    PICTURE X.
           02  I004417H    PICTURE X.
           02  I004417V    PICTURE X.
           02  I004417O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003087C    PICTURE X.
           02  I003087P    PICTURE X.
           02  I003087H    PICTURE X.
           02  I003087V    PICTURE X.
           02  I003087O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001718C    PICTURE X.
           02  I001718P    PICTURE X.
           02  I001718H    PICTURE X.
           02  I001718V    PICTURE X.
           02  I001718O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004418C    PICTURE X.
           02  I004418P    PICTURE X.
           02  I004418H    PICTURE X.
           02  I004418V    PICTURE X.
           02  I004418O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003088C    PICTURE X.
           02  I003088P    PICTURE X.
           02  I003088H    PICTURE X.
           02  I003088V    PICTURE X.
           02  I003088O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001719C    PICTURE X.
           02  I001719P    PICTURE X.
           02  I001719H    PICTURE X.
           02  I001719V    PICTURE X.
           02  I001719O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004419C    PICTURE X.
           02  I004419P    PICTURE X.
           02  I004419H    PICTURE X.
           02  I004419V    PICTURE X.
           02  I004419O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003089C    PICTURE X.
           02  I003089P    PICTURE X.
           02  I003089H    PICTURE X.
           02  I003089V    PICTURE X.
           02  I003089O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001720C    PICTURE X.
           02  I001720P    PICTURE X.
           02  I001720H    PICTURE X.
           02  I001720V    PICTURE X.
           02  I001720O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004420C    PICTURE X.
           02  I004420P    PICTURE X.
           02  I004420H    PICTURE X.
           02  I004420V    PICTURE X.
           02  I004420O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003090C    PICTURE X.
           02  I003090P    PICTURE X.
           02  I003090H    PICTURE X.
           02  I003090V    PICTURE X.
           02  I003090O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001721C    PICTURE X.
           02  I001721P    PICTURE X.
           02  I001721H    PICTURE X.
           02  I001721V    PICTURE X.
           02  I001721O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004421C    PICTURE X.
           02  I004421P    PICTURE X.
           02  I004421H    PICTURE X.
           02  I004421V    PICTURE X.
           02  I004421O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003091C    PICTURE X.
           02  I003091P    PICTURE X.
           02  I003091H    PICTURE X.
           02  I003091V    PICTURE X.
           02  I003091O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001722C    PICTURE X.
           02  I001722P    PICTURE X.
           02  I001722H    PICTURE X.
           02  I001722V    PICTURE X.
           02  I001722O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004422C    PICTURE X.
           02  I004422P    PICTURE X.
           02  I004422H    PICTURE X.
           02  I004422V    PICTURE X.
           02  I004422O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003092C    PICTURE X.
           02  I003092P    PICTURE X.
           02  I003092H    PICTURE X.
           02  I003092V    PICTURE X.
           02  I003092O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001723C    PICTURE X.
           02  I001723P    PICTURE X.
           02  I001723H    PICTURE X.
           02  I001723V    PICTURE X.
           02  I001723O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004423C    PICTURE X.
           02  I004423P    PICTURE X.
           02  I004423H    PICTURE X.
           02  I004423V    PICTURE X.
           02  I004423O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003093C    PICTURE X.
           02  I003093P    PICTURE X.
           02  I003093H    PICTURE X.
           02  I003093V    PICTURE X.
           02  I003093O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001724C    PICTURE X.
           02  I001724P    PICTURE X.
           02  I001724H    PICTURE X.
           02  I001724V    PICTURE X.
           02  I001724O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004424C    PICTURE X.
           02  I004424P    PICTURE X.
           02  I004424H    PICTURE X.
           02  I004424V    PICTURE X.
           02  I004424O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003094C    PICTURE X.
           02  I003094P    PICTURE X.
           02  I003094H    PICTURE X.
           02  I003094V    PICTURE X.
           02  I003094O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001725C    PICTURE X.
           02  I001725P    PICTURE X.
           02  I001725H    PICTURE X.
           02  I001725V    PICTURE X.
           02  I001725O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004425C    PICTURE X.
           02  I004425P    PICTURE X.
           02  I004425H    PICTURE X.
           02  I004425V    PICTURE X.
           02  I004425O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003095C    PICTURE X.
           02  I003095P    PICTURE X.
           02  I003095H    PICTURE X.
           02  I003095V    PICTURE X.
           02  I003095O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001726C    PICTURE X.
           02  I001726P    PICTURE X.
           02  I001726H    PICTURE X.
           02  I001726V    PICTURE X.
           02  I001726O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004426C    PICTURE X.
           02  I004426P    PICTURE X.
           02  I004426H    PICTURE X.
           02  I004426V    PICTURE X.
           02  I004426O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003096C    PICTURE X.
           02  I003096P    PICTURE X.
           02  I003096H    PICTURE X.
           02  I003096V    PICTURE X.
           02  I003096O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001727C    PICTURE X.
           02  I001727P    PICTURE X.
           02  I001727H    PICTURE X.
           02  I001727V    PICTURE X.
           02  I001727O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004427C    PICTURE X.
           02  I004427P    PICTURE X.
           02  I004427H    PICTURE X.
           02  I004427V    PICTURE X.
           02  I004427O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003097C    PICTURE X.
           02  I003097P    PICTURE X.
           02  I003097H    PICTURE X.
           02  I003097V    PICTURE X.
           02  I003097O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001728C    PICTURE X.
           02  I001728P    PICTURE X.
           02  I001728H    PICTURE X.
           02  I001728V    PICTURE X.
           02  I001728O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004428C    PICTURE X.
           02  I004428P    PICTURE X.
           02  I004428H    PICTURE X.
           02  I004428V    PICTURE X.
           02  I004428O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003098C    PICTURE X.
           02  I003098P    PICTURE X.
           02  I003098H    PICTURE X.
           02  I003098V    PICTURE X.
           02  I003098O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001729C    PICTURE X.
           02  I001729P    PICTURE X.
           02  I001729H    PICTURE X.
           02  I001729V    PICTURE X.
           02  I001729O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004429C    PICTURE X.
           02  I004429P    PICTURE X.
           02  I004429H    PICTURE X.
           02  I004429V    PICTURE X.
           02  I004429O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I003099C    PICTURE X.
           02  I003099P    PICTURE X.
           02  I003099H    PICTURE X.
           02  I003099V    PICTURE X.
           02  I003099O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I001730C    PICTURE X.
           02  I001730P    PICTURE X.
           02  I001730H    PICTURE X.
           02  I001730V    PICTURE X.
           02  I001730O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004430C    PICTURE X.
           02  I004430P    PICTURE X.
           02  I004430H    PICTURE X.
           02  I004430V    PICTURE X.
           02  I004430O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IMPFS05C    PICTURE X.
           02  IMPFS05P    PICTURE X.
           02  IMPFS05H    PICTURE X.
           02  IMPFS05V    PICTURE X.
           02  IMPFS05O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR05C    PICTURE X.
           02  IMERR05P    PICTURE X.
           02  IMERR05H    PICTURE X.
           02  IMERR05V    PICTURE X.
           02  IMERR05O  PIC X(79).
       01  IMX1M06I REDEFINES IMX1M07I.
           02  FILLER PIC X(12).
           02  IMITR06L    COMP  PIC  S9(4).
           02  IMITR06F    PICTURE X.
           02  FILLER REDEFINES IMITR06F.
             03 IMITR06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITR06I  PIC X(4).
           02  IMIDT06L    COMP  PIC  S9(4).
           02  IMIDT06F    PICTURE X.
           02  FILLER REDEFINES IMIDT06F.
             03 IMIDT06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMIDT06I  PIC X(8).
           02  IMITM06L    COMP  PIC  S9(4).
           02  IMITM06F    PICTURE X.
           02  FILLER REDEFINES IMITM06F.
             03 IMITM06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITM06I  PIC X(8).
           02  TYPE006L    COMP  PIC  S9(4).
           02  TYPE006F    PICTURE X.
           02  FILLER REDEFINES TYPE006F.
             03 TYPE006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TYPE006I  PIC X(1).
           02  INDEX06L    COMP  PIC  S9(4).
           02  INDEX06F    PICTURE X.
           02  FILLER REDEFINES INDEX06F.
             03 INDEX06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INDEX06I  PIC X(1).
           02  PROD006L    COMP  PIC  S9(4).
           02  PROD006F    PICTURE X.
           02  FILLER REDEFINES PROD006F.
             03 PROD006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PROD006I  PIC X(3).
           02  CTL1006L    COMP  PIC  S9(4).
           02  CTL1006F    PICTURE X.
           02  FILLER REDEFINES CTL1006F.
             03 CTL1006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1006I  PIC X(2).
           02  CTL2006L    COMP  PIC  S9(4).
           02  CTL2006F    PICTURE X.
           02  FILLER REDEFINES CTL2006F.
             03 CTL2006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2006I  PIC X(3).
           02  CTL3006L    COMP  PIC  S9(4).
           02  CTL3006F    PICTURE X.
           02  FILLER REDEFINES CTL3006F.
             03 CTL3006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3006I  PIC X(3).
           02  I005401L    COMP  PIC  S9(4).
           02  I005401F    PICTURE X.
           02  FILLER REDEFINES I005401F.
             03 I005401A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005401I  PIC X(10).
           02  I005601L    COMP  PIC  S9(4).
           02  I005601F    PICTURE X.
           02  FILLER REDEFINES I005601F.
             03 I005601A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005601I  PIC X(1).
           02  I005701L    COMP  PIC  S9(4).
           02  I005701F    PICTURE X.
           02  FILLER REDEFINES I005701F.
             03 I005701A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005701I  PIC X(1).
           02  I005801L    COMP  PIC  S9(4).
           02  I005801F    PICTURE X.
           02  FILLER REDEFINES I005801F.
             03 I005801A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005801I  PIC X(10).
           02  I005901L    COMP  PIC  S9(4).
           02  I005901F    PICTURE X.
           02  FILLER REDEFINES I005901F.
             03 I005901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005901I  PIC X(16).
           02  I001897L    COMP  PIC  S9(4).
           02  I001897F    PICTURE X.
           02  FILLER REDEFINES I001897F.
             03 I001897A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001897I  PIC X(6).
           02  I005802L    COMP  PIC  S9(4).
           02  I005802F    PICTURE X.
           02  FILLER REDEFINES I005802F.
             03 I005802A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005802I  PIC X(10).
           02  I005902L    COMP  PIC  S9(4).
           02  I005902F    PICTURE X.
           02  FILLER REDEFINES I005902F.
             03 I005902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005902I  PIC X(16).
           02  I005803L    COMP  PIC  S9(4).
           02  I005803F    PICTURE X.
           02  FILLER REDEFINES I005803F.
             03 I005803A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005803I  PIC X(10).
           02  I005903L    COMP  PIC  S9(4).
           02  I005903F    PICTURE X.
           02  FILLER REDEFINES I005903F.
             03 I005903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005903I  PIC X(16).
           02  I005804L    COMP  PIC  S9(4).
           02  I005804F    PICTURE X.
           02  FILLER REDEFINES I005804F.
             03 I005804A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005804I  PIC X(10).
           02  I005904L    COMP  PIC  S9(4).
           02  I005904F    PICTURE X.
           02  FILLER REDEFINES I005904F.
             03 I005904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005904I  PIC X(16).
           02  I005805L    COMP  PIC  S9(4).
           02  I005805F    PICTURE X.
           02  FILLER REDEFINES I005805F.
             03 I005805A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005805I  PIC X(10).
           02  I005402L    COMP  PIC  S9(4).
           02  I005402F    PICTURE X.
           02  FILLER REDEFINES I005402F.
             03 I005402A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005402I  PIC X(10).
           02  I005602L    COMP  PIC  S9(4).
           02  I005602F    PICTURE X.
           02  FILLER REDEFINES I005602F.
             03 I005602A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005602I  PIC X(1).
           02  I005702L    COMP  PIC  S9(4).
           02  I005702F    PICTURE X.
           02  FILLER REDEFINES I005702F.
             03 I005702A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005702I  PIC X(1).
           02  I005806L    COMP  PIC  S9(4).
           02  I005806F    PICTURE X.
           02  FILLER REDEFINES I005806F.
             03 I005806A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005806I  PIC X(10).
           02  I005906L    COMP  PIC  S9(4).
           02  I005906F    PICTURE X.
           02  FILLER REDEFINES I005906F.
             03 I005906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005906I  PIC X(16).
           02  I001898L    COMP  PIC  S9(4).
           02  I001898F    PICTURE X.
           02  FILLER REDEFINES I001898F.
             03 I001898A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001898I  PIC X(6).
           02  IMCOR06L    COMP  PIC  S9(4).
           02  IMCOR06F    PICTURE X.
           02  FILLER REDEFINES IMCOR06F.
             03 IMCOR06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMCOR06I  PIC X(1).
           02  I005807L    COMP  PIC  S9(4).
           02  I005807F    PICTURE X.
           02  FILLER REDEFINES I005807F.
             03 I005807A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005807I  PIC X(10).
           02  I005907L    COMP  PIC  S9(4).
           02  I005907F    PICTURE X.
           02  FILLER REDEFINES I005907F.
             03 I005907A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005907I  PIC X(16).
           02  I005808L    COMP  PIC  S9(4).
           02  I005808F    PICTURE X.
           02  FILLER REDEFINES I005808F.
             03 I005808A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005808I  PIC X(10).
           02  I005908L    COMP  PIC  S9(4).
           02  I005908F    PICTURE X.
           02  FILLER REDEFINES I005908F.
             03 I005908A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005908I  PIC X(16).
           02  I005809L    COMP  PIC  S9(4).
           02  I005809F    PICTURE X.
           02  FILLER REDEFINES I005809F.
             03 I005809A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005809I  PIC X(10).
           02  I005909L    COMP  PIC  S9(4).
           02  I005909F    PICTURE X.
           02  FILLER REDEFINES I005909F.
             03 I005909A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005909I  PIC X(16).
           02  I005810L    COMP  PIC  S9(4).
           02  I005810F    PICTURE X.
           02  FILLER REDEFINES I005810F.
             03 I005810A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005810I  PIC X(10).
           02  IMACT99L    COMP  PIC  S9(4).
           02  IMACT99F    PICTURE X.
           02  FILLER REDEFINES IMACT99F.
             03 IMACT99A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMACT99I  PIC X(1).
           02  I005403L    COMP  PIC  S9(4).
           02  I005403F    PICTURE X.
           02  FILLER REDEFINES I005403F.
             03 I005403A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005403I  PIC X(10).
           02  I005603L    COMP  PIC  S9(4).
           02  I005603F    PICTURE X.
           02  FILLER REDEFINES I005603F.
             03 I005603A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005603I  PIC X(1).
           02  I005703L    COMP  PIC  S9(4).
           02  I005703F    PICTURE X.
           02  FILLER REDEFINES I005703F.
             03 I005703A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005703I  PIC X(1).
           02  I005811L    COMP  PIC  S9(4).
           02  I005811F    PICTURE X.
           02  FILLER REDEFINES I005811F.
             03 I005811A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005811I  PIC X(10).
           02  I005911L    COMP  PIC  S9(4).
           02  I005911F    PICTURE X.
           02  FILLER REDEFINES I005911F.
             03 I005911A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005911I  PIC X(16).
           02  I001899L    COMP  PIC  S9(4).
           02  I001899F    PICTURE X.
           02  FILLER REDEFINES I001899F.
             03 I001899A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I001899I  PIC X(6).
           02  I003199L    COMP  PIC  S9(4).
           02  I003199F    PICTURE X.
           02  FILLER REDEFINES I003199F.
             03 I003199A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003199I  PIC X(1).
           02  I005812L    COMP  PIC  S9(4).
           02  I005812F    PICTURE X.
           02  FILLER REDEFINES I005812F.
             03 I005812A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005812I  PIC X(10).
           02  I005912L    COMP  PIC  S9(4).
           02  I005912F    PICTURE X.
           02  FILLER REDEFINES I005912F.
             03 I005912A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005912I  PIC X(16).
           02  I005813L    COMP  PIC  S9(4).
           02  I005813F    PICTURE X.
           02  FILLER REDEFINES I005813F.
             03 I005813A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005813I  PIC X(10).
           02  I005913L    COMP  PIC  S9(4).
           02  I005913F    PICTURE X.
           02  FILLER REDEFINES I005913F.
             03 I005913A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005913I  PIC X(16).
           02  I005814L    COMP  PIC  S9(4).
           02  I005814F    PICTURE X.
           02  FILLER REDEFINES I005814F.
             03 I005814A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005814I  PIC X(10).
           02  I005914L    COMP  PIC  S9(4).
           02  I005914F    PICTURE X.
           02  FILLER REDEFINES I005914F.
             03 I005914A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005914I  PIC X(16).
           02  I005815L    COMP  PIC  S9(4).
           02  I005815F    PICTURE X.
           02  FILLER REDEFINES I005815F.
             03 I005815A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I005815I  PIC X(10).
           02  IMPFS06L    COMP  PIC  S9(4).
           02  IMPFS06F    PICTURE X.
           02  FILLER REDEFINES IMPFS06F.
             03 IMPFS06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS06I  PIC X(79).
           02  IMERR06L    COMP  PIC  S9(4).
           02  IMERR06F    PICTURE X.
           02  FILLER REDEFINES IMERR06F.
             03 IMERR06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR06I  PIC X(79).
       01  IMX1M06O REDEFINES IMX1M06I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMITR06C    PICTURE X.
           02  IMITR06P    PICTURE X.
           02  IMITR06H    PICTURE X.
           02  IMITR06V    PICTURE X.
           02  IMITR06O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMIDT06C    PICTURE X.
           02  IMIDT06P    PICTURE X.
           02  IMIDT06H    PICTURE X.
           02  IMIDT06V    PICTURE X.
           02  IMIDT06O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMITM06C    PICTURE X.
           02  IMITM06P    PICTURE X.
           02  IMITM06H    PICTURE X.
           02  IMITM06V    PICTURE X.
           02  IMITM06O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TYPE006C    PICTURE X.
           02  TYPE006P    PICTURE X.
           02  TYPE006H    PICTURE X.
           02  TYPE006V    PICTURE X.
           02  TYPE006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INDEX06C    PICTURE X.
           02  INDEX06P    PICTURE X.
           02  INDEX06H    PICTURE X.
           02  INDEX06V    PICTURE X.
           02  INDEX06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PROD006C    PICTURE X.
           02  PROD006P    PICTURE X.
           02  PROD006H    PICTURE X.
           02  PROD006V    PICTURE X.
           02  PROD006O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL1006C    PICTURE X.
           02  CTL1006P    PICTURE X.
           02  CTL1006H    PICTURE X.
           02  CTL1006V    PICTURE X.
           02  CTL1006O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2006C    PICTURE X.
           02  CTL2006P    PICTURE X.
           02  CTL2006H    PICTURE X.
           02  CTL2006V    PICTURE X.
           02  CTL2006O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3006C    PICTURE X.
           02  CTL3006P    PICTURE X.
           02  CTL3006H    PICTURE X.
           02  CTL3006V    PICTURE X.
           02  CTL3006O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  I005401C    PICTURE X.
           02  I005401P    PICTURE X.
           02  I005401H    PICTURE X.
           02  I005401V    PICTURE X.
           02  I005401O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005601C    PICTURE X.
           02  I005601P    PICTURE X.
           02  I005601H    PICTURE X.
           02  I005601V    PICTURE X.
           02  I005601O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I005701C    PICTURE X.
           02  I005701P    PICTURE X.
           02  I005701H    PICTURE X.
           02  I005701V    PICTURE X.
           02  I005701O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I005801C    PICTURE X.
           02  I005801P    PICTURE X.
           02  I005801H    PICTURE X.
           02  I005801V    PICTURE X.
           02  I005801O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005901C    PICTURE X.
           02  I005901P    PICTURE X.
           02  I005901H    PICTURE X.
           02  I005901V    PICTURE X.
           02  I005901O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I001897C    PICTURE X.
           02  I001897P    PICTURE X.
           02  I001897H    PICTURE X.
           02  I001897V    PICTURE X.
           02  I001897O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I005802C    PICTURE X.
           02  I005802P    PICTURE X.
           02  I005802H    PICTURE X.
           02  I005802V    PICTURE X.
           02  I005802O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005902C    PICTURE X.
           02  I005902P    PICTURE X.
           02  I005902H    PICTURE X.
           02  I005902V    PICTURE X.
           02  I005902O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I005803C    PICTURE X.
           02  I005803P    PICTURE X.
           02  I005803H    PICTURE X.
           02  I005803V    PICTURE X.
           02  I005803O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005903C    PICTURE X.
           02  I005903P    PICTURE X.
           02  I005903H    PICTURE X.
           02  I005903V    PICTURE X.
           02  I005903O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I005804C    PICTURE X.
           02  I005804P    PICTURE X.
           02  I005804H    PICTURE X.
           02  I005804V    PICTURE X.
           02  I005804O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005904C    PICTURE X.
           02  I005904P    PICTURE X.
           02  I005904H    PICTURE X.
           02  I005904V    PICTURE X.
           02  I005904O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I005805C    PICTURE X.
           02  I005805P    PICTURE X.
           02  I005805H    PICTURE X.
           02  I005805V    PICTURE X.
           02  I005805O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005402C    PICTURE X.
           02  I005402P    PICTURE X.
           02  I005402H    PICTURE X.
           02  I005402V    PICTURE X.
           02  I005402O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005602C    PICTURE X.
           02  I005602P    PICTURE X.
           02  I005602H    PICTURE X.
           02  I005602V    PICTURE X.
           02  I005602O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I005702C    PICTURE X.
           02  I005702P    PICTURE X.
           02  I005702H    PICTURE X.
           02  I005702V    PICTURE X.
           02  I005702O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I005806C    PICTURE X.
           02  I005806P    PICTURE X.
           02  I005806H    PICTURE X.
           02  I005806V    PICTURE X.
           02  I005806O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005906C    PICTURE X.
           02  I005906P    PICTURE X.
           02  I005906H    PICTURE X.
           02  I005906V    PICTURE X.
           02  I005906O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I001898C    PICTURE X.
           02  I001898P    PICTURE X.
           02  I001898H    PICTURE X.
           02  I001898V    PICTURE X.
           02  I001898O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMCOR06C    PICTURE X.
           02  IMCOR06P    PICTURE X.
           02  IMCOR06H    PICTURE X.
           02  IMCOR06V    PICTURE X.
           02  IMCOR06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I005807C    PICTURE X.
           02  I005807P    PICTURE X.
           02  I005807H    PICTURE X.
           02  I005807V    PICTURE X.
           02  I005807O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005907C    PICTURE X.
           02  I005907P    PICTURE X.
           02  I005907H    PICTURE X.
           02  I005907V    PICTURE X.
           02  I005907O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I005808C    PICTURE X.
           02  I005808P    PICTURE X.
           02  I005808H    PICTURE X.
           02  I005808V    PICTURE X.
           02  I005808O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005908C    PICTURE X.
           02  I005908P    PICTURE X.
           02  I005908H    PICTURE X.
           02  I005908V    PICTURE X.
           02  I005908O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I005809C    PICTURE X.
           02  I005809P    PICTURE X.
           02  I005809H    PICTURE X.
           02  I005809V    PICTURE X.
           02  I005809O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005909C    PICTURE X.
           02  I005909P    PICTURE X.
           02  I005909H    PICTURE X.
           02  I005909V    PICTURE X.
           02  I005909O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I005810C    PICTURE X.
           02  I005810P    PICTURE X.
           02  I005810H    PICTURE X.
           02  I005810V    PICTURE X.
           02  I005810O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  IMACT99C    PICTURE X.
           02  IMACT99P    PICTURE X.
           02  IMACT99H    PICTURE X.
           02  IMACT99V    PICTURE X.
           02  IMACT99O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I005403C    PICTURE X.
           02  I005403P    PICTURE X.
           02  I005403H    PICTURE X.
           02  I005403V    PICTURE X.
           02  I005403O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  I005603C    PICTURE X.
           02  I005603P    PICTURE X.
           02  I005603H    PICTURE X.
           02  I005603V    PICTURE X.
           02  I005603O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I005703C    PICTURE X.
           02  I005703P    PICTURE X.
           02  I005703H    PICTURE X.
           02  I005703V    PICTURE X.
           02  I005703O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I005811C    PICTURE X.
           02  I005811P    PICTURE X.
           02  I005811H    PICTURE X.
           02  I005811V    PICTURE X.
           02  I005811O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005911C    PICTURE X.
           02  I005911P    PICTURE X.
           02  I005911H    PICTURE X.
           02  I005911V    PICTURE X.
           02  I005911O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I001899C    PICTURE X.
           02  I001899P    PICTURE X.
           02  I001899H    PICTURE X.
           02  I001899V    PICTURE X.
           02  I001899O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I003199C    PICTURE X.
           02  I003199P    PICTURE X.
           02  I003199H    PICTURE X.
           02  I003199V    PICTURE X.
           02  I003199O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  I005812C    PICTURE X.
           02  I005812P    PICTURE X.
           02  I005812H    PICTURE X.
           02  I005812V    PICTURE X.
           02  I005812O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005912C    PICTURE X.
           02  I005912P    PICTURE X.
           02  I005912H    PICTURE X.
           02  I005912V    PICTURE X.
           02  I005912O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I005813C    PICTURE X.
           02  I005813P    PICTURE X.
           02  I005813H    PICTURE X.
           02  I005813V    PICTURE X.
           02  I005813O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005913C    PICTURE X.
           02  I005913P    PICTURE X.
           02  I005913H    PICTURE X.
           02  I005913V    PICTURE X.
           02  I005913O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I005814C    PICTURE X.
           02  I005814P    PICTURE X.
           02  I005814H    PICTURE X.
           02  I005814V    PICTURE X.
           02  I005814O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  I005914C    PICTURE X.
           02  I005914P    PICTURE X.
           02  I005914H    PICTURE X.
           02  I005914V    PICTURE X.
           02  I005914O PIC ZZZZZZZZZZZZZ.99.
           02  FILLER PICTURE X(3).
           02  I005815C    PICTURE X.
           02  I005815P    PICTURE X.
           02  I005815H    PICTURE X.
           02  I005815V    PICTURE X.
           02  I005815O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  IMPFS06C    PICTURE X.
           02  IMPFS06P    PICTURE X.
           02  IMPFS06H    PICTURE X.
           02  IMPFS06V    PICTURE X.
           02  IMPFS06O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR06C    PICTURE X.
           02  IMERR06P    PICTURE X.
           02  IMERR06H    PICTURE X.
           02  IMERR06V    PICTURE X.
           02  IMERR06O  PIC X(79).
       01  IMX1M08I REDEFINES IMX1M07I.
           02  FILLER PIC X(12).
           02  IMITR08L    COMP  PIC  S9(4).
           02  IMITR08F    PICTURE X.
           02  FILLER REDEFINES IMITR08F.
             03 IMITR08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITR08I  PIC X(4).
           02  IMIDT08L    COMP  PIC  S9(4).
           02  IMIDT08F    PICTURE X.
           02  FILLER REDEFINES IMIDT08F.
             03 IMIDT08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMIDT08I  PIC X(8).
           02  IMITM08L    COMP  PIC  S9(4).
           02  IMITM08F    PICTURE X.
           02  FILLER REDEFINES IMITM08F.
             03 IMITM08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMITM08I  PIC X(8).
           02  TYPE008L    COMP  PIC  S9(4).
           02  TYPE008F    PICTURE X.
           02  FILLER REDEFINES TYPE008F.
             03 TYPE008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TYPE008I  PIC X(1).
           02  INDEX08L    COMP  PIC  S9(4).
           02  INDEX08F    PICTURE X.
           02  FILLER REDEFINES INDEX08F.
             03 INDEX08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INDEX08I  PIC X(1).
           02  PROD008L    COMP  PIC  S9(4).
           02  PROD008F    PICTURE X.
           02  FILLER REDEFINES PROD008F.
             03 PROD008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PROD008I  PIC X(3).
           02  CTL1008L    COMP  PIC  S9(4).
           02  CTL1008F    PICTURE X.
           02  FILLER REDEFINES CTL1008F.
             03 CTL1008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL1008I  PIC X(2).
           02  CTL2008L    COMP  PIC  S9(4).
           02  CTL2008F    PICTURE X.
           02  FILLER REDEFINES CTL2008F.
             03 CTL2008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL2008I  PIC X(3).
           02  CTL3008L    COMP  PIC  S9(4).
           02  CTL3008F    PICTURE X.
           02  FILLER REDEFINES CTL3008F.
             03 CTL3008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CTL3008I  PIC X(3).
           02  I004001L    COMP  PIC  S9(4).
           02  I004001F    PICTURE X.
           02  FILLER REDEFINES I004001F.
             03 I004001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004001I  PIC X(2).
           02  I004002L    COMP  PIC  S9(4).
           02  I004002F    PICTURE X.
           02  FILLER REDEFINES I004002F.
             03 I004002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004002I  PIC X(2).
           02  I004003L    COMP  PIC  S9(4).
           02  I004003F    PICTURE X.
           02  FILLER REDEFINES I004003F.
             03 I004003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004003I  PIC X(2).
           02  I004101L    COMP  PIC  S9(4).
           02  I004101F    PICTURE X.
           02  FILLER REDEFINES I004101F.
             03 I004101A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004101I  PIC X(6).
           02  I004102L    COMP  PIC  S9(4).
           02  I004102F    PICTURE X.
           02  FILLER REDEFINES I004102F.
             03 I004102A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004102I  PIC X(6).
           02  I004103L    COMP  PIC  S9(4).
           02  I004103F    PICTURE X.
           02  FILLER REDEFINES I004103F.
             03 I004103A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I004103I  PIC X(6).
           02  I003901L    COMP  PIC  S9(4).
           02  I003901F    PICTURE X.
           02  FILLER REDEFINES I003901F.
             03 I003901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003901I  PIC X(10).
           02  L003901L    COMP  PIC  S9(4).
           02  L003901F    PICTURE X.
           02  FILLER REDEFINES L003901F.
             03 L003901A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003901I  PIC X(13).
           02  I003910L    COMP  PIC  S9(4).
           02  I003910F    PICTURE X.
           02  FILLER REDEFINES I003910F.
             03 I003910A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003910I  PIC X(10).
           02  L003909L    COMP  PIC  S9(4).
           02  L003909F    PICTURE X.
           02  FILLER REDEFINES L003909F.
             03 L003909A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003909I  PIC X(13).
           02  I003919L    COMP  PIC  S9(4).
           02  I003919F    PICTURE X.
           02  FILLER REDEFINES I003919F.
             03 I003919A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003919I  PIC X(10).
           02  L003917L    COMP  PIC  S9(4).
           02  L003917F    PICTURE X.
           02  FILLER REDEFINES L003917F.
             03 L003917A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003917I  PIC X(13).
           02  I003902L    COMP  PIC  S9(4).
           02  I003902F    PICTURE X.
           02  FILLER REDEFINES I003902F.
             03 I003902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003902I  PIC X(10).
           02  L003902L    COMP  PIC  S9(4).
           02  L003902F    PICTURE X.
           02  FILLER REDEFINES L003902F.
             03 L003902A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003902I  PIC X(13).
           02  I003911L    COMP  PIC  S9(4).
           02  I003911F    PICTURE X.
           02  FILLER REDEFINES I003911F.
             03 I003911A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003911I  PIC X(10).
           02  L003910L    COMP  PIC  S9(4).
           02  L003910F    PICTURE X.
           02  FILLER REDEFINES L003910F.
             03 L003910A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003910I  PIC X(13).
           02  I003920L    COMP  PIC  S9(4).
           02  I003920F    PICTURE X.
           02  FILLER REDEFINES I003920F.
             03 I003920A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003920I  PIC X(10).
           02  L003918L    COMP  PIC  S9(4).
           02  L003918F    PICTURE X.
           02  FILLER REDEFINES L003918F.
             03 L003918A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003918I  PIC X(13).
           02  I003903L    COMP  PIC  S9(4).
           02  I003903F    PICTURE X.
           02  FILLER REDEFINES I003903F.
             03 I003903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003903I  PIC X(10).
           02  L003903L    COMP  PIC  S9(4).
           02  L003903F    PICTURE X.
           02  FILLER REDEFINES L003903F.
             03 L003903A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003903I  PIC X(13).
           02  I003912L    COMP  PIC  S9(4).
           02  I003912F    PICTURE X.
           02  FILLER REDEFINES I003912F.
             03 I003912A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003912I  PIC X(10).
           02  L003911L    COMP  PIC  S9(4).
           02  L003911F    PICTURE X.
           02  FILLER REDEFINES L003911F.
             03 L003911A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003911I  PIC X(13).
           02  I003921L    COMP  PIC  S9(4).
           02  I003921F    PICTURE X.
           02  FILLER REDEFINES I003921F.
             03 I003921A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003921I  PIC X(10).
           02  L003919L    COMP  PIC  S9(4).
           02  L003919F    PICTURE X.
           02  FILLER REDEFINES L003919F.
             03 L003919A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003919I  PIC X(13).
           02  I003904L    COMP  PIC  S9(4).
           02  I003904F    PICTURE X.
           02  FILLER REDEFINES I003904F.
             03 I003904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003904I  PIC X(10).
           02  L003904L    COMP  PIC  S9(4).
           02  L003904F    PICTURE X.
           02  FILLER REDEFINES L003904F.
             03 L003904A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003904I  PIC X(13).
           02  I003913L    COMP  PIC  S9(4).
           02  I003913F    PICTURE X.
           02  FILLER REDEFINES I003913F.
             03 I003913A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003913I  PIC X(10).
           02  L003912L    COMP  PIC  S9(4).
           02  L003912F    PICTURE X.
           02  FILLER REDEFINES L003912F.
             03 L003912A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003912I  PIC X(13).
           02  I003922L    COMP  PIC  S9(4).
           02  I003922F    PICTURE X.
           02  FILLER REDEFINES I003922F.
             03 I003922A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003922I  PIC X(10).
           02  L003920L    COMP  PIC  S9(4).
           02  L003920F    PICTURE X.
           02  FILLER REDEFINES L003920F.
             03 L003920A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003920I  PIC X(13).
           02  I003905L    COMP  PIC  S9(4).
           02  I003905F    PICTURE X.
           02  FILLER REDEFINES I003905F.
             03 I003905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003905I  PIC X(10).
           02  L003905L    COMP  PIC  S9(4).
           02  L003905F    PICTURE X.
           02  FILLER REDEFINES L003905F.
             03 L003905A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003905I  PIC X(13).
           02  I003914L    COMP  PIC  S9(4).
           02  I003914F    PICTURE X.
           02  FILLER REDEFINES I003914F.
             03 I003914A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003914I  PIC X(10).
           02  L003913L    COMP  PIC  S9(4).
           02  L003913F    PICTURE X.
           02  FILLER REDEFINES L003913F.
             03 L003913A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003913I  PIC X(13).
           02  I003923L    COMP  PIC  S9(4).
           02  I003923F    PICTURE X.
           02  FILLER REDEFINES I003923F.
             03 I003923A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003923I  PIC X(10).
           02  L003921L    COMP  PIC  S9(4).
           02  L003921F    PICTURE X.
           02  FILLER REDEFINES L003921F.
             03 L003921A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003921I  PIC X(13).
           02  I003906L    COMP  PIC  S9(4).
           02  I003906F    PICTURE X.
           02  FILLER REDEFINES I003906F.
             03 I003906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003906I  PIC X(10).
           02  L003906L    COMP  PIC  S9(4).
           02  L003906F    PICTURE X.
           02  FILLER REDEFINES L003906F.
             03 L003906A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003906I  PIC X(13).
           02  I003915L    COMP  PIC  S9(4).
           02  I003915F    PICTURE X.
           02  FILLER REDEFINES I003915F.
             03 I003915A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003915I  PIC X(10).
           02  L003914L    COMP  PIC  S9(4).
           02  L003914F    PICTURE X.
           02  FILLER REDEFINES L003914F.
             03 L003914A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003914I  PIC X(13).
           02  I003924L    COMP  PIC  S9(4).
           02  I003924F    PICTURE X.
           02  FILLER REDEFINES I003924F.
             03 I003924A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003924I  PIC X(10).
           02  L003922L    COMP  PIC  S9(4).
           02  L003922F    PICTURE X.
           02  FILLER REDEFINES L003922F.
             03 L003922A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003922I  PIC X(13).
           02  I003907L    COMP  PIC  S9(4).
           02  I003907F    PICTURE X.
           02  FILLER REDEFINES I003907F.
             03 I003907A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003907I  PIC X(10).
           02  L003907L    COMP  PIC  S9(4).
           02  L003907F    PICTURE X.
           02  FILLER REDEFINES L003907F.
             03 L003907A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003907I  PIC X(13).
           02  I003916L    COMP  PIC  S9(4).
           02  I003916F    PICTURE X.
           02  FILLER REDEFINES I003916F.
             03 I003916A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003916I  PIC X(10).
           02  L003915L    COMP  PIC  S9(4).
           02  L003915F    PICTURE X.
           02  FILLER REDEFINES L003915F.
             03 L003915A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003915I  PIC X(13).
           02  I003925L    COMP  PIC  S9(4).
           02  I003925F    PICTURE X.
           02  FILLER REDEFINES I003925F.
             03 I003925A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003925I  PIC X(10).
           02  L003923L    COMP  PIC  S9(4).
           02  L003923F    PICTURE X.
           02  FILLER REDEFINES L003923F.
             03 L003923A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003923I  PIC X(13).
           02  I003908L    COMP  PIC  S9(4).
           02  I003908F    PICTURE X.
           02  FILLER REDEFINES I003908F.
             03 I003908A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003908I  PIC X(10).
           02  L003908L    COMP  PIC  S9(4).
           02  L003908F    PICTURE X.
           02  FILLER REDEFINES L003908F.
             03 L003908A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003908I  PIC X(13).
           02  I003917L    COMP  PIC  S9(4).
           02  I003917F    PICTURE X.
           02  FILLER REDEFINES I003917F.
             03 I003917A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003917I  PIC X(10).
           02  L003916L    COMP  PIC  S9(4).
           02  L003916F    PICTURE X.
           02  FILLER REDEFINES L003916F.
             03 L003916A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003916I  PIC X(13).
           02  I003926L    COMP  PIC  S9(4).
           02  I003926F    PICTURE X.
           02  FILLER REDEFINES I003926F.
             03 I003926A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003926I  PIC X(10).
           02  L003924L    COMP  PIC  S9(4).
           02  L003924F    PICTURE X.
           02  FILLER REDEFINES L003924F.
             03 L003924A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003924I  PIC X(13).
           02  I003909L    COMP  PIC  S9(4).
           02  I003909F    PICTURE X.
           02  FILLER REDEFINES I003909F.
             03 I003909A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003909I  PIC X(10).
           02  L003997L    COMP  PIC  S9(4).
           02  L003997F    PICTURE X.
           02  FILLER REDEFINES L003997F.
             03 L003997A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003997I  PIC X(13).
           02  I003918L    COMP  PIC  S9(4).
           02  I003918F    PICTURE X.
           02  FILLER REDEFINES I003918F.
             03 I003918A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003918I  PIC X(10).
           02  L003998L    COMP  PIC  S9(4).
           02  L003998F    PICTURE X.
           02  FILLER REDEFINES L003998F.
             03 L003998A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003998I  PIC X(13).
           02  I003927L    COMP  PIC  S9(4).
           02  I003927F    PICTURE X.
           02  FILLER REDEFINES I003927F.
             03 I003927A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  I003927I  PIC X(10).
           02  L003999L    COMP  PIC  S9(4).
           02  L003999F    PICTURE X.
           02  FILLER REDEFINES L003999F.
             03 L003999A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  L003999I  PIC X(13).
           02  IMPFS08L    COMP  PIC  S9(4).
           02  IMPFS08F    PICTURE X.
           02  FILLER REDEFINES IMPFS08F.
             03 IMPFS08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS08I  PIC X(79).
           02  IMERR08L    COMP  PIC  S9(4).
           02  IMERR08F    PICTURE X.
           02  FILLER REDEFINES IMERR08F.
             03 IMERR08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR08I  PIC X(79).
       01  IMX1M08O REDEFINES IMX1M08I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMITR08C    PICTURE X.
           02  IMITR08P    PICTURE X.
           02  IMITR08H    PICTURE X.
           02  IMITR08V    PICTURE X.
           02  IMITR08O PIC ZZZ9.
           02  FILLER PICTURE X(3).
           02  IMIDT08C    PICTURE X.
           02  IMIDT08P    PICTURE X.
           02  IMIDT08H    PICTURE X.
           02  IMIDT08V    PICTURE X.
           02  IMIDT08O PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMITM08C    PICTURE X.
           02  IMITM08P    PICTURE X.
           02  IMITM08H    PICTURE X.
           02  IMITM08V    PICTURE X.
           02  IMITM08O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TYPE008C    PICTURE X.
           02  TYPE008P    PICTURE X.
           02  TYPE008H    PICTURE X.
           02  TYPE008V    PICTURE X.
           02  TYPE008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INDEX08C    PICTURE X.
           02  INDEX08P    PICTURE X.
           02  INDEX08H    PICTURE X.
           02  INDEX08V    PICTURE X.
           02  INDEX08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  PROD008C    PICTURE X.
           02  PROD008P    PICTURE X.
           02  PROD008H    PICTURE X.
           02  PROD008V    PICTURE X.
           02  PROD008O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL1008C    PICTURE X.
           02  CTL1008P    PICTURE X.
           02  CTL1008H    PICTURE X.
           02  CTL1008V    PICTURE X.
           02  CTL1008O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CTL2008C    PICTURE X.
           02  CTL2008P    PICTURE X.
           02  CTL2008H    PICTURE X.
           02  CTL2008V    PICTURE X.
           02  CTL2008O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL3008C    PICTURE X.
           02  CTL3008P    PICTURE X.
           02  CTL3008H    PICTURE X.
           02  CTL3008V    PICTURE X.
           02  CTL3008O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  I004001C    PICTURE X.
           02  I004001P    PICTURE X.
           02  I004001H    PICTURE X.
           02  I004001V    PICTURE X.
           02  I004001O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004002C    PICTURE X.
           02  I004002P    PICTURE X.
           02  I004002H    PICTURE X.
           02  I004002V    PICTURE X.
           02  I004002O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004003C    PICTURE X.
           02  I004003P    PICTURE X.
           02  I004003H    PICTURE X.
           02  I004003V    PICTURE X.
           02  I004003O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  I004101C    PICTURE X.
           02  I004101P    PICTURE X.
           02  I004101H    PICTURE X.
           02  I004101V    PICTURE X.
           02  I004101O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004102C    PICTURE X.
           02  I004102P    PICTURE X.
           02  I004102H    PICTURE X.
           02  I004102V    PICTURE X.
           02  I004102O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I004103C    PICTURE X.
           02  I004103P    PICTURE X.
           02  I004103H    PICTURE X.
           02  I004103V    PICTURE X.
           02  I004103O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  I003901C    PICTURE X.
           02  I003901P    PICTURE X.
           02  I003901H    PICTURE X.
           02  I003901V    PICTURE X.
           02  I003901O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003901C    PICTURE X.
           02  L003901P    PICTURE X.
           02  L003901H    PICTURE X.
           02  L003901V    PICTURE X.
           02  L003901O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003910C    PICTURE X.
           02  I003910P    PICTURE X.
           02  I003910H    PICTURE X.
           02  I003910V    PICTURE X.
           02  I003910O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003909C    PICTURE X.
           02  L003909P    PICTURE X.
           02  L003909H    PICTURE X.
           02  L003909V    PICTURE X.
           02  L003909O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003919C    PICTURE X.
           02  I003919P    PICTURE X.
           02  I003919H    PICTURE X.
           02  I003919V    PICTURE X.
           02  I003919O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003917C    PICTURE X.
           02  L003917P    PICTURE X.
           02  L003917H    PICTURE X.
           02  L003917V    PICTURE X.
           02  L003917O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003902C    PICTURE X.
           02  I003902P    PICTURE X.
           02  I003902H    PICTURE X.
           02  I003902V    PICTURE X.
           02  I003902O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003902C    PICTURE X.
           02  L003902P    PICTURE X.
           02  L003902H    PICTURE X.
           02  L003902V    PICTURE X.
           02  L003902O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003911C    PICTURE X.
           02  I003911P    PICTURE X.
           02  I003911H    PICTURE X.
           02  I003911V    PICTURE X.
           02  I003911O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003910C    PICTURE X.
           02  L003910P    PICTURE X.
           02  L003910H    PICTURE X.
           02  L003910V    PICTURE X.
           02  L003910O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003920C    PICTURE X.
           02  I003920P    PICTURE X.
           02  I003920H    PICTURE X.
           02  I003920V    PICTURE X.
           02  I003920O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003918C    PICTURE X.
           02  L003918P    PICTURE X.
           02  L003918H    PICTURE X.
           02  L003918V    PICTURE X.
           02  L003918O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003903C    PICTURE X.
           02  I003903P    PICTURE X.
           02  I003903H    PICTURE X.
           02  I003903V    PICTURE X.
           02  I003903O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003903C    PICTURE X.
           02  L003903P    PICTURE X.
           02  L003903H    PICTURE X.
           02  L003903V    PICTURE X.
           02  L003903O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003912C    PICTURE X.
           02  I003912P    PICTURE X.
           02  I003912H    PICTURE X.
           02  I003912V    PICTURE X.
           02  I003912O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003911C    PICTURE X.
           02  L003911P    PICTURE X.
           02  L003911H    PICTURE X.
           02  L003911V    PICTURE X.
           02  L003911O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003921C    PICTURE X.
           02  I003921P    PICTURE X.
           02  I003921H    PICTURE X.
           02  I003921V    PICTURE X.
           02  I003921O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003919C    PICTURE X.
           02  L003919P    PICTURE X.
           02  L003919H    PICTURE X.
           02  L003919V    PICTURE X.
           02  L003919O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003904C    PICTURE X.
           02  I003904P    PICTURE X.
           02  I003904H    PICTURE X.
           02  I003904V    PICTURE X.
           02  I003904O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003904C    PICTURE X.
           02  L003904P    PICTURE X.
           02  L003904H    PICTURE X.
           02  L003904V    PICTURE X.
           02  L003904O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003913C    PICTURE X.
           02  I003913P    PICTURE X.
           02  I003913H    PICTURE X.
           02  I003913V    PICTURE X.
           02  I003913O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003912C    PICTURE X.
           02  L003912P    PICTURE X.
           02  L003912H    PICTURE X.
           02  L003912V    PICTURE X.
           02  L003912O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003922C    PICTURE X.
           02  I003922P    PICTURE X.
           02  I003922H    PICTURE X.
           02  I003922V    PICTURE X.
           02  I003922O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003920C    PICTURE X.
           02  L003920P    PICTURE X.
           02  L003920H    PICTURE X.
           02  L003920V    PICTURE X.
           02  L003920O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003905C    PICTURE X.
           02  I003905P    PICTURE X.
           02  I003905H    PICTURE X.
           02  I003905V    PICTURE X.
           02  I003905O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003905C    PICTURE X.
           02  L003905P    PICTURE X.
           02  L003905H    PICTURE X.
           02  L003905V    PICTURE X.
           02  L003905O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003914C    PICTURE X.
           02  I003914P    PICTURE X.
           02  I003914H    PICTURE X.
           02  I003914V    PICTURE X.
           02  I003914O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003913C    PICTURE X.
           02  L003913P    PICTURE X.
           02  L003913H    PICTURE X.
           02  L003913V    PICTURE X.
           02  L003913O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003923C    PICTURE X.
           02  I003923P    PICTURE X.
           02  I003923H    PICTURE X.
           02  I003923V    PICTURE X.
           02  I003923O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003921C    PICTURE X.
           02  L003921P    PICTURE X.
           02  L003921H    PICTURE X.
           02  L003921V    PICTURE X.
           02  L003921O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003906C    PICTURE X.
           02  I003906P    PICTURE X.
           02  I003906H    PICTURE X.
           02  I003906V    PICTURE X.
           02  I003906O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003906C    PICTURE X.
           02  L003906P    PICTURE X.
           02  L003906H    PICTURE X.
           02  L003906V    PICTURE X.
           02  L003906O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003915C    PICTURE X.
           02  I003915P    PICTURE X.
           02  I003915H    PICTURE X.
           02  I003915V    PICTURE X.
           02  I003915O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003914C    PICTURE X.
           02  L003914P    PICTURE X.
           02  L003914H    PICTURE X.
           02  L003914V    PICTURE X.
           02  L003914O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003924C    PICTURE X.
           02  I003924P    PICTURE X.
           02  I003924H    PICTURE X.
           02  I003924V    PICTURE X.
           02  I003924O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003922C    PICTURE X.
           02  L003922P    PICTURE X.
           02  L003922H    PICTURE X.
           02  L003922V    PICTURE X.
           02  L003922O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003907C    PICTURE X.
           02  I003907P    PICTURE X.
           02  I003907H    PICTURE X.
           02  I003907V    PICTURE X.
           02  I003907O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003907C    PICTURE X.
           02  L003907P    PICTURE X.
           02  L003907H    PICTURE X.
           02  L003907V    PICTURE X.
           02  L003907O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003916C    PICTURE X.
           02  I003916P    PICTURE X.
           02  I003916H    PICTURE X.
           02  I003916V    PICTURE X.
           02  I003916O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003915C    PICTURE X.
           02  L003915P    PICTURE X.
           02  L003915H    PICTURE X.
           02  L003915V    PICTURE X.
           02  L003915O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003925C    PICTURE X.
           02  I003925P    PICTURE X.
           02  I003925H    PICTURE X.
           02  I003925V    PICTURE X.
           02  I003925O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003923C    PICTURE X.
           02  L003923P    PICTURE X.
           02  L003923H    PICTURE X.
           02  L003923V    PICTURE X.
           02  L003923O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003908C    PICTURE X.
           02  I003908P    PICTURE X.
           02  I003908H    PICTURE X.
           02  I003908V    PICTURE X.
           02  I003908O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003908C    PICTURE X.
           02  L003908P    PICTURE X.
           02  L003908H    PICTURE X.
           02  L003908V    PICTURE X.
           02  L003908O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003917C    PICTURE X.
           02  I003917P    PICTURE X.
           02  I003917H    PICTURE X.
           02  I003917V    PICTURE X.
           02  I003917O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003916C    PICTURE X.
           02  L003916P    PICTURE X.
           02  L003916H    PICTURE X.
           02  L003916V    PICTURE X.
           02  L003916O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003926C    PICTURE X.
           02  I003926P    PICTURE X.
           02  I003926H    PICTURE X.
           02  I003926V    PICTURE X.
           02  I003926O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003924C    PICTURE X.
           02  L003924P    PICTURE X.
           02  L003924H    PICTURE X.
           02  L003924V    PICTURE X.
           02  L003924O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003909C    PICTURE X.
           02  I003909P    PICTURE X.
           02  I003909H    PICTURE X.
           02  I003909V    PICTURE X.
           02  I003909O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003997C    PICTURE X.
           02  L003997P    PICTURE X.
           02  L003997H    PICTURE X.
           02  L003997V    PICTURE X.
           02  L003997O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003918C    PICTURE X.
           02  I003918P    PICTURE X.
           02  I003918H    PICTURE X.
           02  I003918V    PICTURE X.
           02  I003918O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003998C    PICTURE X.
           02  L003998P    PICTURE X.
           02  L003998H    PICTURE X.
           02  L003998V    PICTURE X.
           02  L003998O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  I003927C    PICTURE X.
           02  I003927P    PICTURE X.
           02  I003927H    PICTURE X.
           02  I003927V    PICTURE X.
           02  I003927O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  L003999C    PICTURE X.
           02  L003999P    PICTURE X.
           02  L003999H    PICTURE X.
           02  L003999V    PICTURE X.
           02  L003999O PIC ZZZZZZZZZZZZ9.
           02  FILLER PICTURE X(3).
           02  IMPFS08C    PICTURE X.
           02  IMPFS08P    PICTURE X.
           02  IMPFS08H    PICTURE X.
           02  IMPFS08V    PICTURE X.
           02  IMPFS08O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR08C    PICTURE X.
           02  IMERR08P    PICTURE X.
           02  IMERR08H    PICTURE X.
           02  IMERR08V    PICTURE X.
           02  IMERR08O  PIC X(79).