       01  IMXPM06I.
           02  FILLER PIC X(12).
           02  IM6TRIDL    COMP  PIC  S9(4).
           02  IM6TRIDF    PICTURE X.
           02  FILLER REDEFINES IM6TRIDF.
             03 IM6TRIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6TRIDI  PIC X(4).
           02  IM6DATEL    COMP  PIC  S9(4).
           02  IM6DATEF    PICTURE X.
           02  FILLER REDEFINES IM6DATEF.
             03 IM6DATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6DATEI  PIC X(8).
           02  IM6TIMEL    COMP  PIC  S9(4).
           02  IM6TIMEF    PICTURE X.
           02  FILLER REDEFINES IM6TIMEF.
             03 IM6TIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6TIMEI  PIC X(8).
           02  IM6PRODL    COMP  PIC  S9(4).
           02  IM6PRODF    PICTURE X.
           02  FILLER REDEFINES IM6PRODF.
             03 IM6PRODA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6PRODI  PIC X(3).
           02  IM6CTL1L    COMP  PIC  S9(4).
           02  IM6CTL1F    PICTURE X.
           02  FILLER REDEFINES IM6CTL1F.
             03 IM6CTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6CTL1I  PIC X(2).
           02  IM6CTL2L    COMP  PIC  S9(4).
           02  IM6CTL2F    PICTURE X.
           02  FILLER REDEFINES IM6CTL2F.
             03 IM6CTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6CTL2I  PIC X(3).
           02  IM6CTL3L    COMP  PIC  S9(4).
           02  IM6CTL3F    PICTURE X.
           02  FILLER REDEFINES IM6CTL3F.
             03 IM6CTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6CTL3I  PIC X(3).
           02  IM6ACTNL    COMP  PIC  S9(4).
           02  IM6ACTNF    PICTURE X.
           02  FILLER REDEFINES IM6ACTNF.
             03 IM6ACTNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6ACTNI  PIC X(10).
           02  IM6DISPL    COMP  PIC  S9(4).
           02  IM6DISPF    PICTURE X.
           02  FILLER REDEFINES IM6DISPF.
             03 IM6DISPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6DISPI  PIC X(11).
           02  IM6LINAL    COMP  PIC  S9(4).
           02  IM6LINAF    PICTURE X.
           02  FILLER REDEFINES IM6LINAF.
             03 IM6LINAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINAI  PIC X(77).
           02  IM6LINBL    COMP  PIC  S9(4).
           02  IM6LINBF    PICTURE X.
           02  FILLER REDEFINES IM6LINBF.
             03 IM6LINBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINBI  PIC X(77).
           02  IM6LINCL    COMP  PIC  S9(4).
           02  IM6LINCF    PICTURE X.
           02  FILLER REDEFINES IM6LINCF.
             03 IM6LINCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINCI  PIC X(77).
           02  IM6LINDL    COMP  PIC  S9(4).
           02  IM6LINDF    PICTURE X.
           02  FILLER REDEFINES IM6LINDF.
             03 IM6LINDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINDI  PIC X(77).
           02  IM6LINEL    COMP  PIC  S9(4).
           02  IM6LINEF    PICTURE X.
           02  FILLER REDEFINES IM6LINEF.
             03 IM6LINEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINEI  PIC X(77).
           02  IM6LINFL    COMP  PIC  S9(4).
           02  IM6LINFF    PICTURE X.
           02  FILLER REDEFINES IM6LINFF.
             03 IM6LINFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINFI  PIC X(77).
           02  IM6LINGL    COMP  PIC  S9(4).
           02  IM6LINGF    PICTURE X.
           02  FILLER REDEFINES IM6LINGF.
             03 IM6LINGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINGI  PIC X(77).
           02  IM6LINHL    COMP  PIC  S9(4).
           02  IM6LINHF    PICTURE X.
           02  FILLER REDEFINES IM6LINHF.
             03 IM6LINHA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINHI  PIC X(77).
           02  IM6LINIL    COMP  PIC  S9(4).
           02  IM6LINIF    PICTURE X.
           02  FILLER REDEFINES IM6LINIF.
             03 IM6LINIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINII  PIC X(77).
           02  IM6LINJL    COMP  PIC  S9(4).
           02  IM6LINJF    PICTURE X.
           02  FILLER REDEFINES IM6LINJF.
             03 IM6LINJA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINJI  PIC X(77).
           02  IM6LINKL    COMP  PIC  S9(4).
           02  IM6LINKF    PICTURE X.
           02  FILLER REDEFINES IM6LINKF.
             03 IM6LINKA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINKI  PIC X(77).
           02  IM6LINLL    COMP  PIC  S9(4).
           02  IM6LINLF    PICTURE X.
           02  FILLER REDEFINES IM6LINLF.
             03 IM6LINLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINLI  PIC X(77).
           02  IM6LINML    COMP  PIC  S9(4).
           02  IM6LINMF    PICTURE X.
           02  FILLER REDEFINES IM6LINMF.
             03 IM6LINMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINMI  PIC X(77).
           02  IM6LINNL    COMP  PIC  S9(4).
           02  IM6LINNF    PICTURE X.
           02  FILLER REDEFINES IM6LINNF.
             03 IM6LINNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINNI  PIC X(77).
           02  IM6LINOL    COMP  PIC  S9(4).
           02  IM6LINOF    PICTURE X.
           02  FILLER REDEFINES IM6LINOF.
             03 IM6LINOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM6LINOI  PIC X(77).
           02  IMENTERL    COMP  PIC  S9(4).
           02  IMENTERF    PICTURE X.
           02  FILLER REDEFINES IMENTERF.
             03 IMENTERA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMENTERI  PIC X(70).
           02  IMPFS06L    COMP  PIC  S9(4).
           02  IMPFS06F    PICTURE X.
           02  FILLER REDEFINES IMPFS06F.
             03 IMPFS06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS06I  PIC X(79).
           02  IMERR06L    COMP  PIC  S9(4).
           02  IMERR06F    PICTURE X.
           02  FILLER REDEFINES IMERR06F.
             03 IMERR06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR06I  PIC X(79).
       01  IMXPM06O REDEFINES IMXPM06I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM6TRIDC    PICTURE X.
           02  IM6TRIDP    PICTURE X.
           02  IM6TRIDH    PICTURE X.
           02  IM6TRIDV    PICTURE X.
           02  IM6TRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IM6DATEC    PICTURE X.
           02  IM6DATEP    PICTURE X.
           02  IM6DATEH    PICTURE X.
           02  IM6DATEV    PICTURE X.
           02  IM6DATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IM6TIMEC    PICTURE X.
           02  IM6TIMEP    PICTURE X.
           02  IM6TIMEH    PICTURE X.
           02  IM6TIMEV    PICTURE X.
           02  IM6TIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IM6PRODC    PICTURE X.
           02  IM6PRODP    PICTURE X.
           02  IM6PRODH    PICTURE X.
           02  IM6PRODV    PICTURE X.
           02  IM6PRODO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM6CTL1C    PICTURE X.
           02  IM6CTL1P    PICTURE X.
           02  IM6CTL1H    PICTURE X.
           02  IM6CTL1V    PICTURE X.
           02  IM6CTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IM6CTL2C    PICTURE X.
           02  IM6CTL2P    PICTURE X.
           02  IM6CTL2H    PICTURE X.
           02  IM6CTL2V    PICTURE X.
           02  IM6CTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM6CTL3C    PICTURE X.
           02  IM6CTL3P    PICTURE X.
           02  IM6CTL3H    PICTURE X.
           02  IM6CTL3V    PICTURE X.
           02  IM6CTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM6ACTNC    PICTURE X.
           02  IM6ACTNP    PICTURE X.
           02  IM6ACTNH    PICTURE X.
           02  IM6ACTNV    PICTURE X.
           02  IM6ACTNO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  IM6DISPC    PICTURE X.
           02  IM6DISPP    PICTURE X.
           02  IM6DISPH    PICTURE X.
           02  IM6DISPV    PICTURE X.
           02  IM6DISPO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  IM6LINAC    PICTURE X.
           02  IM6LINAP    PICTURE X.
           02  IM6LINAH    PICTURE X.
           02  IM6LINAV    PICTURE X.
           02  IM6LINAO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINBC    PICTURE X.
           02  IM6LINBP    PICTURE X.
           02  IM6LINBH    PICTURE X.
           02  IM6LINBV    PICTURE X.
           02  IM6LINBO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINCC    PICTURE X.
           02  IM6LINCP    PICTURE X.
           02  IM6LINCH    PICTURE X.
           02  IM6LINCV    PICTURE X.
           02  IM6LINCO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINDC    PICTURE X.
           02  IM6LINDP    PICTURE X.
           02  IM6LINDH    PICTURE X.
           02  IM6LINDV    PICTURE X.
           02  IM6LINDO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINEC    PICTURE X.
           02  IM6LINEP    PICTURE X.
           02  IM6LINEH    PICTURE X.
           02  IM6LINEV    PICTURE X.
           02  IM6LINEO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINFC    PICTURE X.
           02  IM6LINFP    PICTURE X.
           02  IM6LINFH    PICTURE X.
           02  IM6LINFV    PICTURE X.
           02  IM6LINFO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINGC    PICTURE X.
           02  IM6LINGP    PICTURE X.
           02  IM6LINGH    PICTURE X.
           02  IM6LINGV    PICTURE X.
           02  IM6LINGO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINHC    PICTURE X.
           02  IM6LINHP    PICTURE X.
           02  IM6LINHH    PICTURE X.
           02  IM6LINHV    PICTURE X.
           02  IM6LINHO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINIC    PICTURE X.
           02  IM6LINIP    PICTURE X.
           02  IM6LINIH    PICTURE X.
           02  IM6LINIV    PICTURE X.
           02  IM6LINIO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINJC    PICTURE X.
           02  IM6LINJP    PICTURE X.
           02  IM6LINJH    PICTURE X.
           02  IM6LINJV    PICTURE X.
           02  IM6LINJO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINKC    PICTURE X.
           02  IM6LINKP    PICTURE X.
           02  IM6LINKH    PICTURE X.
           02  IM6LINKV    PICTURE X.
           02  IM6LINKO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINLC    PICTURE X.
           02  IM6LINLP    PICTURE X.
           02  IM6LINLH    PICTURE X.
           02  IM6LINLV    PICTURE X.
           02  IM6LINLO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINMC    PICTURE X.
           02  IM6LINMP    PICTURE X.
           02  IM6LINMH    PICTURE X.
           02  IM6LINMV    PICTURE X.
           02  IM6LINMO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINNC    PICTURE X.
           02  IM6LINNP    PICTURE X.
           02  IM6LINNH    PICTURE X.
           02  IM6LINNV    PICTURE X.
           02  IM6LINNO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IM6LINOC    PICTURE X.
           02  IM6LINOP    PICTURE X.
           02  IM6LINOH    PICTURE X.
           02  IM6LINOV    PICTURE X.
           02  IM6LINOO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  IMENTERC    PICTURE X.
           02  IMENTERP    PICTURE X.
           02  IMENTERH    PICTURE X.
           02  IMENTERV    PICTURE X.
           02  IMENTERO  PIC X(70).
           02  FILLER PICTURE X(3).
           02  IMPFS06C    PICTURE X.
           02  IMPFS06P    PICTURE X.
           02  IMPFS06H    PICTURE X.
           02  IMPFS06V    PICTURE X.
           02  IMPFS06O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR06C    PICTURE X.
           02  IMERR06P    PICTURE X.
           02  IMERR06H    PICTURE X.
           02  IMERR06V    PICTURE X.
           02  IMERR06O  PIC X(79).
       01  IMXPM01I REDEFINES IMXPM06I.
           02  FILLER PIC X(12).
           02  IMXTRIDL    COMP  PIC  S9(4).
           02  IMXTRIDF    PICTURE X.
           02  FILLER REDEFINES IMXTRIDF.
             03 IMXTRIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXTRIDI  PIC X(4).
           02  IMXDATEL    COMP  PIC  S9(4).
           02  IMXDATEF    PICTURE X.
           02  FILLER REDEFINES IMXDATEF.
             03 IMXDATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXDATEI  PIC X(8).
           02  IMXTIMEL    COMP  PIC  S9(4).
           02  IMXTIMEF    PICTURE X.
           02  FILLER REDEFINES IMXTIMEF.
             03 IMXTIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXTIMEI  PIC X(8).
           02  IMXPRODL    COMP  PIC  S9(4).
           02  IMXPRODF    PICTURE X.
           02  FILLER REDEFINES IMXPRODF.
             03 IMXPRODA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPRODI  PIC X(3).
           02  IMXCTL1L    COMP  PIC  S9(4).
           02  IMXCTL1F    PICTURE X.
           02  FILLER REDEFINES IMXCTL1F.
             03 IMXCTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL1I  PIC X(2).
           02  IMXCTL2L    COMP  PIC  S9(4).
           02  IMXCTL2F    PICTURE X.
           02  FILLER REDEFINES IMXCTL2F.
             03 IMXCTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL2I  PIC X(3).
           02  IMXCTL3L    COMP  PIC  S9(4).
           02  IMXCTL3F    PICTURE X.
           02  FILLER REDEFINES IMXCTL3F.
             03 IMXCTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXCTL3I  PIC X(3).
           02  IMXACTNL    COMP  PIC  S9(4).
           02  IMXACTNF    PICTURE X.
           02  FILLER REDEFINES IMXACTNF.
             03 IMXACTNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXACTNI  PIC X(1).
           02  IMXDISPL    COMP  PIC  S9(4).
           02  IMXDISPF    PICTURE X.
           02  FILLER REDEFINES IMXDISPF.
             03 IMXDISPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXDISPI  PIC X(1).
           02  IM1ISLOL    COMP  PIC  S9(4).
           02  IM1ISLOF    PICTURE X.
           02  FILLER REDEFINES IM1ISLOF.
             03 IM1ISLOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM1ISLOI  PIC X(1).
           02  IM1MMDAL    COMP  PIC  S9(4).
           02  IM1MMDAF    PICTURE X.
           02  FILLER REDEFINES IM1MMDAF.
             03 IM1MMDAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM1MMDAI  PIC X(1).
           02  IM1SPLTL    COMP  PIC  S9(4).
           02  IM1SPLTF    PICTURE X.
           02  FILLER REDEFINES IM1SPLTF.
             03 IM1SPLTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM1SPLTI  PIC X(1).
           02  IM1PRMLL    COMP  PIC  S9(4).
           02  IM1PRMLF    PICTURE X.
           02  FILLER REDEFINES IM1PRMLF.
             03 IM1PRMLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM1PRMLI  PIC X(1).
           02  IMXSTR2L    COMP  PIC  S9(4).
           02  IMXSTR2F    PICTURE X.
           02  FILLER REDEFINES IMXSTR2F.
             03 IMXSTR2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXSTR2I  PIC X(3).
           02  IMXSTR3L    COMP  PIC  S9(4).
           02  IMXSTR3F    PICTURE X.
           02  FILLER REDEFINES IMXSTR3F.
             03 IMXSTR3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXSTR3I  PIC X(3).
           02  IMXEND2L    COMP  PIC  S9(4).
           02  IMXEND2F    PICTURE X.
           02  FILLER REDEFINES IMXEND2F.
             03 IMXEND2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXEND2I  PIC X(3).
           02  IMXEND3L    COMP  PIC  S9(4).
           02  IMXEND3F    PICTURE X.
           02  FILLER REDEFINES IMXEND3F.
             03 IMXEND3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXEND3I  PIC X(3).
           02  IMXLS01L    COMP  PIC  S9(4).
           02  IMXLS01F    PICTURE X.
           02  FILLER REDEFINES IMXLS01F.
             03 IMXLS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS01I  PIC X(3).
           02  IMXLS02L    COMP  PIC  S9(4).
           02  IMXLS02F    PICTURE X.
           02  FILLER REDEFINES IMXLS02F.
             03 IMXLS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS02I  PIC X(3).
           02  IMXLS03L    COMP  PIC  S9(4).
           02  IMXLS03F    PICTURE X.
           02  FILLER REDEFINES IMXLS03F.
             03 IMXLS03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS03I  PIC X(3).
           02  IMXLS04L    COMP  PIC  S9(4).
           02  IMXLS04F    PICTURE X.
           02  FILLER REDEFINES IMXLS04F.
             03 IMXLS04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS04I  PIC X(3).
           02  IMXLS05L    COMP  PIC  S9(4).
           02  IMXLS05F    PICTURE X.
           02  FILLER REDEFINES IMXLS05F.
             03 IMXLS05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS05I  PIC X(3).
           02  IMXLS06L    COMP  PIC  S9(4).
           02  IMXLS06F    PICTURE X.
           02  FILLER REDEFINES IMXLS06F.
             03 IMXLS06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS06I  PIC X(3).
           02  IMXLS07L    COMP  PIC  S9(4).
           02  IMXLS07F    PICTURE X.
           02  FILLER REDEFINES IMXLS07F.
             03 IMXLS07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS07I  PIC X(3).
           02  IMXLS08L    COMP  PIC  S9(4).
           02  IMXLS08F    PICTURE X.
           02  FILLER REDEFINES IMXLS08F.
             03 IMXLS08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS08I  PIC X(3).
           02  IMXLS09L    COMP  PIC  S9(4).
           02  IMXLS09F    PICTURE X.
           02  FILLER REDEFINES IMXLS09F.
             03 IMXLS09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS09I  PIC X(3).
           02  IMXLS10L    COMP  PIC  S9(4).
           02  IMXLS10F    PICTURE X.
           02  FILLER REDEFINES IMXLS10F.
             03 IMXLS10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS10I  PIC X(3).
           02  IMXLS11L    COMP  PIC  S9(4).
           02  IMXLS11F    PICTURE X.
           02  FILLER REDEFINES IMXLS11F.
             03 IMXLS11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS11I  PIC X(3).
           02  IMXLS12L    COMP  PIC  S9(4).
           02  IMXLS12F    PICTURE X.
           02  FILLER REDEFINES IMXLS12F.
             03 IMXLS12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS12I  PIC X(3).
           02  IMXLS13L    COMP  PIC  S9(4).
           02  IMXLS13F    PICTURE X.
           02  FILLER REDEFINES IMXLS13F.
             03 IMXLS13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS13I  PIC X(3).
           02  IMXLS14L    COMP  PIC  S9(4).
           02  IMXLS14F    PICTURE X.
           02  FILLER REDEFINES IMXLS14F.
             03 IMXLS14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS14I  PIC X(3).
           02  IMXLS15L    COMP  PIC  S9(4).
           02  IMXLS15F    PICTURE X.
           02  FILLER REDEFINES IMXLS15F.
             03 IMXLS15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS15I  PIC X(3).
           02  IMXLS16L    COMP  PIC  S9(4).
           02  IMXLS16F    PICTURE X.
           02  FILLER REDEFINES IMXLS16F.
             03 IMXLS16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS16I  PIC X(3).
           02  IMXLS17L    COMP  PIC  S9(4).
           02  IMXLS17F    PICTURE X.
           02  FILLER REDEFINES IMXLS17F.
             03 IMXLS17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS17I  PIC X(3).
           02  IMXLS18L    COMP  PIC  S9(4).
           02  IMXLS18F    PICTURE X.
           02  FILLER REDEFINES IMXLS18F.
             03 IMXLS18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS18I  PIC X(3).
           02  IMXLS19L    COMP  PIC  S9(4).
           02  IMXLS19F    PICTURE X.
           02  FILLER REDEFINES IMXLS19F.
             03 IMXLS19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS19I  PIC X(3).
           02  IMXLS20L    COMP  PIC  S9(4).
           02  IMXLS20F    PICTURE X.
           02  FILLER REDEFINES IMXLS20F.
             03 IMXLS20A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS20I  PIC X(3).
           02  IMXLS21L    COMP  PIC  S9(4).
           02  IMXLS21F    PICTURE X.
           02  FILLER REDEFINES IMXLS21F.
             03 IMXLS21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS21I  PIC X(3).
           02  IMXLS22L    COMP  PIC  S9(4).
           02  IMXLS22F    PICTURE X.
           02  FILLER REDEFINES IMXLS22F.
             03 IMXLS22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS22I  PIC X(3).
           02  IMXLS23L    COMP  PIC  S9(4).
           02  IMXLS23F    PICTURE X.
           02  FILLER REDEFINES IMXLS23F.
             03 IMXLS23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS23I  PIC X(3).
           02  IMXLS24L    COMP  PIC  S9(4).
           02  IMXLS24F    PICTURE X.
           02  FILLER REDEFINES IMXLS24F.
             03 IMXLS24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS24I  PIC X(3).
           02  IMXLS25L    COMP  PIC  S9(4).
           02  IMXLS25F    PICTURE X.
           02  FILLER REDEFINES IMXLS25F.
             03 IMXLS25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS25I  PIC X(3).
           02  IMXLS26L    COMP  PIC  S9(4).
           02  IMXLS26F    PICTURE X.
           02  FILLER REDEFINES IMXLS26F.
             03 IMXLS26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS26I  PIC X(3).
           02  IMXLS27L    COMP  PIC  S9(4).
           02  IMXLS27F    PICTURE X.
           02  FILLER REDEFINES IMXLS27F.
             03 IMXLS27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS27I  PIC X(3).
           02  IMXLS28L    COMP  PIC  S9(4).
           02  IMXLS28F    PICTURE X.
           02  FILLER REDEFINES IMXLS28F.
             03 IMXLS28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS28I  PIC X(3).
           02  IMXLS29L    COMP  PIC  S9(4).
           02  IMXLS29F    PICTURE X.
           02  FILLER REDEFINES IMXLS29F.
             03 IMXLS29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS29I  PIC X(3).
           02  IMXLS30L    COMP  PIC  S9(4).
           02  IMXLS30F    PICTURE X.
           02  FILLER REDEFINES IMXLS30F.
             03 IMXLS30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS30I  PIC X(3).
           02  IMXLS31L    COMP  PIC  S9(4).
           02  IMXLS31F    PICTURE X.
           02  FILLER REDEFINES IMXLS31F.
             03 IMXLS31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS31I  PIC X(3).
           02  IMXLS32L    COMP  PIC  S9(4).
           02  IMXLS32F    PICTURE X.
           02  FILLER REDEFINES IMXLS32F.
             03 IMXLS32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS32I  PIC X(3).
           02  IMXLS33L    COMP  PIC  S9(4).
           02  IMXLS33F    PICTURE X.
           02  FILLER REDEFINES IMXLS33F.
             03 IMXLS33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS33I  PIC X(3).
           02  IMXLS34L    COMP  PIC  S9(4).
           02  IMXLS34F    PICTURE X.
           02  FILLER REDEFINES IMXLS34F.
             03 IMXLS34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS34I  PIC X(3).
           02  IMXLS35L    COMP  PIC  S9(4).
           02  IMXLS35F    PICTURE X.
           02  FILLER REDEFINES IMXLS35F.
             03 IMXLS35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS35I  PIC X(3).
           02  IMXLS36L    COMP  PIC  S9(4).
           02  IMXLS36F    PICTURE X.
           02  FILLER REDEFINES IMXLS36F.
             03 IMXLS36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS36I  PIC X(3).
           02  IMXLS37L    COMP  PIC  S9(4).
           02  IMXLS37F    PICTURE X.
           02  FILLER REDEFINES IMXLS37F.
             03 IMXLS37A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS37I  PIC X(3).
           02  IMXLS38L    COMP  PIC  S9(4).
           02  IMXLS38F    PICTURE X.
           02  FILLER REDEFINES IMXLS38F.
             03 IMXLS38A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS38I  PIC X(3).
           02  IMXLS39L    COMP  PIC  S9(4).
           02  IMXLS39F    PICTURE X.
           02  FILLER REDEFINES IMXLS39F.
             03 IMXLS39A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS39I  PIC X(3).
           02  IMXLS40L    COMP  PIC  S9(4).
           02  IMXLS40F    PICTURE X.
           02  FILLER REDEFINES IMXLS40F.
             03 IMXLS40A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXLS40I  PIC X(3).
           02  IMXSTRPL    COMP  PIC  S9(4).
           02  IMXSTRPF    PICTURE X.
           02  FILLER REDEFINES IMXSTRPF.
             03 IMXSTRPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXSTRPI  PIC X(3).
           02  IMXENDPL    COMP  PIC  S9(4).
           02  IMXENDPF    PICTURE X.
           02  FILLER REDEFINES IMXENDPF.
             03 IMXENDPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXENDPI  PIC X(3).
           02  IMXPR01L    COMP  PIC  S9(4).
           02  IMXPR01F    PICTURE X.
           02  FILLER REDEFINES IMXPR01F.
             03 IMXPR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR01I  PIC X(3).
           02  IMXPR02L    COMP  PIC  S9(4).
           02  IMXPR02F    PICTURE X.
           02  FILLER REDEFINES IMXPR02F.
             03 IMXPR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR02I  PIC X(3).
           02  IMXPR03L    COMP  PIC  S9(4).
           02  IMXPR03F    PICTURE X.
           02  FILLER REDEFINES IMXPR03F.
             03 IMXPR03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR03I  PIC X(3).
           02  IMXPR04L    COMP  PIC  S9(4).
           02  IMXPR04F    PICTURE X.
           02  FILLER REDEFINES IMXPR04F.
             03 IMXPR04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR04I  PIC X(3).
           02  IMXPR05L    COMP  PIC  S9(4).
           02  IMXPR05F    PICTURE X.
           02  FILLER REDEFINES IMXPR05F.
             03 IMXPR05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR05I  PIC X(3).
           02  IMXPR06L    COMP  PIC  S9(4).
           02  IMXPR06F    PICTURE X.
           02  FILLER REDEFINES IMXPR06F.
             03 IMXPR06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR06I  PIC X(3).
           02  IMXPR07L    COMP  PIC  S9(4).
           02  IMXPR07F    PICTURE X.
           02  FILLER REDEFINES IMXPR07F.
             03 IMXPR07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR07I  PIC X(3).
           02  IMXPR08L    COMP  PIC  S9(4).
           02  IMXPR08F    PICTURE X.
           02  FILLER REDEFINES IMXPR08F.
             03 IMXPR08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR08I  PIC X(3).
           02  IMXPR09L    COMP  PIC  S9(4).
           02  IMXPR09F    PICTURE X.
           02  FILLER REDEFINES IMXPR09F.
             03 IMXPR09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR09I  PIC X(3).
           02  IMXPR10L    COMP  PIC  S9(4).
           02  IMXPR10F    PICTURE X.
           02  FILLER REDEFINES IMXPR10F.
             03 IMXPR10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR10I  PIC X(3).
           02  IMXPR11L    COMP  PIC  S9(4).
           02  IMXPR11F    PICTURE X.
           02  FILLER REDEFINES IMXPR11F.
             03 IMXPR11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR11I  PIC X(3).
           02  IMXPR12L    COMP  PIC  S9(4).
           02  IMXPR12F    PICTURE X.
           02  FILLER REDEFINES IMXPR12F.
             03 IMXPR12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR12I  PIC X(3).
           02  IMXPR13L    COMP  PIC  S9(4).
           02  IMXPR13F    PICTURE X.
           02  FILLER REDEFINES IMXPR13F.
             03 IMXPR13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR13I  PIC X(3).
           02  IMXPR14L    COMP  PIC  S9(4).
           02  IMXPR14F    PICTURE X.
           02  FILLER REDEFINES IMXPR14F.
             03 IMXPR14A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR14I  PIC X(3).
           02  IMXPR15L    COMP  PIC  S9(4).
           02  IMXPR15F    PICTURE X.
           02  FILLER REDEFINES IMXPR15F.
             03 IMXPR15A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR15I  PIC X(3).
           02  IMXPR16L    COMP  PIC  S9(4).
           02  IMXPR16F    PICTURE X.
           02  FILLER REDEFINES IMXPR16F.
             03 IMXPR16A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR16I  PIC X(3).
           02  IMXPR17L    COMP  PIC  S9(4).
           02  IMXPR17F    PICTURE X.
           02  FILLER REDEFINES IMXPR17F.
             03 IMXPR17A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR17I  PIC X(3).
           02  IMXPR18L    COMP  PIC  S9(4).
           02  IMXPR18F    PICTURE X.
           02  FILLER REDEFINES IMXPR18F.
             03 IMXPR18A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR18I  PIC X(3).
           02  IMXPR19L    COMP  PIC  S9(4).
           02  IMXPR19F    PICTURE X.
           02  FILLER REDEFINES IMXPR19F.
             03 IMXPR19A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR19I  PIC X(3).
           02  IMXPR20L    COMP  PIC  S9(4).
           02  IMXPR20F    PICTURE X.
           02  FILLER REDEFINES IMXPR20F.
             03 IMXPR20A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR20I  PIC X(3).
           02  IMXPR21L    COMP  PIC  S9(4).
           02  IMXPR21F    PICTURE X.
           02  FILLER REDEFINES IMXPR21F.
             03 IMXPR21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR21I  PIC X(3).
           02  IMXPR22L    COMP  PIC  S9(4).
           02  IMXPR22F    PICTURE X.
           02  FILLER REDEFINES IMXPR22F.
             03 IMXPR22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR22I  PIC X(3).
           02  IMXPR23L    COMP  PIC  S9(4).
           02  IMXPR23F    PICTURE X.
           02  FILLER REDEFINES IMXPR23F.
             03 IMXPR23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR23I  PIC X(3).
           02  IMXPR24L    COMP  PIC  S9(4).
           02  IMXPR24F    PICTURE X.
           02  FILLER REDEFINES IMXPR24F.
             03 IMXPR24A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR24I  PIC X(3).
           02  IMXPR25L    COMP  PIC  S9(4).
           02  IMXPR25F    PICTURE X.
           02  FILLER REDEFINES IMXPR25F.
             03 IMXPR25A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR25I  PIC X(3).
           02  IMXPR26L    COMP  PIC  S9(4).
           02  IMXPR26F    PICTURE X.
           02  FILLER REDEFINES IMXPR26F.
             03 IMXPR26A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR26I  PIC X(3).
           02  IMXPR27L    COMP  PIC  S9(4).
           02  IMXPR27F    PICTURE X.
           02  FILLER REDEFINES IMXPR27F.
             03 IMXPR27A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR27I  PIC X(3).
           02  IMXPR28L    COMP  PIC  S9(4).
           02  IMXPR28F    PICTURE X.
           02  FILLER REDEFINES IMXPR28F.
             03 IMXPR28A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR28I  PIC X(3).
           02  IMXPR29L    COMP  PIC  S9(4).
           02  IMXPR29F    PICTURE X.
           02  FILLER REDEFINES IMXPR29F.
             03 IMXPR29A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR29I  PIC X(3).
           02  IMXPR30L    COMP  PIC  S9(4).
           02  IMXPR30F    PICTURE X.
           02  FILLER REDEFINES IMXPR30F.
             03 IMXPR30A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR30I  PIC X(3).
           02  IMXPR31L    COMP  PIC  S9(4).
           02  IMXPR31F    PICTURE X.
           02  FILLER REDEFINES IMXPR31F.
             03 IMXPR31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR31I  PIC X(3).
           02  IMXPR32L    COMP  PIC  S9(4).
           02  IMXPR32F    PICTURE X.
           02  FILLER REDEFINES IMXPR32F.
             03 IMXPR32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR32I  PIC X(3).
           02  IMXPR33L    COMP  PIC  S9(4).
           02  IMXPR33F    PICTURE X.
           02  FILLER REDEFINES IMXPR33F.
             03 IMXPR33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR33I  PIC X(3).
           02  IMXPR34L    COMP  PIC  S9(4).
           02  IMXPR34F    PICTURE X.
           02  FILLER REDEFINES IMXPR34F.
             03 IMXPR34A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR34I  PIC X(3).
           02  IMXPR35L    COMP  PIC  S9(4).
           02  IMXPR35F    PICTURE X.
           02  FILLER REDEFINES IMXPR35F.
             03 IMXPR35A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR35I  PIC X(3).
           02  IMXPR36L    COMP  PIC  S9(4).
           02  IMXPR36F    PICTURE X.
           02  FILLER REDEFINES IMXPR36F.
             03 IMXPR36A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR36I  PIC X(3).
           02  IMXPR37L    COMP  PIC  S9(4).
           02  IMXPR37F    PICTURE X.
           02  FILLER REDEFINES IMXPR37F.
             03 IMXPR37A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR37I  PIC X(3).
           02  IMXPR38L    COMP  PIC  S9(4).
           02  IMXPR38F    PICTURE X.
           02  FILLER REDEFINES IMXPR38F.
             03 IMXPR38A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR38I  PIC X(3).
           02  IMXPR39L    COMP  PIC  S9(4).
           02  IMXPR39F    PICTURE X.
           02  FILLER REDEFINES IMXPR39F.
             03 IMXPR39A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR39I  PIC X(3).
           02  IMXPR40L    COMP  PIC  S9(4).
           02  IMXPR40F    PICTURE X.
           02  FILLER REDEFINES IMXPR40F.
             03 IMXPR40A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMXPR40I  PIC X(3).
           02  IMPFS01L    COMP  PIC  S9(4).
           02  IMPFS01F    PICTURE X.
           02  FILLER REDEFINES IMPFS01F.
             03 IMPFS01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS01I  PIC X(79).
           02  IMERR01L    COMP  PIC  S9(4).
           02  IMERR01F    PICTURE X.
           02  FILLER REDEFINES IMERR01F.
             03 IMERR01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR01I  PIC X(79).
       01  IMXPM01O REDEFINES IMXPM01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IMXTRIDC    PICTURE X.
           02  IMXTRIDP    PICTURE X.
           02  IMXTRIDH    PICTURE X.
           02  IMXTRIDV    PICTURE X.
           02  IMXTRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IMXDATEC    PICTURE X.
           02  IMXDATEP    PICTURE X.
           02  IMXDATEH    PICTURE X.
           02  IMXDATEV    PICTURE X.
           02  IMXDATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IMXTIMEC    PICTURE X.
           02  IMXTIMEP    PICTURE X.
           02  IMXTIMEH    PICTURE X.
           02  IMXTIMEV    PICTURE X.
           02  IMXTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IMXPRODC    PICTURE X.
           02  IMXPRODP    PICTURE X.
           02  IMXPRODH    PICTURE X.
           02  IMXPRODV    PICTURE X.
           02  IMXPRODO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL1C    PICTURE X.
           02  IMXCTL1P    PICTURE X.
           02  IMXCTL1H    PICTURE X.
           02  IMXCTL1V    PICTURE X.
           02  IMXCTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IMXCTL2C    PICTURE X.
           02  IMXCTL2P    PICTURE X.
           02  IMXCTL2H    PICTURE X.
           02  IMXCTL2V    PICTURE X.
           02  IMXCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXCTL3C    PICTURE X.
           02  IMXCTL3P    PICTURE X.
           02  IMXCTL3H    PICTURE X.
           02  IMXCTL3V    PICTURE X.
           02  IMXCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXACTNC    PICTURE X.
           02  IMXACTNP    PICTURE X.
           02  IMXACTNH    PICTURE X.
           02  IMXACTNV    PICTURE X.
           02  IMXACTNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMXDISPC    PICTURE X.
           02  IMXDISPP    PICTURE X.
           02  IMXDISPH    PICTURE X.
           02  IMXDISPV    PICTURE X.
           02  IMXDISPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM1ISLOC    PICTURE X.
           02  IM1ISLOP    PICTURE X.
           02  IM1ISLOH    PICTURE X.
           02  IM1ISLOV    PICTURE X.
           02  IM1ISLOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM1MMDAC    PICTURE X.
           02  IM1MMDAP    PICTURE X.
           02  IM1MMDAH    PICTURE X.
           02  IM1MMDAV    PICTURE X.
           02  IM1MMDAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM1SPLTC    PICTURE X.
           02  IM1SPLTP    PICTURE X.
           02  IM1SPLTH    PICTURE X.
           02  IM1SPLTV    PICTURE X.
           02  IM1SPLTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM1PRMLC    PICTURE X.
           02  IM1PRMLP    PICTURE X.
           02  IM1PRMLH    PICTURE X.
           02  IM1PRMLV    PICTURE X.
           02  IM1PRMLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMXSTR2C    PICTURE X.
           02  IMXSTR2P    PICTURE X.
           02  IMXSTR2H    PICTURE X.
           02  IMXSTR2V    PICTURE X.
           02  IMXSTR2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXSTR3C    PICTURE X.
           02  IMXSTR3P    PICTURE X.
           02  IMXSTR3H    PICTURE X.
           02  IMXSTR3V    PICTURE X.
           02  IMXSTR3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXEND2C    PICTURE X.
           02  IMXEND2P    PICTURE X.
           02  IMXEND2H    PICTURE X.
           02  IMXEND2V    PICTURE X.
           02  IMXEND2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXEND3C    PICTURE X.
           02  IMXEND3P    PICTURE X.
           02  IMXEND3H    PICTURE X.
           02  IMXEND3V    PICTURE X.
           02  IMXEND3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS01C    PICTURE X.
           02  IMXLS01P    PICTURE X.
           02  IMXLS01H    PICTURE X.
           02  IMXLS01V    PICTURE X.
           02  IMXLS01O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS02C    PICTURE X.
           02  IMXLS02P    PICTURE X.
           02  IMXLS02H    PICTURE X.
           02  IMXLS02V    PICTURE X.
           02  IMXLS02O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS03C    PICTURE X.
           02  IMXLS03P    PICTURE X.
           02  IMXLS03H    PICTURE X.
           02  IMXLS03V    PICTURE X.
           02  IMXLS03O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS04C    PICTURE X.
           02  IMXLS04P    PICTURE X.
           02  IMXLS04H    PICTURE X.
           02  IMXLS04V    PICTURE X.
           02  IMXLS04O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS05C    PICTURE X.
           02  IMXLS05P    PICTURE X.
           02  IMXLS05H    PICTURE X.
           02  IMXLS05V    PICTURE X.
           02  IMXLS05O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS06C    PICTURE X.
           02  IMXLS06P    PICTURE X.
           02  IMXLS06H    PICTURE X.
           02  IMXLS06V    PICTURE X.
           02  IMXLS06O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS07C    PICTURE X.
           02  IMXLS07P    PICTURE X.
           02  IMXLS07H    PICTURE X.
           02  IMXLS07V    PICTURE X.
           02  IMXLS07O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS08C    PICTURE X.
           02  IMXLS08P    PICTURE X.
           02  IMXLS08H    PICTURE X.
           02  IMXLS08V    PICTURE X.
           02  IMXLS08O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS09C    PICTURE X.
           02  IMXLS09P    PICTURE X.
           02  IMXLS09H    PICTURE X.
           02  IMXLS09V    PICTURE X.
           02  IMXLS09O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS10C    PICTURE X.
           02  IMXLS10P    PICTURE X.
           02  IMXLS10H    PICTURE X.
           02  IMXLS10V    PICTURE X.
           02  IMXLS10O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS11C    PICTURE X.
           02  IMXLS11P    PICTURE X.
           02  IMXLS11H    PICTURE X.
           02  IMXLS11V    PICTURE X.
           02  IMXLS11O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS12C    PICTURE X.
           02  IMXLS12P    PICTURE X.
           02  IMXLS12H    PICTURE X.
           02  IMXLS12V    PICTURE X.
           02  IMXLS12O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS13C    PICTURE X.
           02  IMXLS13P    PICTURE X.
           02  IMXLS13H    PICTURE X.
           02  IMXLS13V    PICTURE X.
           02  IMXLS13O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS14C    PICTURE X.
           02  IMXLS14P    PICTURE X.
           02  IMXLS14H    PICTURE X.
           02  IMXLS14V    PICTURE X.
           02  IMXLS14O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS15C    PICTURE X.
           02  IMXLS15P    PICTURE X.
           02  IMXLS15H    PICTURE X.
           02  IMXLS15V    PICTURE X.
           02  IMXLS15O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS16C    PICTURE X.
           02  IMXLS16P    PICTURE X.
           02  IMXLS16H    PICTURE X.
           02  IMXLS16V    PICTURE X.
           02  IMXLS16O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS17C    PICTURE X.
           02  IMXLS17P    PICTURE X.
           02  IMXLS17H    PICTURE X.
           02  IMXLS17V    PICTURE X.
           02  IMXLS17O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS18C    PICTURE X.
           02  IMXLS18P    PICTURE X.
           02  IMXLS18H    PICTURE X.
           02  IMXLS18V    PICTURE X.
           02  IMXLS18O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS19C    PICTURE X.
           02  IMXLS19P    PICTURE X.
           02  IMXLS19H    PICTURE X.
           02  IMXLS19V    PICTURE X.
           02  IMXLS19O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS20C    PICTURE X.
           02  IMXLS20P    PICTURE X.
           02  IMXLS20H    PICTURE X.
           02  IMXLS20V    PICTURE X.
           02  IMXLS20O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS21C    PICTURE X.
           02  IMXLS21P    PICTURE X.
           02  IMXLS21H    PICTURE X.
           02  IMXLS21V    PICTURE X.
           02  IMXLS21O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS22C    PICTURE X.
           02  IMXLS22P    PICTURE X.
           02  IMXLS22H    PICTURE X.
           02  IMXLS22V    PICTURE X.
           02  IMXLS22O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS23C    PICTURE X.
           02  IMXLS23P    PICTURE X.
           02  IMXLS23H    PICTURE X.
           02  IMXLS23V    PICTURE X.
           02  IMXLS23O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS24C    PICTURE X.
           02  IMXLS24P    PICTURE X.
           02  IMXLS24H    PICTURE X.
           02  IMXLS24V    PICTURE X.
           02  IMXLS24O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS25C    PICTURE X.
           02  IMXLS25P    PICTURE X.
           02  IMXLS25H    PICTURE X.
           02  IMXLS25V    PICTURE X.
           02  IMXLS25O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS26C    PICTURE X.
           02  IMXLS26P    PICTURE X.
           02  IMXLS26H    PICTURE X.
           02  IMXLS26V    PICTURE X.
           02  IMXLS26O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS27C    PICTURE X.
           02  IMXLS27P    PICTURE X.
           02  IMXLS27H    PICTURE X.
           02  IMXLS27V    PICTURE X.
           02  IMXLS27O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS28C    PICTURE X.
           02  IMXLS28P    PICTURE X.
           02  IMXLS28H    PICTURE X.
           02  IMXLS28V    PICTURE X.
           02  IMXLS28O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS29C    PICTURE X.
           02  IMXLS29P    PICTURE X.
           02  IMXLS29H    PICTURE X.
           02  IMXLS29V    PICTURE X.
           02  IMXLS29O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS30C    PICTURE X.
           02  IMXLS30P    PICTURE X.
           02  IMXLS30H    PICTURE X.
           02  IMXLS30V    PICTURE X.
           02  IMXLS30O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS31C    PICTURE X.
           02  IMXLS31P    PICTURE X.
           02  IMXLS31H    PICTURE X.
           02  IMXLS31V    PICTURE X.
           02  IMXLS31O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS32C    PICTURE X.
           02  IMXLS32P    PICTURE X.
           02  IMXLS32H    PICTURE X.
           02  IMXLS32V    PICTURE X.
           02  IMXLS32O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS33C    PICTURE X.
           02  IMXLS33P    PICTURE X.
           02  IMXLS33H    PICTURE X.
           02  IMXLS33V    PICTURE X.
           02  IMXLS33O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS34C    PICTURE X.
           02  IMXLS34P    PICTURE X.
           02  IMXLS34H    PICTURE X.
           02  IMXLS34V    PICTURE X.
           02  IMXLS34O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS35C    PICTURE X.
           02  IMXLS35P    PICTURE X.
           02  IMXLS35H    PICTURE X.
           02  IMXLS35V    PICTURE X.
           02  IMXLS35O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS36C    PICTURE X.
           02  IMXLS36P    PICTURE X.
           02  IMXLS36H    PICTURE X.
           02  IMXLS36V    PICTURE X.
           02  IMXLS36O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS37C    PICTURE X.
           02  IMXLS37P    PICTURE X.
           02  IMXLS37H    PICTURE X.
           02  IMXLS37V    PICTURE X.
           02  IMXLS37O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS38C    PICTURE X.
           02  IMXLS38P    PICTURE X.
           02  IMXLS38H    PICTURE X.
           02  IMXLS38V    PICTURE X.
           02  IMXLS38O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS39C    PICTURE X.
           02  IMXLS39P    PICTURE X.
           02  IMXLS39H    PICTURE X.
           02  IMXLS39V    PICTURE X.
           02  IMXLS39O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXLS40C    PICTURE X.
           02  IMXLS40P    PICTURE X.
           02  IMXLS40H    PICTURE X.
           02  IMXLS40V    PICTURE X.
           02  IMXLS40O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXSTRPC    PICTURE X.
           02  IMXSTRPP    PICTURE X.
           02  IMXSTRPH    PICTURE X.
           02  IMXSTRPV    PICTURE X.
           02  IMXSTRPO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXENDPC    PICTURE X.
           02  IMXENDPP    PICTURE X.
           02  IMXENDPH    PICTURE X.
           02  IMXENDPV    PICTURE X.
           02  IMXENDPO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR01C    PICTURE X.
           02  IMXPR01P    PICTURE X.
           02  IMXPR01H    PICTURE X.
           02  IMXPR01V    PICTURE X.
           02  IMXPR01O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR02C    PICTURE X.
           02  IMXPR02P    PICTURE X.
           02  IMXPR02H    PICTURE X.
           02  IMXPR02V    PICTURE X.
           02  IMXPR02O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR03C    PICTURE X.
           02  IMXPR03P    PICTURE X.
           02  IMXPR03H    PICTURE X.
           02  IMXPR03V    PICTURE X.
           02  IMXPR03O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR04C    PICTURE X.
           02  IMXPR04P    PICTURE X.
           02  IMXPR04H    PICTURE X.
           02  IMXPR04V    PICTURE X.
           02  IMXPR04O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR05C    PICTURE X.
           02  IMXPR05P    PICTURE X.
           02  IMXPR05H    PICTURE X.
           02  IMXPR05V    PICTURE X.
           02  IMXPR05O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR06C    PICTURE X.
           02  IMXPR06P    PICTURE X.
           02  IMXPR06H    PICTURE X.
           02  IMXPR06V    PICTURE X.
           02  IMXPR06O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR07C    PICTURE X.
           02  IMXPR07P    PICTURE X.
           02  IMXPR07H    PICTURE X.
           02  IMXPR07V    PICTURE X.
           02  IMXPR07O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR08C    PICTURE X.
           02  IMXPR08P    PICTURE X.
           02  IMXPR08H    PICTURE X.
           02  IMXPR08V    PICTURE X.
           02  IMXPR08O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR09C    PICTURE X.
           02  IMXPR09P    PICTURE X.
           02  IMXPR09H    PICTURE X.
           02  IMXPR09V    PICTURE X.
           02  IMXPR09O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR10C    PICTURE X.
           02  IMXPR10P    PICTURE X.
           02  IMXPR10H    PICTURE X.
           02  IMXPR10V    PICTURE X.
           02  IMXPR10O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR11C    PICTURE X.
           02  IMXPR11P    PICTURE X.
           02  IMXPR11H    PICTURE X.
           02  IMXPR11V    PICTURE X.
           02  IMXPR11O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR12C    PICTURE X.
           02  IMXPR12P    PICTURE X.
           02  IMXPR12H    PICTURE X.
           02  IMXPR12V    PICTURE X.
           02  IMXPR12O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR13C    PICTURE X.
           02  IMXPR13P    PICTURE X.
           02  IMXPR13H    PICTURE X.
           02  IMXPR13V    PICTURE X.
           02  IMXPR13O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR14C    PICTURE X.
           02  IMXPR14P    PICTURE X.
           02  IMXPR14H    PICTURE X.
           02  IMXPR14V    PICTURE X.
           02  IMXPR14O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR15C    PICTURE X.
           02  IMXPR15P    PICTURE X.
           02  IMXPR15H    PICTURE X.
           02  IMXPR15V    PICTURE X.
           02  IMXPR15O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR16C    PICTURE X.
           02  IMXPR16P    PICTURE X.
           02  IMXPR16H    PICTURE X.
           02  IMXPR16V    PICTURE X.
           02  IMXPR16O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR17C    PICTURE X.
           02  IMXPR17P    PICTURE X.
           02  IMXPR17H    PICTURE X.
           02  IMXPR17V    PICTURE X.
           02  IMXPR17O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR18C    PICTURE X.
           02  IMXPR18P    PICTURE X.
           02  IMXPR18H    PICTURE X.
           02  IMXPR18V    PICTURE X.
           02  IMXPR18O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR19C    PICTURE X.
           02  IMXPR19P    PICTURE X.
           02  IMXPR19H    PICTURE X.
           02  IMXPR19V    PICTURE X.
           02  IMXPR19O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR20C    PICTURE X.
           02  IMXPR20P    PICTURE X.
           02  IMXPR20H    PICTURE X.
           02  IMXPR20V    PICTURE X.
           02  IMXPR20O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR21C    PICTURE X.
           02  IMXPR21P    PICTURE X.
           02  IMXPR21H    PICTURE X.
           02  IMXPR21V    PICTURE X.
           02  IMXPR21O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR22C    PICTURE X.
           02  IMXPR22P    PICTURE X.
           02  IMXPR22H    PICTURE X.
           02  IMXPR22V    PICTURE X.
           02  IMXPR22O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR23C    PICTURE X.
           02  IMXPR23P    PICTURE X.
           02  IMXPR23H    PICTURE X.
           02  IMXPR23V    PICTURE X.
           02  IMXPR23O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR24C    PICTURE X.
           02  IMXPR24P    PICTURE X.
           02  IMXPR24H    PICTURE X.
           02  IMXPR24V    PICTURE X.
           02  IMXPR24O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR25C    PICTURE X.
           02  IMXPR25P    PICTURE X.
           02  IMXPR25H    PICTURE X.
           02  IMXPR25V    PICTURE X.
           02  IMXPR25O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR26C    PICTURE X.
           02  IMXPR26P    PICTURE X.
           02  IMXPR26H    PICTURE X.
           02  IMXPR26V    PICTURE X.
           02  IMXPR26O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR27C    PICTURE X.
           02  IMXPR27P    PICTURE X.
           02  IMXPR27H    PICTURE X.
           02  IMXPR27V    PICTURE X.
           02  IMXPR27O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR28C    PICTURE X.
           02  IMXPR28P    PICTURE X.
           02  IMXPR28H    PICTURE X.
           02  IMXPR28V    PICTURE X.
           02  IMXPR28O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR29C    PICTURE X.
           02  IMXPR29P    PICTURE X.
           02  IMXPR29H    PICTURE X.
           02  IMXPR29V    PICTURE X.
           02  IMXPR29O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR30C    PICTURE X.
           02  IMXPR30P    PICTURE X.
           02  IMXPR30H    PICTURE X.
           02  IMXPR30V    PICTURE X.
           02  IMXPR30O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR31C    PICTURE X.
           02  IMXPR31P    PICTURE X.
           02  IMXPR31H    PICTURE X.
           02  IMXPR31V    PICTURE X.
           02  IMXPR31O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR32C    PICTURE X.
           02  IMXPR32P    PICTURE X.
           02  IMXPR32H    PICTURE X.
           02  IMXPR32V    PICTURE X.
           02  IMXPR32O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR33C    PICTURE X.
           02  IMXPR33P    PICTURE X.
           02  IMXPR33H    PICTURE X.
           02  IMXPR33V    PICTURE X.
           02  IMXPR33O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR34C    PICTURE X.
           02  IMXPR34P    PICTURE X.
           02  IMXPR34H    PICTURE X.
           02  IMXPR34V    PICTURE X.
           02  IMXPR34O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR35C    PICTURE X.
           02  IMXPR35P    PICTURE X.
           02  IMXPR35H    PICTURE X.
           02  IMXPR35V    PICTURE X.
           02  IMXPR35O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR36C    PICTURE X.
           02  IMXPR36P    PICTURE X.
           02  IMXPR36H    PICTURE X.
           02  IMXPR36V    PICTURE X.
           02  IMXPR36O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR37C    PICTURE X.
           02  IMXPR37P    PICTURE X.
           02  IMXPR37H    PICTURE X.
           02  IMXPR37V    PICTURE X.
           02  IMXPR37O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR38C    PICTURE X.
           02  IMXPR38P    PICTURE X.
           02  IMXPR38H    PICTURE X.
           02  IMXPR38V    PICTURE X.
           02  IMXPR38O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR39C    PICTURE X.
           02  IMXPR39P    PICTURE X.
           02  IMXPR39H    PICTURE X.
           02  IMXPR39V    PICTURE X.
           02  IMXPR39O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMXPR40C    PICTURE X.
           02  IMXPR40P    PICTURE X.
           02  IMXPR40H    PICTURE X.
           02  IMXPR40V    PICTURE X.
           02  IMXPR40O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IMPFS01C    PICTURE X.
           02  IMPFS01P    PICTURE X.
           02  IMPFS01H    PICTURE X.
           02  IMPFS01V    PICTURE X.
           02  IMPFS01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR01C    PICTURE X.
           02  IMERR01P    PICTURE X.
           02  IMERR01H    PICTURE X.
           02  IMERR01V    PICTURE X.
           02  IMERR01O  PIC X(79).
       01  IMXPM02I REDEFINES IMXPM06I.
           02  FILLER PIC X(12).
           02  IM2TRIDL    COMP  PIC  S9(4).
           02  IM2TRIDF    PICTURE X.
           02  FILLER REDEFINES IM2TRIDF.
             03 IM2TRIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2TRIDI  PIC X(4).
           02  IM2DATEL    COMP  PIC  S9(4).
           02  IM2DATEF    PICTURE X.
           02  FILLER REDEFINES IM2DATEF.
             03 IM2DATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2DATEI  PIC X(8).
           02  IM2TIMEL    COMP  PIC  S9(4).
           02  IM2TIMEF    PICTURE X.
           02  FILLER REDEFINES IM2TIMEF.
             03 IM2TIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2TIMEI  PIC X(8).
           02  IM2PRODL    COMP  PIC  S9(4).
           02  IM2PRODF    PICTURE X.
           02  FILLER REDEFINES IM2PRODF.
             03 IM2PRODA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2PRODI  PIC X(3).
           02  IM2CTL1L    COMP  PIC  S9(4).
           02  IM2CTL1F    PICTURE X.
           02  FILLER REDEFINES IM2CTL1F.
             03 IM2CTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2CTL1I  PIC X(2).
           02  IM2CTL2L    COMP  PIC  S9(4).
           02  IM2CTL2F    PICTURE X.
           02  FILLER REDEFINES IM2CTL2F.
             03 IM2CTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2CTL2I  PIC X(3).
           02  IM2CTL3L    COMP  PIC  S9(4).
           02  IM2CTL3F    PICTURE X.
           02  FILLER REDEFINES IM2CTL3F.
             03 IM2CTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2CTL3I  PIC X(3).
           02  IM2ACTNL    COMP  PIC  S9(4).
           02  IM2ACTNF    PICTURE X.
           02  FILLER REDEFINES IM2ACTNF.
             03 IM2ACTNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ACTNI  PIC X(1).
           02  IM2ALL1L    COMP  PIC  S9(4).
           02  IM2ALL1F    PICTURE X.
           02  FILLER REDEFINES IM2ALL1F.
             03 IM2ALL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ALL1I  PIC X(1).
           02  IM2IFX1L    COMP  PIC  S9(4).
           02  IM2IFX1F    PICTURE X.
           02  FILLER REDEFINES IM2IFX1F.
             03 IM2IFX1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFX1I  PIC X(1).
           02  IM2IFD1L    COMP  PIC  S9(4).
           02  IM2IFD1F    PICTURE X.
           02  FILLER REDEFINES IM2IFD1F.
             03 IM2IFD1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFD1I  PIC X(17).
           02  IM2ICX1L    COMP  PIC  S9(4).
           02  IM2ICX1F    PICTURE X.
           02  FILLER REDEFINES IM2ICX1F.
             03 IM2ICX1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICX1I  PIC X(1).
           02  IM2ICD1L    COMP  PIC  S9(4).
           02  IM2ICD1F    PICTURE X.
           02  FILLER REDEFINES IM2ICD1F.
             03 IM2ICD1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICD1I  PIC X(17).
           02  IM2ICB1L    COMP  PIC  S9(4).
           02  IM2ICB1F    PICTURE X.
           02  FILLER REDEFINES IM2ICB1F.
             03 IM2ICB1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICB1I  PIC X(1).
           02  IM2IFX2L    COMP  PIC  S9(4).
           02  IM2IFX2F    PICTURE X.
           02  FILLER REDEFINES IM2IFX2F.
             03 IM2IFX2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFX2I  PIC X(1).
           02  IM2IFD2L    COMP  PIC  S9(4).
           02  IM2IFD2F    PICTURE X.
           02  FILLER REDEFINES IM2IFD2F.
             03 IM2IFD2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFD2I  PIC X(17).
           02  IM2ICX2L    COMP  PIC  S9(4).
           02  IM2ICX2F    PICTURE X.
           02  FILLER REDEFINES IM2ICX2F.
             03 IM2ICX2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICX2I  PIC X(1).
           02  IM2ICD2L    COMP  PIC  S9(4).
           02  IM2ICD2F    PICTURE X.
           02  FILLER REDEFINES IM2ICD2F.
             03 IM2ICD2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICD2I  PIC X(17).
           02  IM2ICB2L    COMP  PIC  S9(4).
           02  IM2ICB2F    PICTURE X.
           02  FILLER REDEFINES IM2ICB2F.
             03 IM2ICB2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICB2I  PIC X(1).
           02  IM2IFX3L    COMP  PIC  S9(4).
           02  IM2IFX3F    PICTURE X.
           02  FILLER REDEFINES IM2IFX3F.
             03 IM2IFX3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFX3I  PIC X(1).
           02  IM2IFD3L    COMP  PIC  S9(4).
           02  IM2IFD3F    PICTURE X.
           02  FILLER REDEFINES IM2IFD3F.
             03 IM2IFD3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFD3I  PIC X(17).
           02  IM2ICX3L    COMP  PIC  S9(4).
           02  IM2ICX3F    PICTURE X.
           02  FILLER REDEFINES IM2ICX3F.
             03 IM2ICX3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICX3I  PIC X(1).
           02  IM2ICD3L    COMP  PIC  S9(4).
           02  IM2ICD3F    PICTURE X.
           02  FILLER REDEFINES IM2ICD3F.
             03 IM2ICD3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICD3I  PIC X(17).
           02  IM2ICB3L    COMP  PIC  S9(4).
           02  IM2ICB3F    PICTURE X.
           02  FILLER REDEFINES IM2ICB3F.
             03 IM2ICB3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICB3I  PIC X(1).
           02  IM2IFX4L    COMP  PIC  S9(4).
           02  IM2IFX4F    PICTURE X.
           02  FILLER REDEFINES IM2IFX4F.
             03 IM2IFX4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFX4I  PIC X(1).
           02  IM2IFD4L    COMP  PIC  S9(4).
           02  IM2IFD4F    PICTURE X.
           02  FILLER REDEFINES IM2IFD4F.
             03 IM2IFD4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFD4I  PIC X(17).
           02  IM2ICX4L    COMP  PIC  S9(4).
           02  IM2ICX4F    PICTURE X.
           02  FILLER REDEFINES IM2ICX4F.
             03 IM2ICX4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICX4I  PIC X(1).
           02  IM2ICD4L    COMP  PIC  S9(4).
           02  IM2ICD4F    PICTURE X.
           02  FILLER REDEFINES IM2ICD4F.
             03 IM2ICD4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICD4I  PIC X(17).
           02  IM2ICB4L    COMP  PIC  S9(4).
           02  IM2ICB4F    PICTURE X.
           02  FILLER REDEFINES IM2ICB4F.
             03 IM2ICB4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICB4I  PIC X(1).
           02  IM2IFX5L    COMP  PIC  S9(4).
           02  IM2IFX5F    PICTURE X.
           02  FILLER REDEFINES IM2IFX5F.
             03 IM2IFX5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFX5I  PIC X(1).
           02  IM2IFD5L    COMP  PIC  S9(4).
           02  IM2IFD5F    PICTURE X.
           02  FILLER REDEFINES IM2IFD5F.
             03 IM2IFD5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2IFD5I  PIC X(17).
           02  IM2ICX5L    COMP  PIC  S9(4).
           02  IM2ICX5F    PICTURE X.
           02  FILLER REDEFINES IM2ICX5F.
             03 IM2ICX5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICX5I  PIC X(1).
           02  IM2ICD5L    COMP  PIC  S9(4).
           02  IM2ICD5F    PICTURE X.
           02  FILLER REDEFINES IM2ICD5F.
             03 IM2ICD5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICD5I  PIC X(17).
           02  IM2ICB5L    COMP  PIC  S9(4).
           02  IM2ICB5F    PICTURE X.
           02  FILLER REDEFINES IM2ICB5F.
             03 IM2ICB5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ICB5I  PIC X(1).
           02  IM2ALL2L    COMP  PIC  S9(4).
           02  IM2ALL2F    PICTURE X.
           02  FILLER REDEFINES IM2ALL2F.
             03 IM2ALL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ALL2I  PIC X(1).
           02  IM2LFX1L    COMP  PIC  S9(4).
           02  IM2LFX1F    PICTURE X.
           02  FILLER REDEFINES IM2LFX1F.
             03 IM2LFX1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFX1I  PIC X(1).
           02  IM2LFR1L    COMP  PIC  S9(4).
           02  IM2LFR1F    PICTURE X.
           02  FILLER REDEFINES IM2LFR1F.
             03 IM2LFR1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFR1I  PIC X(17).
           02  IM2LCX1L    COMP  PIC  S9(4).
           02  IM2LCX1F    PICTURE X.
           02  FILLER REDEFINES IM2LCX1F.
             03 IM2LCX1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCX1I  PIC X(1).
           02  IM2LCR1L    COMP  PIC  S9(4).
           02  IM2LCR1F    PICTURE X.
           02  FILLER REDEFINES IM2LCR1F.
             03 IM2LCR1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCR1I  PIC X(17).
           02  IM2LCB1L    COMP  PIC  S9(4).
           02  IM2LCB1F    PICTURE X.
           02  FILLER REDEFINES IM2LCB1F.
             03 IM2LCB1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCB1I  PIC X(1).
           02  IM2LFX2L    COMP  PIC  S9(4).
           02  IM2LFX2F    PICTURE X.
           02  FILLER REDEFINES IM2LFX2F.
             03 IM2LFX2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFX2I  PIC X(1).
           02  IM2LFR2L    COMP  PIC  S9(4).
           02  IM2LFR2F    PICTURE X.
           02  FILLER REDEFINES IM2LFR2F.
             03 IM2LFR2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFR2I  PIC X(17).
           02  IM2LCX2L    COMP  PIC  S9(4).
           02  IM2LCX2F    PICTURE X.
           02  FILLER REDEFINES IM2LCX2F.
             03 IM2LCX2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCX2I  PIC X(1).
           02  IM2LCR2L    COMP  PIC  S9(4).
           02  IM2LCR2F    PICTURE X.
           02  FILLER REDEFINES IM2LCR2F.
             03 IM2LCR2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCR2I  PIC X(17).
           02  IM2LCB2L    COMP  PIC  S9(4).
           02  IM2LCB2F    PICTURE X.
           02  FILLER REDEFINES IM2LCB2F.
             03 IM2LCB2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCB2I  PIC X(1).
           02  IM2LFX3L    COMP  PIC  S9(4).
           02  IM2LFX3F    PICTURE X.
           02  FILLER REDEFINES IM2LFX3F.
             03 IM2LFX3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFX3I  PIC X(1).
           02  IM2LFR3L    COMP  PIC  S9(4).
           02  IM2LFR3F    PICTURE X.
           02  FILLER REDEFINES IM2LFR3F.
             03 IM2LFR3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFR3I  PIC X(17).
           02  IM2LCX3L    COMP  PIC  S9(4).
           02  IM2LCX3F    PICTURE X.
           02  FILLER REDEFINES IM2LCX3F.
             03 IM2LCX3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCX3I  PIC X(1).
           02  IM2LCR3L    COMP  PIC  S9(4).
           02  IM2LCR3F    PICTURE X.
           02  FILLER REDEFINES IM2LCR3F.
             03 IM2LCR3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCR3I  PIC X(17).
           02  IM2LCB3L    COMP  PIC  S9(4).
           02  IM2LCB3F    PICTURE X.
           02  FILLER REDEFINES IM2LCB3F.
             03 IM2LCB3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCB3I  PIC X(1).
           02  IM2LFX4L    COMP  PIC  S9(4).
           02  IM2LFX4F    PICTURE X.
           02  FILLER REDEFINES IM2LFX4F.
             03 IM2LFX4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFX4I  PIC X(1).
           02  IM2LFR4L    COMP  PIC  S9(4).
           02  IM2LFR4F    PICTURE X.
           02  FILLER REDEFINES IM2LFR4F.
             03 IM2LFR4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFR4I  PIC X(17).
           02  IM2LCX4L    COMP  PIC  S9(4).
           02  IM2LCX4F    PICTURE X.
           02  FILLER REDEFINES IM2LCX4F.
             03 IM2LCX4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCX4I  PIC X(1).
           02  IM2LCR4L    COMP  PIC  S9(4).
           02  IM2LCR4F    PICTURE X.
           02  FILLER REDEFINES IM2LCR4F.
             03 IM2LCR4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCR4I  PIC X(17).
           02  IM2LCB4L    COMP  PIC  S9(4).
           02  IM2LCB4F    PICTURE X.
           02  FILLER REDEFINES IM2LCB4F.
             03 IM2LCB4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCB4I  PIC X(1).
           02  IM2LFX5L    COMP  PIC  S9(4).
           02  IM2LFX5F    PICTURE X.
           02  FILLER REDEFINES IM2LFX5F.
             03 IM2LFX5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFX5I  PIC X(1).
           02  IM2LFR5L    COMP  PIC  S9(4).
           02  IM2LFR5F    PICTURE X.
           02  FILLER REDEFINES IM2LFR5F.
             03 IM2LFR5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LFR5I  PIC X(17).
           02  IM2LCX5L    COMP  PIC  S9(4).
           02  IM2LCX5F    PICTURE X.
           02  FILLER REDEFINES IM2LCX5F.
             03 IM2LCX5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCX5I  PIC X(1).
           02  IM2LCR5L    COMP  PIC  S9(4).
           02  IM2LCR5F    PICTURE X.
           02  FILLER REDEFINES IM2LCR5F.
             03 IM2LCR5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCR5I  PIC X(17).
           02  IM2LCB5L    COMP  PIC  S9(4).
           02  IM2LCB5F    PICTURE X.
           02  FILLER REDEFINES IM2LCB5F.
             03 IM2LCB5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2LCB5I  PIC X(1).
           02  IM2ALL3L    COMP  PIC  S9(4).
           02  IM2ALL3F    PICTURE X.
           02  FILLER REDEFINES IM2ALL3F.
             03 IM2ALL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2ALL3I  PIC X(1).
           02  IM2OFX1L    COMP  PIC  S9(4).
           02  IM2OFX1F    PICTURE X.
           02  FILLER REDEFINES IM2OFX1F.
             03 IM2OFX1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFX1I  PIC X(1).
           02  IM2OFR1L    COMP  PIC  S9(4).
           02  IM2OFR1F    PICTURE X.
           02  FILLER REDEFINES IM2OFR1F.
             03 IM2OFR1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFR1I  PIC X(17).
           02  IM2OCX1L    COMP  PIC  S9(4).
           02  IM2OCX1F    PICTURE X.
           02  FILLER REDEFINES IM2OCX1F.
             03 IM2OCX1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCX1I  PIC X(1).
           02  IM2OCR1L    COMP  PIC  S9(4).
           02  IM2OCR1F    PICTURE X.
           02  FILLER REDEFINES IM2OCR1F.
             03 IM2OCR1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCR1I  PIC X(17).
           02  IM2OCB1L    COMP  PIC  S9(4).
           02  IM2OCB1F    PICTURE X.
           02  FILLER REDEFINES IM2OCB1F.
             03 IM2OCB1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCB1I  PIC X(1).
           02  IM2OFX2L    COMP  PIC  S9(4).
           02  IM2OFX2F    PICTURE X.
           02  FILLER REDEFINES IM2OFX2F.
             03 IM2OFX2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFX2I  PIC X(1).
           02  IM2OFR2L    COMP  PIC  S9(4).
           02  IM2OFR2F    PICTURE X.
           02  FILLER REDEFINES IM2OFR2F.
             03 IM2OFR2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFR2I  PIC X(17).
           02  IM2OXC2L    COMP  PIC  S9(4).
           02  IM2OXC2F    PICTURE X.
           02  FILLER REDEFINES IM2OXC2F.
             03 IM2OXC2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OXC2I  PIC X(1).
           02  IM2OCR2L    COMP  PIC  S9(4).
           02  IM2OCR2F    PICTURE X.
           02  FILLER REDEFINES IM2OCR2F.
             03 IM2OCR2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCR2I  PIC X(17).
           02  IM2OCB2L    COMP  PIC  S9(4).
           02  IM2OCB2F    PICTURE X.
           02  FILLER REDEFINES IM2OCB2F.
             03 IM2OCB2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCB2I  PIC X(1).
           02  IM2OFX3L    COMP  PIC  S9(4).
           02  IM2OFX3F    PICTURE X.
           02  FILLER REDEFINES IM2OFX3F.
             03 IM2OFX3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFX3I  PIC X(1).
           02  IM2OFR3L    COMP  PIC  S9(4).
           02  IM2OFR3F    PICTURE X.
           02  FILLER REDEFINES IM2OFR3F.
             03 IM2OFR3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFR3I  PIC X(17).
           02  IM2OCX3L    COMP  PIC  S9(4).
           02  IM2OCX3F    PICTURE X.
           02  FILLER REDEFINES IM2OCX3F.
             03 IM2OCX3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCX3I  PIC X(1).
           02  IM2OCR3L    COMP  PIC  S9(4).
           02  IM2OCR3F    PICTURE X.
           02  FILLER REDEFINES IM2OCR3F.
             03 IM2OCR3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCR3I  PIC X(17).
           02  IM2OCB3L    COMP  PIC  S9(4).
           02  IM2OCB3F    PICTURE X.
           02  FILLER REDEFINES IM2OCB3F.
             03 IM2OCB3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCB3I  PIC X(1).
           02  IM2OFX4L    COMP  PIC  S9(4).
           02  IM2OFX4F    PICTURE X.
           02  FILLER REDEFINES IM2OFX4F.
             03 IM2OFX4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFX4I  PIC X(1).
           02  IM2OFR4L    COMP  PIC  S9(4).
           02  IM2OFR4F    PICTURE X.
           02  FILLER REDEFINES IM2OFR4F.
             03 IM2OFR4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFR4I  PIC X(17).
           02  IM2OCX4L    COMP  PIC  S9(4).
           02  IM2OCX4F    PICTURE X.
           02  FILLER REDEFINES IM2OCX4F.
             03 IM2OCX4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCX4I  PIC X(1).
           02  IM2OCR4L    COMP  PIC  S9(4).
           02  IM2OCR4F    PICTURE X.
           02  FILLER REDEFINES IM2OCR4F.
             03 IM2OCR4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCR4I  PIC X(17).
           02  IM2OCB4L    COMP  PIC  S9(4).
           02  IM2OCB4F    PICTURE X.
           02  FILLER REDEFINES IM2OCB4F.
             03 IM2OCB4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCB4I  PIC X(1).
           02  IM2OFX5L    COMP  PIC  S9(4).
           02  IM2OFX5F    PICTURE X.
           02  FILLER REDEFINES IM2OFX5F.
             03 IM2OFX5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFX5I  PIC X(1).
           02  IM2OFR5L    COMP  PIC  S9(4).
           02  IM2OFR5F    PICTURE X.
           02  FILLER REDEFINES IM2OFR5F.
             03 IM2OFR5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OFR5I  PIC X(17).
           02  IM2OCX5L    COMP  PIC  S9(4).
           02  IM2OCX5F    PICTURE X.
           02  FILLER REDEFINES IM2OCX5F.
             03 IM2OCX5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCX5I  PIC X(1).
           02  IM2OCR5L    COMP  PIC  S9(4).
           02  IM2OCR5F    PICTURE X.
           02  FILLER REDEFINES IM2OCR5F.
             03 IM2OCR5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCR5I  PIC X(17).
           02  IM2OCB5L    COMP  PIC  S9(4).
           02  IM2OCB5F    PICTURE X.
           02  FILLER REDEFINES IM2OCB5F.
             03 IM2OCB5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM2OCB5I  PIC X(1).
           02  IMPFS02L    COMP  PIC  S9(4).
           02  IMPFS02F    PICTURE X.
           02  FILLER REDEFINES IMPFS02F.
             03 IMPFS02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS02I  PIC X(79).
           02  IMERR02L    COMP  PIC  S9(4).
           02  IMERR02F    PICTURE X.
           02  FILLER REDEFINES IMERR02F.
             03 IMERR02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR02I  PIC X(79).
       01  IMXPM02O REDEFINES IMXPM02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM2TRIDC    PICTURE X.
           02  IM2TRIDP    PICTURE X.
           02  IM2TRIDH    PICTURE X.
           02  IM2TRIDV    PICTURE X.
           02  IM2TRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IM2DATEC    PICTURE X.
           02  IM2DATEP    PICTURE X.
           02  IM2DATEH    PICTURE X.
           02  IM2DATEV    PICTURE X.
           02  IM2DATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IM2TIMEC    PICTURE X.
           02  IM2TIMEP    PICTURE X.
           02  IM2TIMEH    PICTURE X.
           02  IM2TIMEV    PICTURE X.
           02  IM2TIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IM2PRODC    PICTURE X.
           02  IM2PRODP    PICTURE X.
           02  IM2PRODH    PICTURE X.
           02  IM2PRODV    PICTURE X.
           02  IM2PRODO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM2CTL1C    PICTURE X.
           02  IM2CTL1P    PICTURE X.
           02  IM2CTL1H    PICTURE X.
           02  IM2CTL1V    PICTURE X.
           02  IM2CTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IM2CTL2C    PICTURE X.
           02  IM2CTL2P    PICTURE X.
           02  IM2CTL2H    PICTURE X.
           02  IM2CTL2V    PICTURE X.
           02  IM2CTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM2CTL3C    PICTURE X.
           02  IM2CTL3P    PICTURE X.
           02  IM2CTL3H    PICTURE X.
           02  IM2CTL3V    PICTURE X.
           02  IM2CTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM2ACTNC    PICTURE X.
           02  IM2ACTNP    PICTURE X.
           02  IM2ACTNH    PICTURE X.
           02  IM2ACTNV    PICTURE X.
           02  IM2ACTNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2ALL1C    PICTURE X.
           02  IM2ALL1P    PICTURE X.
           02  IM2ALL1H    PICTURE X.
           02  IM2ALL1V    PICTURE X.
           02  IM2ALL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFX1C    PICTURE X.
           02  IM2IFX1P    PICTURE X.
           02  IM2IFX1H    PICTURE X.
           02  IM2IFX1V    PICTURE X.
           02  IM2IFX1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFD1C    PICTURE X.
           02  IM2IFD1P    PICTURE X.
           02  IM2IFD1H    PICTURE X.
           02  IM2IFD1V    PICTURE X.
           02  IM2IFD1O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICX1C    PICTURE X.
           02  IM2ICX1P    PICTURE X.
           02  IM2ICX1H    PICTURE X.
           02  IM2ICX1V    PICTURE X.
           02  IM2ICX1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2ICD1C    PICTURE X.
           02  IM2ICD1P    PICTURE X.
           02  IM2ICD1H    PICTURE X.
           02  IM2ICD1V    PICTURE X.
           02  IM2ICD1O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICB1C    PICTURE X.
           02  IM2ICB1P    PICTURE X.
           02  IM2ICB1H    PICTURE X.
           02  IM2ICB1V    PICTURE X.
           02  IM2ICB1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFX2C    PICTURE X.
           02  IM2IFX2P    PICTURE X.
           02  IM2IFX2H    PICTURE X.
           02  IM2IFX2V    PICTURE X.
           02  IM2IFX2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFD2C    PICTURE X.
           02  IM2IFD2P    PICTURE X.
           02  IM2IFD2H    PICTURE X.
           02  IM2IFD2V    PICTURE X.
           02  IM2IFD2O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICX2C    PICTURE X.
           02  IM2ICX2P    PICTURE X.
           02  IM2ICX2H    PICTURE X.
           02  IM2ICX2V    PICTURE X.
           02  IM2ICX2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2ICD2C    PICTURE X.
           02  IM2ICD2P    PICTURE X.
           02  IM2ICD2H    PICTURE X.
           02  IM2ICD2V    PICTURE X.
           02  IM2ICD2O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICB2C    PICTURE X.
           02  IM2ICB2P    PICTURE X.
           02  IM2ICB2H    PICTURE X.
           02  IM2ICB2V    PICTURE X.
           02  IM2ICB2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFX3C    PICTURE X.
           02  IM2IFX3P    PICTURE X.
           02  IM2IFX3H    PICTURE X.
           02  IM2IFX3V    PICTURE X.
           02  IM2IFX3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFD3C    PICTURE X.
           02  IM2IFD3P    PICTURE X.
           02  IM2IFD3H    PICTURE X.
           02  IM2IFD3V    PICTURE X.
           02  IM2IFD3O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICX3C    PICTURE X.
           02  IM2ICX3P    PICTURE X.
           02  IM2ICX3H    PICTURE X.
           02  IM2ICX3V    PICTURE X.
           02  IM2ICX3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2ICD3C    PICTURE X.
           02  IM2ICD3P    PICTURE X.
           02  IM2ICD3H    PICTURE X.
           02  IM2ICD3V    PICTURE X.
           02  IM2ICD3O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICB3C    PICTURE X.
           02  IM2ICB3P    PICTURE X.
           02  IM2ICB3H    PICTURE X.
           02  IM2ICB3V    PICTURE X.
           02  IM2ICB3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFX4C    PICTURE X.
           02  IM2IFX4P    PICTURE X.
           02  IM2IFX4H    PICTURE X.
           02  IM2IFX4V    PICTURE X.
           02  IM2IFX4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFD4C    PICTURE X.
           02  IM2IFD4P    PICTURE X.
           02  IM2IFD4H    PICTURE X.
           02  IM2IFD4V    PICTURE X.
           02  IM2IFD4O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICX4C    PICTURE X.
           02  IM2ICX4P    PICTURE X.
           02  IM2ICX4H    PICTURE X.
           02  IM2ICX4V    PICTURE X.
           02  IM2ICX4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2ICD4C    PICTURE X.
           02  IM2ICD4P    PICTURE X.
           02  IM2ICD4H    PICTURE X.
           02  IM2ICD4V    PICTURE X.
           02  IM2ICD4O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICB4C    PICTURE X.
           02  IM2ICB4P    PICTURE X.
           02  IM2ICB4H    PICTURE X.
           02  IM2ICB4V    PICTURE X.
           02  IM2ICB4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFX5C    PICTURE X.
           02  IM2IFX5P    PICTURE X.
           02  IM2IFX5H    PICTURE X.
           02  IM2IFX5V    PICTURE X.
           02  IM2IFX5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2IFD5C    PICTURE X.
           02  IM2IFD5P    PICTURE X.
           02  IM2IFD5H    PICTURE X.
           02  IM2IFD5V    PICTURE X.
           02  IM2IFD5O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICX5C    PICTURE X.
           02  IM2ICX5P    PICTURE X.
           02  IM2ICX5H    PICTURE X.
           02  IM2ICX5V    PICTURE X.
           02  IM2ICX5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2ICD5C    PICTURE X.
           02  IM2ICD5P    PICTURE X.
           02  IM2ICD5H    PICTURE X.
           02  IM2ICD5V    PICTURE X.
           02  IM2ICD5O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2ICB5C    PICTURE X.
           02  IM2ICB5P    PICTURE X.
           02  IM2ICB5H    PICTURE X.
           02  IM2ICB5V    PICTURE X.
           02  IM2ICB5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2ALL2C    PICTURE X.
           02  IM2ALL2P    PICTURE X.
           02  IM2ALL2H    PICTURE X.
           02  IM2ALL2V    PICTURE X.
           02  IM2ALL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFX1C    PICTURE X.
           02  IM2LFX1P    PICTURE X.
           02  IM2LFX1H    PICTURE X.
           02  IM2LFX1V    PICTURE X.
           02  IM2LFX1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFR1C    PICTURE X.
           02  IM2LFR1P    PICTURE X.
           02  IM2LFR1H    PICTURE X.
           02  IM2LFR1V    PICTURE X.
           02  IM2LFR1O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCX1C    PICTURE X.
           02  IM2LCX1P    PICTURE X.
           02  IM2LCX1H    PICTURE X.
           02  IM2LCX1V    PICTURE X.
           02  IM2LCX1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LCR1C    PICTURE X.
           02  IM2LCR1P    PICTURE X.
           02  IM2LCR1H    PICTURE X.
           02  IM2LCR1V    PICTURE X.
           02  IM2LCR1O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCB1C    PICTURE X.
           02  IM2LCB1P    PICTURE X.
           02  IM2LCB1H    PICTURE X.
           02  IM2LCB1V    PICTURE X.
           02  IM2LCB1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFX2C    PICTURE X.
           02  IM2LFX2P    PICTURE X.
           02  IM2LFX2H    PICTURE X.
           02  IM2LFX2V    PICTURE X.
           02  IM2LFX2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFR2C    PICTURE X.
           02  IM2LFR2P    PICTURE X.
           02  IM2LFR2H    PICTURE X.
           02  IM2LFR2V    PICTURE X.
           02  IM2LFR2O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCX2C    PICTURE X.
           02  IM2LCX2P    PICTURE X.
           02  IM2LCX2H    PICTURE X.
           02  IM2LCX2V    PICTURE X.
           02  IM2LCX2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LCR2C    PICTURE X.
           02  IM2LCR2P    PICTURE X.
           02  IM2LCR2H    PICTURE X.
           02  IM2LCR2V    PICTURE X.
           02  IM2LCR2O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCB2C    PICTURE X.
           02  IM2LCB2P    PICTURE X.
           02  IM2LCB2H    PICTURE X.
           02  IM2LCB2V    PICTURE X.
           02  IM2LCB2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFX3C    PICTURE X.
           02  IM2LFX3P    PICTURE X.
           02  IM2LFX3H    PICTURE X.
           02  IM2LFX3V    PICTURE X.
           02  IM2LFX3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFR3C    PICTURE X.
           02  IM2LFR3P    PICTURE X.
           02  IM2LFR3H    PICTURE X.
           02  IM2LFR3V    PICTURE X.
           02  IM2LFR3O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCX3C    PICTURE X.
           02  IM2LCX3P    PICTURE X.
           02  IM2LCX3H    PICTURE X.
           02  IM2LCX3V    PICTURE X.
           02  IM2LCX3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LCR3C    PICTURE X.
           02  IM2LCR3P    PICTURE X.
           02  IM2LCR3H    PICTURE X.
           02  IM2LCR3V    PICTURE X.
           02  IM2LCR3O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCB3C    PICTURE X.
           02  IM2LCB3P    PICTURE X.
           02  IM2LCB3H    PICTURE X.
           02  IM2LCB3V    PICTURE X.
           02  IM2LCB3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFX4C    PICTURE X.
           02  IM2LFX4P    PICTURE X.
           02  IM2LFX4H    PICTURE X.
           02  IM2LFX4V    PICTURE X.
           02  IM2LFX4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFR4C    PICTURE X.
           02  IM2LFR4P    PICTURE X.
           02  IM2LFR4H    PICTURE X.
           02  IM2LFR4V    PICTURE X.
           02  IM2LFR4O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCX4C    PICTURE X.
           02  IM2LCX4P    PICTURE X.
           02  IM2LCX4H    PICTURE X.
           02  IM2LCX4V    PICTURE X.
           02  IM2LCX4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LCR4C    PICTURE X.
           02  IM2LCR4P    PICTURE X.
           02  IM2LCR4H    PICTURE X.
           02  IM2LCR4V    PICTURE X.
           02  IM2LCR4O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCB4C    PICTURE X.
           02  IM2LCB4P    PICTURE X.
           02  IM2LCB4H    PICTURE X.
           02  IM2LCB4V    PICTURE X.
           02  IM2LCB4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFX5C    PICTURE X.
           02  IM2LFX5P    PICTURE X.
           02  IM2LFX5H    PICTURE X.
           02  IM2LFX5V    PICTURE X.
           02  IM2LFX5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LFR5C    PICTURE X.
           02  IM2LFR5P    PICTURE X.
           02  IM2LFR5H    PICTURE X.
           02  IM2LFR5V    PICTURE X.
           02  IM2LFR5O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCX5C    PICTURE X.
           02  IM2LCX5P    PICTURE X.
           02  IM2LCX5H    PICTURE X.
           02  IM2LCX5V    PICTURE X.
           02  IM2LCX5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2LCR5C    PICTURE X.
           02  IM2LCR5P    PICTURE X.
           02  IM2LCR5H    PICTURE X.
           02  IM2LCR5V    PICTURE X.
           02  IM2LCR5O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2LCB5C    PICTURE X.
           02  IM2LCB5P    PICTURE X.
           02  IM2LCB5H    PICTURE X.
           02  IM2LCB5V    PICTURE X.
           02  IM2LCB5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2ALL3C    PICTURE X.
           02  IM2ALL3P    PICTURE X.
           02  IM2ALL3H    PICTURE X.
           02  IM2ALL3V    PICTURE X.
           02  IM2ALL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFX1C    PICTURE X.
           02  IM2OFX1P    PICTURE X.
           02  IM2OFX1H    PICTURE X.
           02  IM2OFX1V    PICTURE X.
           02  IM2OFX1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFR1C    PICTURE X.
           02  IM2OFR1P    PICTURE X.
           02  IM2OFR1H    PICTURE X.
           02  IM2OFR1V    PICTURE X.
           02  IM2OFR1O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OCX1C    PICTURE X.
           02  IM2OCX1P    PICTURE X.
           02  IM2OCX1H    PICTURE X.
           02  IM2OCX1V    PICTURE X.
           02  IM2OCX1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OCR1C    PICTURE X.
           02  IM2OCR1P    PICTURE X.
           02  IM2OCR1H    PICTURE X.
           02  IM2OCR1V    PICTURE X.
           02  IM2OCR1O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OCB1C    PICTURE X.
           02  IM2OCB1P    PICTURE X.
           02  IM2OCB1H    PICTURE X.
           02  IM2OCB1V    PICTURE X.
           02  IM2OCB1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFX2C    PICTURE X.
           02  IM2OFX2P    PICTURE X.
           02  IM2OFX2H    PICTURE X.
           02  IM2OFX2V    PICTURE X.
           02  IM2OFX2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFR2C    PICTURE X.
           02  IM2OFR2P    PICTURE X.
           02  IM2OFR2H    PICTURE X.
           02  IM2OFR2V    PICTURE X.
           02  IM2OFR2O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OXC2C    PICTURE X.
           02  IM2OXC2P    PICTURE X.
           02  IM2OXC2H    PICTURE X.
           02  IM2OXC2V    PICTURE X.
           02  IM2OXC2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OCR2C    PICTURE X.
           02  IM2OCR2P    PICTURE X.
           02  IM2OCR2H    PICTURE X.
           02  IM2OCR2V    PICTURE X.
           02  IM2OCR2O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OCB2C    PICTURE X.
           02  IM2OCB2P    PICTURE X.
           02  IM2OCB2H    PICTURE X.
           02  IM2OCB2V    PICTURE X.
           02  IM2OCB2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFX3C    PICTURE X.
           02  IM2OFX3P    PICTURE X.
           02  IM2OFX3H    PICTURE X.
           02  IM2OFX3V    PICTURE X.
           02  IM2OFX3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFR3C    PICTURE X.
           02  IM2OFR3P    PICTURE X.
           02  IM2OFR3H    PICTURE X.
           02  IM2OFR3V    PICTURE X.
           02  IM2OFR3O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OCX3C    PICTURE X.
           02  IM2OCX3P    PICTURE X.
           02  IM2OCX3H    PICTURE X.
           02  IM2OCX3V    PICTURE X.
           02  IM2OCX3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OCR3C    PICTURE X.
           02  IM2OCR3P    PICTURE X.
           02  IM2OCR3H    PICTURE X.
           02  IM2OCR3V    PICTURE X.
           02  IM2OCR3O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OCB3C    PICTURE X.
           02  IM2OCB3P    PICTURE X.
           02  IM2OCB3H    PICTURE X.
           02  IM2OCB3V    PICTURE X.
           02  IM2OCB3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFX4C    PICTURE X.
           02  IM2OFX4P    PICTURE X.
           02  IM2OFX4H    PICTURE X.
           02  IM2OFX4V    PICTURE X.
           02  IM2OFX4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFR4C    PICTURE X.
           02  IM2OFR4P    PICTURE X.
           02  IM2OFR4H    PICTURE X.
           02  IM2OFR4V    PICTURE X.
           02  IM2OFR4O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OCX4C    PICTURE X.
           02  IM2OCX4P    PICTURE X.
           02  IM2OCX4H    PICTURE X.
           02  IM2OCX4V    PICTURE X.
           02  IM2OCX4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OCR4C    PICTURE X.
           02  IM2OCR4P    PICTURE X.
           02  IM2OCR4H    PICTURE X.
           02  IM2OCR4V    PICTURE X.
           02  IM2OCR4O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OCB4C    PICTURE X.
           02  IM2OCB4P    PICTURE X.
           02  IM2OCB4H    PICTURE X.
           02  IM2OCB4V    PICTURE X.
           02  IM2OCB4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFX5C    PICTURE X.
           02  IM2OFX5P    PICTURE X.
           02  IM2OFX5H    PICTURE X.
           02  IM2OFX5V    PICTURE X.
           02  IM2OFX5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OFR5C    PICTURE X.
           02  IM2OFR5P    PICTURE X.
           02  IM2OFR5H    PICTURE X.
           02  IM2OFR5V    PICTURE X.
           02  IM2OFR5O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OCX5C    PICTURE X.
           02  IM2OCX5P    PICTURE X.
           02  IM2OCX5H    PICTURE X.
           02  IM2OCX5V    PICTURE X.
           02  IM2OCX5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM2OCR5C    PICTURE X.
           02  IM2OCR5P    PICTURE X.
           02  IM2OCR5H    PICTURE X.
           02  IM2OCR5V    PICTURE X.
           02  IM2OCR5O  PIC X(17).
           02  FILLER PICTURE X(3).
           02  IM2OCB5C    PICTURE X.
           02  IM2OCB5P    PICTURE X.
           02  IM2OCB5H    PICTURE X.
           02  IM2OCB5V    PICTURE X.
           02  IM2OCB5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IMPFS02C    PICTURE X.
           02  IMPFS02P    PICTURE X.
           02  IMPFS02H    PICTURE X.
           02  IMPFS02V    PICTURE X.
           02  IMPFS02O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR02C    PICTURE X.
           02  IMERR02P    PICTURE X.
           02  IMERR02H    PICTURE X.
           02  IMERR02V    PICTURE X.
           02  IMERR02O  PIC X(79).
       01  IMXPM03I REDEFINES IMXPM06I.
           02  FILLER PIC X(12).
           02  IM3TRIDL    COMP  PIC  S9(4).
           02  IM3TRIDF    PICTURE X.
           02  FILLER REDEFINES IM3TRIDF.
             03 IM3TRIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3TRIDI  PIC X(4).
           02  IM3DATEL    COMP  PIC  S9(4).
           02  IM3DATEF    PICTURE X.
           02  FILLER REDEFINES IM3DATEF.
             03 IM3DATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3DATEI  PIC X(8).
           02  IM3TIMEL    COMP  PIC  S9(4).
           02  IM3TIMEF    PICTURE X.
           02  FILLER REDEFINES IM3TIMEF.
             03 IM3TIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3TIMEI  PIC X(8).
           02  IM3PRODL    COMP  PIC  S9(4).
           02  IM3PRODF    PICTURE X.
           02  FILLER REDEFINES IM3PRODF.
             03 IM3PRODA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3PRODI  PIC X(3).
           02  IM3CTL1L    COMP  PIC  S9(4).
           02  IM3CTL1F    PICTURE X.
           02  FILLER REDEFINES IM3CTL1F.
             03 IM3CTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CTL1I  PIC X(2).
           02  IM3CTL2L    COMP  PIC  S9(4).
           02  IM3CTL2F    PICTURE X.
           02  FILLER REDEFINES IM3CTL2F.
             03 IM3CTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CTL2I  PIC X(3).
           02  IM3CTL3L    COMP  PIC  S9(4).
           02  IM3CTL3F    PICTURE X.
           02  FILLER REDEFINES IM3CTL3F.
             03 IM3CTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CTL3I  PIC X(3).
           02  IM3ACTNL    COMP  PIC  S9(4).
           02  IM3ACTNF    PICTURE X.
           02  FILLER REDEFINES IM3ACTNF.
             03 IM3ACTNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3ACTNI  PIC X(1).
           02  IM3ALLIL    COMP  PIC  S9(4).
           02  IM3ALLIF    PICTURE X.
           02  FILLER REDEFINES IM3ALLIF.
             03 IM3ALLIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3ALLII  PIC X(1).
           02  IM3INDXL    COMP  PIC  S9(4).
           02  IM3INDXF    PICTURE X.
           02  FILLER REDEFINES IM3INDXF.
             03 IM3INDXA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3INDXI  PIC X(1).
           02  IM3ALL1L    COMP  PIC  S9(4).
           02  IM3ALL1F    PICTURE X.
           02  FILLER REDEFINES IM3ALL1F.
             03 IM3ALL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3ALL1I  PIC X(1).
           02  IM3CBDLL    COMP  PIC  S9(4).
           02  IM3CBDLF    PICTURE X.
           02  FILLER REDEFINES IM3CBDLF.
             03 IM3CBDLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CBDLI  PIC X(12).
           02  IM3FXR1L    COMP  PIC  S9(4).
           02  IM3FXR1F    PICTURE X.
           02  FILLER REDEFINES IM3FXR1F.
             03 IM3FXR1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXR1I  PIC X(1).
           02  IM3FRT1L    COMP  PIC  S9(4).
           02  IM3FRT1F    PICTURE X.
           02  FILLER REDEFINES IM3FRT1F.
             03 IM3FRT1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FRT1I  PIC X(10).
           02  IM3FXL1L    COMP  PIC  S9(4).
           02  IM3FXL1F    PICTURE X.
           02  FILLER REDEFINES IM3FXL1F.
             03 IM3FXL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXL1I  PIC X(1).
           02  IM3FLT1L    COMP  PIC  S9(4).
           02  IM3FLT1F    PICTURE X.
           02  FILLER REDEFINES IM3FLT1F.
             03 IM3FLT1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FLT1I  PIC X(13).
           02  IM3CXR1L    COMP  PIC  S9(4).
           02  IM3CXR1F    PICTURE X.
           02  FILLER REDEFINES IM3CXR1F.
             03 IM3CXR1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXR1I  PIC X(1).
           02  IM3CRT1L    COMP  PIC  S9(4).
           02  IM3CRT1F    PICTURE X.
           02  FILLER REDEFINES IM3CRT1F.
             03 IM3CRT1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CRT1I  PIC X(10).
           02  IM3CXL1L    COMP  PIC  S9(4).
           02  IM3CXL1F    PICTURE X.
           02  FILLER REDEFINES IM3CXL1F.
             03 IM3CXL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXL1I  PIC X(1).
           02  IM3CLT1L    COMP  PIC  S9(4).
           02  IM3CLT1F    PICTURE X.
           02  FILLER REDEFINES IM3CLT1F.
             03 IM3CLT1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CLT1I  PIC X(13).
           02  IM3FXR2L    COMP  PIC  S9(4).
           02  IM3FXR2F    PICTURE X.
           02  FILLER REDEFINES IM3FXR2F.
             03 IM3FXR2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXR2I  PIC X(1).
           02  IM3FRT2L    COMP  PIC  S9(4).
           02  IM3FRT2F    PICTURE X.
           02  FILLER REDEFINES IM3FRT2F.
             03 IM3FRT2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FRT2I  PIC X(10).
           02  IM3FXL2L    COMP  PIC  S9(4).
           02  IM3FXL2F    PICTURE X.
           02  FILLER REDEFINES IM3FXL2F.
             03 IM3FXL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXL2I  PIC X(1).
           02  IM3FLT2L    COMP  PIC  S9(4).
           02  IM3FLT2F    PICTURE X.
           02  FILLER REDEFINES IM3FLT2F.
             03 IM3FLT2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FLT2I  PIC X(13).
           02  IM3CXR2L    COMP  PIC  S9(4).
           02  IM3CXR2F    PICTURE X.
           02  FILLER REDEFINES IM3CXR2F.
             03 IM3CXR2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXR2I  PIC X(1).
           02  IM3CRT2L    COMP  PIC  S9(4).
           02  IM3CRT2F    PICTURE X.
           02  FILLER REDEFINES IM3CRT2F.
             03 IM3CRT2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CRT2I  PIC X(10).
           02  IM3CXL2L    COMP  PIC  S9(4).
           02  IM3CXL2F    PICTURE X.
           02  FILLER REDEFINES IM3CXL2F.
             03 IM3CXL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXL2I  PIC X(1).
           02  IM3CLT2L    COMP  PIC  S9(4).
           02  IM3CLT2F    PICTURE X.
           02  FILLER REDEFINES IM3CLT2F.
             03 IM3CLT2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CLT2I  PIC X(13).
           02  IM3FXR3L    COMP  PIC  S9(4).
           02  IM3FXR3F    PICTURE X.
           02  FILLER REDEFINES IM3FXR3F.
             03 IM3FXR3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXR3I  PIC X(1).
           02  IM3FRT3L    COMP  PIC  S9(4).
           02  IM3FRT3F    PICTURE X.
           02  FILLER REDEFINES IM3FRT3F.
             03 IM3FRT3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FRT3I  PIC X(10).
           02  IM3FXL3L    COMP  PIC  S9(4).
           02  IM3FXL3F    PICTURE X.
           02  FILLER REDEFINES IM3FXL3F.
             03 IM3FXL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXL3I  PIC X(1).
           02  IM3FLT3L    COMP  PIC  S9(4).
           02  IM3FLT3F    PICTURE X.
           02  FILLER REDEFINES IM3FLT3F.
             03 IM3FLT3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FLT3I  PIC X(13).
           02  IM3CXR3L    COMP  PIC  S9(4).
           02  IM3CXR3F    PICTURE X.
           02  FILLER REDEFINES IM3CXR3F.
             03 IM3CXR3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXR3I  PIC X(1).
           02  IM3CRT3L    COMP  PIC  S9(4).
           02  IM3CRT3F    PICTURE X.
           02  FILLER REDEFINES IM3CRT3F.
             03 IM3CRT3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CRT3I  PIC X(10).
           02  IM3CXL3L    COMP  PIC  S9(4).
           02  IM3CXL3F    PICTURE X.
           02  FILLER REDEFINES IM3CXL3F.
             03 IM3CXL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXL3I  PIC X(1).
           02  IM3CLT3L    COMP  PIC  S9(4).
           02  IM3CLT3F    PICTURE X.
           02  FILLER REDEFINES IM3CLT3F.
             03 IM3CLT3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CLT3I  PIC X(13).
           02  IM3FXR4L    COMP  PIC  S9(4).
           02  IM3FXR4F    PICTURE X.
           02  FILLER REDEFINES IM3FXR4F.
             03 IM3FXR4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXR4I  PIC X(1).
           02  IM3FRT4L    COMP  PIC  S9(4).
           02  IM3FRT4F    PICTURE X.
           02  FILLER REDEFINES IM3FRT4F.
             03 IM3FRT4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FRT4I  PIC X(10).
           02  IM3FXL4L    COMP  PIC  S9(4).
           02  IM3FXL4F    PICTURE X.
           02  FILLER REDEFINES IM3FXL4F.
             03 IM3FXL4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXL4I  PIC X(1).
           02  IM3FLT4L    COMP  PIC  S9(4).
           02  IM3FLT4F    PICTURE X.
           02  FILLER REDEFINES IM3FLT4F.
             03 IM3FLT4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FLT4I  PIC X(13).
           02  IM3CXR4L    COMP  PIC  S9(4).
           02  IM3CXR4F    PICTURE X.
           02  FILLER REDEFINES IM3CXR4F.
             03 IM3CXR4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXR4I  PIC X(1).
           02  IM3CRT4L    COMP  PIC  S9(4).
           02  IM3CRT4F    PICTURE X.
           02  FILLER REDEFINES IM3CRT4F.
             03 IM3CRT4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CRT4I  PIC X(10).
           02  IM3CXL4L    COMP  PIC  S9(4).
           02  IM3CXL4F    PICTURE X.
           02  FILLER REDEFINES IM3CXL4F.
             03 IM3CXL4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXL4I  PIC X(1).
           02  IM3CLT4L    COMP  PIC  S9(4).
           02  IM3CLT4F    PICTURE X.
           02  FILLER REDEFINES IM3CLT4F.
             03 IM3CLT4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CLT4I  PIC X(13).
           02  IM3FXR5L    COMP  PIC  S9(4).
           02  IM3FXR5F    PICTURE X.
           02  FILLER REDEFINES IM3FXR5F.
             03 IM3FXR5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXR5I  PIC X(1).
           02  IM3FRT5L    COMP  PIC  S9(4).
           02  IM3FRT5F    PICTURE X.
           02  FILLER REDEFINES IM3FRT5F.
             03 IM3FRT5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FRT5I  PIC X(10).
           02  IM3FXL5L    COMP  PIC  S9(4).
           02  IM3FXL5F    PICTURE X.
           02  FILLER REDEFINES IM3FXL5F.
             03 IM3FXL5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXL5I  PIC X(1).
           02  IM3FLT5L    COMP  PIC  S9(4).
           02  IM3FLT5F    PICTURE X.
           02  FILLER REDEFINES IM3FLT5F.
             03 IM3FLT5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FLT5I  PIC X(13).
           02  IM3CXR5L    COMP  PIC  S9(4).
           02  IM3CXR5F    PICTURE X.
           02  FILLER REDEFINES IM3CXR5F.
             03 IM3CXR5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXR5I  PIC X(1).
           02  IM3CRT5L    COMP  PIC  S9(4).
           02  IM3CRT5F    PICTURE X.
           02  FILLER REDEFINES IM3CRT5F.
             03 IM3CRT5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CRT5I  PIC X(10).
           02  IM3CXL5L    COMP  PIC  S9(4).
           02  IM3CXL5F    PICTURE X.
           02  FILLER REDEFINES IM3CXL5F.
             03 IM3CXL5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXL5I  PIC X(1).
           02  IM3CLT5L    COMP  PIC  S9(4).
           02  IM3CLT5F    PICTURE X.
           02  FILLER REDEFINES IM3CLT5F.
             03 IM3CLT5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CLT5I  PIC X(13).
           02  IM3FXR6L    COMP  PIC  S9(4).
           02  IM3FXR6F    PICTURE X.
           02  FILLER REDEFINES IM3FXR6F.
             03 IM3FXR6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXR6I  PIC X(1).
           02  IM3FRT6L    COMP  PIC  S9(4).
           02  IM3FRT6F    PICTURE X.
           02  FILLER REDEFINES IM3FRT6F.
             03 IM3FRT6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FRT6I  PIC X(10).
           02  IM3FXL6L    COMP  PIC  S9(4).
           02  IM3FXL6F    PICTURE X.
           02  FILLER REDEFINES IM3FXL6F.
             03 IM3FXL6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXL6I  PIC X(1).
           02  IM3FLT6L    COMP  PIC  S9(4).
           02  IM3FLT6F    PICTURE X.
           02  FILLER REDEFINES IM3FLT6F.
             03 IM3FLT6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FLT6I  PIC X(13).
           02  IM3CXR6L    COMP  PIC  S9(4).
           02  IM3CXR6F    PICTURE X.
           02  FILLER REDEFINES IM3CXR6F.
             03 IM3CXR6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXR6I  PIC X(1).
           02  IM3CRT6L    COMP  PIC  S9(4).
           02  IM3CRT6F    PICTURE X.
           02  FILLER REDEFINES IM3CRT6F.
             03 IM3CRT6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CRT6I  PIC X(10).
           02  IM3CXL6L    COMP  PIC  S9(4).
           02  IM3CXL6F    PICTURE X.
           02  FILLER REDEFINES IM3CXL6F.
             03 IM3CXL6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXL6I  PIC X(1).
           02  IM3CLT6L    COMP  PIC  S9(4).
           02  IM3CLT6F    PICTURE X.
           02  FILLER REDEFINES IM3CLT6F.
             03 IM3CLT6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CLT6I  PIC X(13).
           02  IM3FXR7L    COMP  PIC  S9(4).
           02  IM3FXR7F    PICTURE X.
           02  FILLER REDEFINES IM3FXR7F.
             03 IM3FXR7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXR7I  PIC X(1).
           02  IM3FRT7L    COMP  PIC  S9(4).
           02  IM3FRT7F    PICTURE X.
           02  FILLER REDEFINES IM3FRT7F.
             03 IM3FRT7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FRT7I  PIC X(10).
           02  IM3FXL7L    COMP  PIC  S9(4).
           02  IM3FXL7F    PICTURE X.
           02  FILLER REDEFINES IM3FXL7F.
             03 IM3FXL7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXL7I  PIC X(1).
           02  IM3FLT7L    COMP  PIC  S9(4).
           02  IM3FLT7F    PICTURE X.
           02  FILLER REDEFINES IM3FLT7F.
             03 IM3FLT7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FLT7I  PIC X(13).
           02  IM3CXR7L    COMP  PIC  S9(4).
           02  IM3CXR7F    PICTURE X.
           02  FILLER REDEFINES IM3CXR7F.
             03 IM3CXR7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXR7I  PIC X(1).
           02  IM3CRT7L    COMP  PIC  S9(4).
           02  IM3CRT7F    PICTURE X.
           02  FILLER REDEFINES IM3CRT7F.
             03 IM3CRT7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CRT7I  PIC X(10).
           02  IM3CXL7L    COMP  PIC  S9(4).
           02  IM3CXL7F    PICTURE X.
           02  FILLER REDEFINES IM3CXL7F.
             03 IM3CXL7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXL7I  PIC X(1).
           02  IM3CLT7L    COMP  PIC  S9(4).
           02  IM3CLT7F    PICTURE X.
           02  FILLER REDEFINES IM3CLT7F.
             03 IM3CLT7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CLT7I  PIC X(13).
           02  IM3FXR8L    COMP  PIC  S9(4).
           02  IM3FXR8F    PICTURE X.
           02  FILLER REDEFINES IM3FXR8F.
             03 IM3FXR8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXR8I  PIC X(1).
           02  IM3FRT8L    COMP  PIC  S9(4).
           02  IM3FRT8F    PICTURE X.
           02  FILLER REDEFINES IM3FRT8F.
             03 IM3FRT8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FRT8I  PIC X(10).
           02  IM3FXL8L    COMP  PIC  S9(4).
           02  IM3FXL8F    PICTURE X.
           02  FILLER REDEFINES IM3FXL8F.
             03 IM3FXL8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXL8I  PIC X(1).
           02  IM3FLT8L    COMP  PIC  S9(4).
           02  IM3FLT8F    PICTURE X.
           02  FILLER REDEFINES IM3FLT8F.
             03 IM3FLT8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FLT8I  PIC X(13).
           02  IM3CXR8L    COMP  PIC  S9(4).
           02  IM3CXR8F    PICTURE X.
           02  FILLER REDEFINES IM3CXR8F.
             03 IM3CXR8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXR8I  PIC X(1).
           02  IM3CRT8L    COMP  PIC  S9(4).
           02  IM3CRT8F    PICTURE X.
           02  FILLER REDEFINES IM3CRT8F.
             03 IM3CRT8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CRT8I  PIC X(10).
           02  IM3CXL8L    COMP  PIC  S9(4).
           02  IM3CXL8F    PICTURE X.
           02  FILLER REDEFINES IM3CXL8F.
             03 IM3CXL8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXL8I  PIC X(1).
           02  IM3CLT8L    COMP  PIC  S9(4).
           02  IM3CLT8F    PICTURE X.
           02  FILLER REDEFINES IM3CLT8F.
             03 IM3CLT8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CLT8I  PIC X(13).
           02  IM3FXR9L    COMP  PIC  S9(4).
           02  IM3FXR9F    PICTURE X.
           02  FILLER REDEFINES IM3FXR9F.
             03 IM3FXR9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXR9I  PIC X(1).
           02  IM3FRT9L    COMP  PIC  S9(4).
           02  IM3FRT9F    PICTURE X.
           02  FILLER REDEFINES IM3FRT9F.
             03 IM3FRT9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FRT9I  PIC X(10).
           02  IM3FXL9L    COMP  PIC  S9(4).
           02  IM3FXL9F    PICTURE X.
           02  FILLER REDEFINES IM3FXL9F.
             03 IM3FXL9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FXL9I  PIC X(1).
           02  IM3FLT9L    COMP  PIC  S9(4).
           02  IM3FLT9F    PICTURE X.
           02  FILLER REDEFINES IM3FLT9F.
             03 IM3FLT9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FLT9I  PIC X(13).
           02  IM3CXR9L    COMP  PIC  S9(4).
           02  IM3CXR9F    PICTURE X.
           02  FILLER REDEFINES IM3CXR9F.
             03 IM3CXR9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXR9I  PIC X(1).
           02  IM3CRT9L    COMP  PIC  S9(4).
           02  IM3CRT9F    PICTURE X.
           02  FILLER REDEFINES IM3CRT9F.
             03 IM3CRT9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CRT9I  PIC X(10).
           02  IM3CXL9L    COMP  PIC  S9(4).
           02  IM3CXL9F    PICTURE X.
           02  FILLER REDEFINES IM3CXL9F.
             03 IM3CXL9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CXL9I  PIC X(1).
           02  IM3CLT9L    COMP  PIC  S9(4).
           02  IM3CLT9F    PICTURE X.
           02  FILLER REDEFINES IM3CLT9F.
             03 IM3CLT9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CLT9I  PIC X(13).
           02  IM3FEDTL    COMP  PIC  S9(4).
           02  IM3FEDTF    PICTURE X.
           02  FILLER REDEFINES IM3FEDTF.
             03 IM3FEDTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3FEDTI  PIC X(6).
           02  IM3CEDTL    COMP  PIC  S9(4).
           02  IM3CEDTF    PICTURE X.
           02  FILLER REDEFINES IM3CEDTF.
             03 IM3CEDTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM3CEDTI  PIC X(6).
           02  IMPFS03L    COMP  PIC  S9(4).
           02  IMPFS03F    PICTURE X.
           02  FILLER REDEFINES IMPFS03F.
             03 IMPFS03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS03I  PIC X(79).
           02  IMERR03L    COMP  PIC  S9(4).
           02  IMERR03F    PICTURE X.
           02  FILLER REDEFINES IMERR03F.
             03 IMERR03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR03I  PIC X(79).
       01  IMXPM03O REDEFINES IMXPM03I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM3TRIDC    PICTURE X.
           02  IM3TRIDP    PICTURE X.
           02  IM3TRIDH    PICTURE X.
           02  IM3TRIDV    PICTURE X.
           02  IM3TRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IM3DATEC    PICTURE X.
           02  IM3DATEP    PICTURE X.
           02  IM3DATEH    PICTURE X.
           02  IM3DATEV    PICTURE X.
           02  IM3DATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IM3TIMEC    PICTURE X.
           02  IM3TIMEP    PICTURE X.
           02  IM3TIMEH    PICTURE X.
           02  IM3TIMEV    PICTURE X.
           02  IM3TIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IM3PRODC    PICTURE X.
           02  IM3PRODP    PICTURE X.
           02  IM3PRODH    PICTURE X.
           02  IM3PRODV    PICTURE X.
           02  IM3PRODO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM3CTL1C    PICTURE X.
           02  IM3CTL1P    PICTURE X.
           02  IM3CTL1H    PICTURE X.
           02  IM3CTL1V    PICTURE X.
           02  IM3CTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IM3CTL2C    PICTURE X.
           02  IM3CTL2P    PICTURE X.
           02  IM3CTL2H    PICTURE X.
           02  IM3CTL2V    PICTURE X.
           02  IM3CTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM3CTL3C    PICTURE X.
           02  IM3CTL3P    PICTURE X.
           02  IM3CTL3H    PICTURE X.
           02  IM3CTL3V    PICTURE X.
           02  IM3CTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM3ACTNC    PICTURE X.
           02  IM3ACTNP    PICTURE X.
           02  IM3ACTNH    PICTURE X.
           02  IM3ACTNV    PICTURE X.
           02  IM3ACTNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3ALLIC    PICTURE X.
           02  IM3ALLIP    PICTURE X.
           02  IM3ALLIH    PICTURE X.
           02  IM3ALLIV    PICTURE X.
           02  IM3ALLIO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3INDXC    PICTURE X.
           02  IM3INDXP    PICTURE X.
           02  IM3INDXH    PICTURE X.
           02  IM3INDXV    PICTURE X.
           02  IM3INDXO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3ALL1C    PICTURE X.
           02  IM3ALL1P    PICTURE X.
           02  IM3ALL1H    PICTURE X.
           02  IM3ALL1V    PICTURE X.
           02  IM3ALL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CBDLC    PICTURE X.
           02  IM3CBDLP    PICTURE X.
           02  IM3CBDLH    PICTURE X.
           02  IM3CBDLV    PICTURE X.
           02  IM3CBDLO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM3FXR1C    PICTURE X.
           02  IM3FXR1P    PICTURE X.
           02  IM3FXR1H    PICTURE X.
           02  IM3FXR1V    PICTURE X.
           02  IM3FXR1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FRT1C    PICTURE X.
           02  IM3FRT1P    PICTURE X.
           02  IM3FRT1H    PICTURE X.
           02  IM3FRT1V    PICTURE X.
           02  IM3FRT1O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3FXL1C    PICTURE X.
           02  IM3FXL1P    PICTURE X.
           02  IM3FXL1H    PICTURE X.
           02  IM3FXL1V    PICTURE X.
           02  IM3FXL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FLT1C    PICTURE X.
           02  IM3FLT1P    PICTURE X.
           02  IM3FLT1H    PICTURE X.
           02  IM3FLT1V    PICTURE X.
           02  IM3FLT1O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3CXR1C    PICTURE X.
           02  IM3CXR1P    PICTURE X.
           02  IM3CXR1H    PICTURE X.
           02  IM3CXR1V    PICTURE X.
           02  IM3CXR1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CRT1C    PICTURE X.
           02  IM3CRT1P    PICTURE X.
           02  IM3CRT1H    PICTURE X.
           02  IM3CRT1V    PICTURE X.
           02  IM3CRT1O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3CXL1C    PICTURE X.
           02  IM3CXL1P    PICTURE X.
           02  IM3CXL1H    PICTURE X.
           02  IM3CXL1V    PICTURE X.
           02  IM3CXL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CLT1C    PICTURE X.
           02  IM3CLT1P    PICTURE X.
           02  IM3CLT1H    PICTURE X.
           02  IM3CLT1V    PICTURE X.
           02  IM3CLT1O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3FXR2C    PICTURE X.
           02  IM3FXR2P    PICTURE X.
           02  IM3FXR2H    PICTURE X.
           02  IM3FXR2V    PICTURE X.
           02  IM3FXR2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FRT2C    PICTURE X.
           02  IM3FRT2P    PICTURE X.
           02  IM3FRT2H    PICTURE X.
           02  IM3FRT2V    PICTURE X.
           02  IM3FRT2O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3FXL2C    PICTURE X.
           02  IM3FXL2P    PICTURE X.
           02  IM3FXL2H    PICTURE X.
           02  IM3FXL2V    PICTURE X.
           02  IM3FXL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FLT2C    PICTURE X.
           02  IM3FLT2P    PICTURE X.
           02  IM3FLT2H    PICTURE X.
           02  IM3FLT2V    PICTURE X.
           02  IM3FLT2O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3CXR2C    PICTURE X.
           02  IM3CXR2P    PICTURE X.
           02  IM3CXR2H    PICTURE X.
           02  IM3CXR2V    PICTURE X.
           02  IM3CXR2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CRT2C    PICTURE X.
           02  IM3CRT2P    PICTURE X.
           02  IM3CRT2H    PICTURE X.
           02  IM3CRT2V    PICTURE X.
           02  IM3CRT2O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3CXL2C    PICTURE X.
           02  IM3CXL2P    PICTURE X.
           02  IM3CXL2H    PICTURE X.
           02  IM3CXL2V    PICTURE X.
           02  IM3CXL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CLT2C    PICTURE X.
           02  IM3CLT2P    PICTURE X.
           02  IM3CLT2H    PICTURE X.
           02  IM3CLT2V    PICTURE X.
           02  IM3CLT2O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3FXR3C    PICTURE X.
           02  IM3FXR3P    PICTURE X.
           02  IM3FXR3H    PICTURE X.
           02  IM3FXR3V    PICTURE X.
           02  IM3FXR3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FRT3C    PICTURE X.
           02  IM3FRT3P    PICTURE X.
           02  IM3FRT3H    PICTURE X.
           02  IM3FRT3V    PICTURE X.
           02  IM3FRT3O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3FXL3C    PICTURE X.
           02  IM3FXL3P    PICTURE X.
           02  IM3FXL3H    PICTURE X.
           02  IM3FXL3V    PICTURE X.
           02  IM3FXL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FLT3C    PICTURE X.
           02  IM3FLT3P    PICTURE X.
           02  IM3FLT3H    PICTURE X.
           02  IM3FLT3V    PICTURE X.
           02  IM3FLT3O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3CXR3C    PICTURE X.
           02  IM3CXR3P    PICTURE X.
           02  IM3CXR3H    PICTURE X.
           02  IM3CXR3V    PICTURE X.
           02  IM3CXR3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CRT3C    PICTURE X.
           02  IM3CRT3P    PICTURE X.
           02  IM3CRT3H    PICTURE X.
           02  IM3CRT3V    PICTURE X.
           02  IM3CRT3O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3CXL3C    PICTURE X.
           02  IM3CXL3P    PICTURE X.
           02  IM3CXL3H    PICTURE X.
           02  IM3CXL3V    PICTURE X.
           02  IM3CXL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CLT3C    PICTURE X.
           02  IM3CLT3P    PICTURE X.
           02  IM3CLT3H    PICTURE X.
           02  IM3CLT3V    PICTURE X.
           02  IM3CLT3O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3FXR4C    PICTURE X.
           02  IM3FXR4P    PICTURE X.
           02  IM3FXR4H    PICTURE X.
           02  IM3FXR4V    PICTURE X.
           02  IM3FXR4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FRT4C    PICTURE X.
           02  IM3FRT4P    PICTURE X.
           02  IM3FRT4H    PICTURE X.
           02  IM3FRT4V    PICTURE X.
           02  IM3FRT4O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3FXL4C    PICTURE X.
           02  IM3FXL4P    PICTURE X.
           02  IM3FXL4H    PICTURE X.
           02  IM3FXL4V    PICTURE X.
           02  IM3FXL4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FLT4C    PICTURE X.
           02  IM3FLT4P    PICTURE X.
           02  IM3FLT4H    PICTURE X.
           02  IM3FLT4V    PICTURE X.
           02  IM3FLT4O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3CXR4C    PICTURE X.
           02  IM3CXR4P    PICTURE X.
           02  IM3CXR4H    PICTURE X.
           02  IM3CXR4V    PICTURE X.
           02  IM3CXR4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CRT4C    PICTURE X.
           02  IM3CRT4P    PICTURE X.
           02  IM3CRT4H    PICTURE X.
           02  IM3CRT4V    PICTURE X.
           02  IM3CRT4O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3CXL4C    PICTURE X.
           02  IM3CXL4P    PICTURE X.
           02  IM3CXL4H    PICTURE X.
           02  IM3CXL4V    PICTURE X.
           02  IM3CXL4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CLT4C    PICTURE X.
           02  IM3CLT4P    PICTURE X.
           02  IM3CLT4H    PICTURE X.
           02  IM3CLT4V    PICTURE X.
           02  IM3CLT4O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3FXR5C    PICTURE X.
           02  IM3FXR5P    PICTURE X.
           02  IM3FXR5H    PICTURE X.
           02  IM3FXR5V    PICTURE X.
           02  IM3FXR5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FRT5C    PICTURE X.
           02  IM3FRT5P    PICTURE X.
           02  IM3FRT5H    PICTURE X.
           02  IM3FRT5V    PICTURE X.
           02  IM3FRT5O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3FXL5C    PICTURE X.
           02  IM3FXL5P    PICTURE X.
           02  IM3FXL5H    PICTURE X.
           02  IM3FXL5V    PICTURE X.
           02  IM3FXL5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FLT5C    PICTURE X.
           02  IM3FLT5P    PICTURE X.
           02  IM3FLT5H    PICTURE X.
           02  IM3FLT5V    PICTURE X.
           02  IM3FLT5O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3CXR5C    PICTURE X.
           02  IM3CXR5P    PICTURE X.
           02  IM3CXR5H    PICTURE X.
           02  IM3CXR5V    PICTURE X.
           02  IM3CXR5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CRT5C    PICTURE X.
           02  IM3CRT5P    PICTURE X.
           02  IM3CRT5H    PICTURE X.
           02  IM3CRT5V    PICTURE X.
           02  IM3CRT5O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3CXL5C    PICTURE X.
           02  IM3CXL5P    PICTURE X.
           02  IM3CXL5H    PICTURE X.
           02  IM3CXL5V    PICTURE X.
           02  IM3CXL5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CLT5C    PICTURE X.
           02  IM3CLT5P    PICTURE X.
           02  IM3CLT5H    PICTURE X.
           02  IM3CLT5V    PICTURE X.
           02  IM3CLT5O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3FXR6C    PICTURE X.
           02  IM3FXR6P    PICTURE X.
           02  IM3FXR6H    PICTURE X.
           02  IM3FXR6V    PICTURE X.
           02  IM3FXR6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FRT6C    PICTURE X.
           02  IM3FRT6P    PICTURE X.
           02  IM3FRT6H    PICTURE X.
           02  IM3FRT6V    PICTURE X.
           02  IM3FRT6O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3FXL6C    PICTURE X.
           02  IM3FXL6P    PICTURE X.
           02  IM3FXL6H    PICTURE X.
           02  IM3FXL6V    PICTURE X.
           02  IM3FXL6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FLT6C    PICTURE X.
           02  IM3FLT6P    PICTURE X.
           02  IM3FLT6H    PICTURE X.
           02  IM3FLT6V    PICTURE X.
           02  IM3FLT6O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3CXR6C    PICTURE X.
           02  IM3CXR6P    PICTURE X.
           02  IM3CXR6H    PICTURE X.
           02  IM3CXR6V    PICTURE X.
           02  IM3CXR6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CRT6C    PICTURE X.
           02  IM3CRT6P    PICTURE X.
           02  IM3CRT6H    PICTURE X.
           02  IM3CRT6V    PICTURE X.
           02  IM3CRT6O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3CXL6C    PICTURE X.
           02  IM3CXL6P    PICTURE X.
           02  IM3CXL6H    PICTURE X.
           02  IM3CXL6V    PICTURE X.
           02  IM3CXL6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CLT6C    PICTURE X.
           02  IM3CLT6P    PICTURE X.
           02  IM3CLT6H    PICTURE X.
           02  IM3CLT6V    PICTURE X.
           02  IM3CLT6O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3FXR7C    PICTURE X.
           02  IM3FXR7P    PICTURE X.
           02  IM3FXR7H    PICTURE X.
           02  IM3FXR7V    PICTURE X.
           02  IM3FXR7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FRT7C    PICTURE X.
           02  IM3FRT7P    PICTURE X.
           02  IM3FRT7H    PICTURE X.
           02  IM3FRT7V    PICTURE X.
           02  IM3FRT7O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3FXL7C    PICTURE X.
           02  IM3FXL7P    PICTURE X.
           02  IM3FXL7H    PICTURE X.
           02  IM3FXL7V    PICTURE X.
           02  IM3FXL7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FLT7C    PICTURE X.
           02  IM3FLT7P    PICTURE X.
           02  IM3FLT7H    PICTURE X.
           02  IM3FLT7V    PICTURE X.
           02  IM3FLT7O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3CXR7C    PICTURE X.
           02  IM3CXR7P    PICTURE X.
           02  IM3CXR7H    PICTURE X.
           02  IM3CXR7V    PICTURE X.
           02  IM3CXR7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CRT7C    PICTURE X.
           02  IM3CRT7P    PICTURE X.
           02  IM3CRT7H    PICTURE X.
           02  IM3CRT7V    PICTURE X.
           02  IM3CRT7O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3CXL7C    PICTURE X.
           02  IM3CXL7P    PICTURE X.
           02  IM3CXL7H    PICTURE X.
           02  IM3CXL7V    PICTURE X.
           02  IM3CXL7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CLT7C    PICTURE X.
           02  IM3CLT7P    PICTURE X.
           02  IM3CLT7H    PICTURE X.
           02  IM3CLT7V    PICTURE X.
           02  IM3CLT7O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3FXR8C    PICTURE X.
           02  IM3FXR8P    PICTURE X.
           02  IM3FXR8H    PICTURE X.
           02  IM3FXR8V    PICTURE X.
           02  IM3FXR8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FRT8C    PICTURE X.
           02  IM3FRT8P    PICTURE X.
           02  IM3FRT8H    PICTURE X.
           02  IM3FRT8V    PICTURE X.
           02  IM3FRT8O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3FXL8C    PICTURE X.
           02  IM3FXL8P    PICTURE X.
           02  IM3FXL8H    PICTURE X.
           02  IM3FXL8V    PICTURE X.
           02  IM3FXL8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FLT8C    PICTURE X.
           02  IM3FLT8P    PICTURE X.
           02  IM3FLT8H    PICTURE X.
           02  IM3FLT8V    PICTURE X.
           02  IM3FLT8O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3CXR8C    PICTURE X.
           02  IM3CXR8P    PICTURE X.
           02  IM3CXR8H    PICTURE X.
           02  IM3CXR8V    PICTURE X.
           02  IM3CXR8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CRT8C    PICTURE X.
           02  IM3CRT8P    PICTURE X.
           02  IM3CRT8H    PICTURE X.
           02  IM3CRT8V    PICTURE X.
           02  IM3CRT8O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3CXL8C    PICTURE X.
           02  IM3CXL8P    PICTURE X.
           02  IM3CXL8H    PICTURE X.
           02  IM3CXL8V    PICTURE X.
           02  IM3CXL8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CLT8C    PICTURE X.
           02  IM3CLT8P    PICTURE X.
           02  IM3CLT8H    PICTURE X.
           02  IM3CLT8V    PICTURE X.
           02  IM3CLT8O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3FXR9C    PICTURE X.
           02  IM3FXR9P    PICTURE X.
           02  IM3FXR9H    PICTURE X.
           02  IM3FXR9V    PICTURE X.
           02  IM3FXR9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FRT9C    PICTURE X.
           02  IM3FRT9P    PICTURE X.
           02  IM3FRT9H    PICTURE X.
           02  IM3FRT9V    PICTURE X.
           02  IM3FRT9O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3FXL9C    PICTURE X.
           02  IM3FXL9P    PICTURE X.
           02  IM3FXL9H    PICTURE X.
           02  IM3FXL9V    PICTURE X.
           02  IM3FXL9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3FLT9C    PICTURE X.
           02  IM3FLT9P    PICTURE X.
           02  IM3FLT9H    PICTURE X.
           02  IM3FLT9V    PICTURE X.
           02  IM3FLT9O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3CXR9C    PICTURE X.
           02  IM3CXR9P    PICTURE X.
           02  IM3CXR9H    PICTURE X.
           02  IM3CXR9V    PICTURE X.
           02  IM3CXR9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CRT9C    PICTURE X.
           02  IM3CRT9P    PICTURE X.
           02  IM3CRT9H    PICTURE X.
           02  IM3CRT9V    PICTURE X.
           02  IM3CRT9O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM3CXL9C    PICTURE X.
           02  IM3CXL9P    PICTURE X.
           02  IM3CXL9H    PICTURE X.
           02  IM3CXL9V    PICTURE X.
           02  IM3CXL9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM3CLT9C    PICTURE X.
           02  IM3CLT9P    PICTURE X.
           02  IM3CLT9H    PICTURE X.
           02  IM3CLT9V    PICTURE X.
           02  IM3CLT9O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM3FEDTC    PICTURE X.
           02  IM3FEDTP    PICTURE X.
           02  IM3FEDTH    PICTURE X.
           02  IM3FEDTV    PICTURE X.
           02  IM3FEDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IM3CEDTC    PICTURE X.
           02  IM3CEDTP    PICTURE X.
           02  IM3CEDTH    PICTURE X.
           02  IM3CEDTV    PICTURE X.
           02  IM3CEDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMPFS03C    PICTURE X.
           02  IMPFS03P    PICTURE X.
           02  IMPFS03H    PICTURE X.
           02  IMPFS03V    PICTURE X.
           02  IMPFS03O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR03C    PICTURE X.
           02  IMERR03P    PICTURE X.
           02  IMERR03H    PICTURE X.
           02  IMERR03V    PICTURE X.
           02  IMERR03O  PIC X(79).
       01  IMXPM04I REDEFINES IMXPM06I.
           02  FILLER PIC X(12).
           02  IM4TRIDL    COMP  PIC  S9(4).
           02  IM4TRIDF    PICTURE X.
           02  FILLER REDEFINES IM4TRIDF.
             03 IM4TRIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4TRIDI  PIC X(4).
           02  IM4DATEL    COMP  PIC  S9(4).
           02  IM4DATEF    PICTURE X.
           02  FILLER REDEFINES IM4DATEF.
             03 IM4DATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4DATEI  PIC X(8).
           02  IM4TIMEL    COMP  PIC  S9(4).
           02  IM4TIMEF    PICTURE X.
           02  FILLER REDEFINES IM4TIMEF.
             03 IM4TIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4TIMEI  PIC X(8).
           02  IM4PRODL    COMP  PIC  S9(4).
           02  IM4PRODF    PICTURE X.
           02  FILLER REDEFINES IM4PRODF.
             03 IM4PRODA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4PRODI  PIC X(3).
           02  IM4CTL1L    COMP  PIC  S9(4).
           02  IM4CTL1F    PICTURE X.
           02  FILLER REDEFINES IM4CTL1F.
             03 IM4CTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CTL1I  PIC X(2).
           02  IM4CTL2L    COMP  PIC  S9(4).
           02  IM4CTL2F    PICTURE X.
           02  FILLER REDEFINES IM4CTL2F.
             03 IM4CTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CTL2I  PIC X(3).
           02  IM4CTL3L    COMP  PIC  S9(4).
           02  IM4CTL3F    PICTURE X.
           02  FILLER REDEFINES IM4CTL3F.
             03 IM4CTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CTL3I  PIC X(3).
           02  IM4ACTNL    COMP  PIC  S9(4).
           02  IM4ACTNF    PICTURE X.
           02  FILLER REDEFINES IM4ACTNF.
             03 IM4ACTNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4ACTNI  PIC X(1).
           02  IM4ALLFL    COMP  PIC  S9(4).
           02  IM4ALLFF    PICTURE X.
           02  FILLER REDEFINES IM4ALLFF.
             03 IM4ALLFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4ALLFI  PIC X(1).
           02  IM4ALL1L    COMP  PIC  S9(4).
           02  IM4ALL1F    PICTURE X.
           02  FILLER REDEFINES IM4ALL1F.
             03 IM4ALL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4ALL1I  PIC X(1).
           02  IM4FX11L    COMP  PIC  S9(4).
           02  IM4FX11F    PICTURE X.
           02  FILLER REDEFINES IM4FX11F.
             03 IM4FX11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FX11I  PIC X(1).
           02  IM4FR11L    COMP  PIC  S9(4).
           02  IM4FR11F    PICTURE X.
           02  FILLER REDEFINES IM4FR11F.
             03 IM4FR11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FR11I  PIC X(10).
           02  IM4FY11L    COMP  PIC  S9(4).
           02  IM4FY11F    PICTURE X.
           02  FILLER REDEFINES IM4FY11F.
             03 IM4FY11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FY11I  PIC X(1).
           02  IM4FL11L    COMP  PIC  S9(4).
           02  IM4FL11F    PICTURE X.
           02  FILLER REDEFINES IM4FL11F.
             03 IM4FL11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FL11I  PIC X(13).
           02  IM4CX11L    COMP  PIC  S9(4).
           02  IM4CX11F    PICTURE X.
           02  FILLER REDEFINES IM4CX11F.
             03 IM4CX11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CX11I  PIC X(1).
           02  IM4CR11L    COMP  PIC  S9(4).
           02  IM4CR11F    PICTURE X.
           02  FILLER REDEFINES IM4CR11F.
             03 IM4CR11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CR11I  PIC X(10).
           02  IM4CY11L    COMP  PIC  S9(4).
           02  IM4CY11F    PICTURE X.
           02  FILLER REDEFINES IM4CY11F.
             03 IM4CY11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CY11I  PIC X(1).
           02  IM4CL11L    COMP  PIC  S9(4).
           02  IM4CL11F    PICTURE X.
           02  FILLER REDEFINES IM4CL11F.
             03 IM4CL11A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CL11I  PIC X(13).
           02  IM4FX12L    COMP  PIC  S9(4).
           02  IM4FX12F    PICTURE X.
           02  FILLER REDEFINES IM4FX12F.
             03 IM4FX12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FX12I  PIC X(1).
           02  IM4FR12L    COMP  PIC  S9(4).
           02  IM4FR12F    PICTURE X.
           02  FILLER REDEFINES IM4FR12F.
             03 IM4FR12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FR12I  PIC X(10).
           02  IM4FY12L    COMP  PIC  S9(4).
           02  IM4FY12F    PICTURE X.
           02  FILLER REDEFINES IM4FY12F.
             03 IM4FY12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FY12I  PIC X(1).
           02  IM4FL12L    COMP  PIC  S9(4).
           02  IM4FL12F    PICTURE X.
           02  FILLER REDEFINES IM4FL12F.
             03 IM4FL12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FL12I  PIC X(13).
           02  IM4CX12L    COMP  PIC  S9(4).
           02  IM4CX12F    PICTURE X.
           02  FILLER REDEFINES IM4CX12F.
             03 IM4CX12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CX12I  PIC X(1).
           02  IM4CR12L    COMP  PIC  S9(4).
           02  IM4CR12F    PICTURE X.
           02  FILLER REDEFINES IM4CR12F.
             03 IM4CR12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CR12I  PIC X(10).
           02  IM4CY12L    COMP  PIC  S9(4).
           02  IM4CY12F    PICTURE X.
           02  FILLER REDEFINES IM4CY12F.
             03 IM4CY12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CY12I  PIC X(1).
           02  IM4CL12L    COMP  PIC  S9(4).
           02  IM4CL12F    PICTURE X.
           02  FILLER REDEFINES IM4CL12F.
             03 IM4CL12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CL12I  PIC X(13).
           02  IM4FX13L    COMP  PIC  S9(4).
           02  IM4FX13F    PICTURE X.
           02  FILLER REDEFINES IM4FX13F.
             03 IM4FX13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FX13I  PIC X(1).
           02  IM4FR13L    COMP  PIC  S9(4).
           02  IM4FR13F    PICTURE X.
           02  FILLER REDEFINES IM4FR13F.
             03 IM4FR13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FR13I  PIC X(10).
           02  IM4FY13L    COMP  PIC  S9(4).
           02  IM4FY13F    PICTURE X.
           02  FILLER REDEFINES IM4FY13F.
             03 IM4FY13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FY13I  PIC X(1).
           02  IM4FL13L    COMP  PIC  S9(4).
           02  IM4FL13F    PICTURE X.
           02  FILLER REDEFINES IM4FL13F.
             03 IM4FL13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FL13I  PIC X(13).
           02  IM4CX13L    COMP  PIC  S9(4).
           02  IM4CX13F    PICTURE X.
           02  FILLER REDEFINES IM4CX13F.
             03 IM4CX13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CX13I  PIC X(1).
           02  IM4CR13L    COMP  PIC  S9(4).
           02  IM4CR13F    PICTURE X.
           02  FILLER REDEFINES IM4CR13F.
             03 IM4CR13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CR13I  PIC X(10).
           02  IM4CY13L    COMP  PIC  S9(4).
           02  IM4CY13F    PICTURE X.
           02  FILLER REDEFINES IM4CY13F.
             03 IM4CY13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CY13I  PIC X(1).
           02  IM4CL13L    COMP  PIC  S9(4).
           02  IM4CL13F    PICTURE X.
           02  FILLER REDEFINES IM4CL13F.
             03 IM4CL13A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CL13I  PIC X(13).
           02  IM4CBF1L    COMP  PIC  S9(4).
           02  IM4CBF1F    PICTURE X.
           02  FILLER REDEFINES IM4CBF1F.
             03 IM4CBF1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CBF1I  PIC X(12).
           02  IM4FED1L    COMP  PIC  S9(4).
           02  IM4FED1F    PICTURE X.
           02  FILLER REDEFINES IM4FED1F.
             03 IM4FED1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FED1I  PIC X(6).
           02  IM4CED1L    COMP  PIC  S9(4).
           02  IM4CED1F    PICTURE X.
           02  FILLER REDEFINES IM4CED1F.
             03 IM4CED1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CED1I  PIC X(6).
           02  IM4ALL2L    COMP  PIC  S9(4).
           02  IM4ALL2F    PICTURE X.
           02  FILLER REDEFINES IM4ALL2F.
             03 IM4ALL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4ALL2I  PIC X(1).
           02  IM4FX21L    COMP  PIC  S9(4).
           02  IM4FX21F    PICTURE X.
           02  FILLER REDEFINES IM4FX21F.
             03 IM4FX21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FX21I  PIC X(1).
           02  IM4FR21L    COMP  PIC  S9(4).
           02  IM4FR21F    PICTURE X.
           02  FILLER REDEFINES IM4FR21F.
             03 IM4FR21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FR21I  PIC X(10).
           02  IM4FY21L    COMP  PIC  S9(4).
           02  IM4FY21F    PICTURE X.
           02  FILLER REDEFINES IM4FY21F.
             03 IM4FY21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FY21I  PIC X(1).
           02  IM4FL21L    COMP  PIC  S9(4).
           02  IM4FL21F    PICTURE X.
           02  FILLER REDEFINES IM4FL21F.
             03 IM4FL21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FL21I  PIC X(13).
           02  IM4CX21L    COMP  PIC  S9(4).
           02  IM4CX21F    PICTURE X.
           02  FILLER REDEFINES IM4CX21F.
             03 IM4CX21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CX21I  PIC X(1).
           02  IM4CR21L    COMP  PIC  S9(4).
           02  IM4CR21F    PICTURE X.
           02  FILLER REDEFINES IM4CR21F.
             03 IM4CR21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CR21I  PIC X(10).
           02  IM4CY21L    COMP  PIC  S9(4).
           02  IM4CY21F    PICTURE X.
           02  FILLER REDEFINES IM4CY21F.
             03 IM4CY21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CY21I  PIC X(1).
           02  IM4CL21L    COMP  PIC  S9(4).
           02  IM4CL21F    PICTURE X.
           02  FILLER REDEFINES IM4CL21F.
             03 IM4CL21A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CL21I  PIC X(13).
           02  IM4FX22L    COMP  PIC  S9(4).
           02  IM4FX22F    PICTURE X.
           02  FILLER REDEFINES IM4FX22F.
             03 IM4FX22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FX22I  PIC X(1).
           02  IM4FR22L    COMP  PIC  S9(4).
           02  IM4FR22F    PICTURE X.
           02  FILLER REDEFINES IM4FR22F.
             03 IM4FR22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FR22I  PIC X(10).
           02  IM4RY22L    COMP  PIC  S9(4).
           02  IM4RY22F    PICTURE X.
           02  FILLER REDEFINES IM4RY22F.
             03 IM4RY22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4RY22I  PIC X(1).
           02  IM4FL22L    COMP  PIC  S9(4).
           02  IM4FL22F    PICTURE X.
           02  FILLER REDEFINES IM4FL22F.
             03 IM4FL22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FL22I  PIC X(13).
           02  IM4CX22L    COMP  PIC  S9(4).
           02  IM4CX22F    PICTURE X.
           02  FILLER REDEFINES IM4CX22F.
             03 IM4CX22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CX22I  PIC X(1).
           02  IM4CR22L    COMP  PIC  S9(4).
           02  IM4CR22F    PICTURE X.
           02  FILLER REDEFINES IM4CR22F.
             03 IM4CR22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CR22I  PIC X(10).
           02  IM4CY22L    COMP  PIC  S9(4).
           02  IM4CY22F    PICTURE X.
           02  FILLER REDEFINES IM4CY22F.
             03 IM4CY22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CY22I  PIC X(1).
           02  IM4CL22L    COMP  PIC  S9(4).
           02  IM4CL22F    PICTURE X.
           02  FILLER REDEFINES IM4CL22F.
             03 IM4CL22A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CL22I  PIC X(13).
           02  IM4FX23L    COMP  PIC  S9(4).
           02  IM4FX23F    PICTURE X.
           02  FILLER REDEFINES IM4FX23F.
             03 IM4FX23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FX23I  PIC X(1).
           02  IM4FR23L    COMP  PIC  S9(4).
           02  IM4FR23F    PICTURE X.
           02  FILLER REDEFINES IM4FR23F.
             03 IM4FR23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FR23I  PIC X(10).
           02  IM4FY23L    COMP  PIC  S9(4).
           02  IM4FY23F    PICTURE X.
           02  FILLER REDEFINES IM4FY23F.
             03 IM4FY23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FY23I  PIC X(1).
           02  IM4FL23L    COMP  PIC  S9(4).
           02  IM4FL23F    PICTURE X.
           02  FILLER REDEFINES IM4FL23F.
             03 IM4FL23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FL23I  PIC X(13).
           02  IM4CX23L    COMP  PIC  S9(4).
           02  IM4CX23F    PICTURE X.
           02  FILLER REDEFINES IM4CX23F.
             03 IM4CX23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CX23I  PIC X(1).
           02  IM4CR23L    COMP  PIC  S9(4).
           02  IM4CR23F    PICTURE X.
           02  FILLER REDEFINES IM4CR23F.
             03 IM4CR23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CR23I  PIC X(10).
           02  IM4CY23L    COMP  PIC  S9(4).
           02  IM4CY23F    PICTURE X.
           02  FILLER REDEFINES IM4CY23F.
             03 IM4CY23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CY23I  PIC X(1).
           02  IM4CL23L    COMP  PIC  S9(4).
           02  IM4CL23F    PICTURE X.
           02  FILLER REDEFINES IM4CL23F.
             03 IM4CL23A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CL23I  PIC X(13).
           02  IM4CBF2L    COMP  PIC  S9(4).
           02  IM4CBF2F    PICTURE X.
           02  FILLER REDEFINES IM4CBF2F.
             03 IM4CBF2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CBF2I  PIC X(12).
           02  IM4FED2L    COMP  PIC  S9(4).
           02  IM4FED2F    PICTURE X.
           02  FILLER REDEFINES IM4FED2F.
             03 IM4FED2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FED2I  PIC X(6).
           02  IM4CED2L    COMP  PIC  S9(4).
           02  IM4CED2F    PICTURE X.
           02  FILLER REDEFINES IM4CED2F.
             03 IM4CED2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CED2I  PIC X(6).
           02  IM4ALL3L    COMP  PIC  S9(4).
           02  IM4ALL3F    PICTURE X.
           02  FILLER REDEFINES IM4ALL3F.
             03 IM4ALL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4ALL3I  PIC X(1).
           02  IM4FX31L    COMP  PIC  S9(4).
           02  IM4FX31F    PICTURE X.
           02  FILLER REDEFINES IM4FX31F.
             03 IM4FX31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FX31I  PIC X(1).
           02  IM4FR31L    COMP  PIC  S9(4).
           02  IM4FR31F    PICTURE X.
           02  FILLER REDEFINES IM4FR31F.
             03 IM4FR31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FR31I  PIC X(10).
           02  IM4FY31L    COMP  PIC  S9(4).
           02  IM4FY31F    PICTURE X.
           02  FILLER REDEFINES IM4FY31F.
             03 IM4FY31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FY31I  PIC X(1).
           02  IM4FL31L    COMP  PIC  S9(4).
           02  IM4FL31F    PICTURE X.
           02  FILLER REDEFINES IM4FL31F.
             03 IM4FL31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FL31I  PIC X(13).
           02  IM4CX31L    COMP  PIC  S9(4).
           02  IM4CX31F    PICTURE X.
           02  FILLER REDEFINES IM4CX31F.
             03 IM4CX31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CX31I  PIC X(1).
           02  IM4CR31L    COMP  PIC  S9(4).
           02  IM4CR31F    PICTURE X.
           02  FILLER REDEFINES IM4CR31F.
             03 IM4CR31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CR31I  PIC X(10).
           02  IM4CY31L    COMP  PIC  S9(4).
           02  IM4CY31F    PICTURE X.
           02  FILLER REDEFINES IM4CY31F.
             03 IM4CY31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CY31I  PIC X(1).
           02  IM4CL31L    COMP  PIC  S9(4).
           02  IM4CL31F    PICTURE X.
           02  FILLER REDEFINES IM4CL31F.
             03 IM4CL31A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CL31I  PIC X(13).
           02  IM4FX32L    COMP  PIC  S9(4).
           02  IM4FX32F    PICTURE X.
           02  FILLER REDEFINES IM4FX32F.
             03 IM4FX32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FX32I  PIC X(1).
           02  IM4FR32L    COMP  PIC  S9(4).
           02  IM4FR32F    PICTURE X.
           02  FILLER REDEFINES IM4FR32F.
             03 IM4FR32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FR32I  PIC X(10).
           02  IM4FY32L    COMP  PIC  S9(4).
           02  IM4FY32F    PICTURE X.
           02  FILLER REDEFINES IM4FY32F.
             03 IM4FY32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FY32I  PIC X(1).
           02  IM4FL32L    COMP  PIC  S9(4).
           02  IM4FL32F    PICTURE X.
           02  FILLER REDEFINES IM4FL32F.
             03 IM4FL32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FL32I  PIC X(13).
           02  IM4CX32L    COMP  PIC  S9(4).
           02  IM4CX32F    PICTURE X.
           02  FILLER REDEFINES IM4CX32F.
             03 IM4CX32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CX32I  PIC X(1).
           02  IM4CR32L    COMP  PIC  S9(4).
           02  IM4CR32F    PICTURE X.
           02  FILLER REDEFINES IM4CR32F.
             03 IM4CR32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CR32I  PIC X(10).
           02  IM4CY32L    COMP  PIC  S9(4).
           02  IM4CY32F    PICTURE X.
           02  FILLER REDEFINES IM4CY32F.
             03 IM4CY32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CY32I  PIC X(1).
           02  IM4CL32L    COMP  PIC  S9(4).
           02  IM4CL32F    PICTURE X.
           02  FILLER REDEFINES IM4CL32F.
             03 IM4CL32A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CL32I  PIC X(13).
           02  IM4FX33L    COMP  PIC  S9(4).
           02  IM4FX33F    PICTURE X.
           02  FILLER REDEFINES IM4FX33F.
             03 IM4FX33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FX33I  PIC X(1).
           02  IM4FR33L    COMP  PIC  S9(4).
           02  IM4FR33F    PICTURE X.
           02  FILLER REDEFINES IM4FR33F.
             03 IM4FR33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FR33I  PIC X(10).
           02  IM4FY33L    COMP  PIC  S9(4).
           02  IM4FY33F    PICTURE X.
           02  FILLER REDEFINES IM4FY33F.
             03 IM4FY33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FY33I  PIC X(1).
           02  IM4FL33L    COMP  PIC  S9(4).
           02  IM4FL33F    PICTURE X.
           02  FILLER REDEFINES IM4FL33F.
             03 IM4FL33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FL33I  PIC X(13).
           02  IM4CX33L    COMP  PIC  S9(4).
           02  IM4CX33F    PICTURE X.
           02  FILLER REDEFINES IM4CX33F.
             03 IM4CX33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CX33I  PIC X(1).
           02  IM4CR33L    COMP  PIC  S9(4).
           02  IM4CR33F    PICTURE X.
           02  FILLER REDEFINES IM4CR33F.
             03 IM4CR33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CR33I  PIC X(10).
           02  IM4CY33L    COMP  PIC  S9(4).
           02  IM4CY33F    PICTURE X.
           02  FILLER REDEFINES IM4CY33F.
             03 IM4CY33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CY33I  PIC X(1).
           02  IM4CL33L    COMP  PIC  S9(4).
           02  IM4CL33F    PICTURE X.
           02  FILLER REDEFINES IM4CL33F.
             03 IM4CL33A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CL33I  PIC X(13).
           02  IM4CBF3L    COMP  PIC  S9(4).
           02  IM4CBF3F    PICTURE X.
           02  FILLER REDEFINES IM4CBF3F.
             03 IM4CBF3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CBF3I  PIC X(12).
           02  IM4FED3L    COMP  PIC  S9(4).
           02  IM4FED3F    PICTURE X.
           02  FILLER REDEFINES IM4FED3F.
             03 IM4FED3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4FED3I  PIC X(6).
           02  IM4CED3L    COMP  PIC  S9(4).
           02  IM4CED3F    PICTURE X.
           02  FILLER REDEFINES IM4CED3F.
             03 IM4CED3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM4CED3I  PIC X(6).
           02  IMPFS04L    COMP  PIC  S9(4).
           02  IMPFS04F    PICTURE X.
           02  FILLER REDEFINES IMPFS04F.
             03 IMPFS04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS04I  PIC X(79).
           02  IMERR04L    COMP  PIC  S9(4).
           02  IMERR04F    PICTURE X.
           02  FILLER REDEFINES IMERR04F.
             03 IMERR04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR04I  PIC X(79).
       01  IMXPM04O REDEFINES IMXPM04I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM4TRIDC    PICTURE X.
           02  IM4TRIDP    PICTURE X.
           02  IM4TRIDH    PICTURE X.
           02  IM4TRIDV    PICTURE X.
           02  IM4TRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IM4DATEC    PICTURE X.
           02  IM4DATEP    PICTURE X.
           02  IM4DATEH    PICTURE X.
           02  IM4DATEV    PICTURE X.
           02  IM4DATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IM4TIMEC    PICTURE X.
           02  IM4TIMEP    PICTURE X.
           02  IM4TIMEH    PICTURE X.
           02  IM4TIMEV    PICTURE X.
           02  IM4TIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IM4PRODC    PICTURE X.
           02  IM4PRODP    PICTURE X.
           02  IM4PRODH    PICTURE X.
           02  IM4PRODV    PICTURE X.
           02  IM4PRODO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM4CTL1C    PICTURE X.
           02  IM4CTL1P    PICTURE X.
           02  IM4CTL1H    PICTURE X.
           02  IM4CTL1V    PICTURE X.
           02  IM4CTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IM4CTL2C    PICTURE X.
           02  IM4CTL2P    PICTURE X.
           02  IM4CTL2H    PICTURE X.
           02  IM4CTL2V    PICTURE X.
           02  IM4CTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM4CTL3C    PICTURE X.
           02  IM4CTL3P    PICTURE X.
           02  IM4CTL3H    PICTURE X.
           02  IM4CTL3V    PICTURE X.
           02  IM4CTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM4ACTNC    PICTURE X.
           02  IM4ACTNP    PICTURE X.
           02  IM4ACTNH    PICTURE X.
           02  IM4ACTNV    PICTURE X.
           02  IM4ACTNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4ALLFC    PICTURE X.
           02  IM4ALLFP    PICTURE X.
           02  IM4ALLFH    PICTURE X.
           02  IM4ALLFV    PICTURE X.
           02  IM4ALLFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4ALL1C    PICTURE X.
           02  IM4ALL1P    PICTURE X.
           02  IM4ALL1H    PICTURE X.
           02  IM4ALL1V    PICTURE X.
           02  IM4ALL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FX11C    PICTURE X.
           02  IM4FX11P    PICTURE X.
           02  IM4FX11H    PICTURE X.
           02  IM4FX11V    PICTURE X.
           02  IM4FX11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FR11C    PICTURE X.
           02  IM4FR11P    PICTURE X.
           02  IM4FR11H    PICTURE X.
           02  IM4FR11V    PICTURE X.
           02  IM4FR11O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4FY11C    PICTURE X.
           02  IM4FY11P    PICTURE X.
           02  IM4FY11H    PICTURE X.
           02  IM4FY11V    PICTURE X.
           02  IM4FY11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FL11C    PICTURE X.
           02  IM4FL11P    PICTURE X.
           02  IM4FL11H    PICTURE X.
           02  IM4FL11V    PICTURE X.
           02  IM4FL11O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CX11C    PICTURE X.
           02  IM4CX11P    PICTURE X.
           02  IM4CX11H    PICTURE X.
           02  IM4CX11V    PICTURE X.
           02  IM4CX11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CR11C    PICTURE X.
           02  IM4CR11P    PICTURE X.
           02  IM4CR11H    PICTURE X.
           02  IM4CR11V    PICTURE X.
           02  IM4CR11O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4CY11C    PICTURE X.
           02  IM4CY11P    PICTURE X.
           02  IM4CY11H    PICTURE X.
           02  IM4CY11V    PICTURE X.
           02  IM4CY11O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CL11C    PICTURE X.
           02  IM4CL11P    PICTURE X.
           02  IM4CL11H    PICTURE X.
           02  IM4CL11V    PICTURE X.
           02  IM4CL11O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4FX12C    PICTURE X.
           02  IM4FX12P    PICTURE X.
           02  IM4FX12H    PICTURE X.
           02  IM4FX12V    PICTURE X.
           02  IM4FX12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FR12C    PICTURE X.
           02  IM4FR12P    PICTURE X.
           02  IM4FR12H    PICTURE X.
           02  IM4FR12V    PICTURE X.
           02  IM4FR12O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4FY12C    PICTURE X.
           02  IM4FY12P    PICTURE X.
           02  IM4FY12H    PICTURE X.
           02  IM4FY12V    PICTURE X.
           02  IM4FY12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FL12C    PICTURE X.
           02  IM4FL12P    PICTURE X.
           02  IM4FL12H    PICTURE X.
           02  IM4FL12V    PICTURE X.
           02  IM4FL12O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CX12C    PICTURE X.
           02  IM4CX12P    PICTURE X.
           02  IM4CX12H    PICTURE X.
           02  IM4CX12V    PICTURE X.
           02  IM4CX12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CR12C    PICTURE X.
           02  IM4CR12P    PICTURE X.
           02  IM4CR12H    PICTURE X.
           02  IM4CR12V    PICTURE X.
           02  IM4CR12O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4CY12C    PICTURE X.
           02  IM4CY12P    PICTURE X.
           02  IM4CY12H    PICTURE X.
           02  IM4CY12V    PICTURE X.
           02  IM4CY12O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CL12C    PICTURE X.
           02  IM4CL12P    PICTURE X.
           02  IM4CL12H    PICTURE X.
           02  IM4CL12V    PICTURE X.
           02  IM4CL12O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4FX13C    PICTURE X.
           02  IM4FX13P    PICTURE X.
           02  IM4FX13H    PICTURE X.
           02  IM4FX13V    PICTURE X.
           02  IM4FX13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FR13C    PICTURE X.
           02  IM4FR13P    PICTURE X.
           02  IM4FR13H    PICTURE X.
           02  IM4FR13V    PICTURE X.
           02  IM4FR13O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4FY13C    PICTURE X.
           02  IM4FY13P    PICTURE X.
           02  IM4FY13H    PICTURE X.
           02  IM4FY13V    PICTURE X.
           02  IM4FY13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FL13C    PICTURE X.
           02  IM4FL13P    PICTURE X.
           02  IM4FL13H    PICTURE X.
           02  IM4FL13V    PICTURE X.
           02  IM4FL13O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CX13C    PICTURE X.
           02  IM4CX13P    PICTURE X.
           02  IM4CX13H    PICTURE X.
           02  IM4CX13V    PICTURE X.
           02  IM4CX13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CR13C    PICTURE X.
           02  IM4CR13P    PICTURE X.
           02  IM4CR13H    PICTURE X.
           02  IM4CR13V    PICTURE X.
           02  IM4CR13O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4CY13C    PICTURE X.
           02  IM4CY13P    PICTURE X.
           02  IM4CY13H    PICTURE X.
           02  IM4CY13V    PICTURE X.
           02  IM4CY13O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CL13C    PICTURE X.
           02  IM4CL13P    PICTURE X.
           02  IM4CL13H    PICTURE X.
           02  IM4CL13V    PICTURE X.
           02  IM4CL13O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CBF1C    PICTURE X.
           02  IM4CBF1P    PICTURE X.
           02  IM4CBF1H    PICTURE X.
           02  IM4CBF1V    PICTURE X.
           02  IM4CBF1O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM4FED1C    PICTURE X.
           02  IM4FED1P    PICTURE X.
           02  IM4FED1H    PICTURE X.
           02  IM4FED1V    PICTURE X.
           02  IM4FED1O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IM4CED1C    PICTURE X.
           02  IM4CED1P    PICTURE X.
           02  IM4CED1H    PICTURE X.
           02  IM4CED1V    PICTURE X.
           02  IM4CED1O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IM4ALL2C    PICTURE X.
           02  IM4ALL2P    PICTURE X.
           02  IM4ALL2H    PICTURE X.
           02  IM4ALL2V    PICTURE X.
           02  IM4ALL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FX21C    PICTURE X.
           02  IM4FX21P    PICTURE X.
           02  IM4FX21H    PICTURE X.
           02  IM4FX21V    PICTURE X.
           02  IM4FX21O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FR21C    PICTURE X.
           02  IM4FR21P    PICTURE X.
           02  IM4FR21H    PICTURE X.
           02  IM4FR21V    PICTURE X.
           02  IM4FR21O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4FY21C    PICTURE X.
           02  IM4FY21P    PICTURE X.
           02  IM4FY21H    PICTURE X.
           02  IM4FY21V    PICTURE X.
           02  IM4FY21O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FL21C    PICTURE X.
           02  IM4FL21P    PICTURE X.
           02  IM4FL21H    PICTURE X.
           02  IM4FL21V    PICTURE X.
           02  IM4FL21O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CX21C    PICTURE X.
           02  IM4CX21P    PICTURE X.
           02  IM4CX21H    PICTURE X.
           02  IM4CX21V    PICTURE X.
           02  IM4CX21O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CR21C    PICTURE X.
           02  IM4CR21P    PICTURE X.
           02  IM4CR21H    PICTURE X.
           02  IM4CR21V    PICTURE X.
           02  IM4CR21O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4CY21C    PICTURE X.
           02  IM4CY21P    PICTURE X.
           02  IM4CY21H    PICTURE X.
           02  IM4CY21V    PICTURE X.
           02  IM4CY21O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CL21C    PICTURE X.
           02  IM4CL21P    PICTURE X.
           02  IM4CL21H    PICTURE X.
           02  IM4CL21V    PICTURE X.
           02  IM4CL21O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4FX22C    PICTURE X.
           02  IM4FX22P    PICTURE X.
           02  IM4FX22H    PICTURE X.
           02  IM4FX22V    PICTURE X.
           02  IM4FX22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FR22C    PICTURE X.
           02  IM4FR22P    PICTURE X.
           02  IM4FR22H    PICTURE X.
           02  IM4FR22V    PICTURE X.
           02  IM4FR22O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4RY22C    PICTURE X.
           02  IM4RY22P    PICTURE X.
           02  IM4RY22H    PICTURE X.
           02  IM4RY22V    PICTURE X.
           02  IM4RY22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FL22C    PICTURE X.
           02  IM4FL22P    PICTURE X.
           02  IM4FL22H    PICTURE X.
           02  IM4FL22V    PICTURE X.
           02  IM4FL22O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CX22C    PICTURE X.
           02  IM4CX22P    PICTURE X.
           02  IM4CX22H    PICTURE X.
           02  IM4CX22V    PICTURE X.
           02  IM4CX22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CR22C    PICTURE X.
           02  IM4CR22P    PICTURE X.
           02  IM4CR22H    PICTURE X.
           02  IM4CR22V    PICTURE X.
           02  IM4CR22O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4CY22C    PICTURE X.
           02  IM4CY22P    PICTURE X.
           02  IM4CY22H    PICTURE X.
           02  IM4CY22V    PICTURE X.
           02  IM4CY22O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CL22C    PICTURE X.
           02  IM4CL22P    PICTURE X.
           02  IM4CL22H    PICTURE X.
           02  IM4CL22V    PICTURE X.
           02  IM4CL22O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4FX23C    PICTURE X.
           02  IM4FX23P    PICTURE X.
           02  IM4FX23H    PICTURE X.
           02  IM4FX23V    PICTURE X.
           02  IM4FX23O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FR23C    PICTURE X.
           02  IM4FR23P    PICTURE X.
           02  IM4FR23H    PICTURE X.
           02  IM4FR23V    PICTURE X.
           02  IM4FR23O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4FY23C    PICTURE X.
           02  IM4FY23P    PICTURE X.
           02  IM4FY23H    PICTURE X.
           02  IM4FY23V    PICTURE X.
           02  IM4FY23O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FL23C    PICTURE X.
           02  IM4FL23P    PICTURE X.
           02  IM4FL23H    PICTURE X.
           02  IM4FL23V    PICTURE X.
           02  IM4FL23O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CX23C    PICTURE X.
           02  IM4CX23P    PICTURE X.
           02  IM4CX23H    PICTURE X.
           02  IM4CX23V    PICTURE X.
           02  IM4CX23O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CR23C    PICTURE X.
           02  IM4CR23P    PICTURE X.
           02  IM4CR23H    PICTURE X.
           02  IM4CR23V    PICTURE X.
           02  IM4CR23O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4CY23C    PICTURE X.
           02  IM4CY23P    PICTURE X.
           02  IM4CY23H    PICTURE X.
           02  IM4CY23V    PICTURE X.
           02  IM4CY23O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CL23C    PICTURE X.
           02  IM4CL23P    PICTURE X.
           02  IM4CL23H    PICTURE X.
           02  IM4CL23V    PICTURE X.
           02  IM4CL23O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CBF2C    PICTURE X.
           02  IM4CBF2P    PICTURE X.
           02  IM4CBF2H    PICTURE X.
           02  IM4CBF2V    PICTURE X.
           02  IM4CBF2O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM4FED2C    PICTURE X.
           02  IM4FED2P    PICTURE X.
           02  IM4FED2H    PICTURE X.
           02  IM4FED2V    PICTURE X.
           02  IM4FED2O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IM4CED2C    PICTURE X.
           02  IM4CED2P    PICTURE X.
           02  IM4CED2H    PICTURE X.
           02  IM4CED2V    PICTURE X.
           02  IM4CED2O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IM4ALL3C    PICTURE X.
           02  IM4ALL3P    PICTURE X.
           02  IM4ALL3H    PICTURE X.
           02  IM4ALL3V    PICTURE X.
           02  IM4ALL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FX31C    PICTURE X.
           02  IM4FX31P    PICTURE X.
           02  IM4FX31H    PICTURE X.
           02  IM4FX31V    PICTURE X.
           02  IM4FX31O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FR31C    PICTURE X.
           02  IM4FR31P    PICTURE X.
           02  IM4FR31H    PICTURE X.
           02  IM4FR31V    PICTURE X.
           02  IM4FR31O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4FY31C    PICTURE X.
           02  IM4FY31P    PICTURE X.
           02  IM4FY31H    PICTURE X.
           02  IM4FY31V    PICTURE X.
           02  IM4FY31O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FL31C    PICTURE X.
           02  IM4FL31P    PICTURE X.
           02  IM4FL31H    PICTURE X.
           02  IM4FL31V    PICTURE X.
           02  IM4FL31O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CX31C    PICTURE X.
           02  IM4CX31P    PICTURE X.
           02  IM4CX31H    PICTURE X.
           02  IM4CX31V    PICTURE X.
           02  IM4CX31O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CR31C    PICTURE X.
           02  IM4CR31P    PICTURE X.
           02  IM4CR31H    PICTURE X.
           02  IM4CR31V    PICTURE X.
           02  IM4CR31O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4CY31C    PICTURE X.
           02  IM4CY31P    PICTURE X.
           02  IM4CY31H    PICTURE X.
           02  IM4CY31V    PICTURE X.
           02  IM4CY31O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CL31C    PICTURE X.
           02  IM4CL31P    PICTURE X.
           02  IM4CL31H    PICTURE X.
           02  IM4CL31V    PICTURE X.
           02  IM4CL31O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4FX32C    PICTURE X.
           02  IM4FX32P    PICTURE X.
           02  IM4FX32H    PICTURE X.
           02  IM4FX32V    PICTURE X.
           02  IM4FX32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FR32C    PICTURE X.
           02  IM4FR32P    PICTURE X.
           02  IM4FR32H    PICTURE X.
           02  IM4FR32V    PICTURE X.
           02  IM4FR32O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4FY32C    PICTURE X.
           02  IM4FY32P    PICTURE X.
           02  IM4FY32H    PICTURE X.
           02  IM4FY32V    PICTURE X.
           02  IM4FY32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FL32C    PICTURE X.
           02  IM4FL32P    PICTURE X.
           02  IM4FL32H    PICTURE X.
           02  IM4FL32V    PICTURE X.
           02  IM4FL32O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CX32C    PICTURE X.
           02  IM4CX32P    PICTURE X.
           02  IM4CX32H    PICTURE X.
           02  IM4CX32V    PICTURE X.
           02  IM4CX32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CR32C    PICTURE X.
           02  IM4CR32P    PICTURE X.
           02  IM4CR32H    PICTURE X.
           02  IM4CR32V    PICTURE X.
           02  IM4CR32O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4CY32C    PICTURE X.
           02  IM4CY32P    PICTURE X.
           02  IM4CY32H    PICTURE X.
           02  IM4CY32V    PICTURE X.
           02  IM4CY32O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CL32C    PICTURE X.
           02  IM4CL32P    PICTURE X.
           02  IM4CL32H    PICTURE X.
           02  IM4CL32V    PICTURE X.
           02  IM4CL32O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4FX33C    PICTURE X.
           02  IM4FX33P    PICTURE X.
           02  IM4FX33H    PICTURE X.
           02  IM4FX33V    PICTURE X.
           02  IM4FX33O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FR33C    PICTURE X.
           02  IM4FR33P    PICTURE X.
           02  IM4FR33H    PICTURE X.
           02  IM4FR33V    PICTURE X.
           02  IM4FR33O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4FY33C    PICTURE X.
           02  IM4FY33P    PICTURE X.
           02  IM4FY33H    PICTURE X.
           02  IM4FY33V    PICTURE X.
           02  IM4FY33O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4FL33C    PICTURE X.
           02  IM4FL33P    PICTURE X.
           02  IM4FL33H    PICTURE X.
           02  IM4FL33V    PICTURE X.
           02  IM4FL33O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CX33C    PICTURE X.
           02  IM4CX33P    PICTURE X.
           02  IM4CX33H    PICTURE X.
           02  IM4CX33V    PICTURE X.
           02  IM4CX33O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CR33C    PICTURE X.
           02  IM4CR33P    PICTURE X.
           02  IM4CR33H    PICTURE X.
           02  IM4CR33V    PICTURE X.
           02  IM4CR33O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM4CY33C    PICTURE X.
           02  IM4CY33P    PICTURE X.
           02  IM4CY33H    PICTURE X.
           02  IM4CY33V    PICTURE X.
           02  IM4CY33O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM4CL33C    PICTURE X.
           02  IM4CL33P    PICTURE X.
           02  IM4CL33H    PICTURE X.
           02  IM4CL33V    PICTURE X.
           02  IM4CL33O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  IM4CBF3C    PICTURE X.
           02  IM4CBF3P    PICTURE X.
           02  IM4CBF3H    PICTURE X.
           02  IM4CBF3V    PICTURE X.
           02  IM4CBF3O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM4FED3C    PICTURE X.
           02  IM4FED3P    PICTURE X.
           02  IM4FED3H    PICTURE X.
           02  IM4FED3V    PICTURE X.
           02  IM4FED3O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IM4CED3C    PICTURE X.
           02  IM4CED3P    PICTURE X.
           02  IM4CED3H    PICTURE X.
           02  IM4CED3V    PICTURE X.
           02  IM4CED3O  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IMPFS04C    PICTURE X.
           02  IMPFS04P    PICTURE X.
           02  IMPFS04H    PICTURE X.
           02  IMPFS04V    PICTURE X.
           02  IMPFS04O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR04C    PICTURE X.
           02  IMERR04P    PICTURE X.
           02  IMERR04H    PICTURE X.
           02  IMERR04V    PICTURE X.
           02  IMERR04O  PIC X(79).
       01  IMXPM05I REDEFINES IMXPM06I.
           02  FILLER PIC X(12).
           02  IM5TRIDL    COMP  PIC  S9(4).
           02  IM5TRIDF    PICTURE X.
           02  FILLER REDEFINES IM5TRIDF.
             03 IM5TRIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5TRIDI  PIC X(4).
           02  IM5DATEL    COMP  PIC  S9(4).
           02  IM5DATEF    PICTURE X.
           02  FILLER REDEFINES IM5DATEF.
             03 IM5DATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5DATEI  PIC X(8).
           02  IM5TIMEL    COMP  PIC  S9(4).
           02  IM5TIMEF    PICTURE X.
           02  FILLER REDEFINES IM5TIMEF.
             03 IM5TIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5TIMEI  PIC X(8).
           02  IM5PRODL    COMP  PIC  S9(4).
           02  IM5PRODF    PICTURE X.
           02  FILLER REDEFINES IM5PRODF.
             03 IM5PRODA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5PRODI  PIC X(3).
           02  IM5CTL1L    COMP  PIC  S9(4).
           02  IM5CTL1F    PICTURE X.
           02  FILLER REDEFINES IM5CTL1F.
             03 IM5CTL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CTL1I  PIC X(2).
           02  IM5CTL2L    COMP  PIC  S9(4).
           02  IM5CTL2F    PICTURE X.
           02  FILLER REDEFINES IM5CTL2F.
             03 IM5CTL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CTL2I  PIC X(3).
           02  IM5CTL3L    COMP  PIC  S9(4).
           02  IM5CTL3F    PICTURE X.
           02  FILLER REDEFINES IM5CTL3F.
             03 IM5CTL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CTL3I  PIC X(3).
           02  IM5ACTNL    COMP  PIC  S9(4).
           02  IM5ACTNF    PICTURE X.
           02  FILLER REDEFINES IM5ACTNF.
             03 IM5ACTNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5ACTNI  PIC X(1).
           02  IM5ALL1L    COMP  PIC  S9(4).
           02  IM5ALL1F    PICTURE X.
           02  FILLER REDEFINES IM5ALL1F.
             03 IM5ALL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5ALL1I  PIC X(1).
           02  IM5CBD1L    COMP  PIC  S9(4).
           02  IM5CBD1F    PICTURE X.
           02  FILLER REDEFINES IM5CBD1F.
             03 IM5CBD1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CBD1I  PIC X(12).
           02  IM5INDXL    COMP  PIC  S9(4).
           02  IM5INDXF    PICTURE X.
           02  FILLER REDEFINES IM5INDXF.
             03 IM5INDXA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5INDXI  PIC X(1).
           02  IM5FEDTL    COMP  PIC  S9(4).
           02  IM5FEDTF    PICTURE X.
           02  FILLER REDEFINES IM5FEDTF.
             03 IM5FEDTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FEDTI  PIC X(6).
           02  IM5FXRTL    COMP  PIC  S9(4).
           02  IM5FXRTF    PICTURE X.
           02  FILLER REDEFINES IM5FXRTF.
             03 IM5FXRTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXRTI  PIC X(1).
           02  IM5FRTEL    COMP  PIC  S9(4).
           02  IM5FRTEF    PICTURE X.
           02  FILLER REDEFINES IM5FRTEF.
             03 IM5FRTEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FRTEI  PIC X(10).
           02  IM5FXADL    COMP  PIC  S9(4).
           02  IM5FXADF    PICTURE X.
           02  FILLER REDEFINES IM5FXADF.
             03 IM5FXADA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXADI  PIC X(1).
           02  IM5FADJL    COMP  PIC  S9(4).
           02  IM5FADJF    PICTURE X.
           02  FILLER REDEFINES IM5FADJF.
             03 IM5FADJA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FADJI  PIC X(1).
           02  IM5FXBLL    COMP  PIC  S9(4).
           02  IM5FXBLF    PICTURE X.
           02  FILLER REDEFINES IM5FXBLF.
             03 IM5FXBLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXBLI  PIC X(1).
           02  IM5FBALL    COMP  PIC  S9(4).
           02  IM5FBALF    PICTURE X.
           02  FILLER REDEFINES IM5FBALF.
             03 IM5FBALA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FBALI  PIC X(1).
           02  IM5FXA1L    COMP  PIC  S9(4).
           02  IM5FXA1F    PICTURE X.
           02  FILLER REDEFINES IM5FXA1F.
             03 IM5FXA1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXA1I  PIC X(1).
           02  IM5FAA1L    COMP  PIC  S9(4).
           02  IM5FAA1F    PICTURE X.
           02  FILLER REDEFINES IM5FAA1F.
             03 IM5FAA1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FAA1I  PIC X(10).
           02  IM5FLX1L    COMP  PIC  S9(4).
           02  IM5FLX1F    PICTURE X.
           02  FILLER REDEFINES IM5FLX1F.
             03 IM5FLX1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FLX1I  PIC X(1).
           02  IM5FLT1L    COMP  PIC  S9(4).
           02  IM5FLT1F    PICTURE X.
           02  FILLER REDEFINES IM5FLT1F.
             03 IM5FLT1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FLT1I  PIC X(16).
           02  IM5FXA2L    COMP  PIC  S9(4).
           02  IM5FXA2F    PICTURE X.
           02  FILLER REDEFINES IM5FXA2F.
             03 IM5FXA2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXA2I  PIC X(1).
           02  IM5FAA2L    COMP  PIC  S9(4).
           02  IM5FAA2F    PICTURE X.
           02  FILLER REDEFINES IM5FAA2F.
             03 IM5FAA2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FAA2I  PIC X(10).
           02  IM5FXL2L    COMP  PIC  S9(4).
           02  IM5FXL2F    PICTURE X.
           02  FILLER REDEFINES IM5FXL2F.
             03 IM5FXL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXL2I  PIC X(1).
           02  IM5FLT2L    COMP  PIC  S9(4).
           02  IM5FLT2F    PICTURE X.
           02  FILLER REDEFINES IM5FLT2F.
             03 IM5FLT2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FLT2I  PIC X(16).
           02  IM5FXA3L    COMP  PIC  S9(4).
           02  IM5FXA3F    PICTURE X.
           02  FILLER REDEFINES IM5FXA3F.
             03 IM5FXA3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXA3I  PIC X(1).
           02  IM5FAA3L    COMP  PIC  S9(4).
           02  IM5FAA3F    PICTURE X.
           02  FILLER REDEFINES IM5FAA3F.
             03 IM5FAA3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FAA3I  PIC X(10).
           02  IM5FXL3L    COMP  PIC  S9(4).
           02  IM5FXL3F    PICTURE X.
           02  FILLER REDEFINES IM5FXL3F.
             03 IM5FXL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXL3I  PIC X(1).
           02  IM5FLT3L    COMP  PIC  S9(4).
           02  IM5FLT3F    PICTURE X.
           02  FILLER REDEFINES IM5FLT3F.
             03 IM5FLT3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FLT3I  PIC X(16).
           02  IM5FXA4L    COMP  PIC  S9(4).
           02  IM5FXA4F    PICTURE X.
           02  FILLER REDEFINES IM5FXA4F.
             03 IM5FXA4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXA4I  PIC X(1).
           02  IM5FAA4L    COMP  PIC  S9(4).
           02  IM5FAA4F    PICTURE X.
           02  FILLER REDEFINES IM5FAA4F.
             03 IM5FAA4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FAA4I  PIC X(10).
           02  IM5FXL4L    COMP  PIC  S9(4).
           02  IM5FXL4F    PICTURE X.
           02  FILLER REDEFINES IM5FXL4F.
             03 IM5FXL4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXL4I  PIC X(1).
           02  IM5FLT4L    COMP  PIC  S9(4).
           02  IM5FLT4F    PICTURE X.
           02  FILLER REDEFINES IM5FLT4F.
             03 IM5FLT4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FLT4I  PIC X(16).
           02  IM5FXR5L    COMP  PIC  S9(4).
           02  IM5FXR5F    PICTURE X.
           02  FILLER REDEFINES IM5FXR5F.
             03 IM5FXR5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXR5I  PIC X(1).
           02  IM5FAA5L    COMP  PIC  S9(4).
           02  IM5FAA5F    PICTURE X.
           02  FILLER REDEFINES IM5FAA5F.
             03 IM5FAA5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FAA5I  PIC X(10).
           02  IM5FXL5L    COMP  PIC  S9(4).
           02  IM5FXL5F    PICTURE X.
           02  FILLER REDEFINES IM5FXL5F.
             03 IM5FXL5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FXL5I  PIC X(1).
           02  IM5FLT5L    COMP  PIC  S9(4).
           02  IM5FLT5F    PICTURE X.
           02  FILLER REDEFINES IM5FLT5F.
             03 IM5FLT5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5FLT5I  PIC X(16).
           02  IM5CEDTL    COMP  PIC  S9(4).
           02  IM5CEDTF    PICTURE X.
           02  FILLER REDEFINES IM5CEDTF.
             03 IM5CEDTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CEDTI  PIC X(6).
           02  IM5CXRTL    COMP  PIC  S9(4).
           02  IM5CXRTF    PICTURE X.
           02  FILLER REDEFINES IM5CXRTF.
             03 IM5CXRTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXRTI  PIC X(1).
           02  IM5CRTEL    COMP  PIC  S9(4).
           02  IM5CRTEF    PICTURE X.
           02  FILLER REDEFINES IM5CRTEF.
             03 IM5CRTEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CRTEI  PIC X(10).
           02  IM5CXADL    COMP  PIC  S9(4).
           02  IM5CXADF    PICTURE X.
           02  FILLER REDEFINES IM5CXADF.
             03 IM5CXADA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXADI  PIC X(1).
           02  IM5CADJL    COMP  PIC  S9(4).
           02  IM5CADJF    PICTURE X.
           02  FILLER REDEFINES IM5CADJF.
             03 IM5CADJA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CADJI  PIC X(1).
           02  IM5CXBLL    COMP  PIC  S9(4).
           02  IM5CXBLF    PICTURE X.
           02  FILLER REDEFINES IM5CXBLF.
             03 IM5CXBLA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXBLI  PIC X(1).
           02  IM5CBALL    COMP  PIC  S9(4).
           02  IM5CBALF    PICTURE X.
           02  FILLER REDEFINES IM5CBALF.
             03 IM5CBALA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CBALI  PIC X(1).
           02  IM5CXA1L    COMP  PIC  S9(4).
           02  IM5CXA1F    PICTURE X.
           02  FILLER REDEFINES IM5CXA1F.
             03 IM5CXA1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXA1I  PIC X(1).
           02  IM5CAA1L    COMP  PIC  S9(4).
           02  IM5CAA1F    PICTURE X.
           02  FILLER REDEFINES IM5CAA1F.
             03 IM5CAA1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CAA1I  PIC X(10).
           02  IM5CXL1L    COMP  PIC  S9(4).
           02  IM5CXL1F    PICTURE X.
           02  FILLER REDEFINES IM5CXL1F.
             03 IM5CXL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXL1I  PIC X(1).
           02  IM5CLT1L    COMP  PIC  S9(4).
           02  IM5CLT1F    PICTURE X.
           02  FILLER REDEFINES IM5CLT1F.
             03 IM5CLT1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CLT1I  PIC X(16).
           02  IM5CXA2L    COMP  PIC  S9(4).
           02  IM5CXA2F    PICTURE X.
           02  FILLER REDEFINES IM5CXA2F.
             03 IM5CXA2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXA2I  PIC X(1).
           02  IM5CAA2L    COMP  PIC  S9(4).
           02  IM5CAA2F    PICTURE X.
           02  FILLER REDEFINES IM5CAA2F.
             03 IM5CAA2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CAA2I  PIC X(10).
           02  IM5CXL2L    COMP  PIC  S9(4).
           02  IM5CXL2F    PICTURE X.
           02  FILLER REDEFINES IM5CXL2F.
             03 IM5CXL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXL2I  PIC X(1).
           02  IM5CLT2L    COMP  PIC  S9(4).
           02  IM5CLT2F    PICTURE X.
           02  FILLER REDEFINES IM5CLT2F.
             03 IM5CLT2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CLT2I  PIC X(16).
           02  IM5CXA3L    COMP  PIC  S9(4).
           02  IM5CXA3F    PICTURE X.
           02  FILLER REDEFINES IM5CXA3F.
             03 IM5CXA3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXA3I  PIC X(1).
           02  IM5CAA3L    COMP  PIC  S9(4).
           02  IM5CAA3F    PICTURE X.
           02  FILLER REDEFINES IM5CAA3F.
             03 IM5CAA3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CAA3I  PIC X(10).
           02  IM5CXL3L    COMP  PIC  S9(4).
           02  IM5CXL3F    PICTURE X.
           02  FILLER REDEFINES IM5CXL3F.
             03 IM5CXL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXL3I  PIC X(1).
           02  IM5CLT3L    COMP  PIC  S9(4).
           02  IM5CLT3F    PICTURE X.
           02  FILLER REDEFINES IM5CLT3F.
             03 IM5CLT3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CLT3I  PIC X(16).
           02  IM5CXA4L    COMP  PIC  S9(4).
           02  IM5CXA4F    PICTURE X.
           02  FILLER REDEFINES IM5CXA4F.
             03 IM5CXA4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXA4I  PIC X(1).
           02  IM5CAA4L    COMP  PIC  S9(4).
           02  IM5CAA4F    PICTURE X.
           02  FILLER REDEFINES IM5CAA4F.
             03 IM5CAA4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CAA4I  PIC X(10).
           02  IM5CXL4L    COMP  PIC  S9(4).
           02  IM5CXL4F    PICTURE X.
           02  FILLER REDEFINES IM5CXL4F.
             03 IM5CXL4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXL4I  PIC X(1).
           02  IM5CLT4L    COMP  PIC  S9(4).
           02  IM5CLT4F    PICTURE X.
           02  FILLER REDEFINES IM5CLT4F.
             03 IM5CLT4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CLT4I  PIC X(16).
           02  IM5CXA5L    COMP  PIC  S9(4).
           02  IM5CXA5F    PICTURE X.
           02  FILLER REDEFINES IM5CXA5F.
             03 IM5CXA5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXA5I  PIC X(1).
           02  IM5CAA5L    COMP  PIC  S9(4).
           02  IM5CAA5F    PICTURE X.
           02  FILLER REDEFINES IM5CAA5F.
             03 IM5CAA5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CAA5I  PIC X(10).
           02  IM5CXL5L    COMP  PIC  S9(4).
           02  IM5CXL5F    PICTURE X.
           02  FILLER REDEFINES IM5CXL5F.
             03 IM5CXL5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CXL5I  PIC X(1).
           02  IM5CLT5L    COMP  PIC  S9(4).
           02  IM5CLT5F    PICTURE X.
           02  FILLER REDEFINES IM5CLT5F.
             03 IM5CLT5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IM5CLT5I  PIC X(16).
           02  IMPFS05L    COMP  PIC  S9(4).
           02  IMPFS05F    PICTURE X.
           02  FILLER REDEFINES IMPFS05F.
             03 IMPFS05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMPFS05I  PIC X(79).
           02  IMERR05L    COMP  PIC  S9(4).
           02  IMERR05F    PICTURE X.
           02  FILLER REDEFINES IMERR05F.
             03 IMERR05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  IMERR05I  PIC X(79).
       01  IMXPM05O REDEFINES IMXPM05I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM5TRIDC    PICTURE X.
           02  IM5TRIDP    PICTURE X.
           02  IM5TRIDH    PICTURE X.
           02  IM5TRIDV    PICTURE X.
           02  IM5TRIDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  IM5DATEC    PICTURE X.
           02  IM5DATEP    PICTURE X.
           02  IM5DATEH    PICTURE X.
           02  IM5DATEV    PICTURE X.
           02  IM5DATEO PIC 99/99/99.
           02  FILLER PICTURE X(3).
           02  IM5TIMEC    PICTURE X.
           02  IM5TIMEP    PICTURE X.
           02  IM5TIMEH    PICTURE X.
           02  IM5TIMEV    PICTURE X.
           02  IM5TIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  IM5PRODC    PICTURE X.
           02  IM5PRODP    PICTURE X.
           02  IM5PRODH    PICTURE X.
           02  IM5PRODV    PICTURE X.
           02  IM5PRODO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM5CTL1C    PICTURE X.
           02  IM5CTL1P    PICTURE X.
           02  IM5CTL1H    PICTURE X.
           02  IM5CTL1V    PICTURE X.
           02  IM5CTL1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  IM5CTL2C    PICTURE X.
           02  IM5CTL2P    PICTURE X.
           02  IM5CTL2H    PICTURE X.
           02  IM5CTL2V    PICTURE X.
           02  IM5CTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM5CTL3C    PICTURE X.
           02  IM5CTL3P    PICTURE X.
           02  IM5CTL3H    PICTURE X.
           02  IM5CTL3V    PICTURE X.
           02  IM5CTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IM5ACTNC    PICTURE X.
           02  IM5ACTNP    PICTURE X.
           02  IM5ACTNH    PICTURE X.
           02  IM5ACTNV    PICTURE X.
           02  IM5ACTNO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5ALL1C    PICTURE X.
           02  IM5ALL1P    PICTURE X.
           02  IM5ALL1H    PICTURE X.
           02  IM5ALL1V    PICTURE X.
           02  IM5ALL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CBD1C    PICTURE X.
           02  IM5CBD1P    PICTURE X.
           02  IM5CBD1H    PICTURE X.
           02  IM5CBD1V    PICTURE X.
           02  IM5CBD1O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  IM5INDXC    PICTURE X.
           02  IM5INDXP    PICTURE X.
           02  IM5INDXH    PICTURE X.
           02  IM5INDXV    PICTURE X.
           02  IM5INDXO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FEDTC    PICTURE X.
           02  IM5FEDTP    PICTURE X.
           02  IM5FEDTH    PICTURE X.
           02  IM5FEDTV    PICTURE X.
           02  IM5FEDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IM5FXRTC    PICTURE X.
           02  IM5FXRTP    PICTURE X.
           02  IM5FXRTH    PICTURE X.
           02  IM5FXRTV    PICTURE X.
           02  IM5FXRTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FRTEC    PICTURE X.
           02  IM5FRTEP    PICTURE X.
           02  IM5FRTEH    PICTURE X.
           02  IM5FRTEV    PICTURE X.
           02  IM5FRTEO PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5FXADC    PICTURE X.
           02  IM5FXADP    PICTURE X.
           02  IM5FXADH    PICTURE X.
           02  IM5FXADV    PICTURE X.
           02  IM5FXADO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FADJC    PICTURE X.
           02  IM5FADJP    PICTURE X.
           02  IM5FADJH    PICTURE X.
           02  IM5FADJV    PICTURE X.
           02  IM5FADJO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FXBLC    PICTURE X.
           02  IM5FXBLP    PICTURE X.
           02  IM5FXBLH    PICTURE X.
           02  IM5FXBLV    PICTURE X.
           02  IM5FXBLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FBALC    PICTURE X.
           02  IM5FBALP    PICTURE X.
           02  IM5FBALH    PICTURE X.
           02  IM5FBALV    PICTURE X.
           02  IM5FBALO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FXA1C    PICTURE X.
           02  IM5FXA1P    PICTURE X.
           02  IM5FXA1H    PICTURE X.
           02  IM5FXA1V    PICTURE X.
           02  IM5FXA1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FAA1C    PICTURE X.
           02  IM5FAA1P    PICTURE X.
           02  IM5FAA1H    PICTURE X.
           02  IM5FAA1V    PICTURE X.
           02  IM5FAA1O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5FLX1C    PICTURE X.
           02  IM5FLX1P    PICTURE X.
           02  IM5FLX1H    PICTURE X.
           02  IM5FLX1V    PICTURE X.
           02  IM5FLX1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FLT1C    PICTURE X.
           02  IM5FLT1P    PICTURE X.
           02  IM5FLT1H    PICTURE X.
           02  IM5FLT1V    PICTURE X.
           02  IM5FLT1O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IM5FXA2C    PICTURE X.
           02  IM5FXA2P    PICTURE X.
           02  IM5FXA2H    PICTURE X.
           02  IM5FXA2V    PICTURE X.
           02  IM5FXA2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FAA2C    PICTURE X.
           02  IM5FAA2P    PICTURE X.
           02  IM5FAA2H    PICTURE X.
           02  IM5FAA2V    PICTURE X.
           02  IM5FAA2O PIC 999.999999.
           02  FILLER PICTURE X(3).
           02  IM5FXL2C    PICTURE X.
           02  IM5FXL2P    PICTURE X.
           02  IM5FXL2H    PICTURE X.
           02  IM5FXL2V    PICTURE X.
           02  IM5FXL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FLT2C    PICTURE X.
           02  IM5FLT2P    PICTURE X.
           02  IM5FLT2H    PICTURE X.
           02  IM5FLT2V    PICTURE X.
           02  IM5FLT2O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IM5FXA3C    PICTURE X.
           02  IM5FXA3P    PICTURE X.
           02  IM5FXA3H    PICTURE X.
           02  IM5FXA3V    PICTURE X.
           02  IM5FXA3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FAA3C    PICTURE X.
           02  IM5FAA3P    PICTURE X.
           02  IM5FAA3H    PICTURE X.
           02  IM5FAA3V    PICTURE X.
           02  IM5FAA3O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5FXL3C    PICTURE X.
           02  IM5FXL3P    PICTURE X.
           02  IM5FXL3H    PICTURE X.
           02  IM5FXL3V    PICTURE X.
           02  IM5FXL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FLT3C    PICTURE X.
           02  IM5FLT3P    PICTURE X.
           02  IM5FLT3H    PICTURE X.
           02  IM5FLT3V    PICTURE X.
           02  IM5FLT3O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IM5FXA4C    PICTURE X.
           02  IM5FXA4P    PICTURE X.
           02  IM5FXA4H    PICTURE X.
           02  IM5FXA4V    PICTURE X.
           02  IM5FXA4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FAA4C    PICTURE X.
           02  IM5FAA4P    PICTURE X.
           02  IM5FAA4H    PICTURE X.
           02  IM5FAA4V    PICTURE X.
           02  IM5FAA4O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5FXL4C    PICTURE X.
           02  IM5FXL4P    PICTURE X.
           02  IM5FXL4H    PICTURE X.
           02  IM5FXL4V    PICTURE X.
           02  IM5FXL4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FLT4C    PICTURE X.
           02  IM5FLT4P    PICTURE X.
           02  IM5FLT4H    PICTURE X.
           02  IM5FLT4V    PICTURE X.
           02  IM5FLT4O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IM5FXR5C    PICTURE X.
           02  IM5FXR5P    PICTURE X.
           02  IM5FXR5H    PICTURE X.
           02  IM5FXR5V    PICTURE X.
           02  IM5FXR5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FAA5C    PICTURE X.
           02  IM5FAA5P    PICTURE X.
           02  IM5FAA5H    PICTURE X.
           02  IM5FAA5V    PICTURE X.
           02  IM5FAA5O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5FXL5C    PICTURE X.
           02  IM5FXL5P    PICTURE X.
           02  IM5FXL5H    PICTURE X.
           02  IM5FXL5V    PICTURE X.
           02  IM5FXL5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5FLT5C    PICTURE X.
           02  IM5FLT5P    PICTURE X.
           02  IM5FLT5H    PICTURE X.
           02  IM5FLT5V    PICTURE X.
           02  IM5FLT5O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IM5CEDTC    PICTURE X.
           02  IM5CEDTP    PICTURE X.
           02  IM5CEDTH    PICTURE X.
           02  IM5CEDTV    PICTURE X.
           02  IM5CEDTO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  IM5CXRTC    PICTURE X.
           02  IM5CXRTP    PICTURE X.
           02  IM5CXRTH    PICTURE X.
           02  IM5CXRTV    PICTURE X.
           02  IM5CXRTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CRTEC    PICTURE X.
           02  IM5CRTEP    PICTURE X.
           02  IM5CRTEH    PICTURE X.
           02  IM5CRTEV    PICTURE X.
           02  IM5CRTEO PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5CXADC    PICTURE X.
           02  IM5CXADP    PICTURE X.
           02  IM5CXADH    PICTURE X.
           02  IM5CXADV    PICTURE X.
           02  IM5CXADO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CADJC    PICTURE X.
           02  IM5CADJP    PICTURE X.
           02  IM5CADJH    PICTURE X.
           02  IM5CADJV    PICTURE X.
           02  IM5CADJO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CXBLC    PICTURE X.
           02  IM5CXBLP    PICTURE X.
           02  IM5CXBLH    PICTURE X.
           02  IM5CXBLV    PICTURE X.
           02  IM5CXBLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CBALC    PICTURE X.
           02  IM5CBALP    PICTURE X.
           02  IM5CBALH    PICTURE X.
           02  IM5CBALV    PICTURE X.
           02  IM5CBALO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CXA1C    PICTURE X.
           02  IM5CXA1P    PICTURE X.
           02  IM5CXA1H    PICTURE X.
           02  IM5CXA1V    PICTURE X.
           02  IM5CXA1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CAA1C    PICTURE X.
           02  IM5CAA1P    PICTURE X.
           02  IM5CAA1H    PICTURE X.
           02  IM5CAA1V    PICTURE X.
           02  IM5CAA1O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5CXL1C    PICTURE X.
           02  IM5CXL1P    PICTURE X.
           02  IM5CXL1H    PICTURE X.
           02  IM5CXL1V    PICTURE X.
           02  IM5CXL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CLT1C    PICTURE X.
           02  IM5CLT1P    PICTURE X.
           02  IM5CLT1H    PICTURE X.
           02  IM5CLT1V    PICTURE X.
           02  IM5CLT1O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IM5CXA2C    PICTURE X.
           02  IM5CXA2P    PICTURE X.
           02  IM5CXA2H    PICTURE X.
           02  IM5CXA2V    PICTURE X.
           02  IM5CXA2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CAA2C    PICTURE X.
           02  IM5CAA2P    PICTURE X.
           02  IM5CAA2H    PICTURE X.
           02  IM5CAA2V    PICTURE X.
           02  IM5CAA2O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5CXL2C    PICTURE X.
           02  IM5CXL2P    PICTURE X.
           02  IM5CXL2H    PICTURE X.
           02  IM5CXL2V    PICTURE X.
           02  IM5CXL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CLT2C    PICTURE X.
           02  IM5CLT2P    PICTURE X.
           02  IM5CLT2H    PICTURE X.
           02  IM5CLT2V    PICTURE X.
           02  IM5CLT2O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IM5CXA3C    PICTURE X.
           02  IM5CXA3P    PICTURE X.
           02  IM5CXA3H    PICTURE X.
           02  IM5CXA3V    PICTURE X.
           02  IM5CXA3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CAA3C    PICTURE X.
           02  IM5CAA3P    PICTURE X.
           02  IM5CAA3H    PICTURE X.
           02  IM5CAA3V    PICTURE X.
           02  IM5CAA3O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5CXL3C    PICTURE X.
           02  IM5CXL3P    PICTURE X.
           02  IM5CXL3H    PICTURE X.
           02  IM5CXL3V    PICTURE X.
           02  IM5CXL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CLT3C    PICTURE X.
           02  IM5CLT3P    PICTURE X.
           02  IM5CLT3H    PICTURE X.
           02  IM5CLT3V    PICTURE X.
           02  IM5CLT3O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IM5CXA4C    PICTURE X.
           02  IM5CXA4P    PICTURE X.
           02  IM5CXA4H    PICTURE X.
           02  IM5CXA4V    PICTURE X.
           02  IM5CXA4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CAA4C    PICTURE X.
           02  IM5CAA4P    PICTURE X.
           02  IM5CAA4H    PICTURE X.
           02  IM5CAA4V    PICTURE X.
           02  IM5CAA4O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5CXL4C    PICTURE X.
           02  IM5CXL4P    PICTURE X.
           02  IM5CXL4H    PICTURE X.
           02  IM5CXL4V    PICTURE X.
           02  IM5CXL4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CLT4C    PICTURE X.
           02  IM5CLT4P    PICTURE X.
           02  IM5CLT4H    PICTURE X.
           02  IM5CLT4V    PICTURE X.
           02  IM5CLT4O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IM5CXA5C    PICTURE X.
           02  IM5CXA5P    PICTURE X.
           02  IM5CXA5H    PICTURE X.
           02  IM5CXA5V    PICTURE X.
           02  IM5CXA5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CAA5C    PICTURE X.
           02  IM5CAA5P    PICTURE X.
           02  IM5CAA5H    PICTURE X.
           02  IM5CAA5V    PICTURE X.
           02  IM5CAA5O PIC Z99.999999.
           02  FILLER PICTURE X(3).
           02  IM5CXL5C    PICTURE X.
           02  IM5CXL5P    PICTURE X.
           02  IM5CXL5H    PICTURE X.
           02  IM5CXL5V    PICTURE X.
           02  IM5CXL5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IM5CLT5C    PICTURE X.
           02  IM5CLT5P    PICTURE X.
           02  IM5CLT5H    PICTURE X.
           02  IM5CLT5V    PICTURE X.
           02  IM5CLT5O PIC Z999999999999.99.
           02  FILLER PICTURE X(3).
           02  IMPFS05C    PICTURE X.
           02  IMPFS05P    PICTURE X.
           02  IMPFS05H    PICTURE X.
           02  IMPFS05V    PICTURE X.
           02  IMPFS05O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  IMERR05C    PICTURE X.
           02  IMERR05P    PICTURE X.
           02  IMERR05H    PICTURE X.
           02  IMERR05V    PICTURE X.
           02  IMERR05O  PIC X(79).