       01  FIIMI1CO.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(2).
           02  IMTRANCA    PICTURE X.
           02  IMTRANCO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMDATCA    PICTURE X.
           02  IMDATCO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTIMCA    PICTURE X.
           02  IMTIMCO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMKEYCA    PICTURE X.
           02  IMKEYCO  PIC X(23).
           02  FILLER PICTURE X(2).
           02  IMMORECA    PICTURE X.
           02  IMMORECO  PIC X(27).
           02  FILLER PICTURE X(2).
           02  IMATYPCA    PICTURE X.
           02  IMATYPCO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMSTATCA    PICTURE X.
           02  IMSTATCO  PIC X(21).
           02  FILLER PICTURE X(2).
           02  IMSTYPCA    PICTURE X.
           02  IMSTYPCO  PIC X(19).
           02  FILLER PICTURE X(2).
           02  IMRELCDA    PICTURE X.
           02  IMRELCDO  PIC X(9).
           02  FILLER PICTURE X(2).
           02  IMRELNOA    PICTURE X.
           02  IMRELNOO  PIC X(22).
           02  FILLER PICTURE X(2).
           02  IMNAMEA    PICTURE X.
           02  IMNAMEO  PIC X(13).
           02  FILLER PICTURE X(2).
           02  IMNSFCLA    PICTURE X.
           02  IMNSFCLO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMIODTXA    PICTURE X.
           02  IMIODTXO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMBRNCHA    PICTURE X.
           02  IMBRNCHO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMIODRTA    PICTURE X.
           02  IMIODRTO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPIODTA    PICTURE X.
           02  IMPIODTO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMOFFCRA    PICTURE X.
           02  IMOFFCRO  PIC X(5).
           02  FILLER PICTURE X(2).
           02  IMIRATEA    PICTURE X.
           02  IMIRATEO  PIC 9.9(8).
           02  FILLER PICTURE X(2).
           02  IMYTDINA    PICTURE X.
           02  IMYTDINO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMSTPULA    PICTURE X.
           02  IMSTPULO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMHIINDA    PICTURE X.
           02  IMHIINDO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPIODIA    PICTURE X.
           02  IMPIODIO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMSFLD1A    PICTURE X.
           02  IMSFLD1O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMSFLD2A    PICTURE X.
           02  IMSFLD2O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMSFLD3A    PICTURE X.
           02  IMSFLD3O  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMACRTYA    PICTURE X.
           02  IMACRTYO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMHXACTA    PICTURE X.
           02  IMHXACTO  PIC 9(17).
           02  FILLER PICTURE X(2).
           02  IMSVCTPA    PICTURE X.
           02  IMSVCTPO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMRTEUSA    PICTURE X.
           02  IMRTEUSO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMIPDTXA    PICTURE X.
           02  IMIPDTXO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMSVCCDA    PICTURE X.
           02  IMSVCCDO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMEXMPTA    PICTURE X.
           02  IMEXMPTO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMGLA    PICTURE X.
           02  IMGLO  PIC X(2).
           02  FILLER PICTURE X(2).
           02  IMBULKFA    PICTURE X.
           02  IMBULKFO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMNAMCLA    PICTURE X.
           02  IMNAMCLO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMCKTRUA    PICTURE X.
           02  IMCKTRUO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMTINA    PICTURE X.
           02  IMTINO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IM0BALA    PICTURE X.
           02  IM0BALO  PIC ZZ9.
           02  FILLER PICTURE X(2).
           02  IMFNDFLA    PICTURE X.
           02  IMFNDFLO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMBKUPA    PICTURE X.
           02  IMBKUPO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMBKAVTA    PICTURE X.
           02  IMBKAVTO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMDCTRA    PICTURE X.
           02  IMDCTRO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMKITTRA    PICTURE X.
           02  IMKITTRO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMNAMETA    PICTURE X.
           02  IMNAMETO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSNCTRA    PICTURE X.
           02  IMSNCTRO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMCSHAVA    PICTURE X.
           02  IMCSHAVO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMEXPEDA    PICTURE X.
           02  IMEXPEDO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLIMTRA    PICTURE X.
           02  IMLIMTRO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMNSFTA    PICTURE X.
           02  IMNSFTO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMTARGTA    PICTURE X.
           02  IMTARGTO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMCMBTRA    PICTURE X.
           02  IMCMBTRO  PIC ZZ9.
           02  FILLER PICTURE X(2).
           02  IMEXDEPA    PICTURE X.
           02  IMEXDEPO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLNTRA    PICTURE X.
           02  IMLNTRO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMODACCA    PICTURE X.
           02  IMODACCO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMTRAFFA    PICTURE X.
           02  IMTRAFFO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMCSTAVA    PICTURE X.
           02  IMCSTAVO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMEXSHGA    PICTURE X.
           02  IMEXSHGO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMMKTTRA    PICTURE X.
           02  IMMKTTRO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMSAVTRA    PICTURE X.
           02  IMSAVTRO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMDCDTRA    PICTURE X.
           02  IMDCDTRO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMPAGEBA    PICTURE X.
           02  IMPAGEBO  PIC X(79).
           02  FILLER PICTURE X(2).
           02  IMERRCA    PICTURE X.
           02  IMERRCO  PIC X(79).
       01  FIIMI1BO REDEFINES FIIMI1CO.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(2).
           02  IMTRANBA    PICTURE X.
           02  IMTRANBO  PIC X(4).
           02  FILLER PICTURE X(2).
           02  IMDATBA    PICTURE X.
           02  IMDATBO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTIMBA    PICTURE X.
           02  IMTIMBO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMKEYBA    PICTURE X.
           02  IMKEYBO  PIC X(23).
           02  FILLER PICTURE X(2).
           02  IMIBTBA    PICTURE X.
           02  IMIBTBO  PIC X(13).
           02  FILLER PICTURE X(2).
           02  IMMOREBA    PICTURE X.
           02  IMMOREBO  PIC X(27).
           02  FILLER PICTURE X(2).
           02  IMSTATBA    PICTURE X.
           02  IMSTATBO  PIC X(34).
           02  FILLER PICTURE X(2).
           02  IMATYPBA    PICTURE X.
           02  IMATYPBO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMNAME1A    PICTURE X.
           02  IMNAME1O  PIC X(40).
           02  FILLER PICTURE X(2).
           02  IMSTYPBA    PICTURE X.
           02  IMSTYPBO  PIC X(19).
           02  FILLER PICTURE X(2).
           02  IMNAME2A    PICTURE X.
           02  IMNAME2O  PIC X(40).
           02  FILLER PICTURE X(2).
           02  IMCUSBLA    PICTURE X.
           02  IMCUSBLO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMADDR1A    PICTURE X.
           02  IMADDR1O  PIC X(40).
           02  FILLER PICTURE X(2).
           02  IMCSHBLA    PICTURE X.
           02  IMCSHBLO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMADDR2A    PICTURE X.
           02  IMADDR2O  PIC X(40).
           02  FILLER PICTURE X(2).
           02  IMDDABLA    PICTURE X.
           02  IMDDABLO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMCTYSTA    PICTURE X.
           02  IMCTYSTO  PIC X(40).
           02  FILLER PICTURE X(2).
           02  IMLNBALA    PICTURE X.
           02  IMLNBALO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMINSTRA    PICTURE X.
           02  IMINSTRO  PIC X(40).
           02  FILLER PICTURE X(2).
           02  IMSAVBLA    PICTURE X.
           02  IMSAVBLO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMDTOPNA    PICTURE X.
           02  IMDTOPNO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMSIGNA    PICTURE X.
           02  IMSIGNO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMLOCA    PICTURE X.
           02  IMLOCO  PIC X(10).
           02  FILLER PICTURE X(2).
           02  IMHOLDSA    PICTURE X.
           02  IMHOLDSO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMDTCSTA    PICTURE X.
           02  IMDTCSTO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMTAXCDA    PICTURE X.
           02  IMTAXCDO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMTAXNOA    PICTURE X.
           02  IMTAXNOO  PIC X(11).
           02  FILLER PICTURE X(2).
           02  IMBKUNVA    PICTURE X.
           02  IMBKUNVO  PIC Z(07),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMDTDEPA    PICTURE X.
           02  IMDTDEPO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMCHGCDA    PICTURE X.
           02  IMCHGCDO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMCSUNVA    PICTURE X.
           02  IMCSUNVO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMLTMNTA    PICTURE X.
           02  IMLTMNTO  PIC X(8).
           02  FILLER PICTURE X(2).
           02  IMSPINSA    PICTURE X.
           02  IMSPINSO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMAMDEPA    PICTURE X.
           02  IMAMDEPO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMNSFTDA    PICTURE X.
           02  IMNSFTDO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMMINBLA    PICTURE X.
           02  IMMINBLO  PIC Z(10),ZZ9-.
           02  FILLER PICTURE X(2).
           02  IMODTODA    PICTURE X.
           02  IMODTODO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMAVCOLA    PICTURE X.
           02  IMAVCOLO  PIC Z(12),ZZ9-.
           02  FILLER PICTURE X(2).
           02  IMCONKTA    PICTURE X.
           02  IMCONKTO  PIC ZZ9.
           02  FILLER PICTURE X(2).
           02  IMMTDAVA    PICTURE X.
           02  IMMTDAVO  PIC Z(12),ZZ9-.
           02  FILLER PICTURE X(2).
           02  IMHIFIA    PICTURE X.
           02  IMHIFIO  PIC 9.
           02  FILLER PICTURE X(2).
           02  IMMTDKTA    PICTURE X.
           02  IMMTDKTO  PIC ZZ9.
           02  FILLER PICTURE X(2).
           02  IMCYCACA    PICTURE X.
           02  IMCYCACO  PIC Z(10)9.9(6)-.
           02  FILLER PICTURE X(2).
           02  IMNOTRFA    PICTURE X.
           02  IMNOTRFO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMPROJA    PICTURE X.
           02  IMPROJO  PIC Z(10),ZZ9.99-.
           02  FILLER PICTURE X(2).
           02  IMNOCHKA    PICTURE X.
           02  IMNOCHKO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMSTPAYA    PICTURE X.
           02  IMSTPAYO  PIC Z(6)9.
           02  FILLER PICTURE X(2).
           02  IMODLIMA    PICTURE X.
           02  IMODLIMO  PIC X(16).
           02  FILLER PICTURE X(2).
           02  IMBHOPTA    PICTURE X.
           02  IMBHOPTO  PIC X(1).
           02  FILLER PICTURE X(2).
           02  IMBHRETA    PICTURE X.
           02  IMBHRETO  PIC X(3).
           02  FILLER PICTURE X(2).
           02  IMCHQREA    PICTURE X.
           02  IMCHQREO  PIC X(29).
           02  FILLER PICTURE X(2).
           02  IMPAGEFA    PICTURE X.
           02  IMPAGEFO  PIC X(79).
           02  FILLER PICTURE X(2).
           02  IMERRBA    PICTURE X.
           02  IMERRBO  PIC X(79).