       01  FIIMSCBI.
           02  FILLER PIC X(12).
           02  SCTRANL    COMP  PIC  S9(4).
           02  SCTRANF    PICTURE X.
           02  FILLER REDEFINES SCTRANF.
             03 SCTRANA    PICTURE X.
           02  SCTRANI  PIC X(4).
           02  SCDATEL    COMP  PIC  S9(4).
           02  SCDATEF    PICTURE X.
           02  FILLER REDEFINES SCDATEF.
             03 SCDATEA    PICTURE X.
           02  SCDATEI  PIC X(8).
           02  SCTIMEL    COMP  PIC  S9(4).
           02  SCTIMEF    PICTURE X.
           02  FILLER REDEFINES SCTIMEF.
             03 SCTIMEA    PICTURE X.
           02  SCTIMEI  PIC X(8).
           02  SCCTL2L    COMP  PIC  S9(4).
           02  SCCTL2F    PICTURE X.
           02  FILLER REDEFINES SCCTL2F.
             03 SCCTL2A    PICTURE X.
           02  SCCTL2I  PIC X(3).
           02  SCCTL3L    COMP  PIC  S9(4).
           02  SCCTL3F    PICTURE X.
           02  FILLER REDEFINES SCCTL3F.
             03 SCCTL3A    PICTURE X.
           02  SCCTL3I  PIC X(3).
           02  SCTYPEL    COMP  PIC  S9(4).
           02  SCTYPEF    PICTURE X.
           02  FILLER REDEFINES SCTYPEF.
             03 SCTYPEA    PICTURE X.
           02  SCTYPEI  PIC X(1).
           02  SCDLML    COMP  PIC  S9(4).
           02  SCDLMF    PICTURE X.
           02  FILLER REDEFINES SCDLMF.
             03 SCDLMA    PICTURE X.
           02  SCDLMI  PIC X(8).
           02  SCDESCL    COMP  PIC  S9(4).
           02  SCDESCF    PICTURE X.
           02  FILLER REDEFINES SCDESCF.
             03 SCDESCA    PICTURE X.
           02  SCDESCI  PIC X(20).
           02  SCO1WBZL    COMP  PIC  S9(4).
           02  SCO1WBZF    PICTURE X.
           02  FILLER REDEFINES SCO1WBZF.
             03 SCO1WBZA    PICTURE X.
           02  SCO1WBZI  PIC X(1).
           02  SCO1AFZL    COMP  PIC  S9(4).
           02  SCO1AFZF    PICTURE X.
           02  FILLER REDEFINES SCO1AFZF.
             03 SCO1AFZA    PICTURE X.
           02  SCO1AFZI  PIC X(1).
           02  SCO1WNAL    COMP  PIC  S9(4).
           02  SCO1WNAF    PICTURE X.
           02  FILLER REDEFINES SCO1WNAF.
             03 SCO1WNAA    PICTURE X.
           02  SCO1WNAI  PIC X(1).
           02  SCO1WIAL    COMP  PIC  S9(4).
           02  SCO1WIAF    PICTURE X.
           02  FILLER REDEFINES SCO1WIAF.
             03 SCO1WIAA    PICTURE X.
           02  SCO1WIAI  PIC X(1).
           02  SCO1WTTL    COMP  PIC  S9(4).
           02  SCO1WTTF    PICTURE X.
           02  FILLER REDEFINES SCO1WTTF.
             03 SCO1WTTA    PICTURE X.
           02  SCO1WTTI  PIC X(1).
           02  SCO1WADL    COMP  PIC  S9(4).
           02  SCO1WADF    PICTURE X.
           02  FILLER REDEFINES SCO1WADF.
             03 SCO1WADA    PICTURE X.
           02  SCO1WADI  PIC X(1).
           02  SCO1WANL    COMP  PIC  S9(4).
           02  SCO1WANF    PICTURE X.
           02  FILLER REDEFINES SCO1WANF.
             03 SCO1WANA    PICTURE X.
           02  SCO1WANI  PIC X(1).
           02  SCO1WAGL    COMP  PIC  S9(4).
           02  SCO1WAGF    PICTURE X.
           02  FILLER REDEFINES SCO1WAGF.
             03 SCO1WAGA    PICTURE X.
           02  SCO1WAGI  PIC X(1).
           02  SCO1WCLL    COMP  PIC  S9(4).
           02  SCO1WCLF    PICTURE X.
           02  FILLER REDEFINES SCO1WCLF.
             03 SCO1WCLA    PICTURE X.
           02  SCO1WCLI  PIC X(1).
           02  SCO1DNWL    COMP  PIC  S9(4).
           02  SCO1DNWF    PICTURE X.
           02  FILLER REDEFINES SCO1DNWF.
             03 SCO1DNWA    PICTURE X.
           02  SCO1DNWI  PIC X(2).
           02  SCO1AGLL    COMP  PIC  S9(4).
           02  SCO1AGLF    PICTURE X.
           02  FILLER REDEFINES SCO1AGLF.
             03 SCO1AGLA    PICTURE X.
           02  SCO1AGLI  PIC X(2).
           02  SCO1AGUL    COMP  PIC  S9(4).
           02  SCO1AGUF    PICTURE X.
           02  FILLER REDEFINES SCO1AGUF.
             03 SCO1AGUA    PICTURE X.
           02  SCO1AGUI  PIC X(2).
           02  SCO1CTZL    COMP  PIC  S9(4).
           02  SCO1CTZF    PICTURE X.
           02  FILLER REDEFINES SCO1CTZF.
             03 SCO1CTZA    PICTURE X.
           02  SCO1CTZI  PIC X(1).
           02  SCO1PIOL    COMP  PIC  S9(4).
           02  SCO1PIOF    PICTURE X.
           02  FILLER REDEFINES SCO1PIOF.
             03 SCO1PIOA    PICTURE X.
           02  SCO1PIOI  PIC X(1).
           02  SCO1DCAL    COMP  PIC  S9(4).
           02  SCO1DCAF    PICTURE X.
           02  FILLER REDEFINES SCO1DCAF.
             03 SCO1DCAA    PICTURE X.
           02  SCO1DCAI  PIC X(1).
           02  SCO1MSCL    COMP  PIC  S9(4).
           02  SCO1MSCF    PICTURE X.
           02  FILLER REDEFINES SCO1MSCF.
             03 SCO1MSCA    PICTURE X.
           02  SCO1MSCI  PIC X(8).
           02  SCO1MTAL    COMP  PIC  S9(4).
           02  SCO1MTAF    PICTURE X.
           02  FILLER REDEFINES SCO1MTAF.
             03 SCO1MTAA    PICTURE X.
           02  SCO1MTAI  PIC X(8).
           02  SCERRL    COMP  PIC  S9(4).
           02  SCERRF    PICTURE X.
           02  FILLER REDEFINES SCERRF.
             03 SCERRA    PICTURE X.
           02  SCERRI  PIC X(79).
       01  FIIMSCBO REDEFINES FIIMSCBI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  SCTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCCTL2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  SCCTL3O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  SCTYPEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCDLMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCDESCO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  SCO1WBZO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1AFZO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WNAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WIAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WTTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WADO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WANO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WAGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1WCLO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1DNWO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  SCO1AGLO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  SCO1AGUO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  SCO1CTZO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1PIOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1DCAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO1MSCO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCO1MTAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCERRO  PIC X(79).