       01  FIIMSCDI.
           02  FILLER PIC X(12).
           02  SCTRANL    COMP  PIC  S9(4).
           02  SCTRANF    PICTURE X.
           02  FILLER REDEFINES SCTRANF.
             03 SCTRANA    PICTURE X.
           02  SCTRANI  PIC X(4).
           02  SCDATEL    COMP  PIC  S9(4).
           02  SCDATEF    PICTURE X.
           02  FILLER REDEFINES SCDATEF.
             03 SCDATEA    PICTURE X.
           02  SCDATEI  PIC X(8).
           02  SCTIMEL    COMP  PIC  S9(4).
           02  SCTIMEF    PICTURE X.
           02  FILLER REDEFINES SCTIMEF.
             03 SCTIMEA    PICTURE X.
           02  SCTIMEI  PIC X(8).
           02  SCO3SEPL    COMP  PIC  S9(4).
           02  SCO3SEPF    PICTURE X.
           02  FILLER REDEFINES SCO3SEPF.
             03 SCO3SEPA    PICTURE X.
           02  SCO3SEPI  PIC X(1).
           02  SCO3WSVL    COMP  PIC  S9(4).
           02  SCO3WSVF    PICTURE X.
           02  FILLER REDEFINES SCO3WSVF.
             03 SCO3WSVA    PICTURE X.
           02  SCO3WSVI  PIC X(1).
           02  SCO3MFEL    COMP  PIC  S9(4).
           02  SCO3MFEF    PICTURE X.
           02  FILLER REDEFINES SCO3MFEF.
             03 SCO3MFEA    PICTURE X.
           02  SCO3MFEI  PIC X(10).
           02  SCO3FMIL    COMP  PIC  S9(4).
           02  SCO3FMIF    PICTURE X.
           02  FILLER REDEFINES SCO3FMIF.
             03 SCO3FMIA    PICTURE X.
           02  SCO3FMII  PIC X(3).
           02  SCO3SVAL    COMP  PIC  S9(4).
           02  SCO3SVAF    PICTURE X.
           02  FILLER REDEFINES SCO3SVAF.
             03 SCO3SVAA    PICTURE X.
           02  SCO3SVAI  PIC X(16).
           02  SCO3SVML    COMP  PIC  S9(4).
           02  SCO3SVMF    PICTURE X.
           02  FILLER REDEFINES SCO3SVMF.
             03 SCO3SVMA    PICTURE X.
           02  SCO3SVMI  PIC X(16).
           02  SCO3CBLL    COMP  PIC  S9(4).
           02  SCO3CBLF    PICTURE X.
           02  FILLER REDEFINES SCO3CBLF.
             03 SCO3CBLA    PICTURE X.
           02  SCO3CBLI  PIC X(16).
           02  SCO3MBLL    COMP  PIC  S9(4).
           02  SCO3MBLF    PICTURE X.
           02  FILLER REDEFINES SCO3MBLF.
             03 SCO3MBLA    PICTURE X.
           02  SCO3MBLI  PIC X(16).
           02  SCO3ABLL    COMP  PIC  S9(4).
           02  SCO3ABLF    PICTURE X.
           02  FILLER REDEFINES SCO3ABLF.
             03 SCO3ABLA    PICTURE X.
           02  SCO3ABLI  PIC X(16).
           02  SCO3ACBL    COMP  PIC  S9(4).
           02  SCO3ACBF    PICTURE X.
           02  FILLER REDEFINES SCO3ACBF.
             03 SCO3ACBA    PICTURE X.
           02  SCO3ACBI  PIC X(16).
           02  SCO3ECFL    COMP  PIC  S9(4).
           02  SCO3ECFF    PICTURE X.
           02  FILLER REDEFINES SCO3ECFF.
             03 SCO3ECFA    PICTURE X.
           02  SCO3ECFI  PIC X(1).
           02  SCO3EBTL    COMP  PIC  S9(4).
           02  SCO3EBTF    PICTURE X.
           02  FILLER REDEFINES SCO3EBTF.
             03 SCO3EBTA    PICTURE X.
           02  SCO3EBTI  PIC X(1).
           02  SCO3EPFL    COMP  PIC  S9(4).
           02  SCO3EPFF    PICTURE X.
           02  FILLER REDEFINES SCO3EPFF.
             03 SCO3EPFA    PICTURE X.
           02  SCO3EPFI  PIC X(10).
           02  SCO3ENFL    COMP  PIC  S9(4).
           02  SCO3ENFF    PICTURE X.
           02  FILLER REDEFINES SCO3ENFF.
             03 SCO3ENFA    PICTURE X.
           02  SCO3ENFI  PIC X(10).
           02  SCO3ERRL    COMP  PIC  S9(4).
           02  SCO3ERRF    PICTURE X.
           02  FILLER REDEFINES SCO3ERRF.
             03 SCO3ERRA    PICTURE X.
           02  SCO3ERRI  PIC X(10).
           02  SCO3FFOL    COMP  PIC  S9(4).
           02  SCO3FFOF    PICTURE X.
           02  FILLER REDEFINES SCO3FFOF.
             03 SCO3FFOA    PICTURE X.
           02  SCO3FFOI  PIC X(1).
           02  SCO3FBTL    COMP  PIC  S9(4).
           02  SCO3FBTF    PICTURE X.
           02  FILLER REDEFINES SCO3FBTF.
             03 SCO3FBTA    PICTURE X.
           02  SCO3FBTI  PIC X(1).
           02  SCO3FF1L    COMP  PIC  S9(4).
           02  SCO3FF1F    PICTURE X.
           02  FILLER REDEFINES SCO3FF1F.
             03 SCO3FF1A    PICTURE X.
           02  SCO3FF1I  PIC X(10).
           02  SCO3DCOL    COMP  PIC  S9(4).
           02  SCO3DCOF    PICTURE X.
           02  FILLER REDEFINES SCO3DCOF.
             03 SCO3DCOA    PICTURE X.
           02  SCO3DCOI  PIC X(10).
           02  SCO3FF2L    COMP  PIC  S9(4).
           02  SCO3FF2F    PICTURE X.
           02  FILLER REDEFINES SCO3FF2F.
             03 SCO3FF2A    PICTURE X.
           02  SCO3FF2I  PIC X(10).
           02  SCO3DBAL    COMP  PIC  S9(4).
           02  SCO3DBAF    PICTURE X.
           02  FILLER REDEFINES SCO3DBAF.
             03 SCO3DBAA    PICTURE X.
           02  SCO3DBAI  PIC X(16).
           02  SCERRL    COMP  PIC  S9(4).
           02  SCERRF    PICTURE X.
           02  FILLER REDEFINES SCERRF.
             03 SCERRA    PICTURE X.
           02  SCERRI  PIC X(79).
       01  FIIMSCDO REDEFINES FIIMSCDI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  SCTRANO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SCDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SCO3SEPO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO3WSVO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO3MFEO PIC Z(6)9.99.
           02  FILLER PICTURE X(3).
           02  SCO3FMIO PIC ZZ9.
           02  FILLER PICTURE X(3).
           02  SCO3SVAO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  SCO3SVMO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  SCO3CBLO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  SCO3MBLO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  SCO3ABLO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  SCO3ACBO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  SCO3ECFO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO3EBTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO3EPFO PIC 9.9(8).
           02  FILLER PICTURE X(3).
           02  SCO3ENFO PIC 9.9(8).
           02  FILLER PICTURE X(3).
           02  SCO3ERRO PIC 9.9(8).
           02  FILLER PICTURE X(3).
           02  SCO3FFOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO3FBTO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SCO3FF1O PIC 9.9(8).
           02  FILLER PICTURE X(3).
           02  SCO3DCOO PIC Z(6)9.99.
           02  FILLER PICTURE X(3).
           02  SCO3FF2O PIC 9.9(8).
           02  FILLER PICTURE X(3).
           02  SCO3DBAO PIC Z(12)9.99.
           02  FILLER PICTURE X(3).
           02  SCERRO  PIC X(79).