*     * FO5238*05/12/11 PROYECTO UPGRADE SYSTEMATIC
         TITLE 'SI INSTALLATION UTILITY SELECT/DEBLOCK PROGRAM'         00000005
*---------------------------------------------------------------------* 00000010
*                   ** COPYBOOK DESCRIPTION **                        * 00000020
*                                                                     * 00000025
* IUDBKSRC IS A COPYBOOK USED FOR INSTALLATION/UTILITY SELECT/DEBLOCK * 00000030
*                                                                     * 00000035
*---------------------------------------------------------------------* 00000040
         EJECT                                                9913801   00000045
*---------------------------------------------------------------------* 00000050
*                  ** HISTORY OF REVISIONS **                         * 00000055
*                                                                     * 00000060
* DESCRIPTION                                                 CHNGID  * 00000065
* __________________________________________________________  _______ * 00000070
* 05/06/03 MODIFIED COMPANY NAME                              0354773   00000148
* 02/01/00 MODIFY TO REMOVE COBVS                             2024183 * 00000149
* 10/08/99 MODIFY TO CORRECT PPS LAM INSTALLATION             2024126 * 00000151
* 10/07/99 MODIFY TO CORRECT COMPILE ERRORS                   2024132 * 00000153
* 12/02/98 SUPPORT EXCLUDE PREFIX=                            9914000 * 00000155
* 06/03/98 LIST PDS MEMBERS                                   9913407 * 00000157
* 04/22/98 SUPPORT LIBRARIAN                                  9913801 * 00000159
* 03/31/97 SUPPORT COBOL/VSE                                  9713437 * 00000163
* 05/16/96 CORRECT COBOL FILTERING                            9713161 * 00000164
* 02/28/94 CORRECT SELECT SECTION= COMMAND                    2601922 * 00000165
* 04/20/94 CORRECT SELECT NAME= WITH SELECT TABLE= PROCESSING 2602137 * 00000166
*                                                                     * 00000170
*---------------------------------------------------------------------* 00000175
         EJECT                                                          00000180
         GBLB  &LIBRM                                                   00000200
         COPY  IUOPTNS                                                  00000300
         AIF   ('&OPSYS' NE 'VSE').LIBR002                              00000400
         AIF   (NOT &SUBLIB).LIBR002                                    00000410
         AIF   (&VSEVER GT 5).LIBR001                                   00000500
         AIF   (&VSEVER LT 5).LIBR002                                   00000600
         AIF   (&VSEREL LT 2).LIBR002                                   00000700
.LIBR001 ANOP                                                           00000800
&LIBRM   SETB  1                                                        00000900
.LIBR002 ANOP                                                           00001000
         AIF   ('&SYSPARM' EQ 'EXIT').CHKEXIT                           00001100
IUDBKSTD START                                                          00001200
         AGO   .START                                                   00001300
.CHKEXIT ANOP                                                           00001400
         AIF   (&PAN).PANTITL                                           00001500
         AIF   (&LIB).LIBTITL                                           00001600
         MNOTE 16,'SOURCE LIBRARY OPTION MUST BE PAN OR LIB WITH EXIT'  00001700
         AGO   .END                                                     00001800
.PANTITL ANOP                                                           00001900
         TITLE 'SI INSTALLATION UTILITY SELECT/DEBLOCK FOR PANVALET'    00002000
IUDBKPAN START                                                          00002100
         AGO   .START                                                   00002200
.LIBTITL ANOP                                                           00002300
         TITLE 'SI INSTALLATION UTILITY SELECT/DEBLOCK FOR LIBRARIAN'   00002400
         AIF   ('&OPSYS' NE 'VSE').LIB001                     9913801   00002410
* THE FOLLOWING STATEMENT(S) MODIFIED BY                      9913801   00002419
UINPEX   START                                                          00002420
         AGO   .LIB002                                        9913801   00002430
.LIB001  ANOP                                                 9913801   00002440
IUDBKLIB START                                                          00002500
.LIB002  ANOP                                                 9913801   00002510
.START   ANOP                                                           00002600
PROGINIT EQU   *                                                        00002700
R0       EQU   0                                                        00002800
R1       EQU   1                                                        00002900
R2       EQU   2                                                        00003000
R3       EQU   3                                                        00003100
R4       EQU   4                                                        00003200
R5       EQU   5                                                        00003300
R6       EQU   6                                                        00003400
R7       EQU   7                                                        00003500
R8       EQU   8                                                        00003600
R9       EQU   9                                                        00003700
R10      EQU   10                                                       00003800
R11      EQU   11                                                       00003900
R12      EQU   12                                                       00004000
R13      EQU   13                                                       00004100
R14      EQU   14                                                       00004200
R15      EQU   15                                                       00004300
         USING PROGINIT,R9,R10                                          00004400
*********************************************************************** 00004500
*        REGISTERS 9 AND 10 ARE USED AS BASE REGISTERS UNTIL          * 00004600
*        THE LABEL B0010 AFTER WHICH THEY ARE DROPPED AND USED AS     * 00004700
*        WORK AND BAL LINK REGISTERS RESPECTIVELY                     * 00004800
*********************************************************************** 00004900
         STM   R14,R12,12(R13)     SAVE CALLER'S REGISTERS              00005000
         LR    R9,R15              SET FIRST BASE REGISTER              00005100
         LA    R10,2048(0,R9)      SET SECOND BASE REGISTER             00005200
         LA    R10,2048(0,R10)                                          00005300
         L     R12,=A(IUDBKBEG)    GET MY SAVEAREA ADDR       9913801   00005400
         ST    R13,4(R12)          SAVE CALLER'S SAVEAREA ADR 9913801   00005500
         ST    R12,8(0,R13)        SAVE MY SAVEAREA ADDR IN CALLER'S    00005600
         LR    R13,R12             POINT R13 TO MY SAVEAREA             00005700
         LA    R12,2048(0,R13)     SET UP THE REST OF MY BASE REGISTERS 00005800
         LA    R12,2048(0,R12)     *                                    00005900
         LA    R11,2048(0,R12)     *                                    00006000
         LA    R11,2048(0,R11)     *                                    00006100
         USING IUDBKBEG,R13,R12,R11                           9913801   00006200
         B     RTNBEGIN                                                 00006300
         DC    CL10'*IUDBKSRC*'                                         00006400
         AIF   ('&OPSYS' EQ 'MVS').MVS1                                 00006500
RTNBEGIN EQU   *                                                        00006600
*                                                                       00006700
         AIF   ('&SYSPARM' NE 'EXIT').NOXIT                             00006800
         MVC   SAVEPARM,0(R1)      SAVE EXIT PARAMETER ADDRESSES        00006900
         NOP   A0200               BR AFTER 1ST TIME THRU               00007000
         OI    *-3,X'F0'           CHANGE NOP TO BR AFTER 1ST TIME      00007100
.NOXIT   ANOP                                                           00007200
*                                                                       00007300
         AIF   ('&OPSYS' EQ 'VSE').A0010C                               00007400
.MVS1    ANOP                                                           00007500
         DC    CL14' DATE &SYSDATE'   ASSEMBLY DATE                     00007600
         DC    CL14' TIME &SYSTIME'   ASSEMBLY TIME                     00007700
RTNBEGIN EQU   *                                                        00007800
         AIF   ('&SYSPARM' NE 'EXIT').NOXIT2                            00007900
         MVC   SAVEPARM,0(R1)      SAVE EXIT PARAMETER ADDRESSES        00008000
         NOP   A0200               BR AFTER 1ST TIME THRU               00008100
         OI    *-3,X'F0'           CHANGE NOP TO BR AFTER 1ST TIME      00008200
         AGO   .NOXIT3                                                  00008300
.NOXIT2  ANOP                                                           00008400
         ST    R1,PARMADDR         SAVE ADDRESS OF PARM FIELD           00008500
.NOXIT3  ANOP                                                           00008600
*********************************************************************** 00008700
*        GET TABLE OF ALL VALID SECTION ID'S                          * 00008800
*********************************************************************** 00008900
         LOAD  EP=IUSECTBL         LOAD VALID SECTION TABLE CODES       00009000
         ST    R0,IUSECTAD         SAVE ITS ADDRESS                     00009100
*                                                                       00009200
         AIF   ('&SYSPARM' NE 'EXIT').A0010A                            00009300
         OPEN  (TAPEIN,INPUT)                                           00009400
         AGO   .A0090                                                   00009500
*                                                                       00009600
.A0010A  ANOP                                                           00009700
         L     R1,PARMADDR         LOAD ADDRESS OF PARM FIELD           00009800
         LH    R2,0(0,R1)          LOAD LENGTH OF PARM                  00009900
         LTR   R2,R2               LENGTH EQUAL ZERO                    00010000
         BZ    A0010               YES                                  00010100
         MVC   SYSPARM,2(R1)       SAVE PARM FIELD                      00010200
A0010    EQU   *                                                        00010300
*********************************************************************** 00010400
*        GET SYSTEM DATE AND TIME                                     * 00010500
*********************************************************************** 00010600
         TIME  DEC                                                      00010700
         SRL   R0,4                     SHIFT OFF HUNDREDTHS            00010800
         ST    R0,WKWORD                STORE TIME                      00010900
         OI    WKWORD+3,X'0F'           FIX SIGN                        00011000
         UNPK  DIRHD2TM,WKWORD          UNPACK DIRHD2TM                 00011100
         MVC   DIRHD2TM(2),DIRHD2TM+2   MOVE HOURS                      00011200
         MVI   DIRHD2TM+2,C'.'          MOVE 1ST POINT                  00011300
         MVC   DIRHD2TM+3(2),DIRHD2TM+4 MOVE MINUTES                    00011400
         MVI   DIRHD2TM+5,C'.'          MOVE 2ND POINT                  00011500
         ST    R1,WKWORD                STORE DATE                      00011600
         UNPK  JULDATE,WKWORD                                           00011700
         MVC   DIRHD1DT+6(2),JULYR      MOVE INPUT YEAR TO OUTPUT YEAR  00011800
         MVC   DAYTBL+2(2),=P'028'      RESET FEB DAYS TO 28            00011900
         PACK  DBLWORD,JULYR            PACK YEAR                       00012000
         CVB   R1,DBLWORD               CONVERT YEAR TO BINARY          00012100
         STC   R1,DBLWORD               STORE IT FOR LEAP YEAR CHECK    00012200
         TM    DBLWORD,X'03'            IS YEAR DIVISIBLE BY 4          00012300
         BNZ   NOTLPYR                  NO - NOT LEAP YEAR              00012400
         AP    DAYTBL+2(2),=P'1'        CHANGE FEB DAYS TO 29           00012500
NOTLPYR  EQU   *                                                        00012600
         LA    R1,DAYTBL                                                00012700
         ZAP   MONTHCNT,=P'1'           SET BEGINNING MONTH             00012800
CHKDAY   EQU   *                                                        00012900
         CP    WORKDAY,0(2,R1)          DAYS REMAINING LESS THAN MONTH  00013000
         BNH   ENDDAYS                  YES                             00013100
         AP    MONTHCNT,=P'1'           ADD ONE TO MONTH                00013200
         SP    WORKDAY,0(2,R1)          SUBTRACT MONTH DAYS             00013300
         LA    R1,2(0,R1)               BUMP TO NEXT MONTH IN TABLE     00013400
         B     CHKDAY                                                   00013500
ENDDAYS  EQU   *                                                        00013600
         UNPK  DIRHD1DT(2),MONTHCNT     MOVE MONTH TO OUTPUT            00013700
         OI    DIRHD1DT+1,X'F0'                                         00013800
         MVI   DIRHD1DT+2,C'/'                                          00013900
         UNPK  DIRHD1DT+3(2),WORKDAY    MOVE DAYS IN MONTH TO OUTPUT    00014000
         OI    DIRHD1DT+4,X'F0'                                         00014100
         MVI   DIRHD1DT+5,C'/'                                          00014200
         B     A0015                                                    00014300
PARMADDR DC    F'0'                                                     00014400
WKWORD   DC    F'0'                                                     00014500
         ORG   WKWORD                                                   00014600
         DS    CL2                                                      00014700
WORKDAY  DS    PL2                                                      00014800
JULDATE  DS    0CL5                                                     00014900
JULYR    DC    CL2' '                                                   00015000
         DC    CL3' '                                                   00015100
MONTHCNT DC    PL2'0'                                                   00015200
DAYTBL   DC    PL2'031,028,031,030,031,030,031,031,030,031,030,031'     00015300
         DS    0H                                                       00015400
A0015    EQU   *                                                        00015500
*********************************************************************** 00015600
*        OPEN FILES                                                   * 00015700
*********************************************************************** 00015800
         OPEN  (TAPEIN,INPUT,CARDFIL,INPUT,PRTOUT,OUTPUT)               00015900
         MVC   OUTFILAD,TAPEOUAD   SET DEFAULT OUTPUT FILE              00016000
         AGO   .A0010D                                                  00016100
*                                                                       00016200
.A0010C  ANOP                                                           00016300
         AIF   ('&SYSPARM' EQ 'EXIT').A0015                             00016400
         MVC   OUTFILAD,PRTOUTAD   SET DEFAULT OUTPUT FILE              00016500
         L     R14,TAPEOUAD        GET TAPEOUT DTF ADDR                 00016600
         L     R15,TAPESVAD        GET TAPESAVE ADDR                    00016700
         MVC   0(TAPELNG,R15),0(R14) SAVE TAPE DTF                      00016800
*********************************************************************** 00016900
*        GET SYSTEM DATE AND TIME                                     * 00017000
*********************************************************************** 00017100
         COMRG                     GET VSE COMMUNICATIONS AREA          00017200
         L     R15,112(0,R1)       GET ADDRESS OF SYSPARM FIELD         00017300
         MVC   SYSPARM,1(R15)      SAVE SYSPARM FIELD                   00017400
         CLC   SYSPARM(5),REPRO    DOES SYSPARM FIELD = REPRO           00017500
         BE    R0010               YES - GO TO REPRO PROCESSING         00017600
         CLC   SYSPARM(7),VSEBKUP  DOES SYSPARM FIELD = VSEBKUP         00017700
         BE    R0200               YES - GO TO VSE BACKUP POSITIONING   00017800
         MVC   DIRHD1DT,0(R1)      MOVE SYSTEM DATE                     00017900
         SR    R15,R15             CLEAR REG 15                         00018000
         IC    R15,78(0,R1)        GET SYSTEM LINE COUNT                00018100
         CVD   R15,DBLWORD         CONVERT IT TO DECIMAL                00018200
         ZAP   LINELMT,DBLWORD     MOVE SYSTEM LINE COUNT TO LINELMT    00018300
         MVC   COMFLAG,56(R1)      SAVE COMMUNICATION FLAGS             00018400
         GETIME STANDARD                                                00018500
         ST    R1,FWORD                                                 00018600
         OI    FWORD+3,X'0F'            FIX SIGN OF LAST BYTE           00018700
         UNPK  DIRHD2TM,FWORD           UNPACK TIME                     00018800
         MVC   DIRHD2TM(2),DIRHD2TM+2   MOVE HOURS                      00018900
         MVI   DIRHD2TM+2,C'.'          MOVE 1ST POINT                  00019000
         MVC   DIRHD2TM+3(2),DIRHD2TM+4 MOVE MINUTES                    00019100
         MVI   DIRHD2TM+5,C'.'          MOVE 2ND POINT                  00019200
         B     A0015                                                    00019300
FWORD    DC    F'0'                                                     00019400
REPRO    DC    CL5'REPRO'                                               00019500
VSEBKUP  DC    CL7'VSEBKUP'                                             00019600
         DS    0H                                                       00019700
.A0015   ANOP                                                           00019800
A0015    EQU   *                                                        00019900
*********************************************************************** 00020000
*        SEE IF DISKIN DLBL EXISTS FOR DISK DISTRIBUTION FILE         * 00020100
*********************************************************************** 00020200
         LABEL LPLADDR=LPL,FUNCT=GETLBL                                 00020300
         LTR   R15,R15             ERROR IN LABEL                       00020400
         BZ    A0020               NO - USE DISK INPUT FILE             00020500
         CH    R15,=H'8'           DOES LABEL EXIST                     00020600
         BNE   A0030               NO - USE TAPE INPUT FILE             00020700
A0020    EQU   *                                                        00020800
         MVC   FILEINAD,DISKINAD   POINT INPUT FILE TO DISK             00020900
         B     A0040               GO OPEN INPUT DISK FILE              00021000
COMFLAG  DC    XL1'00'                                                  00021100
LPL      LPL   AREA=LBLIO,AREALEN=140,FILENAM=DISKIN                    00021200
LBLIO    DC    XL140'00'                                                00021300
         DS    0H                                                       00021400
*********************************************************************** 00021500
*        GET BUFFER SPACE FOR FOR TAPE DISTRIBUTION FILE              * 00021600
*********************************************************************** 00021700
A0030    EQU   *                                                        00021800
         LH    R0,=H'20000'        SET LENGTH OF I/O BUFFERS            00021900
         GETVIS LENGTH=(0)                                              00022000
         LTR   R15,R15             WAS GETVIS SUCCESSFUL                00022100
         BNZ   A9170               NO - PUT OUT MSG AND CANCEL          00022200
         L     R15,TAPEINAD        GET TAPEIN DTF ADDR                  00022300
         STCM  R1,B'0111',57(R15)  SAVE IOAREA1 IN TAPEIN DTF CCW       00022400
         AH    R1,=H'10000'        BUMP TO NEXT I/O AREA                00022500
         ST    R1,64(0,R15)        SAVE IOAREA2 IN TAPEIN DTF           00022600
         ST    R1,68(0,R15)        SAVE IOAREA2 IN TAPEIN DTF           00022700
         MVC   FILEINAD,TAPEINAD   POINT INPUT FILE TO TAPE             00022800
A0040    EQU   *                                                        00022900
*********************************************************************** 00023000
*        GET TABLE OF ALL VALID SECTION ID'S                          * 00023100
*********************************************************************** 00023200
         CDLOAD IUSECTBL           LOAD VALID SECTION TABLE CODES       00023300
         ST    R0,IUSECTAD         SAVE ITS ADDRESS                     00023400
*********************************************************************** 00023500
*        OPEN FILES                                                   * 00023600
*********************************************************************** 00023700
         L     R2,FILEINAD         GET INPUT FILE ADDR                  00023800
         OPENR (2)                                                      00023900
         OPENR CSLFILE                                                  00024000
*                                                                       00024100
         AIF   ('&SYSPARM' EQ 'EXIT').A0090                             00024200
         OPENR PRTOUT                                                   00024300
*                                                                       00024400
.A0010D  ANOP                                                           00024500
         CLC   SYSPARM(4),COPY     DO I WANT AN UNCOMPRESSED COPY       00024600
         BNE   A0090               NO - CONTINUE                        00024700
         MVI   OUTDEV,C'C'         INDICATE COPY PROCESSING             00024800
         AIF   ('&OPSYS' EQ 'MVS').A0010E                               00024900
         CLI   SYSPARM+4,C'P'      DO I WANT PRINT COPY OUTPUT          00025000
         BE    B0010               YES                                  00025100
         CLI   SYSPARM+4,C'T'      DO I WANT TAPE COPY OUTPUT           00025200
         BE    A0050               YES                                  00025300
         MVC   OUTFILAD,DSKCPYAD   SAVE DISK OUTPUT FILE ADDR           00025400
         B     B0010                                                    00025500
*                                                                       00025600
A0050    EQU   *                                                        00025700
*********************************************************************** 00025800
*        GET BUFFER SPACE FOR FOR TAPE OUTPUT COPY                    * 00025900
*********************************************************************** 00026000
         MVC   OUTFILAD,TAPCPYAD   SAVE TAPE OUTPUT FILE ADDR           00026100
         LH    R0,=H'20000'        SET LENGTH OF I/O BUFFERS            00026200
         GETVIS LENGTH=(0)         GET SPACE FOR TAPE I/O BUFFERS       00026300
         LTR   R15,R15             WAS GETVIS SUCCESSFUL                00026400
         BNZ   A9240               NO - PUT OUT MSG AND CANCEL          00026500
         L     R15,TAPCPYAD        GET TAPECPY DTF ADDR                 00026600
         ST    R15,OUTFILAD        SET TAPE OUTPUT FILE ADDR            00026700
         STCM  R1,B'0111',57(R15)  SAVE IOAREA1 IN COPYOUT DTF CCW      00026800
         AH    R1,=H'10000'        BUMP TO NEXT I/O AREA                00026900
         ST    R1,64(0,R15)        SAVE IOAREA2 IN TAPECPY DEBLOCKR1    00027000
         ST    R1,68(0,R15)        SAVE IOAREA2 IN TAPECPY DEBLOCKR2    00027100
         AH    R1,=H'10000'        BUMP TO END OF I/O AREA              00027200
         BCTR  R1,0                SUBTRACT 1                           00027300
         ST    R1,76(0,R15)        SAVE END OF IOAREA IN DTF DEBLOCKR3  00027400
.A0010E  ANOP                                                           00027500
         B     B0010                                                    00027600
COPY     DC    CL4'COPY'                                                00027700
         DS    0H                                                       00027800
*                                                                       00027900
.A0090   ANOP                                                           00028000
A0090    EQU   *                                                        00028100
         L     R1,IUSECTAD         GET ADDRESS OF VALID SECTION CODES   00028200
         AH    R1,0(0,R1)          ADD OFFSET TO VALID SECTION TABLE    00028300
         MVC   IUSECTLN,8(R1)      SAVE LENGTH OF EACH ENTRY            00028400
         LA    R1,16(0,R1)         BUMP OVER EYECATCHER AND LENGTH      00028500
         L     R2,SECTBLAD         GET ADDRESS OF SECTION TABLE         00028600
         LA    R2,SECTBLNG(0,R2)   BUMP OVER 'ALL' SECTION ENTRY        00028700
A0095    EQU   *                                                        00028800
         CLC   0(3,R2),=C'XXX'     AVAILABLE ENTRY IN TABLE             00028900
         BNE   A9310               NO - QUIT                            00029000
         MVC   0(3,R2),0(R1)       FILL IN SECTION TABLE ENTRY          00029100
         LA    R2,SECTBLNG(0,R2)   BUMP TO NEXT SECTION TABLE ENTRY     00029200
         AH    R1,IUSECTLN         BUMP TO NEXT TABLE ENTRY             00029300
         CLI   0(R1),X'FF'         END OF TABLE                         00029400
         BNE   A0095               NO - LOOP BACK                       00029500
         EJECT                                                          00029600
*********************************************************************** 00029700
*        READ AND SAVE HEADER CARDS FROM INPUT FILE                   * 00029800
*********************************************************************** 00029900
A0100    EQU   *                                                        00030000
         BAL   R14,DBLKREAD        READ INPUT FILE                      00030100
         CLC   CDHDSECT,SECTKEY    IS THIS THE FIRST SECTION HEADER     00030200
         BE    A0150               YES - FINISH THIS UP                 00030300
         AIF   ('&SYSPARM' EQ 'EXIT').A0110                             00030400
         MVI   HDNGTYPE,C'I'       INDICATE TYPE OF HEADING (INPUT)     00030500
         MVC   PRTBUF,PRTCLR       CLEAR BUFFER AREA                    00030600
         MVI   PRTCTL,X'09'        PRINT AND SPACE ONE COMMAND CODE     00030700
         MVC   PRTREC,CARDIN       MOVE CARD INPUT TO PRINT MSG         00030800
         BAL   R14,PUTPRT          PRINT INPUT CARD                     00030900
.A0110   ANOP                                                           00031000
         CLC   CDHDAPID,APPLKEY    IS THIS AN APPL CARD                 00031100
         BNE   A0110               NO - CHK FOR HDR CARD                00031200
         MVC   APPLCD,CARDIN       SAVE APPL CARD                       00031300
         MVC   EXITAPPL,CDHDAPPL   MOVE APPLICATION ID TO EXIT PARM     00031400
         MVC   EXITREL,CDHDAPRN    MOVE UPDATE NO. TO EXIT PARM         00031500
         B     A0100               READ NEXT TAPE RECORD                00031600
A0110    EQU   *                                                        00031700
         AIF   ('&SYSPARM' EQ 'EXIT').A0125                             00031800
         CLC   CARDIN(6),HDR1KEY   IS THIS A HDR1 CARD                  00031900
         BNE   A0115               NO - CHK FOR HDR2 CARD               00032000
         MVC   DIRHD5KY,HDR1APKY   SAVE APPLICATION DISTRIBUTION KEY    00032100
         B     A0100               READ NEXT TAPE RECORD                00032200
A0115    EQU   *                                                        00032300
         CLC   CARDIN(6),HDR2KEY   IS THIS A HDR2 CARD                  00032400
         BNE   A0120               NO - CHK FOR HDR3 CARD               00032500
         MVC   DIRHD3AP,HDR2APNM   SAVE APPLICATION NAME                00032600
         B     A0100               READ NEXT TAPE RECORD                00032700
A0120    EQU   *                                                        00032800
         CLC   CARDIN(6),HDR3KEY   IS THIS A HDR3 CARD                  00032900
         BNE   A0125               NO - CHK FOR HDR4 CARD               00033000
         MVC   DIRHD4CO,HDR3COMP   SAVE COMPONENT DESCRIPTION           00033100
         B     A0100               READ NEXT TAPE RECORD                00033200
A0125    EQU   *                                                        00033300
.A0125   ANOP                                                           00033400
         CLC   CARDIN(6),HDR4KEY   IS THIS A HDR4 CARD                  00033500
         BNE   A0100               NO - READ NEXT TAPE RECORD           00033600
*        SAVE SECTION INFO FROM HDR4 RECORD                             00033700
         L     R4,SECTBLAD         GET SECTION TABLE ADDR               00033800
A0130    EQU   *                   VALIDATE SECTION ID                  00033900
         CLI   0(R4),X'FF'         END OF TABLE                         00034000
         BE    A9060               YES - TOO MANY SECTIONS ADDED        00034100
         CLC   0(3,R4),=C'XXX'     END OF PREDEFINED TABLE              00034200
         BE    A0135               YES - ADD NEW SECTION                00034300
         CLC   HDR4SECT,0(R4)      IS THIS THE RIGHT SECTION            00034400
         BE    A0140               YES - SAVE SELECTED SECTION DATA     00034500
         LA    R4,SECTBLNG(0,4)                                         00034600
         B     A0130                                                    00034700
A0135    EQU   *                                                        00034800
         MVC   0(3,R4),HDR4SECT    NEW SECTION ADDED TO TABLE           00034900
A0140    EQU   *                                                        00035000
         MVC   30(30,R4),HDR4DESC  SAVE DESCRIPTION                     00035100
         SR    R1,R1               CLEAR REG 1                          00035200
         IC    R1,3(0,R4)          GET SECTION NUMBER                   00035300
         LA    R1,WKSECTFL(R1)     POINT TO ENTRY IN SECTION FLAG TABLE 00035400
         MVI   0(R1),C'1'          TURN ON FLAG FOR SECTION             00035500
         B     A0100               READ NEXT TAPE RECORD                00035600
A0150    EQU   *                                                        00035700
         MVC   CARDSAVE,CARDIN     SAVE SECTION HEADER                  00035800
         EJECT                                                          00035900
*********************************************************************** 00036000
*        READ OPTION COMMANDS AND PROTOTYPE JCL                       * 00036100
*********************************************************************** 00036200
A0200    EQU   *                                                        00036300
         AIF   ('&SYSPARM' EQ 'EXIT').A0200X                            00036400
         AIF   ('&OPSYS' EQ 'VSE').A0200A                               00036500
*                                                                       00036600
*        BATCH MVS INPUT PROCESSING                                     00036700
*                                                                       00036800
         L     R1,CARDFIAD                                    2024132   00036900
         LA    R0,CARDIN                                                00037000
         GET   (1),(0)                                                  00037100
         AGO   .A0230                                                   00037200
*                                                                       00037300
.A0200A  ANOP                                                           00037400
*                                                                       00037500
*        BATCH VSE INPUT PROCESSING                                     00037600
*                                                                       00037700
         TM    COMFLAG,X'20'       IS EXEC FROM CARDS                   00037800
         BO    A0220               YES                                  00037900
         NOP   A0215               BR TO READ AFTER OPEN                00038000
         OI    *-3,X'F0'                                                00038100
         MVC   CSLBUF(L'FIRSTMSG),FIRSTMSG PUT INPUT MSG ON CONSOLE     00038200
         L     R1,CSLFILAD         GET CONSOLE FILE ADDRESS             00038300
         PUT   (1)                                                      00038400
A0215    EQU   *                                                        00038500
         MVC   CSLBUF,SPACES                                            00038600
         L     R1,CSLFILAD                                              00038700
         GET   (1)                                                      00038800
         OC    CSLBUF,SPACES       CHANGE CSL INPUT TO UPPER CASE       00038900
         MVC   CARDIN,CSLBUF       MOVE CSL INPUT TO CARD AREA IF CSL   00039000
         CLC   CARDIN(2),=C'/*'    END OF INPUT                         00039100
         BE    A3000               YES - GO TO CARD EOF ADDR            00039200
         CLC   CARDIN(3),=C'EOJ'   END OF INPUT                         00039300
         BE    A3000               YES - GO TO CARD EOF ADDR            00039400
         CLC   CARDIN,SPACES       END OF INPUT                         00039500
         BE    A3000               YES - GO TO CARD EOF ADDR            00039600
         B     A0230                                                    00039700
A0220    EQU   *                                                        00039800
         NOP   A0225               BR TO READ AFTER OPEN                00039900
         OI    *-3,X'F0'                                                00040000
         OPEN  CARDFIL             OPEN CARD FILE                       00040100
         NI    B0030+1,X'0F'       SET BRANCH TO CLOSE CARD FILE        00040200
A0225    EQU   *                                                        00040300
         L     R1,CARDFIAD         GET CARD FILE ADDRESS                00040400
         GET   (1)                                                      00040500
.A0230   ANOP                                                           00040600
*                                                                       00040700
*        COMMON BATCH INPUT PROCESSING                                  00040800
*                                                                       00040900
A0230    EQU   *                                                        00041000
         MVI   CARDFLAG,C'1'       TURN ON CARDS READ FLAG              00041100
         MVI   HDNGTYPE,C'I'       INDICATE TYPE OF HEADING (INPUT)     00041200
         MVC   PRTBUF,PRTCLR       CLEAR BUFFER AREA                    00041300
         MVI   PRTCTL,X'09'        PRINT AND SPACE ONE COMMAND CODE     00041400
         MVC   PRTREC,CARDIN       MOVE CARD INPUT TO PRINT MSG         00041500
         BAL   R14,PUTPRT          PRINT INPUT CARD                     00041600
         AGO   .A0300                                                   00041700
*                                                                       00041800
.A0200X  ANOP                                                           00041900
         AIF   (NOT &LIB OR '&SYSPARM' NE 'EXIT').A0200XP               00042000
*                                                                       00042100
*        LIBRARIAN INPUT EXIT PROCESSING                                00042200
*                                                                       00042300
         L     R1,EXTIOCD          GET ADDR OF LIBR RETURN CODE         00042400
         OC    0(2,R1),0(R1)       INPUT RECORD - RC=0                  00042500
         BZ    A0210               YES                                  00042600
         CLI   PROCSW,C'1'         IS PROCESS SWITCH ON                 00042700
         BE    GOUT055             YES - FINISH UP                      00042800
         B     A3000               NO - END OF INPUT DATA               00042900
A0210    EQU   *                                                        00043000
         L     R2,EXTIOREC             GET ADDR OF I/O RECORD           00043100
         MVC   CARDIN,0(2)             MOVE RECORD TO CARDIN            00043200
A0230    NOP   A0240                   SWITCH FOR THIS EXIT PROCESSING  00043300
         CLC   0(9,2),=C'-IUDBKLIB'    INVOKE THIS EXIT PROCESSING      00043400
         BNE   LIBEXIT                 NO - SKIP THIS CARD              00043500
         OI    A0230+1,X'F0'           TURN BRANCH ON                   00043600
         B     LIBSKIP                 SKIP THIS CARD                   00043700
A0240    EQU   *                                                        00043800
         CLI   0(2),C'-'               IS THIS A LIBRARIAN CARD         00043900
         BE    LIBEXIT                 YES - WE DON'T WANT IT           00044000
         AGO   .A0300                                                   00044100
*                                                                       00044200
.A0200XP ANOP                                                           00044300
         AIF   (NOT &PAN OR '&SYSPARM' NE 'EXIT').A0210X                00044400
*                                                                       00044500
*        PANVALET INPUT EXIT PROCESSING                                 00044600
*                                                                       00044700
         L     R1,EXTIOCD          GET ADDR OF PAN I/O CODES            00044800
         USING PANCODES,R1                                              00044900
         CLI   PANIO1,C'2'         AFTER A READ                         00045000
         BE    A0210               YES                                  00045100
         CLI   PANIO1,C'7'         END OF PAN INPUT                     00045200
         BE    A3000               YES                                  00045300
         CLI   PROCSW,C'1'         IS PROCESS SWITCH ON                 00045400
         BNE   EXIT                NO                                   00045500
         CLI   PANIO1,C'1'         BEFORE A READ                        00045600
         BE    GOUT055             YES                                  00045700
         B     EXIT                EXIT - NO PROCESSING                 00045800
         DROP  R1                                             9913801   00045810
A0210    EQU   *                                                        00045900
         L     R2,EXTIOREC         GET ADDR OF PAN I/O RECORD           00046000
         MVC   CARDIN,0(2)         MOVE RECORD TO CARDIN                00046100
         CLC   CARDIN(2),=C'++'    IS THIS A PANVALET CARD              00046200
         BE    EXIT                YES                                  00046300
         CLC   CARDIN(2),=C'--'    IS THIS A PANVALET CARD              00046400
         BE    EXIT                YES                                  00046500
.A0210X  ANOP                                                           00046600
*                                                                       00046700
.A0300   ANOP                                                           00046800
         EJECT                                                          00046900
*********************************************************************** 00047000
*        CHECK INPUT FOR COMMAND OPTIONS                              * 00047100
*********************************************************************** 00047200
A0300    EQU   *                                                        00047300
         LA    R15,INPCOMND        POINT TO COMMAND TABLE               00047400
         SR    R1,R1               CLEAR R1                             00047500
A0310    EQU   *                                                        00047600
         IC    R1,0(0,R15)         GET COMMAND LENGTH                   00047700
         EX    R1,CLCCOMND         CHECK COMMAND                        00047800
         BE    A0600               GOT IT                               00047900
         LA    R15,16(0,R15)       BUMP TO NEXT TABLE ENTRY             00048000
         CLI   0(R15),X'FF'        END OF TABLE                         00048100
         BNE   A0310               NO                                   00048200
*********************************************************************** 00048300
*        CHECK INPUT FOR PROTOTYPE JCL                                * 00048400
*********************************************************************** 00048500
*        VALIDATE SECTION ID                                          * 00048600
*********************************************************************** 00048700
A0400    EQU   *                                                        00048800
         L     R4,SECTBLAD         GET ADDR OF SECTION TABLE            00048900
A0410    EQU   *                                                        00049000
         CLI   0(R4),X'FF'         END OF TABLE                         00049100
         BE    A9010               YES - ERROR                          00049200
         CLC   CARDIN(3),0(R4)     FIND ENTRY IN SECTION TABLE          00049300
         BE    A0420                                                    00049400
         LA    R4,SECTBLNG(0,R4)                                        00049500
         B     A0410                                                    00049600
A0420    EQU   *                                                        00049700
         MVC   CDINSECT,3(R4)      MOVE SECTION CODE INTO CARD          00049800
*********************************************************************** 00049900
*        VALIDATE TYPE                                                * 00050000
*********************************************************************** 00050100
         CLC   CARDIN(3),=C'BEG'   BEGINNING SECTION PROTOTYPE          00050200
         BE    A0430               YES                                  00050300
         CLC   CARDIN(3),=C'END'   ENDING SECTION PROTOTYPE             00050400
         BNE   A0440               NO - DONT FIX CARD                   00050500
A0430    EQU   *                                                        00050600
         MVC   CARDIN+3(2),CARDIN  SET BEG/END CODE IN CARD             00050700
A0440    EQU   *                                                        00050800
         LA    R4,TYPETBL          GET ADDR OF TYPE TABLE               00050900
A0450    EQU   *                                                        00051000
         CLC   CARDIN+3(2),0(R4)   FIND ENTRY IN SECTION TABLE          00051100
         BE    A0460               GOT IT                               00051200
         LA    R4,3(0,R4)          BUMP TO NEXT ENTRY                   00051300
         CLI   0(R4),X'FF'         END OF TABLE                         00051400
         BE    A9020               YES - INVALID TYPE FIELD IN CARD     00051500
         B     A0450               LOOP BACK                            00051600
A0460    EQU   *                                                        00051700
         MVC   CDINTYPE,2(R4)      MOVE INPUT TYPE CODE TO INPUT CARD   00051800
         B     A0490                                                    00051900
TYPETBL  DS    0D                                                       00052000
         DC    CL2'SH',X'01'                                            00052100
         DC    CL2'DH',X'02'                                            00052200
         DC    CL2'VR',X'03'                                            00052300
         DC    CL2'DT',X'04'                                            00052400
         DC    CL2'ST',X'05'                                            00052500
         DC    CL2'BE',X'01'                                            00052600
         DC    CL2'EN',X'01'                                            00052700
         DC    X'FF'                                                    00052800
         DS    0H                                                       00052900
         EJECT                                                          00053000
*********************************************************************** 00053100
*        PUT PROTOTYPE JCL INTO JCL TABLE                             * 00053200
*********************************************************************** 00053300
A0490    EQU   *                                                        00053400
         NOP   A0500               DON'T ALLOCATE AFTER 1ST TIME        00053500
         OI    *-3,X'F0'                                                00053600
         L     R1,JCLTBLSZ         GET JCL TABLE SIZE                   00053700
         A     R1,VRTBLSZ          ADD VER/REP TABLE SIZE               00053800
         LA    R1,16(0,R1)         ADD 16 FOR END-OF-TABLE FLAGS        00053900
         BAL   R6,A0900            ALLOCATE STORAGE FOR TABLE           00054000
         ST    R1,JCLTBLAD         SAVE TABLE AREA ADDR                 00054100
         ST    R1,JCLTBLOC         SAVE START ADDR IN POINTER ADDR      00054200
         A     R1,JCLTBLSZ         ADD SIZE OF JCL TABLE                00054300
         MVC   0(8,R1),HEXFF       FLAG END OF JCL TABLE                00054400
         LA    R1,8(0,R1)          BUMP PAST END OF NAME SELECT TABLE   00054500
         ST    R1,VRTBLAD          SAVE VER/REP TABLE ADDR              00054600
         ST    R1,VRTBLOC          SAVE START ADDR IN POINTER ADDR      00054700
         A     R1,VRTBLSZ          ADD SIZE OF VER/REP TABLE            00054800
         MVC   0(8,R1),HEXFF       FLAG END OF VER/REP TABLE            00054900
A0500    EQU   *                                                        00055000
         L     R2,JCLTBLOC         GET CURRENT TABLE ADDRESS            00055100
         CLI   0(R2),X'FF'         END OF TABLE REACHED                 00055200
         BE    A9030               YES - TOO MANY JCL CARDS             00055300
         MVC   0(80,R2),CARDIN     SAVE JCL CARD IN TABLE               00055400
         LA    R2,80(0,R2)         BUMP TO NEXT POSITION IN TABLE       00055500
         ST    R2,JCLTBLOC                                              00055600
         LH    R2,NOJCLENT         GET NO. ENTRIES IN JCL TABLE         00055700
         LA    R2,1(0,R2)          ADD 1 TO IT                          00055800
         STH   R2,NOJCLENT         AND SAVE IT                          00055900
         B     A2999               GO GET NEXT CARD                     00056000
         EJECT                                                          00056100
*********************************************************************** 00056200
*        PARSE INPUT COMMAND INTO SEPARATE FIELDS                     * 00056300
*********************************************************************** 00056400
A0600    EQU   *                                                        00056500
         MVI   FIELDS,C' '         CLEAR PARSE AREA                     00056600
         MVC   FIELDS+1(L'FIELDS-1),FIELDS                              00056700
         LA    R4,CARDIN           POINT TO INPUT AREA                  00056800
         LA    R5,72               SET INPUT AREA LENGTH                00056900
         LA    R6,FIELD1           POINT TO FIRST PARSE FIELD           00057000
A0630    EQU   *                                                        00057100
         CLI   0(R4),C'('          IS THIS A LEFT PAREN                 00057200
         BE    A0670               YES - RETURN                         00057300
         CLI   0(R4),C' '          IS THIS A BLANK                      00057400
         BNE   A0640               NO                                   00057500
         LA    R4,1(0,R4)          BUMP TO NEXT POSITION                00057600
         BCT   R5,A0630            LOOP BACK                            00057700
         B     A0670               RETURN                               00057800
A0640    EQU   *                                                        00057900
         LR    R7,R6               POINT TO FIELD                       00058000
         LA    R8,12               SET FIELD LENGTH LIMIT               00058100
A0650    EQU   *                                                        00058200
         MVC   0(1,R7),0(R4)       MOVE INPUT BYTE                      00058300
         LA    R4,1(0,R4)          BUMP TO NEXT INPUT BYTE              00058400
         LA    R7,1(0,R7)          BUMP TO NEXT FIELD BYTE              00058500
         BCT   R8,*+8              BR IF FIELD NOT FULL                 00058600
         B     A0660               BUMP TO NEXT FIELD IF THIS IS FULL   00058700
         BCT   R5,*+8              BR IF NOT END OF INPUT AREA          00058800
         B     A0670               RETURN IF END OF INPUT AREA          00058900
         CLI   0(R4),C' '          IS THIS A SPACE                      00059000
         BE    A0660               YES - BUMP TO NEXT FIELD             00059100
         CLI   0(R4),C','          IS THIS A COMMA                      00059200
         BE    A0660               YES - BUMP TO NEXT FIELD             00059300
         CLI   0(R4),C'='          IS THIS AN EQUAL SIGN                00059400
         BE    A0660               YES - BUMP TO NEXT FIELD             00059500
         CLI   0(R4),C'('          IS THIS A LEFT PAREN                 00059600
         BE    A0670               YES - RETURN                         00059700
         B     A0650               LOOP BACK                            00059800
A0660    EQU   *                                                        00059900
         SR    R7,R6               CALC LENGTH OF FIELD                 00060000
         BCTR  R7,0                CALC LENGTH - 1                      00060100
         STC   R7,11(0,R6)         SAVE LENGTH OF FIELD                 00060200
         LA    R4,1(0,R4)          BUMP TO NEXT INPUT BYTE              00060300
         LA    R6,12(0,R6)         POINT TO NEXT PARSE FIELD            00060400
         BCT   R5,A0630            BR IF NOT END OF INPUT AREA          00060500
A0670    EQU   *                                                        00060600
         STM   R4,R5,PARSREGS      SAVE ENDING PARSE REGISTERS          00060700
         L     R15,12(0,R15)       GET PROCESS ADDRESS                  00060800
         BR    R15                    AND GO THERE                      00060900
CLCCOMND CLC   CARDIN(0),1(R15)                                         00061000
INPCOMND DS    0F                                                       00061100
         AIF   ('&SYSPARM' EQ 'EXIT').XITINPC                           00061200
         DC    X'00',CL11'*          ',A(A2999)                         00061300
         DC    X'05',CL11'OUTPUT     ',A(A1100)                         00061400
         DC    X'05',CL11'SELECT     ',A(A1200)                         00061500
         DC    X'06',CL11'TPLIMIT    ',A(A1400)                         00061600
         DC    X'06',CL11'DSLIMIT    ',A(A1401)                         00061700
         DC    X'05',CL11'CUTOFF     ',A(A1402)                         00061800
         DC    X'04',CL11'START      ',A(A1500)                         00061900
         DC    X'06',CL11'DELIMIT    ',A(A1550)                         00062000
         DC    X'08',CL11'DIRECTORY  ',A(A1600)                         00062100
         DC    X'06',CL11'INSTALL    ',A(A1650)                         00062200
         DC    X'03',CL11'TYPE       ',A(A1650)                         00062300
         DC    X'0A',CL11'TYPEINSTALL',A(A1650)                         00062400
         DC    X'03',CL11'MODE       ',A(A1650)                         00062500
         DC    X'08',CL11'NOHEADING  ',A(A1700)                         00062600
         DC    X'07',CL11'USEREXIT   ',A(A1750)                         00062700
         DC    X'03',CL11'DUMP       ',A(A1820)                         00062800
         DC    X'04',CL11'PRINT      ',A(A1850)                         00062900
         DC    X'06',CL11'EXCLUDE    ',A(A1900)                         00063000
         DC    X'05',CL11'FILTER     ',A(A2000)                         00063100
         AIF   ('&OPSYS' EQ 'MVS').INPCEND                    2024183   00063110
         AIF   (NOT &LIBRM).INPCEND                                     00063200
         DC    X'05',CL11'ACCESS     ',A(A2100)                         00063300
         AGO   .INPCEND                                                 00063400
.XITINPC ANOP                                                           00063500
         DC    X'00',CL11'*          ',A(A2999)                         00063600
         DC    X'05',CL11'SELECT     ',A(A1200)                         00063700
         DC    X'04',CL11'START      ',A(A1500)                         00063800
         DC    X'06',CL11'DELIMIT    ',A(A1550)                         00063900
         DC    X'06',CL11'INSTALL    ',A(A1650)                         00064000
         DC    X'03',CL11'TYPE       ',A(A1650)                         00064100
         DC    X'0A',CL11'TYPEINSTALL',A(A1650)                         00064200
         DC    X'03',CL11'MODE       ',A(A1650)                         00064300
         DC    X'07',CL11'USEREXIT   ',A(A1750)                         00064400
         DC    X'03',CL11'DUMP       ',A(A1820)                         00064500
         DC    X'06',CL11'EXCLUDE    ',A(A1900)                         00064600
         DC    X'05',CL11'FILTER     ',A(A2000)                         00064700
.INPCEND ANOP                                                           00064800
         DC    X'FFFF'                                                  00064900
PARSREGS DC    D'0'                                                     00065000
FIELDS   DS    0CL240              PARSE WORK AREA                      00065100
FIELD1   DC    CL12' '                                                  00065200
FIELD2   DC    CL12' '                                                  00065300
FIELD3   DC    CL12' '                                                  00065400
FIELD4   DC    CL12' '                                                  00065500
FIELD5   DC    CL12' '                                                  00065600
FIELD6   DC    CL12' '                                                  00065700
FIELD7   DC    CL12' '                                                  00065800
FIELD8   DC    CL12' '                                                  00065900
FIELD9   DC    CL12' '                                                  00066000
FIELD10  DC    CL12' '                                                  00066100
FIELD11  DC    CL12' '                                                  00066200
FIELD12  DC    CL12' '                                                  00066300
FIELD13  DC    CL12' '                                                  00066400
FIELD14  DC    CL12' '                                                  00066500
FIELD15  DC    CL12' '                                                  00066600
FIELD16  DC    CL12' '                                                  00066700
FIELD17  DC    CL12' '                                                  00066800
FIELD18  DC    CL12' '                                                  00066900
FIELD19  DC    CL12' '                                                  00067000
FIELD20  DC    CL12' '                                                  00067100
         DS    0H                                                       00067200
         EJECT                                                          00067300
*********************************************************************** 00067400
*        ALLOCATE JCL, NAME, AND VER/REP TABLES                       * 00067500
*********************************************************************** 00067600
A0900    EQU   *                                                        00067700
         STM   R2,R6,A900SAVE      SAVE REGS 2 THRU 6                   00067800
         LR    R2,R1               GET SIZE OF STORAGE REGUESTED        00067900
         A     R2,=F'256'          ADD PADDING                          00068000
         SRL   R2,8                SHIFT OFF LAST BYTE                  00068100
         SLL   R2,8                SHIFT TO ZERO LAST BYTE              00068200
         AIF   ('&OPSYS' NE 'VSE').A0900A                               00068300
         GETVIS ADDRESS=(1),LENGTH=(2)    REQUEST STORAGE FOR TABLES    00068400
         AGO   .A0900B                                                  00068500
.A0900A  ANOP                                                           00068600
         GETMAIN R,LV=(2)          REQUEST STORAGE FOR TABLES           00068700
.A0900B  ANOP                                                           00068800
         LTR   R15,R15             WAS REQUEST SUCCESSFUL               00068900
         BNZ   A9160               NO - PUT OUT MSG AND CANCEL          00069000
         LR    R3,R2               GET TABLE AREA SIZE                  00069100
         LR    R2,R1               GET TABLE AREA ADDR                  00069200
         LA    R4,*                DUMMY ADDRESS FOR MOVE               00069300
         SR    R5,R5               PADDING CHAR AND ZERO FROM LNG       00069400
         MVCL  R2,R4               CLEAR TABLE AREA WITH X'00'          00069500
         LM    R2,R6,A900SAVE      RESTORE REGS 2 THRU 6                00069600
         BR    R6                  RETURN                               00069700
A900SAVE DC    5F'0'                                                    00069800
         EJECT                                                          00069900
         AIF   ('&SYSPARM' EQ 'EXIT').A1200                             00070000
*********************************************************************** 00070100
*        OUTPUT OPTION PROCESSING                                     * 00070200
*        OUTPUT XXXXX                                                 * 00070300
*********************************************************************** 00070400
A1100    EQU   *                                                        00070500
         CLI   DIRFLAG,C'1'        HAVE WE REQUESTED A DIRECTORY        00070600
         BE    A9120               YES - OUTPUT CARD INVALID            00070700
         LA    R15,OUTOPTDF        POINT TO DEFAULT TABLE ENTRY         00070800
         CLI   FIELD2,C' '         ANY OUTPUT OPTION DATA FIELD         00070900
         BE    A1115               NO OUTPUT DATA - TAKE DEFAULT        00071000
         LA    R15,OUTOPTN         POINT TO OUTPUT OPTION               00071100
         SR    R1,R1               CLEAR R1                             00071200
A1110    EQU   *                                                        00071300
         IC    R1,0(0,R15)         GET OPTION LENGTH                    00071400
         EX    R1,CLCOUTOP         CHECK OPTION                         00071500
         BE    A1115               GOT IT                               00071600
         LA    R15,16(0,R15)       BUMP TO NEXT TABLE ENTRY             00071700
         CLI   0(R15),X'FF'        END OF TABLE                         00071800
         BNE   A1110               NO                                   00071900
A1115    EQU   *                                                        00072000
         L     R14,12(0,R15)       GET BRANCH ADDR FROM TABLE           00072100
         BR    R14                    AND GO THERE                      00072200
CLCOUTOP CLC   FIELD2(0),1(R15)                                         00072300
         SPACE 1                                                        00072400
A1120    EQU   *                                                        00072500
         MVC   OUTDEV,7(R15)       INDICATE OUTPUT DEVICE               00072600
         MVC   OUTFILAD,8(R15)     SAVE OUTPUT FILE ADDR                00072700
         AIF   ('&OPSYS' EQ 'MVS').OUTOPNM                              00072800
         B     A2999               GET NEXT CARD                        00072900
*********************************************************************** 00073000
*        VSE PUNCH OUTPUT PROCESSING                                  * 00073100
*        OUTPUT PUNCH,SEGMENT=(---SEGMENT DATA---)                    * 00073200
*********************************************************************** 00073300
A1140    EQU   *                                                        00073400
         MVC   OUTDEV,7(R15)       INDICATE OUTPUT DEVICE               00073500
         MVC   OUTFILAD,8(R15)     SAVE OUTPUT FILE ADDR                00073600
         LM    R4,R5,PARSREGS      GET FINAL PARSE REGISTERS            00073700
         CLC   FIELD3(7),=CL7'SEGMENT' IS THIS A SEGMENT COMMAND        00073800
         BNE   A2999               NO - I DONT WANT IT                  00073900
         MVI   SEGFLAG,C'1'        SET SEGMENT WANTED FLAG              00074000
         CLI   0(R4),C'('          IS THIS A LEFT PAREN                 00074100
         BNE   *+8                 NO                                   00074200
         LA    R4,1(0,R4)          BUMP OVER LEFT PAREN                 00074300
         LA    R5,PWRPUN+9         POINT TO POWER PUNCH CARD            00074400
         LA    R6,50               LIMIT MOVE                           00074500
A1160    EQU   *                                                        00074600
         MVC   0(1,R5),0(R4)       MOVE SEGMENT DATA                    00074700
         LA    R4,1(0,R4)          BUMP TO NEXT POSITION                00074800
         LA    R5,1(0,R5)                                               00074900
         CLI   0(R4),C')'          IS THIS THE END                      00075000
         BE    A2999               YES                                  00075100
         CLI   0(R4),C' '          IS THIS THE END                      00075200
         BE    A2999               YES                                  00075300
         BCT   R6,A1160            LOOP BACK                            00075400
         B     A2999               GO GET NEXT CARD                     00075500
OUTOPTN  DS    0F                                                       00075600
         DC    X'04',CL6'PRINT ',C'L',A(PRTOUT),A(A1195)                00075700
         DC    X'02',CL6'PRT   ',C'L',A(PRTOUT),A(A1195)                00075800
         DC    X'03',CL6'LIST  ',C'L',A(PRTOUT),A(A1195)                00075900
         DC    X'04',CL6'PUNCH ',C'P',A(PCHOUT),A(A1140)                00076000
         DC    X'02',CL6'PCH   ',C'P',A(PCHOUT),A(A1140)                00076100
         DC    X'03',CL6'DISK  ',C'D',A(DISKOUT),A(A1120)               00076200
         DC    X'03',CL6'TAPE  ',C'T',A(TAPEOUT),A(A1190)               00076300
         AIF   ('&OPSYS' EQ 'MVS').XSUBLB1                    2024183   00076350
         AIF   (NOT &LIBRM).XSUBLB1                                     00076400
         DC    X'05',CL6'SUBLIB',C'S',A(LIBRDCB),A(A1180)               00076500
.XSUBLB1 ANOP                                                           00076600
OUTOPTDF DC    X'FF',CL6'      ',C' ',A(0),A(A9040)                     00076700
         DS    0H                                                       00076800
*********************************************************************** 00076900
*        SPECIAL PROCESSING FOR OUTPUT=SUBLIB                         * 00077000
*        CHECK FOR REPLACE OPTION                                     * 00077100
*********************************************************************** 00077200
A1180    EQU   *                                                        00077300
         CLC   FIELD3(8),=CL8'REPLACE=' IS THIS A REPLACE OPTION        00077400
         BNE   A1120                    NO - I DON'T KNOW THIS          00077500
         CLC   FIELD4(3),=CL3'YES'      IS THIS A REPLACE=YES           00077600
         BNE   A1120                    NO - REPLACE=NO IS DEFAULT      00077700
         MVI   REPOPTN,C'Y'             SET REPLACE OPTION              00077800
         B     A1120                    GET NEXT CARD                   00077900
*********************************************************************** 00078000
*        SPECIAL PROCESSING FOR TPLIMIT OPTION                        * 00078100
*        SET DEFAULT TPLIMIT IF NOT ALREADY ENTERED                   * 00078200
*********************************************************************** 00078300
A1190    EQU   *                                                        00078400
         CLI   TPLIMFLG,C'1'       HAS A TPLIMIT CARD BEEN ENTERED      00078500
         BE    A1120               YES - SKIP SETTING DEFAULT TPLIMIT   00078600
         ZAP   TPLIMIT,=P'30000'   SET DEFAULT TPLIMIT                  00078700
         B     A1120                                                    00078800
         AGO   .OUTOPNE                                                 00078900
.OUTOPNM ANOP                                                           00079000
         CLI   OUTDEV,C'S'         IS OUTPUT A PDS                      00079100
         BNE   A2999               NO - GET NEXT CARD                   00079200
         CLC   FIELD3(7),=CL7'REPLACE'  IS THIS A REPLACE OPTION        00079300
         BNE   A2999                    NO - I DON'T KNOW THIS          00079400
         CLC   FIELD4(3),=CL3'YES'      IS THIS A REPLACE=YES           00079500
         BNE   A2999                    NO - REPLACE=NO IS DEFAULT      00079600
         MVI   REPOPTN,C'Y'             SET REPLACE OPTION              00079700
         B     A2999                    GET NEXT CARD                   00079800
OUTOPTN  DS    0F                                                       00079900
         DC    X'04',CL6'PRINT ',C'L',A(PRTOUT),A(A1195)                00080000
         DC    X'02',CL6'PRT   ',C'L',A(PRTOUT),A(A1195)                00080100
         DC    X'03',CL6'LIST  ',C'L',A(PRTOUT),A(A1195)                00080200
         DC    X'02',CL6'PDS   ',C'S',A(PDSOUT),A(A1120)                00080300
         DC    X'03',CL6'TAPE  ',C'T',A(TAPEOUT),A(A1120)               00080400
OUTOPTDF DC    X'FF',CL6'      ',C'T',A(TAPEOUT),A(A1120)               00080500
         DS    0H                                                       00080600
.OUTOPNE ANOP                                                           00080700
*********************************************************************** 00080800
*        SPECIAL PROCESSING PRINT OPTION                              * 00080900
*        OUTPUT PRINT,NOCC                                            * 00081000
*********************************************************************** 00081100
A1195    EQU   *                                                        00081200
         CLC   FIELD3(4),=C'NOCC'  NO CARRIAGE CTL OPTION ENTERED       00081300
         BNE   A1120               NO                                   00081400
         MVI   NOCCOPT,C'1'        INDICATE NO CARRIAGE CTL OPTION      00081500
         B     A1120                                                    00081600
         EJECT                                                          00081700
.A1200   ANOP                                                           00081800
*********************************************************************** 00081900
*        SAVE SELECT CRITERIA                                         * 00082000
*********************************************************************** 00082100
A1200    EQU   *                                                        00082200
         CLI   FIELD2,C' '           ANY SELECT DATA                    00082300
         BE    A9050                 NO - ERROR                         00082400
         CLC   FIELD2(3),=C'ALL'     SELECT ALL                         00082500
         BE    A2999                 YES - DEFAULT - GO READ NEXT CARD  00082600
         CLI   FIELD3,C' '           ANY SELECT SECTIONS                00082700
         BE    A9050                 NO - ERROR                         00082800
         CLC   FIELD2(7),=C'SECTION' IS IT SECTION SELECT               00082900
         BE    A1230                 YES - SAVE SECTION ID              00083000
         CLC   FIELD2(4),=C'NAME'    IS IT NAME SELECT                  00083100
         BE    A1250                 YES - SAVE NAME IN SELECT TABLE    00083200
         CLC   FIELD2(6),=C'ACTION'  IS IT ACTION SELECT                00083300
         BE    A1260                 YES - SAVE ACTION CODE IN TABLE    00083400
         CLC   FIELD2(6),=C'PREFIX'  IS IT PREFIX SELECT                00083500
         BE    A1280                 YES - SAVE PREFIX                  00083600
         CLC   FIELD2(4),=C'LANG'    IS IT LANGUAGE SELECT              00083700
         BE    A1300                 YES - SAVE LANG CODE IN TABLE      00083800
         CLC   FIELD2(5),=C'TABLE'   IS IT TABLE SELECT                 00083900
         BE    A1350                 YES - LOAD SELECT TABLE            00084000
         B     A9050                 ERROR IN SELECT CARD               00084100
         SPACE 3                                                        00084200
*********************************************************************** 00084300
*        SAVE SELECT SECTION DATA                                     * 00084400
*        SELECT SECTION=XXX,XXX,XXX,.....                             * 00084500
*********************************************************************** 00084600
A1230    EQU   *                                                        00084700
         CLC   FIELD3(3),=C'ALL'   DID CARD SAY SECTION=ALL             00084800
         BE    A2999               YES - THIS IS THE DEFAULT            00084900
         MVI   SELTYPE,C'S'        INDICATE SECTION SELECT              00085000
         LA    R4,FIELD3           POINT TO FIRST SECTION FIELD         00085100
A1235    EQU   *                                                        00085200
         MVC   SELSECT,0(R4)       SAVE SECTION ID                      00085300
         ST    R4,SECCRDAD         SAVE SECTION CARD ADDR               00085400
         L     R4,SECTBLAD         GET SECTION TABLE ADDR               00085500
A1240    EQU   *                   VALIDATE SECTION ID                  00085600
         CLI   0(R4),X'FF'         END OF TABLE                         00085700
         BE    A9060               YES - INVALID SECTION ID             00085800
         CLC   SELSECT,0(R4)       IS THIS THE RIGHT SECTION            00085900
         BE    A1245               YES - SAVE SELECTED SECTION DATA     00086000
         LA    R4,SECTBLNG(0,R4)   BUMP TO NEXT TABLE ENTRY             00086100
         B     A1240               LOOP BACK                            00086200
A1245    EQU   *                                                        00086300
         SR    R14,R14             CLEAR REG 14                         00086400
         IC    R14,3(0,R4)         GET SECTION TABLE DISPLACEMENT       00086500
         LTR   R14,R14             IS THIS SECTION VALID FOR THIS TAPE  00086600
         BZ    A1246               NO                                   00086700
         LA    R15,WKHDAPSC(R14)   POINT TO WORK SECTION SELECT LIST    00086800
         MVI   0(R15),C'1'         SET SECTION SELECTED FLAG            00086900
A1246    EQU   *                                                        00087000
         L     R3,SECSELAD         GET SECTION SELECT TABLE POINTER     00087100
         CLI   0(R3),X'FF'         END OF TABLE                         00087200
         BE    A9180               YES - TOO MANY SECTIONS SELECTED     00087300
         MVC   0(4,R3),SELSECT     MOVE SECTION NAME INTO TABLE         00087400
         AP    SECTBLNO,=P'1'      ADD TO NO. OF SECTIONS SELECTED      00087500
         LA    R3,4(0,R3)          BUMP TO NEXT TABLE LOCATION          00087600
         ST    R3,SECSELAD         SAVE SECTION SELECT TABLE POINTER    00087700
         L     R4,SECCRDAD         GET PARSE FIELD POINTER              00087800
         LA    R4,12(0,R4)         BUMP TO NEXT PARSE FIELD             00087900
         CLI   0(R4),C' '          END OF SECTIONS                      00088000
         BE    A2999               YES - GO READ NEXT CARD              00088100
         B     A1235               GO SET UP NEXT SECTION               00088200
         SPACE 3                                                        00088300
*********************************************************************** 00088400
*        SAVE SELECT NAME DATA                                        * 00088500
*        SELECT NAME=XXXXXXXX,XXXXXXXX,.....                          * 00088600
*********************************************************************** 00088700
A1250    EQU   *                                                        00088800
         CLC   FIELD3(3),=C'ALL'   DID CARD SAY NAME=ALL                00088900
         BE    A2999               YES - THIS IS THE DEFAULT            00089000
         CLI   SELTYPE,C'T'        HAS TABLE BEEN SELECTED    2602137   00089010
         BE    A1290               YES, GO UPDATE TABLE       2602137   00089020
         NOP   A1252               DON'T ALLOCATE AFTER 1ST TIME        00089100
         OI    *-3,X'F0'                                                00089200
         L     R1,NAMTBLSZ         GET NAME SELECT TABLE SIZE           00089300
         LA    R1,8(0,R1)          ADD 8 FOR END-OF-TABLE FLAG          00089400
         BAL   R6,A0900            ALLOCATE STORAGE FOR TABLE           00089500
         ST    R1,NAMTBLAD         SAVE NAME SELECT TABLE ADDR          00089600
         ST    R1,NAMTBLOC         SAVE START ADDR IN POINTER ADDR      00089700
         A     R1,NAMTBLSZ         ADD SIZE OF NAME SELECT TABLE        00089800
         MVC   0(8,R1),HEXFF       FLAG END OF NAME SELECT TABLE        00089900
         MVC   NAMTBLLN,=F'8'      SET NAME TABLE ENTRY LENGTH2602137   00089910
         ZAP   NAMTBLNO,=P'0'      CLEAR NUMBER OF NAMES      2602137   00089920
A1252    EQU   *                                                        00090000
         LA    R4,FIELD3           POINT TO FIRST NAME FIELD            00090100
         L     R3,NAMTBLOC         GET NEXT TABLE ADDRESS               00090200
A1255    EQU   *                                                        00090300
         CLI   0(R3),X'FF'         END OF SELECT NAME TABLE             00090400
         BE    A9070               YES - TOO MANY NAMES SELECTED        00090500
         MVC   0(8,R3),0(R4)       SAVE SELECT NAME IN TABLE            00090600
         CLC   0(5,R4),=C'&&APPL'  IS NAME PRECEDED BY APPL KEYWORD     00090700
         BNE   A1257               NO - NAME IS OK                      00090800
         MVC   0(2,R3),CDHDAPPL    MOVE APPL CODE                       00090900
         MVC   2(6,R3),5(R4)       MOVE REST OF NAME                    00091000
A1257    EQU   *                                                        00091100
         MVI   SELTYPE,C'N'        SET SELECT TYPE                      00091200
         AP    NAMTBLNO,=P'1'      ADD 1 TO NO. OF NAMES TO SELECT      00091300
         LA    R3,8(0,R3)          BUMP TO NEXT TABLE LOCATION          00091400
         ST    R3,NAMTBLOC         SAVE ITS ADDRESS                     00091500
         LA    R4,12(0,R4)         BUMP TO NEXT PARSE FIELD             00091600
         CLI   0(R4),C' '          END OF SECTIONS                      00091700
         BE    A2999               YES - GO READ NEXT CARD              00091800
         B     A1255               GO SET UP NEXT SECTION               00091900
         EJECT                                                          00092000
*********************************************************************** 00092100
*        SAVE SELECT ACTION DATA                                      * 00092200
*        SELECT ACTION=X,X,.....                                        00092300
*********************************************************************** 00092400
A1260    EQU   *                                                        00092500
         CLC   FIELD3(3),=C'ALL'   DID CARD SAY ACTION=ALL              00092600
         BE    A1270               YES - ADD DELETE CODE TO ACTION TBL  00092700
         MVI   ACTFLG,C'1'         SET ACTION SELECT ENTERED FLAG       00092800
         LA    R4,FIELD3           POINT TO FIRST ACTION PARSE FIELD    00092900
         NOP   A1265               BR THIS AFTER FIRST TIME             00093000
         OI    *-3,X'F0'           CLEAR ACTION SELECT TABLE FIRST TIME 00093100
         XC    ACTTBL,ACTTBL       CLEAR ACTION SELECT TABLE            00093200
A1265    EQU   *                                                        00093300
         CLI   0(R4),C'A'          IS ACTION ENTERED LOWER THAN 'A'     00093400
         BL    A1267               YES - SKIP IT                        00093500
         CLI   0(R4),C'D'          IS ACTION ENTERED LOWER THAN 'D'     00093600
         BNH   A1266               YES - USE IT                         00093700
         CLI   0(R4),C'R'          IS ACTION ENTERED EQUAL 'R'          00093800
         BE    A1266               YES - USE IT                         00093900
         CLI   0(R4),C'S'          IS ACTION ENTERED EQUAL 'S' (STATIC) 00094000
         BNE   A1267               NO - SKIP IT                         00094100
A1266    EQU   *                                                        00094200
         SR    R5,R5               CLEAR R5                             00094300
         IC    R5,0(0,R4)          GET ACTION CODE                      00094400
         STC   R5,ACTTBL(R5)       PUT ACTION CODE IN TABLE             00094500
A1267    EQU   *                                                        00094600
         LA    R4,12(0,R4)         BUMP TO NEXT PARSE FIELD             00094700
         CLI   0(R4),C' '          END OF ACTIONS                       00094800
         BE    A2999               YES - GO READ NEXT CARD              00094900
         B     A1265                                                    00095000
A1270    EQU   *                                                        00095100
         MVI   ACTTBL+C'D',C'D'    SET DELETE CODE IN ACTION TABLE      00095200
         B     A2999               READ NEXT CARD                       00095300
         SPACE 3                                                        00095400
*********************************************************************** 00095500
*        SAVE PREFIX SELECT DATA                                      * 00095600
*        SELECT PREFIX=XX....                                         * 00095700
*********************************************************************** 00095800
A1280    EQU   *                                                        00095900
         CLI   FIELD3,C' '         ANY PREFIX ENTERED                   00096000
         BE    A9050               NO - ERROR                           00096100
         L     R3,SELPFXPT         POINT TO PREFIX TABLE                00096200
         LA    R4,FIELD3           POINT TO PARSE FIELDS                00096300
A1285    EQU   *                                                        00096400
         CLI   0(R3),X'FF'         END OF TABLE                         00096500
         BE    A9050               YES                                  00096600
         MVC   0(1,R3),11(R4)      MOVE PREFIX LENGTH TO TABLE          00096700
         MVC   1(7,R3),0(R4)       MOVE PREFIX VALUE TO TABLE           00096800
         LA    R3,8(0,R3)          BUMP TO NEXT PREFIX TABLE ENTRY      00096900
         LA    R4,12(0,R4)         BUMP TO NEXT INPUT FIELD             00097000
         CLI   0(R4),C' '          ANY DATA IN THIS FIELD               00097100
         BNE   A1285               YES                                  00097200
         ST    R3,SELPFXPT         SAVE PREFIX TABLE POINTER            00097300
         MVI   SELEXC,C'S'         FLAG AS SELECT             9914000   00097310
         B     A2999               READ NEXT CARD                       00097400
         SPACE 3                                              2602137   00097402
**************************************************************2602137** 00097404
*        UPDATE TABLE WITH SELECTED NAMES                     2602137 * 00097406
*        SELECT NAME=XXXXXXXX,XXXXXXXX,.....                  2602137 * 00097408
**************************************************************2602137** 00097410
A1290    EQU   *                                              2602137   00097412
         NOP   A1292               DON'T CLEAR AFTER 1ST TIME 2602137   00097414
         OI    *-3,X'F0'                                      2602137   00097416
         L     R3,NAMTBLAD         GET SELECT TABLE ADDR      2602137   00097418
A1291    EQU   *                                              2602137   00097420
         CLI   0(R3),X'FF'         END OF TABLE?              2602137   00097422
         BE    A1292               YES, GO CHECK NAME         2602137   00097424
         MVI   19(R3),X'00'        TURN OFF TABLE SELECT FLAG 2602137   00097426
         LA    R3,20(R3)           BUMP TO NEXT ENTRY         2602137   00097428
         B     A1291               LOOP THRU TABLE            2602137   00097430
A1292    EQU   *                                              2602137   00097432
         LA    R4,FIELD3           POINT TO FIRST NAME FIELD  2602137   00097434
A1293    EQU   *                                              2602137   00097436
         L     R3,NAMTBLAD         GET TABLE ADDRESS          2602137   00097438
A1295    EQU   *                                              2602137   00097440
         CLI   0(R3),X'FF'         END OF SELECT NAME TABLE   2602137   00097442
         BE    A9350               YES - NAME NOT IN TABLE    2602137   00097444
         CLC   0(8,R3),0(R4)       SELECT NAME IN TABLE       2602137   00097446
         BE    A1297               YES - GO FLAG AS SELECTED  2602137   00097448
         CLC   8(8,R3),0(R4)       SELECT NAME IN TABLE       2602137   00097450
         BE    A1297               YES - GO FLAG AS SELECTED  2602137   00097452
         LA    R3,20(R3)           MOVE APPL CODE             2602137   00097454
         B     A1295               LOOP THRU TABLE            2602137   00097456
A1297    EQU   *                                              2602137   00097458
         MVI   19(R3),X'01'        FLAG AS SELECTED           2602137   00097460
         LA    R4,12(0,R4)         BUMP TO NEXT PARSE FIELD   2602137   00097462
         CLI   0(R4),C' '          END OF SECTIONS            2602137   00097464
         BE    A2999               YES - GO READ NEXT CARD    2602137   00097466
         B     A1293               GO SET UP NEXT SECTION     2602137   00097468
         SPACE 3                                                        00097500
*********************************************************************** 00097600
*        SAVE SELECT LANGUAGE DATA                                    * 00097700
*        SELECT LANG=XXXXX,XXXXX,....                                 * 00097800
*********************************************************************** 00097900
A1300    EQU   *                                                        00098000
         CLC   FIELD3(3),=C'ALL'   DID CARD SAY LANG=ALL                00098100
         BE    A2999               YES - IS THE DEFAULT                 00098200
         LA    R4,FIELD3           POINT TO FIRST DATA FIELD            00098300
         L     R3,LNGTBLOC         GET NEXT TABLE ADDRESS               00098400
A1305    EQU   *                                                        00098500
         CLI   0(R3),X'FF'         END OF SELECT LANG TABLE             00098600
         BE    A9320               YES - TOO MANY LANGUAGES SELECTED    00098700
         MVC   0(5,R3),0(R4)       SAVE LANGUAGE IN TABLE               00098800
         LA    R3,5(0,R3)          BUMP TO NEXT TABLE LOCATION          00098900
         ST    R3,LNGTBLOC         SAVE ITS ADDRESS                     00099000
         LA    R4,12(0,R4)         BUMP TO NEXT PARSE FIELD             00099100
         CLI   0(R4),C' '          END OF LANGUAGES                     00099200
         BE    A2999               YES - GO READ NEXT CARD              00099300
         B     A1305               GO SET UP NEXT LANGUAGE              00099400
         SPACE 3                                                        00099500
*********************************************************************** 00099600
*        SAVE SELECT TABLE DATA                                       * 00099700
*        SELECT TABLE=XXXXXXXX                                        * 00099800
*********************************************************************** 00099900
A1350    EQU   *                                                        00100000
         CLI   FIELD3,C' '         ANY PREFIX ENTERED                   00100100
         BE    A9050               NO - ERROR                           00100200
         AIF   ('&OPSYS' EQ 'MVS').A1350M                               00100300
         LA    R1,FIELD3           POINT TO SELECT TABLE PHASE NAME     00100400
         CDLOAD (1)                LOAD SELECT TABLE                    00100500
         AGO   .A1350E                                                  00100600
.A1350M  ANOP                                                           00100700
         LA    R4,FIELD3           POINT TO SELECT TABLE MODULE NAME    00100800
         LOAD  EPLOC=(4)           LOAD SELECT TABLE                    00100900
.A1350E  ANOP                                                           00101000
         ST    R0,NAMTBLAD         SAVE ITS ADDRESS                     00101100
         MVC   NAMTBLLN,=F'20'     SET NAME TABLE ENTRY LENGTH          00101200
         MVI   SELTYPE,C'T'        SET SELECT TYPE TO TABLE             00101300
         LR    R4,R0               POINT TO SELECT TABLE                00101400
A1352    EQU   *                                                        00101500
         CLI   0(R4),X'FF'         END OF TABLE                         00101600
         BE    A1355               YES                                  00101700
         AP    NAMTBLNO,=P'1'      ADD 1 TO NO. OF NAMES TO SELECT      00101800
         MVI   19(R4),X'01'        FLAG AS SELECTED           2602137   00101810
         LA    R4,20(0,R4)         BUMP TO NEXT NAME                    00101900
         B     A1352               LOOP BACK                            00102000
A1355    EQU   *                                                        00102100
         ST    R4,NAMTBLOC         SAVE END OF TABLE ADDRESS            00102200
         B     A2999               READ NEXT CARD                       00102300
         EJECT                                                          00102400
         AIF   ('&SYSPARM' EQ 'EXIT').A1500                             00102500
*********************************************************************** 00102600
*        PROCESS TPLIMIT/DSLIMIT/CUTOFF CARD                          * 00102700
*        TPLIMIT NNNNN                                                * 00102800
*        DELIMIT NNNNN                                                * 00102900
*        CUTOFF  NNNNN                                                * 00103000
*********************************************************************** 00103100
A1400    EQU   *                                                        00103200
         AIF   ('&OPSYS' EQ 'VSE').A1400A                               00103300
         B     A2999               TPLIMIT CARD SKIPPED FOR MVS         00103400
         AGO   .A1401                                                   00103500
.A1400A  ANOP                                                           00103600
         LA    R15,TPLIMIT         SET TARGET FIELD ADDRESS             00103700
         B     A1410                                                    00103800
.A1401   ANOP                                                           00103900
A1401    EQU   *                   DSLIMIT ENTRY POINT                  00104000
         LA    R15,DSLIMIT         SET TARGET FIELD ADDRESS             00104100
         B     A1410                                                    00104200
A1402    EQU   *                   CUTOFF ENTRY POINT                   00104300
         LA    R15,DSCUTOFF        SET TARGET FIELD ADDRESS             00104400
A1410    EQU   *                                                        00104500
         CLI   FIELD2,C' '         ANY DATA                             00104600
         BE    A9100               NO - ERROR                           00104700
         SR    R5,R5               CLEAR R5                             00104800
         IC    R5,FIELD2+11        GET DATA LENGTH                      00104900
         EX    R5,MVZLMT           MOVE ZONES OF DATA                   00105000
         EX    R5,CLCLMT           SEE IF NUMERIC                       00105100
         BNE   A9100               ERROR - FIELD NOT NUMERIC            00105200
         EX    R5,PACKLMT          PACK TAPE LIMIT                      00105300
         AIF   ('&OPSYS' EQ 'MVS').A1400E                               00105400
         CLI   FIELD1,C'T'         IS IT A TPLIMIT CARD                 00105500
         BNE   A2999               NO - RETURN                          00105600
         MVI   TPLIMFLG,C'1'       SET TPLIMIT CARD ENTERED FLAG        00105700
.A1400E  ANOP                                                           00105800
         B     A2999               RETURN                               00105900
MVZLMT   MVZ   FLDWORK(0),FIELD2                                        00106000
CLCLMT   MVZ   FLDWORK(0),FIELD2                                        00106100
PACKLMT  PACK  0(4,R15),FIELD2                                          00106200
FLDWORK  DC    CL5'00000'                                               00106300
         DS    0H                                                       00106400
         EJECT                                                          00106500
.A1500   ANOP                                                           00106600
*********************************************************************** 00106700
*        PROCESS START CARD                                           * 00106800
*        START XXXXXXXX                                               * 00106900
*********************************************************************** 00107000
A1500    EQU   *                                                        00107100
         CLI   FIELD2,C' '         ANY START NAME DATA                  00107200
         BE    A2999               ERROR - NO START FIELD               00107300
         MVC   STRTNAME,FIELD2     MOVE START NAME                      00107400
         B     A2999               READ NEXT CARD                       00107500
         SPACE 3                                                        00107600
*********************************************************************** 00107700
*        PROCESS DELIMIT CARD                                         * 00107800
*        DELIMIT X                                                    * 00107900
*********************************************************************** 00108000
A1550    EQU   *                                                        00108100
         CLI   FIELD2,C' '         ANY DELIMIT FIELD                    00108200
         BE    A9090               NO - ERROR                           00108300
         NOP   A1555               DON'T CLEAR AFTER 1ST TIME           00108400
         OI    *-3,X'F0'                                                00108500
         XC    SCANTBL,SCANTBL     CLEAR SCAN DELIMITER TABLE           00108600
A1555    EQU   *                                                        00108700
         LA    R4,FIELD2           POINT TO FIRST PARSE DATA FIELD      00108800
A1560    EQU   *                                                        00108900
         SR    R5,R5               CLEAR R5                             00109000
         IC    R5,0(0,R4)          GET DELIMIT CHAR                     00109100
         STC   R5,SCANTBL(R5)      PUT DELIMITER IN TABLE               00109200
         LA    R4,12(0,R4)         BUMP TO NEXT PARSE FIELD             00109300
         CLI   0(R4),C' '          END OF DELIMITERS                    00109400
         BNE   A1560               NO - PUT NEXT CHAR IN TABLE          00109500
         B     A2999                                                    00109600
         EJECT                                                          00109700
         AIF   ('&SYSPARM' EQ 'EXIT').A1650                             00109800
*********************************************************************** 00109900
*        PROCESS DIRECTORY CARD                                       * 00110000
*        DIRECTORY                                                    * 00110100
*********************************************************************** 00110200
A1600    EQU   *                                                        00110300
         MVI   DIRFLAG,C'1'        INDICATE DIRECTORY PRINT             00110400
         MVC   OUTFILAD,PRTOUTAD   SAVE PRINT DTF/DCB ADDR              00110500
         MVI   OUTDEV,C'L'         INDICATE PRINT OUTPUT                00110600
         CLI   TYPEINST,C'U'       IS THIS AN UPDATE INSTALL            00110700
         BNE   A2999               NO - GET NEXT CARD                   00110800
         CLI   ACTFLG,C'1'         WAS SELECT ACTION CARD ENTERED       00110900
         BE    A2999               YES - GET NEXT CARD                  00111000
         MVI   ACTTBL+C'D',C'D'    VALIDATE DELETE ACTION CODE          00111100
         B     A2999               GO GET NEXT CARD                     00111200
         EJECT                                                          00111300
.A1650   ANOP                                                           00111400
*********************************************************************** 00111500
*        PROCESS TYPEINSTALL CARD                                     * 00111600
*        TYPEINSTALL=XXXXXXX                                          * 00111700
*        TYPE=XXXXXXX                                                 * 00111800
*        INSTALL=XXXXXXXX                                             * 00111900
*********************************************************************** 00112000
A1650    EQU   *                                                        00112100
         CLI   FIELD2,C' '         ANY TYPEINSTALL OPTION               00112200
         BE    A9190               ERROR - NO TYPEINSTALL FIELD         00112300
         CLI   FIELD2,C'?'         LOOK AT EVERYTHING ON TAPE           00112400
         BE    A1675               YES                                  00112500
         CLI   FIELD2,C'S'                                              00112600
         BE    A1675                                                    00112700
         CLI   FIELD2,C'R'         IS THIS A RELEASE TYPE INSTALL       00112800
         BNE   A1655               YES                                  00112900
         MVI   FIELD2,C'I'         MAKE IT LOOK LIKE AN INSTALL         00113000
A1655    EQU   *                                                        00113100
         CLI   FIELD2,C'I'         IS THIS AN INSTALL TYPE INSTALL      00113200
         BE    A1680               YES                                  00113300
         CLI   FIELD2,C'U'         IS THIS AN UPDATE TYPE INSTALL       00113400
         BNE   A9190               NO - ERROR                           00113500
         MVI   ACTTBL+C'S',X'00'   INVALIDATE STATIC ACTION CODE        00113600
         AIF   ('&SYSPARM' EQ 'EXIT').A1675                             00113700
         CLI   FIELD2,C'U'         IS IT AN UPDATE TYPE INSTALL         00113800
         BNE   A1673               NO                                   00113900
         CLI   DIRHD2RT,C'R'       DO WE STILL HAVE A HEADING           00114000
         BNE   A1673               NO - DONT CHANGE IT                  00114100
         MVC   DIRHD2RT(7),=CL7' UPDATE'  FIX HEADING FOR UPDATE        00114200
A1673    EQU   *                                                        00114300
         CLI   DIRFLAG,C'1'        ARE WE PRINTING A DIRECTORY          00114400
         BNE   A1680               NO                                   00114500
         AGO   .A1675A                                                  00114600
.A1675   ANOP                                                           00114700
         B     A1680                                                    00114800
.A1675A  ANOP                                                           00114900
A1675    EQU   *                                                        00115000
         MVI   ACTTBL+C'D',C'D'    VALIDATE DELETE ACTION CODE          00115100
A1680    EQU   *                                                        00115200
         MVC   TYPEINST,FIELD2     MOVE TYPEINSTALL PARAMETER           00115300
         B     A2999                                                    00115400
         EJECT                                                          00115500
         AIF   ('&SYSPARM' EQ 'EXIT').A1750                             00115600
*********************************************************************** 00115700
*        PROCESS NOHEADING CARD                                       * 00115800
*        NOHEADING                                                    * 00115900
*********************************************************************** 00116000
A1700    EQU   *                                                        00116100
         MVI   NOHDGFLG,C'1'       SET NO-HEADING FLAG                  00116200
         B     A2999               GO GET NEXT CARD                     00116300
         SPACE 3                                                        00116400
.A1750   ANOP                                                           00116500
*********************************************************************** 00116600
*        PROCESS USEREXIT CARD                                        * 00116700
*        USEREXIT XXXXXXXX                                            * 00116800
*********************************************************************** 00116900
A1750    EQU   *                                                        00117000
         CLI   FIELD2,C' '         ANY EXIT NAME                        00117100
         BE    A2999               RETURN IF NO NAME                    00117200
         AIF   ('&OPSYS' EQ 'MVS').A1760                                00117300
         LA    R1,FIELD2           POINT TO EXIT PHASE NAME             00117400
         CDLOAD (1),RETPNF=YES     LOAD USER EXIT                       00117500
         LTR   R15,R15             WAS CDLOAD SUCCESSFUL                00117600
         BNZ   A9250               NO - PUT OUT MSG AND CANCEL          00117700
         ST    R1,DXITADDR         SAVE EXIT ENTRY ADDRESS              00117800
         AGO   .A1750E                                                  00117900
.A1760   ANOP                                                           00118000
         LA    R4,FIELD2           POINT TO EXIT NAME                   00118100
         LOAD  EPLOC=(4)           LOAD USER EXIT                       00118200
         ST    R0,DXITADDR         SAVE EXIT ENTRY ADDRESS              00118300
.A1750E  ANOP                                                           00118400
         B     A2999                                                    00118500
         SPACE 3                                                        00118600
*********************************************************************** 00118700
*        PROCESS DUMP CARD                                            * 00118800
*        DUMP                                                         * 00118900
*********************************************************************** 00119000
A1820    EQU   *                                                        00119100
         MVI   DUMPFLAG,C'1'       SET DUMP FLAG                        00119200
         B     A2999               READ NEXT CARD                       00119300
         SPACE 3                                                        00119400
         AIF   ('&SYSPARM' EQ 'EXIT').A1900                             00119500
*********************************************************************** 00119600
*        PROCESS PRINT CARD                                           * 00119700
*        PRINT XXXXXXXX                                               * 00119800
*********************************************************************** 00119900
A1850    EQU   *                                                        00120000
         L     R1,PRTOUTAD         GET PRINT FILE ADDRESS               00120100
         ST    R1,OUTFILAD         SAVE OUTPUT ADDR                     00120200
         MVI   OUTDEV,C'L'         INDICATE OUTPUT DEVICE PRINT         00120300
         MVI   SELTYPE,C'N'        SET SELECT TYPE TO NAME              00120400
         MVC   FIELD3,FIELD2       MOVE NAME FOR NAME SELECT PROCESSING 00120500
         B     A1250               PUT NAME IN NAME SELECT TABLE        00120600
.A1900   ANOP                                                           00120700
         EJECT                                                          00120800
*********************************************************************** 00120900
*        PROCESS EXCLUDE CARDS                                        * 00121000
*********************************************************************** 00121100
A1900    EQU   *                                                        00121200
         CLI   FIELD2,C' '           ANY EXCLUDE PARAMETER              00121300
         BE    A9270                 BR IF NO EXCLUDE PARAMETER         00121400
         CLI   FIELD3,C' '           ANY EXCLUDE SECTION PARAMETER      00121500
         BE    A9270                 BR IF NO EXCLUDE PARAMETER         00121600
         CLC   FIELD2(7),=C'SECTION' IS IT SECTION EXCLUDE              00121700
         BE    A1930                 YES - SAVE SECTION ID              00121800
         CLC   FIELD2(4),=C'NAME'    IS IT NAME EXCLUDE                 00121900
         BE    A1950                 YES - SAVE NAME IN EXCLUDE TABLE   00122000
         CLC   FIELD2(6),=C'PREFIX'  IS IT PREFIX EXCLUDE     9914000   00122010
         BE    A1980                 YES - TABLE PREFIXES     9914000   00122020
         B     A9270                 ERROR IN EXCLUDE CARD              00122100
         SPACE 3                                                        00122200
*********************************************************************** 00122300
*        PROCESS EXCLUDE SECTION CARDS                                * 00122400
*        EXCLUDE SECTION=XXX,XXX,XXX,.....                            * 00122500
*********************************************************************** 00122600
A1930    EQU   *                                                        00122700
         LA    R4,FIELD3           POINT TO FIRST SECTION FIELD         00122800
A1935    EQU   *                                                        00122900
         MVC   SELSECT,0(R4)       SAVE SECTION ID                      00123000
         ST    R4,SECCRDAD         SAVE SECTION CARD ADDR               00123100
         L     R4,SECTBLAD         GET SECTION TABLE ADDR               00123200
A1940    EQU   *                   VALIDATE SECTION ID                  00123300
         CLI   0(R4),X'FF'         END OF TABLE                         00123400
         BE    A9280               YES - INVALID SECTION ID             00123500
         CLC   SELSECT,0(R4)       IS THIS THE RIGHT SECTION            00123600
         BE    A1945               YES - SAVE SELECTED SECTION DATA     00123700
         LA    R4,SECTBLNG(0,R4)   BUMP TO NEXT TABLE ENTRY             00123800
         B     A1940               LOOP BACK                            00123900
A1945    EQU   *                                                        00124000
         SR    R14,R14             CLEAR REG 14                         00124100
         IC    R14,3(0,R4)         GET SECTION TABLE DISPLACEMENT       00124200
         LTR   R14,R14             IS THIS SECTION VALID FOR THIS TAPE  00124300
         BZ    A1946               NO                                   00124400
         LA    R15,WKHDAPSC(R14)   POINT TO WORK SECTION SELECT LIST    00124500
         MVI   0(R15),X'00'        RESET SECTION SELECTED FLAG          00124600
A1946    EQU   *                                                        00124700
         L     R3,SECEXCAD         GET SECTION EXCLUDE TABLE POINTER    00124800
         CLI   0(R3),X'FF'         END OF TABLE                         00124900
         BE    A9300               YES - TOO MANY SECTIONS EXCLUDED     00125000
         MVC   0(4,R3),SELSECT     MOVE SECTION NAME INTO TABLE         00125100
         AP    SECEXCNO,=P'1'      ADD TO NO. OF SECTIONS EXCLUDED      00125200
         LA    R3,4(0,R3)          BUMP TO NEXT TABLE LOCATION          00125300
         ST    R3,SECEXCAD         SAVE SECTION EXCLUDE TABLE POINTER   00125400
         L     R4,SECCRDAD         GET SECTION= CARD POINTER            00125500
         LA    R4,12(0,R4)         BUMP TO NEXT PARSE FIELD             00125600
         CLI   0(R4),C' '          END OF SECTIONS                      00125700
         BE    A2999               YES - GO READ NEXT CARD              00125800
         B     A1935               GO SET UP NEXT SECTION               00125900
         SPACE 3                                                        00126000
*********************************************************************** 00126100
*        PROCESS EXCLUDE NAME CARDS                                   * 00126200
*        EXCLUDE NAME=XXXXXXXX,XXXXXXXX,.....                         * 00126300
*********************************************************************** 00126400
A1950    EQU   *                                                        00126500
         NOP   A1955               DON'T ALLOCATE AFTER 1ST TIME        00126600
         OI    *-3,X'F0'                                                00126700
         L     R1,NAMEXCSZ         GET NAME EXCLUDE TABLE SIZE          00126800
         LA    R1,8(0,R1)          ADD 8 FOR END-OF-TABLE FLAG          00126900
         BAL   R6,A0900            ALLOCATE STORAGE FOR TABLE           00127000
         ST    R1,NAMEXCAD         SAVE NAME EXCLUDE TABLE ADDR         00127100
         ST    R1,NAMEXLOC         SAVE START ADDR IN POINTER ADDR      00127200
         A     R1,NAMEXCSZ         ADD SIZE OF NAME EXCLUDE TABLE       00127300
         MVC   0(8,R1),HEXFF       FLAG END OF NAME EXCLUDE TABLE       00127400
A1955    EQU   *                                                        00127500
         LA    R4,FIELD3           POINT TO FIRST NAME FIELD            00127600
         L     R3,NAMEXLOC         GET NEXT TABLE ADDRESS               00127700
A1960    EQU   *                                                        00127800
         CLI   0(R3),X'FF'         END OF SELECT NAME TABLE             00127900
         BE    A9290               YES - TOO MANY NAMES EXCLUDED        00128000
         MVC   0(8,R3),0(R4)       SAVE SELECT NAME IN TABLE            00128100
         CLC   5(5,R4),=C'&&APPL'  IS NAME PRECEDED BY APPL KEYWORD     00128200
         BNE   A1965               NO - NAME IS OK                      00128300
         MVC   0(2,R3),CDHDAPPL    MOVE APPL CODE                       00128400
         MVC   2(6,R3),5(R4)       MOVE REST OF NAME                    00128500
A1965    EQU   *                                                        00128600
         AP    NAMEXCNO,=P'1'      ADD 1 TO NO. OF NAMES TO EXCLUDE     00128700
         LA    R3,8(0,R3)          BUMP TO NEXT TABLE LOCATION          00128800
         ST    R3,NAMEXLOC                                              00128900
         LA    R4,12(0,R4)         BUMP TO NEXT PARSE FIELD             00129000
         CLI   0(R4),C' '          END OF SECTIONS                      00129100
         BE    A2999               YES - GO READ NEXT CARD              00129200
         B     A1960               GO SET UP NEXT SECTION               00129300
         SPACE 3                                              9914000   00129305
**************************************************************9914000** 00129310
*        SAVE PREFIX EXCLUDE DATA                             9914000 * 00129315
*        EXCLUDE PREFIX=XX....                                9914000 * 00129320
**************************************************************9914000** 00129325
A1980    EQU   *                                              9914000   00129330
         CLI   FIELD3,C' '         ANY PREFIX ENTERED         9914000   00129335
         BE    A9050               NO - ERROR                 9914000   00129340
         L     R3,SELPFXPT         POINT TO PREFIX TABLE      9914000   00129345
         LA    R4,FIELD3           POINT TO PARSE FIELDS      9914000   00129350
A1985    EQU   *                                              9914000   00129355
         CLI   0(R3),X'FF'         END OF TABLE               9914000   00129360
         BE    A9050               YES                        9914000   00129365
         MVC   0(1,R3),11(R4)      PREFIX LENGTH TO TABLE     9914000   00129370
         MVC   1(7,R3),0(R4)       PREFIX VALUE TO TABLE      9914000   00129375
         LA    R3,8(0,R3)          BUMP TO NEXT TABLE ENTRY   9914000   00129380
         LA    R4,12(0,R4)         BUMP TO NEXT INPUT FIELD   9914000   00129385
         CLI   0(R4),C' '          ANY DATA IN THIS FIELD     9914000   00129390
         BNE   A1985               YES                        9914000   00129395
         ST    R3,SELPFXPT         SAVE PREFIX TABLE POINTER  9914000   00129400
         MVI   SELEXC,C'E'         FLAG AS EXCLUDE            9914000   00129405
         B     A2999               READ NEXT CARD             9914000   00129410
         SPACE 3                                              9914000   00129415
*********************************************************************** 00129500
*        PROCESS COBOL 2 PROCESS OPTION                               * 00129600
*********************************************************************** 00129700
A2000    EQU   *                                                        00129800
         CLC   FIELD2(2),=CL2'NO'  IS FILTER TURNED OFF       2024183   00129900
         BE    A2999               YES                        2024183   00130000
         CLC   FIELD2(5),=CL5'COBII'  IS FILTER FOR COBOL/II            00130600
         BNE   A9360               NO                                   00130700
         MVI   COB2PROC,C'2'       SET FILTER TO COBOL/II               00130800
         B     A2999                                                    00130900
         AIF   ('&SYSPARM' EQ 'EXIT').A2999                             00131000
         AIF   ('&OPSYS' EQ 'MVS').A2999                      2024183   00131050
         AIF   (NOT &LIBRM).A2999                                       00131100
         SPACE 3                                                        00131200
*********************************************************************** 00131300
*        PROCESS ACCESS CARDS                                         * 00131400
*        ACCESS=LIB.SUBLIB                                            * 00131500
*********************************************************************** 00131600
A2100    EQU   *                                                        00131700
         MVC   LIBNAME,FIELD2      MOVE LIBRARY NAME                    00131800
         MVC   SUBLIBNM,FIELD3     MOVE SUBLIBRARY NAME                 00131900
         CLI   LIBNAME,C' '        ANY LIB NAME                         00132000
         BE    A9330               ERROR - NO LIBRARY NAME              00132100
         CLI   SUBLIBNM,C' '       ANY SUBLIB NAME                      00132200
         BE    A9330               ERROR - NO SUBLIBRARY NAME           00132300
         B     A2999                                                    00132400
.A2999   ANOP                                                           00132500
         AIF   ('&SYSPARM' NE 'EXIT').A2999E                            00132600
         AIF   (NOT &PAN).A2999D                                        00132700
         SPACE 3                                                        00132800
*********************************************************************** 00132900
*        EXIT TO PANVALET AND SKIP INPUT CARD                         * 00133000
*********************************************************************** 00133100
A2999    EQU   *                                                        00133200
         L     R1,EXTIOCD          GET PANVALET IOCODES ADDR            00133300
         USING PANCODES,R1                                    9913801   00133310
         MVI   PANIO1,C'B'         INDICATE SKIP INPUT RECORD           00133400
         B     EXIT                                                     00133500
         DROP  R1                                             9913801   00133510
         AGO   .A3000                                                   00133600
.A2999D  ANOP                                                           00133700
         AIF   (NOT &LIB).A2999E                                        00133800
         SPACE 3                                                        00133900
*********************************************************************** 00134000
*        EXIT TO LIBRARIAN AND SKIP INPUT CARD                        * 00134100
*********************************************************************** 00134200
A2999    EQU   *                                                        00134300
         B     LIBSKIP             SKIP INPUT RECORD AND EXIT           00134400
         AGO   .A3000                                                   00134500
.A2999E  ANOP                                                           00134600
         SPACE 3                                                        00134700
*********************************************************************** 00134800
*        RETURN TO READ NEXT CARD                                     * 00134900
*********************************************************************** 00135000
A2999    EQU   *                                                        00135100
         B     A0200               READ NEXT CARD                       00135200
.A3000   ANOP                                                           00135300
         EJECT                                                          00135400
*********************************************************************** 00135500
*        END OF CARD INPUT - FINAL SETUP FOR PROCESSING               * 00135600
*********************************************************************** 00135700
A3000    EQU   *                                                        00135800
         AIF   ('&OPSYS' NE 'VSE').NOREP1                               00135900
         AIF   ('&SYSPARM' EQ 'EXIT').NOREP1                            00136000
         CLI   REPROFLG,C'1'       ARE WE DOING REPRO PROCESSING        00136100
         BE    R0110               YES - GO FINISH REPRO PROCESSING     00136200
.NOREP1  ANOP                                                           00136300
         CLI   CNCLFLAG,C'1'       DID WE GET A DELAYED CANCEL          00136400
         BE    Z9530               YES - GO TO CANCEL ROUTINE           00136500
         MVC   CARDIN,CARDSAVE     RESTORE SECTION HEADER               00136600
         MVI   CNCLFLAG,C'9'       FORCE A CANCEL ON ANY OTHER ERROR    00136700
         ZAP   NAMSELNO,NAMTBLNO   SAVE NO. NAMES SELECTED              00136800
         MVC   CARDWORK,SPACES     CLEAR CARDWORK                       00136900
         MVC   SVDSNHD,SPACES      CLEAR DATA SET HEADER 1 AREA         00137000
         AIF   ('&SYSPARM' EQ 'EXIT').A3001                             00137100
         ZAP   LINECTR,=P'999'     FORCE HEADINGS                       00137200
         CLI   CARDFLAG,C'0'       ANY CARDS READ                       00137300
         BNE   A3001               YES - DON'T DEFAULT TO DIRECTORY     00137400
         MVI   DIRFLAG,C'1'        INDICATE DIRECTORY PRINT             00137500
         MVC   OUTFILAD,PRTOUTAD   SAVE PRINT DTF/DCB ADDR              00137600
         MVI   OUTDEV,C'L'         INDICATE PRINT OUTPUT                00137700
A3001    EQU   *                                                        00137800
         CLI   DIRFLAG,C'1'        ARE WE PRINTING A DIRECTORY          00137900
         BE    B0030               YES - DON'T USE ANY TABLES           00138000
.A3001   ANOP                                                           00138100
         L     R2,JCLTBLAD         GET JCL TABLE ADDRESS                00138200
         CLI   0(R2),X'FF'         WERE ANY TABLES ALLOCATED            00138300
         BE    B0010               NO                                   00138400
         L     R2,JCLTBLOC         GET END OF JCL TABLE LOCATION        00138500
         MVI   0(R2),X'FF'         SET END OF TABLE FLAG                00138600
         L     R2,NAMTBLOC         GET END OF NAME TABLE LOCATION       00138700
         MVI   0(R2),X'FF'         SET END OF TABLE FLAG                00138800
         L     R3,NAMEXLOC         GET END OF NAME EXCLUDE LOCATION     00138900
         MVI   0(R2),X'FF'         SET END OF TABLE FLAG                00139000
         L     R2,SECSELAD         GET END OF SECTION SELECT TABLE      00139100
         MVI   0(R2),X'FF'         SET END OF TABLE FLAG                00139200
         L     R2,SECEXCAD         GET END OF SECTION EXCLUDE TABLE     00139300
         MVI   0(R2),X'FF'         SET END OF TABLE FLAG                00139400
         L     R2,JCLTBLAD         GET JCL TABLE ADDRESS                00139500
         CLI   0(R2),X'FF'         ANY ENTRIES IN TABLE                 00139600
         BE    B0010               NO                                   00139700
         EJECT                                                          00139800
*********************************************************************** 00139900
*        SORT JCL TABLE INTO SH, DH, VR, DT, ST SEQUENCE              * 00140000
*********************************************************************** 00140100
A3010    EQU   *                                                        00140200
         LA    R1,NOJCLENT         SET NO. OF ENTRIES TO SORT           00140300
         L     R2,JCLTBLAD         POINT TO 1ST JCL TABLE ENTRY         00140400
         LA    R3,80(0,R2)         POINT TO 2ND JCL TABLE ENTRY         00140500
         SR    R4,R4               CLEAR R4 FOR SORT FLAG               00140600
A3020    EQU   *                                                        00140700
         CLI   0(R3),X'FF'         END OF TABLE                         00140800
         BE    A3040               YES                                  00140900
         CLC   5(2,R2),5(R3)       FIRST FIELD LOWER THAN NEXT          00141000
         BNH   A3030               YES - DONT SWITCH ENTRIES            00141100
         MVC   CARDSAVE,0(R2)      SWITCH ENTRIES                       00141200
         MVC   0(80,R2),0(R3)                                           00141300
         MVC   0(80,R3),CARDSAVE                                        00141400
         LA    R4,1                SET FLAG FOR ENTRIES SWITCHED        00141500
A3030    EQU   *                                                        00141600
         LA    R2,80(0,R2)         BUMP TO NEXT ENTRIES                 00141700
         LA    R3,80(0,R3)                                              00141800
         BCT   R1,A3020            LOOP BACK                            00141900
A3040    EQU   *                                                        00142000
         LTR   R4,R4               ANY ENTRIES SWITCHED                 00142100
         BNZ   A3010               YES - DO IT AGAIN                    00142200
         EJECT                                                          00142300
*********************************************************************** 00142400
*        SCAN JCL TABLE AND FILL IN BEGINNING AND ENDING ADDRESSES    * 00142500
*********************************************************************** 00142600
A3500    EQU   *                                                        00142700
         L     R2,JCLTBLAD         GET ADDR OF JCL TABLE                00142800
A3510    EQU   *                                                        00142900
         CLC   WRKSEC,0(R2)        SAME SECTION ID AND JCL TYPE         00143000
         BE    A3540               YES                                  00143100
         CLC   WRKSEC(3),=C'ALL'   WAS PREVIOUS SECTION = ALL           00143200
         BNE   A3535               NO                                   00143300
         L     R14,SECTBLAD        GET ADDR OF 1ST SECTION TABLE ENTRY  00143400
         LA    R1,SECTBLNG(0,R14)  GET ADDR OF 2ND SECTION TABLE ENTRY  00143500
A3520    EQU   *                                                        00143600
         MVC   4(20,R1),4(R14)     MOVE 'ALL' ADDRESSES TO EACH         00143700
         LA    R1,SECTBLNG(R1)          SECTION ENTRY FOR DEFAULT       00143800
         CLC   0(3,R1),=C'BEG'     STOP AT 'BEG' SECTION                00143900
         BNE   A3520                                                    00144000
A3535    EQU   *                                                        00144100
         MVC   WRKSEC,0(R2)        SAVE SECTION NAME                    00144200
         MVC   WORKID,5(R2)        SAVE ID                              00144300
         SR    R1,R1                                                    00144400
         IC    R1,WORKID           GET WORK SECTION ID                  00144500
         MH    R1,SECTBLN          MULTIPLY BY TBL LENGTH               00144600
         SR    R15,R15                                                  00144700
         IC    R15,WORKID+1        GET SUB ID                           00144800
         SLL   R15,2               MULTIPLY BY 4                        00144900
         AR    R1,R15              ADD TO GET TABLE DISPLACEMENT        00145000
         L     R14,SECTBLAD        GET ADDR SECTION TABLE               00145100
         LA    R1,0(R1,R14)        CALC ADDR IN TABLE                   00145200
         ST    R2,0(0,R1)          SAVE JCL STARTING ADDR               00145300
A3540    EQU   *                                                        00145400
         LA    R2,80(0,R2)         BUMP TO NEXT JCL CARD                00145500
         CLI   0(R2),X'FF'         END OF JCL TABLE                     00145600
         BNE   A3510               NO                                   00145700
         CLC   WRKSEC(3),=C'ALL'   WAS PREVIOUS SECTION = ALL           00145800
         BNE   A3550               NO                                   00145900
         L     R14,SECTBLAD        GET ADDR OF 1ST SECTION TABLE ENTRY  00146000
         LA    R1,SECTBLNG(0,R14)  GET ADDR OF 2ND SECTION TABLE ENTRY  00146100
A3545    EQU   *                                                        00146200
         MVC   4(20,R1),4(R14)     MOVE "ALL" ADDRESSES TO EACH         00146300
         LA    R1,SECTBLNG(R1)          SECTION ENTRY FOR DEFAULT       00146400
         CLC   0(3,R1),=C'BEG'     STOP AT 'BEG' SECTION                00146500
         BNE   A3545                                                    00146600
A3550    EQU   *                                                        00146700
         L     R4,SECTBLAD         GET ADDR SECTION TABLE               00146800
A3560    EQU   *                                                        00146900
         CLI   0(R4),X'FF'         END OF SECTION TABLE                 00147000
         BE    B0010               YES - START PROCESSING TAPE          00147100
         MVC   WKSECTBL,0(R4)      SAVE SECTION INFO                    00147200
         OC    WKSCVRAD,WKSCVRAD   ANY VERIFY/REPLACE DATA              00147300
         BZ    A3570               NO - BUMP TO NEXT SECTION            00147400
         CLC   WKSCID,=C'ALL'      IS THIS THE 'ALL' SECTION            00147500
         BNE   A3565               NO                                   00147600
         MVC   SVALVRAD,WKSCVRAD   SAVE ALL VR JCL POINTER              00147700
         B     A3600                                                    00147800
A3565    EQU   *                                                        00147900
         L     R14,SECTBLAD        GET ADDR SECTION TABLE               00148000
         CLC   WKSCVRAD,SVALVRAD   SAME ADDR AS 'ALL' VER/REP ENTRY     00148100
         BNE   A3600               NO - GO SET UP VER/REP TABLE         00148200
         MVC   12(4,R4),12(R14)    MOVE VR POINTER TO THIS SECTION      00148300
A3570    EQU   *                                                        00148400
         LA    R4,SECTBLNG(0,R4)   BUMP TO NEXT SECTION TABLE ENTRY     00148500
         B     A3560                                                    00148600
A3600    EQU   *                                                        00148700
         MVI   VRFLAG,C'1'         INDICATE VER/REP DATA ENTERED        00148800
         L     R5,WKSCVRAD         POINT TO FIRST V/R CARD IN SECTION   00148900
         L     R6,VRTBLOC          POINT TO NEXT V/R TABLE SLOT         00149000
         CLI   0(R6),X'FF'         END OF TABLE                         00149100
         BE    A9130               YES - PUT OUT ERROR MSG              00149200
         ST    R6,WKSCVRAD         CHANGE V/R POINTER IN WORK TABLE     00149300
         ST    R6,12(0,R4)         CHANGE V/R POINTER IN JCL TABLE      00149400
A3610    EQU   *                                                        00149500
         LA    R7,VRTBLNG(0,R6)    UPDATE V/R SLOT POINTER              00149600
         ST    R7,VRTBLOC               AND SAVE IT                     00149700
A3620    EQU   *                                                        00149800
         MVC   0(3,R6),0(R5)       SAVE SECTION ID IN V/R TABLE         00149900
         LA    R7,9(0,R5)          START SCAN IN COL. 10 OF JCL CARD    00150000
         MVI   3(R6),X'09'         PRESET LENGTH FIELD TO 9             00150100
         LA    R8,72(0,R5)         SET SCAN END ADDR                    00150200
A3630    EQU   *                                                        00150300
         CLC   0(4,R7),=C'VER='    LOOK FOR VERIFY DATA                 00150400
         BE    A3650               GOT IT                               00150500
         CLC   0(4,R7),=C'REP='    LOOK FOR REPLACE DATA                00150600
         BE    A3660               GOT IT                               00150700
         CLC   0(4,R7),=C'LNG='    LOOK FOR LENGTH DATA                 00150800
         BE    A3700               GOT IT                               00150900
         LA    R7,1(0,R7)          BUMP TO NEXT BYTE                    00151000
         CR    R7,R8               AT END OF SCAN FIELD                 00151100
         BL    A3630               NO                                   00151200
         LA    R5,80(0,R5)         BUMP TO NEXT JCL POSITION            00151300
         CLC   0(3,R5),0(R6)       SAME SECTION AS BEFORE               00151400
         BNE   A3570               NO - START NEXT SECTION              00151500
         CLC   3(2,R5),=C'VR'      IS IT VER/REP DATA                   00151600
         BNE   A3570               NO - START NEXT SECTION              00151700
         L     R6,VRTBLOC          POINT TO NEXT TABLE ENTRY            00151800
         CLI   0(R6),X'FF'         END OF TABLE                         00151900
         BE    A9130               YES - PUT OUT ERROR MSG              00152000
         B     A3610                                                    00152100
A3650    EQU   *                                                        00152200
         LA    R14,4(0,R6)         POINT TO VERIFY AREA IN TABLE        00152300
         B     A3670                                                    00152400
A3660    EQU   *                                                        00152500
         LA    R14,14(0,R6)        POINT TO REPLACE AREA IN TABLE       00152600
A3670    EQU   *                                                        00152700
         LA    R15,10              SET SCAN LIMIT                       00152800
         MVC   SCANCHAR,4(R7)      SAVE SCAN DELIMITER CHARACTER        00152900
         LA    R7,5(0,R7)          BUMP OVER ID FIELD                   00153000
A3680    EQU   *                                                        00153100
         MVC   0(1,R14),0(R7)      MOVE VER/REP CHARACTER               00153200
         LA    R14,1(0,R14)        BUMP TO NEXT POSITION                00153300
         LA    R7,1(0,R7)                                               00153400
         CLC   SCANCHAR,0(R7)      END OF FIELD                         00153500
         BE    A3630               YES                                  00153600
         BCT   R15,A3680           LOOP BACK IF LENGTH NOT EXHAUSTED    00153700
         B     A3630                                                    00153800
A3700    EQU   *                                                        00153900
         LA    R7,4(0,R7)          BUMP OVER LNG CONST                  00154000
         SR    R15,R15             CLEAR LENGTH REG                     00154100
A3710    EQU   *                                                        00154200
         TM    0(R7),X'F0'         FIND FIRST NUMERIC CHAR              00154300
         BO    A3720                                                    00154400
         LA    R7,1(0,R7)                                               00154500
         B     A3710                                                    00154600
A3720    EQU   *                                                        00154700
         LR    R14,R7              SAVE BEGINNING OF LNG FIELD          00154800
A3730    EQU   *                                                        00154900
         LA    R15,1(0,R15)        ADD 1 TO FIELD LENGTH                00155000
         LA    R7,1(0,R7)          BUMP TO NEXT POSITION                00155100
         TM    0(R7),X'F0'         IS CHARACTER NUMERIC                 00155200
         BO    A3730               YES - GET NEXT CHARACTER             00155300
         BCTR  R15,0               SUBTRACT 1 FROM LENGTH               00155400
         EX    R15,PACKLNG         PACK LENGTH FIELD                    00155500
         CVB   R15,DBLWORD         CONVERT IT TO BINARY                 00155600
         BCTR  R15,0               SUBTRACT 1 FROM LENGTH               00155700
         STC   R15,3(0,R6)         STORE LENGTH IN VER/REP TABLE ENTRY  00155800
         B     A3630               GO SCAN FOR NEXT FIELD               00155900
         SPACE 3                                                        00156000
PACKLNG  PACK  DBLWORD,0(0,R14)                                         00156100
         EJECT                                                          00156200
*********************************************************************** 00156300
*        SET UP ERROR MESSAGES FOR INITIALIZATION STUFF               * 00156400
*        R1 - ADDR OF OUTPUT MESSAGE                                  * 00156500
*        R3 - RETURN ADDRESS IF NOT A CANCEL                          * 00156600
*********************************************************************** 00156700
A9010    EQU   *                                                        00156800
         LA    R1,MSG1             GET MESSAGE ADDR                     00156900
         LA    R3,A2999            GET RETURN ADDR                      00157000
         B     Z9500               PUT OUT MESSAGE                      00157100
A9020    EQU   *                                                        00157200
         LA    R1,MSG2             GET MESSAGE ADDR                     00157300
         LA    R3,A2999            GET RETURN ADDR                      00157400
         B     Z9500               PUT OUT MESSAGE                      00157500
A9030    EQU   *                                                        00157600
         LA    R1,MSG3             GET MESSAGE ADDR                     00157700
         LA    R3,A2999            GET RETURN ADDR                      00157800
         B     Z9500               PUT OUT MESSAGE                      00157900
         AIF   ('&SYSPARM' EQ 'EXIT').A9050                             00158000
         AIF   ('&OPSYS' EQ 'MVS').A9050                                00158100
A9040    EQU   *                                                        00158200
         LA    R1,MSG4             GET MESSAGE ADDR                     00158300
         LA    R3,A2999            GET RETURN ADDR                      00158400
         B     Z9500               PUT OUT MESSAGE                      00158500
.A9050   ANOP                                                           00158600
A9050    EQU   *                                                        00158700
         LA    R1,MSG5             GET MESSAGE ADDR                     00158800
         LA    R3,A2999            GET RETURN ADDR                      00158900
         B     Z9500               PUT OUT MESSAGE                      00159000
A9060    EQU   *                                                        00159100
         LA    R1,MSG6             GET MESSAGE ADDR                     00159200
         LA    R3,A2999            GET RETURN ADDR                      00159300
         B     Z9500               PUT OUT MESSAGE                      00159400
A9070    EQU   *                                                        00159500
         LA    R1,MSG7             GET MESSAGE ADDR                     00159600
         LA    R3,A2999            GET RETURN ADDR                      00159700
         B     Z9500               PUT OUT MESSAGE                      00159800
A9090    EQU   *                                                        00159900
         LA    R1,MSG9             GET MESSAGE ADDR                     00160000
         LA    R3,A2999            GET RETURN ADDR                      00160100
         B     Z9500               PUT OUT MESSAGE                      00160200
         AIF   ('&SYSPARM' EQ 'EXIT').A9120                             00160300
A9100    EQU   *                                                        00160400
         MVC   MSG10+38(2),CARDIN  IDENTIFY CARD TYPE                   00160500
         LA    R1,MSG10            GET MESSAGE ADDR                     00160600
         LA    R3,A2999            GET RETURN ADDR                      00160700
         B     Z9500               PUT OUT MESSAGE                      00160800
.A9120   ANOP                                                           00160900
         AIF   ('&SYSPARM' EQ 'EXIT').A9130                             00161000
A9120    EQU   *                                                        00161100
         LA    R1,MSG12            GET MESSAGE ADDR                     00161200
         LA    R3,A2999            GET RETURN ADDR                      00161300
         B     Z9500               PUT OUT MESSAGE                      00161400
.A9130   ANOP                                                           00161500
A9130    EQU   *                                                        00161600
         LA    R1,MSG13            GET MESSAGE ADDR                     00161700
         LA    R3,A2999            GET RETURN ADDR                      00161800
         B     Z9500               PUT OUT MESSAGE                      00161900
A9160    EQU   *                                                        00162000
         LA    R1,MSG16            GET MESSAGE ADDR                     00162100
         CVD   R15,DBLWORD         CONVERT RTN CODE TO PACKED DECIMAL   00162200
         AIF   ('&OPSYS' NE 'VSE').A9161                                00162300
         UNPK  MSG16+42(2),DBLWORD+6(2) UNPACK RETURN CODE              00162400
         OI    MSG16+43,X'F0'      FIX SIGN ON LAST CHARACTER           00162500
         AGO   .A9162                                                   00162600
.A9161   ANOP                                                           00162700
         UNPK  MSG16+43(2),DBLWORD+6(2) UNPACK RETURN CODE              00162800
         OI    MSG16+44,X'F0'      FIX SIGN ON LAST CHARACTER           00162900
.A9162   ANOP                                                           00163000
         B     Z9500               PUT OUT MESSAGE                      00163100
         AIF   ('&OPSYS' NE 'VSE').A9180                                00163200
A9170    EQU   *                                                        00163300
         LA    R1,MSG17            GET MESSAGE ADDR                     00163400
         CVD   R15,DBLWORD         CONVERT RTN CODE TO PACKED DECIMAL   00163500
         UNPK  MSG17+48(2),DBLWORD+6(2) UNPACK RETURN CODE              00163600
         OI    MSG17+49,X'F0'      FIX SIGN ON LAST CHARACTER           00163700
         B     Z9500               PUT OUT MESSAGE                      00163800
.A9180   ANOP                                                           00163900
A9180    EQU   *                                                        00164000
         LA    R1,MSG18            GET MESSAGE ADDR                     00164100
         LA    R3,A2999            GET RETURN ADDR                      00164200
         B     Z9500               PUT OUT MESSAGE                      00164300
A9190    EQU   *                                                        00164400
         LA    R1,MSG19            GET MESSAGE ADDR                     00164500
         LA    R3,A2999            GET RETURN ADDR                      00164600
         B     Z9500               PUT OUT MESSAGE                      00164700
         AIF   ('&OPSYS' NE 'VSE').A9270                                00164800
A9240    EQU   *                                                        00164900
         LA    R1,MSG24            GET MESSAGE ADDR                     00165000
         CVD   R15,DBLWORD         CONVERT RTN CODE TO PACKED DECIMAL   00165100
         UNPK  MSG24+48(2),DBLWORD+6(2) UNPACK RETURN CODE              00165200
         OI    MSG24+49,X'F0'      FIX SIGN ON LAST CHARACTER           00165300
         B     Z9500               PUT OUT MESSAGE                      00165400
A9250    EQU   *                                                        00165500
         LA    R1,MSG25            GET MESSAGE ADDR                     00165600
         CVD   R15,DBLWORD         CONVERT RTN CODE TO PACKED DECIMAL   00165700
         UNPK  MSG25+34(2),DBLWORD+6(2) UNPACK RETURN CODE              00165800
         OI    MSG25+35,X'F0'      FIX SIGN ON LAST CHARACTER           00165900
         B     Z9500               PUT OUT MESSAGE                      00166000
.A9270   ANOP                                                           00166100
A9270    EQU   *                                                        00166200
         LA    R1,MSG27            GET MESSAGE ADDR                     00166300
         LA    R3,A2999            GET RETURN ADDR                      00166400
         B     Z9500               PUT OUT MESSAGE                      00166500
A9280    EQU   *                                                        00166600
         LA    R1,MSG28            GET MESSAGE ADDR                     00166700
         LA    R3,A2999            GET RETURN ADDR                      00166800
         B     Z9500               PUT OUT MESSAGE                      00166900
A9290    EQU   *                                                        00167000
         LA    R1,MSG29            GET MESSAGE ADDR                     00167100
         LA    R3,A2999            GET RETURN ADDR                      00167200
         B     Z9500               PUT OUT MESSAGE                      00167300
A9300    EQU   *                                                        00167400
         LA    R1,MSG30            GET MESSAGE ADDR                     00167500
         LA    R3,A2999            GET RETURN ADDR                      00167600
         B     Z9500               PUT OUT MESSAGE                      00167700
A9310    EQU   *                                                        00167800
         LA    R1,MSG31            GET MESSAGE ADDR                     00167900
         B     Z9500               PUT OUT MESSAGE                      00168000
A9320    EQU   *                                                        00168100
         LA    R1,MSG32            GET MESSAGE ADDR                     00168200
         LA    R3,A2999            GET RETURN ADDR                      00168300
         B     Z9500               PUT OUT MESSAGE                      00168400
         AIF   ('&OPSYS' EQ 'MVS').A9340E                               00168500
A9330    EQU   *                                                        00168600
         LA    R1,MSG33            GET MESSAGE ADDR                     00168700
         LA    R3,A2999            GET RETURN ADDR                      00168800
         B     Z9500               PUT OUT MESSAGE                      00168900
A9340    EQU   *                                                        00169000
         LA    R1,MSG34            GET MESSAGE ADDR                     00169100
         LA    R3,A2999            GET RETURN ADDR                      00169200
         B     Z9500               PUT OUT MESSAGE                      00169300
.A9340E  ANOP                                                           00169400
A9350    EQU   *                                              2602137   00169410
         LA    R1,MSG37            GET MESSAGE ADDR           2602137   00169420
         LA    R3,A2999            GET RETURN ADDR            2602137   00169430
         B     Z9500               PUT OUT MESSAGE            2602137   00169440
A9360    EQU   *                                                        00169500
         LA    R1,MSG36            GET MESSAGE ADDR                     00169600
         LA    R3,A2999            GET RETURN ADDR                      00169700
         B     Z9500               PUT OUT MESSAGE                      00169800
         EJECT                                                          00169900
         AIF   ('&OPSYS' EQ 'MVS').NOFMSG                               00170000
         AIF   ('&SYSPARM' EQ 'EXIT').NOFMSG                            00170100
FIRSTMSG DC    CL42'IUDSTBLK-ENTER COMMAND/PROTOTYPE JCL/''/*'''        00170200
.NOFMSG  ANOP                                                           00170300
MSG1     DC    AL1(MSG2-*)                                              00170400
         DC    C'01AINVALID CONTROL OR JCL PROTOTYPE CARD'              00170500
MSG2     DC    AL1(MSG3-*)                                              00170600
         DC    C'02BINVALID JCL TYPE IN JCL PROTOTYPE CARD'             00170700
MSG3     DC    AL1(MSG3E-*)                                             00170800
         DC    C'03BTOO MANY JCL PROTOTYPE CARDS'                       00170900
MSG3E    EQU   *                                                        00171000
         AIF   ('&SYSPARM' EQ 'EXIT').MSG5                              00171100
         AIF   ('&OPSYS' EQ 'MVS').MSG5                                 00171200
MSG4     DC    AL1(MSG5-*)                                              00171300
         DC    C'04BINVALID OUTPUT SPECIFICATION'                       00171400
.MSG5    ANOP                                                           00171500
MSG5     DC    AL1(MSG6-*)                                              00171600
         DC    C'05BINVALID SELECT CARD'                                00171700
MSG6     DC    AL1(MSG7-*)                                              00171800
         DC    C'06BINVALID SECTION ID IN SECTION SELECT CARD'          00171900
MSG7     DC    AL1(MSG9-*)                                              00172000
         DC    C'07BTOO MANY NAMES SELECTED'                            00172100
MSG9     DC    AL1(MSG9E-*)                                             00172200
         DC    C'09BNO DELIMIT CHARACTER ENTERED ON DELIMIT CARD'       00172300
MSG9E    EQU   *                                                        00172400
         AIF   ('&SYSPARM' EQ 'EXIT').MSG12                             00172500
MSG10    DC    AL1(MSG10E-*)                                            00172600
         DC    C'10BINVALID DIGIT OR MISSING FIELD ON XXLIMIT CARD'     00172700
MSG10E   EQU   *                                                        00172800
.MSG12   ANOP                                                           00172900
         AIF   ('&SYSPARM' EQ 'EXIT').MSG13                             00173000
MSG12    DC    AL1(MSG13-*)                                             00173100
         DC    C'12AOUTPUT SELECT CARD SKIPPED-INVALID WITH DIRECTORY'  00173200
.MSG13   ANOP                                                           00173300
MSG13    DC    AL1(MSG13E-*)                                            00173400
         DC    C'13BTOO MANY VERIFY/REPLACE CARDS ENTERED'              00173500
MSG13E   EQU   *                                                        00173600
         AIF   ('&OPSYS' EQ 'MVS').MSG16M                               00173700
MSG16    DC    AL1(MSG17-*)                                             00173800
         DC    C'16CGETVIS FAILED FOR TABLE ALLOCATION, RC=XX'          00173900
MSG17    DC    AL1(MSG18-*)                                             00174000
         DC    C'17CGETVIS FAILED FOR TAPE BUFFER ALLOCATION, RC=XX'    00174100
         AGO   .MSG18                                                   00174200
.MSG16M  ANOP                                                           00174300
MSG16    DC    AL1(MSG18-*)                                             00174400
         DC    C'16CGETMAIN FAILED FOR TABLE ALLOCATION, RC=XX'         00174500
.MSG18   ANOP                                                           00174600
MSG18    DC    AL1(MSG18E-*)                                            00174700
         DC    C'18ATOO MANY SECTIONS SELECTED'                         00174800
MSG18E   EQU   *                                                        00174900
MSG19    DC    AL1(MSG19E-*)                                            00175000
         DC    C'19BINVALID OR MISSING FIELD ON INSTALL CARD'           00175100
MSG19E   EQU   *                                                        00175200
         AIF   ('&OPSYS' NE 'VSE').MSG27                                00175300
MSG24    DC    AL1(MSG5-*)                                              00175400
         DC    C'24CGETVIS FAILED FOR COPY BUFFER ALLOCATION, RC=XX'    00175500
MSG25    DC    AL1(MSG27-*)                                             00175600
         DC    C'25CCDLOAD FAILED FOR USER EXIT, RC=XX'                 00175700
.MSG27   ANOP                                                           00175800
MSG27    DC    AL1(MSG28-*)                                             00175900
         DC    C'27BINVALID EXCLUDE CARD'                               00176000
MSG28    DC    AL1(MSG29-*)                                             00176100
         DC    C'28BINVALID SECTION ID IN EXCLUDE SELECT CARD'          00176200
MSG29    DC    AL1(MSG30-*)                                             00176300
         DC    C'29BTOO MANY NAMES EXCLUDED'                            00176400
MSG30    DC    AL1(MSG31-*)                                             00176500
         DC    C'30BTOO MANY SECTIONS EXCLUDED'                         00176600
MSG31    DC    AL1(MSG32-*)                                             00176700
         DC    C'31CSECTION TABLE IS FULL'                              00176800
MSG32    DC    AL1(MSG32E-*)                                            00176900
         DC    C'32BTOO MANY LANGUAGES SELECTED'                        00177000
MSG32E   EQU   *                                                        00177100
         AIF   ('&OPSYS' NE 'VSE').MSG34E                               00177200
MSG33    DC    AL1(MSG34-*)                                             00177300
         DC    C'33BLIB OR SUBLIB MISSING ON ACCESS= OPTION'            00177400
MSG34    DC    AL1(MSGEND-*)                                            00177500
         DC    C'34BREPLACE OPTION NOT YES OR NO'                       00177600
.MSG34E  ANOP                                                           00177700
MSG36    DC    AL1(MSG36E-*)                                            00177800
         DC    C'36BINVALID COBOL II FILTER OPTION'                     00177900
MSG36E   EQU   *                                              2602137   00177910
MSG37    DC    AL1(MSG37E-*)                                  2602137   00177920
         DC    C'37BSELECTED NAME NOT IN SELECTED TABLE'      2602137   00177930
MSG37E   EQU   *                                                        00178000
MSGEND   EQU   *                                                        00178100
IUSECTLN DC    H'0'                LENGTH OF EACH ENTRY                 00178200
NOJCLENT DC    H'1'                NO. ENTRIES IN JCL TABLE + 1         00178300
ACTFLG   DC    CL1'0'              SELECT ACTION= CARD FLAG             00178400
SCANCHAR DC    CL1' '                                                   00178500
APPLKEY  DC    CL6'*APPL='                                              00178600
HDR1KEY  DC    CL6'*HDR1='                                              00178700
HDR2KEY  DC    CL6'*HDR2='                                              00178800
HDR3KEY  DC    CL6'*HDR3='                                              00178900
HDR4KEY  DC    CL6'*HDR4='                                              00179000
         AIF   ('&SYSPARM' EQ 'EXIT').LTORG1                            00179100
         SPACE 3                                                        00179200
INPHDNG1 DS    0CL45                                                    00179300
         DC    XL1'11'             PRINT AND SPACE 2 COMMAND CODE       00179400
         DC    CL20' '                                                  00179500
         DC    CL24'* * INPUT CARD IMAGE * *'                           00179600
INPHDNG2 DS    0CL81                                                    00179700
         DC    XL1'11'             PRINT AND SPACE 2 COMMAND CODE       00179800
         DC    CL40'1...5...10...15...20...25...30...35...40'           00179900
         DC    CL40'...45...50...55...60...65...70...75...80'           00180000
.LTORG1  ANOP                                                           00180100
         LTORG                                                          00180200
         DROP  R9                                                       00180300
         DROP  R10                                                      00180400
IUDBKBEG CSECT                                                9913801   00180410
SAVEAREA DC    18F'0'                                                   00180500
         AIF   ('&SYSPARM' EQ 'EXIT').B0035                             00180600
         EJECT                                                          00180700
*********************************************************************** 00180800
*        OPEN OUTPUT FILE                                             * 00180900
*********************************************************************** 00181000
B0010    EQU   *                                                        00181100
         AIF   ('&OPSYS' EQ 'VSE').B0010A                               00181200
*        CLOSE CARDFIL                                                  00181300
         CLOSE CARDFIL                                                  00181400
         CLI   OUTDEV,C'L'         IS PRINTER OUTPUT                    00181500
         BE    B0030               YES - ALREADY OPEN                   00181600
         CLI   OUTDEV,C'S'         IS PDS OUTPUT                        00181700
         BNE   B0025               NO                                   00181800
         RDJFCB PDSOUT                                                  00181900
         OPEN  (PDSOUT,(INPUT))                                         00182000
         L     R15,PDSOUTAD        GET PDSOUT DCB ADDRESS               00182100
         L     R15,44(0,R15)       GET DEB ADDRESS                      00182200
         L     R15,32(0,R15)       UCB ADDRESS                          00182300
         ST    R15,UCBADDR         SAVE UCB ADDRESS                     00182400
         CLOSE PDSOUT                                                   00182500
         L     R15,UCBADDR         GET UCB ADDRESS                      00182600
         USING UCBCMSEG,R15                                             00182700
         TM    UCBTBYT2,UCBRR      IS THIS A SHARED DASD                00182800
         BZ    B0013               NO - CHK FOR ENQ                     00182900
         DROP  R15                                                      00183000
*        IF SHARED DASD, USE RESERVE MACRO                              00183100
         RESERVE (SPFEDIT,JFCBDSNM,E,44,SYSTEMS),RET=HAVE,UCB=UCBADDR   00183200
         B     B0020                                                    00183300
B0013    EQU   *                                                        00183400
*        PDS NOT SHARED AND DISP=OLD, MOD, OR NEW DOES NOT NEED ENQ     00183500
         TM    JFCBIND2,JFCSHARE   IS DISP=SHR                          00183600
         BZ    B0020               NO - DONT NEED ENQ                   00183700
         ENQ   (SPFEDIT,JFCBDSNM,E,44,SYSTEMS),RET=HAVE                 00183800
B0020    EQU   *                                                        00183900
         OPEN  (PDSOUT,OUTPUT)                                          00184000
         L     R1,PDSOUTAD         GET PDSOUT DCB ADDRESS               00184100
         USING IHADCB,R1                                                00184200
         MVC   PDSMAXBK,DCBBLKSI   SAVE MAX BLOCKSIZE                   00184300
         MVC   PDSREMLN,DCBBLKSI   SAVE MAX BLOCKSIZE AS LNG REMAINING  00184400
         LH    R2,PDSMAXBK         GET SIZE OF STORAGE REQUESTED        00184500
         GETMAIN R,LV=(2)          REQUEST STORAGE FOR PDS BUFFER       00184600
         LTR   R15,R15             CHK FOR ERROR                        00184700
         BNZ   Z9210               ERROR - GETMAIN FAILURE              00184800
         ST    R1,PDSBUFAD         SAVE ADDRESS OF PDS BUFFER           00184900
         ST    R1,PDSBUFPT         SAVE ADDRESS OF PDS BUFFER IN PTR    00185000
         B     B0030                                                    00185100
B0025    EQU   *                                                        00185200
         OPEN  (TAPEOUT,OUTPUT)                                         00185300
B0030    EQU   *                                                        00185400
         AGO   .B0035                                                   00185500
.B0010A  ANOP                                                           00185600
         CLI   OUTDEV,C'L'         IS PRINTER OUTPUT                    00185700
         BE    B0030               YES - DON'T OPEN IT                  00185800
         AIF   ('&OPSYS' EQ 'MVS').B0020                      2024183   00185810
         AIF   (NOT &LIBRM).B0020                                       00185900
         CLI   OUTDEV,C'S'         IS SUBLIB OUTPUT                     00186000
         BNE   B0020               NO                                   00186100
         CLI   LIBNAME,C' '        ANY LIB NAME                         00186200
         BE    Z9350               ERROR - NO LIBRARY NAME              00186300
         CLI   SUBLIBNM,C' '       ANY SUBLIB NAME                      00186400
         BE    Z9350               ERROR - NO SUBLIBRARY NAME           00186500
*********************************************************************** 00186600
*        GENERATE LIBR DCB                                            * 00186700
*********************************************************************** 00186800
         LIBRDCB FUNC=GEN,AREA=LIBRDCB,                                X00186900
               LIB=LIBNAME,SUBLIB=SUBLIBNM,                            X00187000
               MEMBER=MEMNAME,TYPE=MEMTYPE,                            X00187100
               BUFFER=CARDIN,BUFSIZE=80                                 00187200
         B     B0030                                                    00187300
.B0020   ANOP                                                           00187400
B0020    EQU   *                                                        00187500
         L     R1,OUTFILAD         GET OUTPUT FILE ADDR                 00187600
         OPEN  (1)                                                      00187700
B0030    B     B0035               CHANGED TO NOP IF CARD INPUT         00187800
*        CLOSE CARDFIL                                                  00187900
         CLOSE CARDFIL                                                  00188000
B0035    EQU   *                                                        00188100
.B0035   ANOP                                                           00188200
         AIF   ('&SYSPARM' NE 'EXIT').B0040                             00188300
B0010    EQU   *                                                        00188400
         MVI   PROCSW,C'1'         SET PROCESS SWITCH ON                00188500
.B0040   ANOP                                                           00188600
         AIF   ('&SYSPARM' EQ 'EXIT').B0050                             00188700
         CLI   OUTDEV,C'C'         IS OUTPUT OPTION=COPY                00188800
         BE    Q0010               YES - GO TO COPY PROCESSING          00188900
.B0050   ANOP                                                           00189000
*********************************************************************** 00189100
*        SELECT TYPE OF PROCESSING - ALL, SECTION, OR NAME            * 00189200
*********************************************************************** 00189300
         LA    R0,CARDWORK                                              00189400
         MVI   IOCODE,C'0'         INDICATE INITIAL CALL TO USER EXIT   00189500
         BAL   R10,GOUT020         CALL ANY USER EXIT                   00189600
         BAL   R10,GBEG010         GENERATE BEGIN STATEMENTS            00189700
         CLI   SELTYPE,C'S'        SELECT SECTION                       00189800
         BE    D0010               YES                                  00189900
         CLI   SELTYPE,C'N'        SELECT NAME                          00190000
         BE    E0010               YES                                  00190100
         CLI   SELTYPE,C'T'        SELECT TABLE                         00190200
         BE    E0010               YES                                  00190300
         EJECT                                                          00190400
*********************************************************************** 00190500
*        SELECT ALL PROCESSING                                        * 00190600
*********************************************************************** 00190700
C0010    EQU   *                                                        00190800
         CLI   SKIPREAD,C'1'       IS SKIP READ SWITCH ON               00190900
         BE    C0020               YES - DON'T READ ONE RECORD          00191000
         BAL   R14,DBLKREAD        READ INPUT FILE                      00191100
C0020    EQU   *                                                        00191200
         MVI   SKIPREAD,C'0'       RESET SKIP READ SWITCH               00191300
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00191400
         BNE   C0050               NO - CHK FOR DATA SET HEADER         00191500
*        CHECK FOR ANY SECTIONS TO BE EXCLUDED                          00191600
         CP    SECEXCNO,=P'0'      ANY SECTIONS TO BE EXCLUDED          00191700
         BE    C0050               NO                                   00191800
         LA    R4,SECEXCTB         GET SECTION EXCLUDE TABLE ADDR       00191900
C0040    EQU   *                                                        00192000
         CLC   CDHDSCNM,0(R4)      IS THIS AN EXCLUDED SECTION          00192100
         BE    C0045               YES                                  00192200
         LA    R4,4(0,R4)          BUMP TO NEXT TABLE ENTRY             00192300
         CLI   0(R4),X'FF'         END OF SECTION EXCLUDE TABLE         00192400
         BNE   C0040               NO - CHECK THIS TABLE ENTRY          00192500
         B     C0050               CHECK FOR EXCLUDED NAME              00192600
C0045    EQU   *                                                        00192700
         BAL   R14,DBLKREAD        READ INPUT FILE                      00192800
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00192900
         BNE   C0045               NO - LOOP TO NEXT SECTION HEADER     00193000
         B     C0020                                                    00193100
C0050    EQU   *                                                        00193200
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00193300
         BNE   C0160               NO                                   00193400
*        CHECK FOR ANY DATA SET NAMES TO BE EXCLUDED                    00193500
         CP    NAMEXCNO,=P'0'      ANY NAMES TO BE EXCLUDED             00193600
         BE    C0160               NO                                   00193700
         L     R3,NAMEXCAD         GET ADDR OF NAME EXCLUDE TABLE       00193800
C0055    EQU   *                                                        00193900
         CLC   CDHDNAME,0(R3)      EXCLUDE THIS NAME                    00194000
         BE    C0060               YES                                  00194100
         LA    R3,8(0,R3)          BUMP TO NEXT TABLE ENTRY             00194200
         CLI   0(R3),X'FF'         END OF TABLE                         00194300
         BE    C0160               YES - PROCESS THIS NAME              00194400
         B     C0055                                                    00194500
C0060    EQU   *                                                        00194600
         BAL   R14,DBLKREAD        READ INPUT FILE                      00194700
         CLC   CDEOSECT,SECTEND    IS IT END OF SECTION                 00194800
         BE    C0400               YES - PROCESS END OF SECTION         00194900
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00195000
         BNE   C0060               NO - LOOP TO NEXT DATA SET HEADER    00195100
         B     C0050                                                    00195200
C0160    EQU   *                                                        00195300
         CLI   TYPEINST,C'?'       WANT EVERYTHING                      00195400
         BE    C0400               YES                                  00195500
         CLI   TYPEINST,C'S'       WANT ALL SECTIONS AND ALL ACTIONS    00195600
         BE    C0400               YES                                  00195700
         CLI   TYPEINST,C'I'       IS THIS AN INITIAL TYPE INSTALL      00195800
         BNE   C0180               NO - CHK FOR UPDATE TYPE INSTALL     00195900
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00196000
         BNE   C0180               NO - CHK FOR ACTION CODE             00196100
         CLC   CDHDSCNM,=C'UPD'    IS THIS AN UPDATE SECTION            00196200
         BNE   C0400               NO - PROCESS AS NORMAL               00196300
*        SKIP TO NEXT SECTION IF TYPEINSTAL=INITIAL AND UPDATE SECTION  00196400
C0170    EQU   *                                                        00196500
         BAL   R14,DBLKREAD        READ INPUT FILE                      00196600
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00196700
         BNE   C0170               NO - LOOP TO NEXT SECTION HEADER     00196800
         B     C0020                                                    00196900
C0180    EQU   *                                                        00197000
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00197100
         BNE   C0400               NO - PROCESS RECORD                  00197200
*        CHECK ACTION CODE ON DATA SET TO SEE IF I WANT IT              00197300
         CLI   CDHDACT,C' '        OLD STATIC ACTION CODE               00197400
         BNE   *+8                 NO                                   00197500
         MVI   CDHDACT,C'S'        SET NEW STATIC ACTION CODE           00197600
         TRT   CDHDACT,ACTTBL      ACTION SELECTED                      00197700
         BZ    C0300               NO - SKIP IT                         00197800
*        CHECK LANGUAGE CODE ON DATA SET TO SEE IF I WANT IT            00197900
         L     R4,=A(LANGTBL)      GET LANG TABLE ADDRESS     9713437   00197910
         CLI   0(R4),X'FE'   ANY LANGUAGE SELECTION CRITERIA  9713437   00198000
         BNL   C0200               NO - PROCESS DATA SET                00198100
C0190    EQU   *                                                        00198300
         CLC   CDHDTYPE,0(R4)      IS THIS LANGUAGE SELECTED            00198400
         BE    C0200               YES - PROCESS DATA SET               00198500
         LA    R4,5(0,R4)          BUMP TO NEXT TABLE ENTRY             00198600
         CLI   0(R4),X'FE'         END OF TABLE                         00198700
         BL    C0190               NO - LOOP BACK                       00198800
         B     C0300               YES - SKIP THIS DATA SET             00198900
*        CHECK PREFIX SELECT ON DATA SET TO SEE IF I WANT IT            00199000
C0200    EQU   *                                                        00199100
         CLI   SELPFXTB,X'FE'      ANY PREFIX SELECTS                   00199200
         BNL   C0400               NO                                   00199300
         SR    R1,R1               CLEAR R1                             00199400
         LA    R15,SELPFXTB        POINT TO PREFIX SELECT TABLE         00199500
C0210    EQU   *                                                        00199600
         IC    R1,0(0,R15)         GET PREFIX LENGTH                    00199700
         EX    R1,C0200CLC         DO I WANT THIS PREFIX                00199800
         BE    C0250               YES                        9914000   00199900
         LA    R15,8(0,R15)        BUMP TO NEXT PREFIX ENTRY            00200000
         CLI   0(R15),X'FE'        END OF TABLE                         00200100
         BL    C0210               NO - CHK THIS PREFIX                 00200200
         CLI   SELEXC,C'E'         EXCLUDE PREFIX             9914000   00200210
         BE    C0400               YES                        9914000   00200220
         B     C0300               NO - SKIP THE DATA SET               00200300
C0250    EQU   *                                              9914000   00200310
         CLI   SELEXC,C'E'         EXCLUDE PREFIX             9914000   00200320
         BE    C0300               YES, SKIP IT               9914000   00200330
         B     C0400               NO                         9914000   00200340
C0200CLC CLC   CDHDNAME(0),1(R15)                                       00200400
*        SKIP TO NEXT SECTION OR DATA SET IF ACTION FOR THIS DATA SET   00200500
*        IS NOT SELECTED                                                00200600
C0300    EQU   *                                                        00200700
         BAL   R14,DBLKREAD        READ INPUT FILE                      00200800
         CLC   CDEOSECT,SECTEND    IS THIS A SECTION TRAILER            00200900
         BE    C0400               YES - GET OUT OF THIS                00201000
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00201100
         BNE   C0300               NO - LOOP TO NEXT DATA SET HEADER    00201200
         B     C0180                                                    00201300
C0400    EQU   *                                                        00201400
         BAL   R10,G0010           CALL OUTPUT PROCESSING               00201500
         B     C0010               READ NEXT RECORD                     00201600
         EJECT                                                          00201700
*********************************************************************** 00201800
*        SELECT SECTION PROCESSING                                    * 00201900
*********************************************************************** 00202000
D0010    EQU   *                                                        00202100
         NC    WKHDAPSC,WKSECTFL   TURN OFF SELECTED                    00202200
*                                     SECTION FLAGS NOT ON TAPE         00202300
         BZ    Z9150               NO - ERROR                           00202400
D0012    EQU   *                                                        00202500
         CLI   SKIPREAD,C'1'       IS SKIP READ SWITCH ON               00202600
         BE    D0015               YES - DON'T READ ONE RECORD          00202700
         BAL   R14,DBLKREAD        READ INPUT FILE                      00202800
D0015    EQU   *                                                        00202900
         MVI   SKIPREAD,C'0'       RESET SKIP READ SWITCH               00203000
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00203100
         BNE   D0012               NO - READ AGAIN                      00203200
         LA    R4,SECSELTB         GET SECTION SELECT TABLE ADDR        00203300
D0016    EQU   *                                                        00203400
         CLC   CDHDSCNM,0(R4)      IS THIS A SELECTED SECTION           00203500
         BE    D0017               YES                                  00203600
         LA    R4,4(0,R4)          BUMP TO NEXT TABLE ENTRY             00203700
         CLI   0(R4),X'FF'         END OF SECTION SELECT TABLE          00203800
         BNE   D0016               NO - CHECK THIS TABLE ENTRY          00203900
         B     D0012               YES - READ TO NEXT SECTION HEADER    00204000
D0017    EQU   *                                                        00204100
         MVC   SELSECT(4),0(R4)    MOVE TABLE ENTRY TO WORK AREA        00204200
         SP    SECTBLNO,=P'1'      SUBTRACT 1 FROM NO. SECTIONS         00204300
         CLC   STRTNAME,SPACES     ANY STARTING NAME                    00204400
         BE    D0030               NO - START PROCESSING SECTION        00204500
         CLI   TYPEINST,C'I'       IS THIS AN INITIAL TYPE INSTALL      00204600
         BNE   D0019               NO - DONT CHK FOR UPDATE SECTION     00204700
         CLC   CDHDSCNM,=C'UPD'    IS THIS AN UPDATE SECTION            00204800
         BE    D0012               YES - SKIP IT                        00204900
D0019    EQU   *                                                        00205000
         BAL   R10,G0010           PUT OUT SECTION HEADER JCL           00205100
D0020    EQU   *                                                        00205200
         BAL   R14,DBLKREAD        READ INPUT FILE                      00205300
         CLC   CDEOSECT,SECTEND    IS IT END OF SECTION                 00205400
         BE    Z9110               YES - ERROR - NAME NOT IN SECTION    00205500
         CLC   CDHDDSN,DSNKEY      IS IT DATA SET HEADER RECORD         00205600
         BNE   D0020               NO - READ AGAIN                      00205700
         CLC   CDHDNAME,STRTNAME   IS IT THE STARTING NAME              00205800
         BNE   D0020               NO - READ AGAIN                      00205900
         B     D0030                                                    00206000
D0025    EQU   *                                                        00206100
         CLI   SKIPREAD,C'1'       IS SKIP READ SWITCH ON               00206200
         BE    D0030               YES - DON'T READ ONE RECORD          00206300
         BAL   R14,DBLKREAD        READ INPUT FILE                      00206400
D0030    EQU   *                                                        00206500
         MVI   SKIPREAD,C'0'       RESET SKIP READ SWITCH               00206600
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00206700
         BNE   D0160               NO                                   00206800
         CP    NAMEXCNO,=P'0'      ANY NAMES TO BE EXCLUDED             00206900
         BE    D0160               NO                                   00207000
         L     R3,NAMEXCAD         GET ADDR OF NAME EXCLUDE TABLE       00207100
D0050    EQU   *                                                        00207200
         CLC   CDHDNAME,0(R3)      EXCLUDE THIS NAME                    00207300
         BE    D0060               YES                                  00207400
         LA    R3,8(0,R3)          BUMP TO NEXT TABLE ENTRY             00207500
         CLI   0(R3),X'FF'         END OF TABLE                         00207600
         BE    D0160               YES - WANT THIS NAME                 00207700
         B     D0050                                                    00207800
D0060    EQU   *                                                        00207900
         BAL   R14,DBLKREAD        READ INPUT FILE                      00208000
         CLC   CDEOSECT,SECTEND    IS IT END OF SECTION                 00208100
         BE    D0400               YES - PROCESS END OF SECTION         00208200
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00208300
         BNE   D0060               NO - LOOP TO NEXT DATA SET HEADER    00208400
         B     D0030                                                    00208500
D0160    EQU   *                                                        00208600
         CLI   TYPEINST,C'?'       WANT EVERYTHING                      00208700
         BE    D0400               YES                                  00208800
         CLI   TYPEINST,C'S'       WANT ALL SECTIONS AND ALL ACTIONS    00208900
         BE    D0400               YES                                  00209000
         CLI   TYPEINST,C'I'       IS THIS AN INITIAL TYPE INSTALL      00209100
         BNE   D0180               NO - CHK FOR UPDATE TYPE INSTALL     00209200
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00209300
         BNE   D0180               NO - CHK FOR ACTION CODE             00209400
         CLC   CDHDSCNM,=C'UPD'    IS THIS AN UPDATE SECTION            00209500
         BNE   D0400               NO - PROCESS AS NORMAL               00209600
*        SKIP TO NEXT SECTION IF TYPEINSTAL=INITIAL AND UPDATE SECTION  00209700
D0170    EQU   *                                                        00209800
         BAL   R14,DBLKREAD        READ INPUT FILE                      00209900
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00210000
         BNE   D0170               NO - LOOP TO NEXT SECTION HEADER     00210100
         B     D0030                                                    00210200
D0180    EQU   *                                                        00210300
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00210400
         BNE   D0400               NO - PROCESS RECORD        2601922   00210500
*        CHECK ACTION CODE ON DATA SET TO SEE IF I WANT IT              00210600
         CLI   CDHDACT,C' '        OLD STATIC ACTION CODE               00210700
         BNE   *+8                 NO                                   00210800
         MVI   CDHDACT,C'S'        SET NEW STATIC ACTION CODE           00210900
         TRT   CDHDACT,ACTTBL      ACTION SELECTED                      00211000
         BZ    D0300               NO - SKIP IT                         00211100
*        CHECK LANGUAGE CODE ON DATA SET TO SEE IF I WANT IT            00211200
         L     R4,=A(LANGTBL)      GET LANG TABLE ADDRESS     9713437   00211210
         CLI   0(R4),X'FE'   ANY LANGUAGE SELECTION CRITERIA  9713437   00211300
         BNL   D0200               NO - PROCESS DATA SET                00211400
D0190    EQU   *                                                        00211600
         CLC   CDHDTYPE,0(R4)      IS THIS LANGUAGE SELECTED            00211700
         BE    D0200               YES - PROCESS DATA SET               00211800
         LA    R4,5(0,R4)          BUMP TO NEXT TABLE ENTRY             00211900
         CLI   0(R4),X'FE'         END OF TABLE                         00212000
         BL    D0190               NO - LOOP BACK                       00212100
         B     D0300               YES - SKIP THIS DATA SET             00212200
*        CHECK PREFIX SELECT ON DATA SET TO SEE IF I WANT IT            00212300
D0200    EQU   *                                                        00212400
         CLI   SELPFXTB,X'FE'      ANY PREFIX SELECTS                   00212500
         BNL   D0400               NO                                   00212600
         SR    R1,R1               CLEAR R1                             00212700
         LA    R15,SELPFXTB        POINT TO PREFIX SELECT TABLE         00212800
D0210    EQU   *                                                        00212900
         IC    R1,0(0,R15)         GET PREFIX LENGTH                    00213000
         EX    R1,C0200CLC         DO I WANT THIS PREFIX                00213100
         BE    D0250               YES                        9914000   00213200
         LA    R15,8(0,R15)        BUMP TO NEXT PREFIX ENTRY            00213300
         CLI   0(R15),X'FE'        END OF TABLE                         00213400
         BL    D0210               NO - CHK THIS PREFIX                 00213500
         CLI   SELEXC,C'E'         EXCLUDE PREFIX             9914000   00213510
         BE    D0400               YES                        9914000   00213520
         B     D0300               NO - SKIP THE DATA SET               00213600
D0250    EQU   *                                              9914000   00213610
         CLI   SELEXC,C'E'         EXCLUDE PREFIX             9914000   00213620
         BE    D0300               YES, SKIP IT               9914000   00213630
         B     D0400               NO                         9914000   00213640
D0200CLC CLC   CDHDNAME(0),1(R15)                                       00213700
*        SKIP TO NEXT SECTION OR DATA SET IF ACTION FOR THIS DATA SET   00213800
*        IS NOT SELECTED                                                00213900
D0300    EQU   *                                                        00214000
         BAL   R14,DBLKREAD        READ INPUT FILE                      00214100
         CLC   CDEOSECT,SECTEND    IS IT END OF SECTION                 00214200
         BE    D0400               YES - PROCESS END OF SECTION         00214300
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00214400
         BNE   D0300               NO - LOOP TO NEXT DATA SET HEADER    00214500
         B     D0180                                                    00214600
D0400    EQU   *                                                        00214700
         BAL   R10,G0010           GO OUTPUT RECORD                     00214800
         CLC   CDEOSECT,SECTEND    IS IT END OF SECTION                 00214900
         BNE   D0025               NO - READ NEXT RECORD                00215000
         CP    SECTBLNO,=P'0'      ANY SECTIONS REMAINING TO SELECT     00215100
         BNE   D0012               YES - FIND NEXT SELECTED SECTION     00215200
         B     Z0010               NO - EOJ                             00215300
         EJECT                                                          00215400
*********************************************************************** 00215500
*        SELECT NAME PROCESSING                                         00215600
*********************************************************************** 00215700
E0010    EQU   *                                                        00215800
         CP    NAMTBLNO,=P'0'      ANY NAMES NOT SELECTED               00215900
         BE    Z0010               NO - EOJ                             00216000
         B     E0016               CHK FIRST SECTION HEADER             00216100
E0015    EQU   *                                                        00216200
         CLI   SKIPREAD,C'1'       IS SKIP READ SWITCH ON               00216300
         BE    E0016               YES - DON'T READ ONE RECORD          00216400
         BAL   R14,DBLKREAD        READ INPUT FILE                      00216500
E0016    EQU   *                                                        00216600
         MVI   SKIPREAD,C'0'       RESET SKIP READ SWITCH               00216700
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00216800
         BNE   E0020               NO                                   00216900
         MVC   WKSECTID,CDHDSCNM   SAVE SECTION NAME                    00217000
         MVC   SVSECTHD,CARDIN     SAVE SECTION HEADER CARD             00217100
         B     E0015                                                    00217200
E0020    EQU   *                                                        00217300
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00217400
         BNE   E0015               NO                                   00217500
         L     R3,NAMTBLAD         GET ADDR OF NAME TABLE               00217600
E0030    EQU   *                                                        00217700
         CLI   0(R3),X'FF'         END OF TABLE                         00217800
         BE    E0015               YES - DONT WANT THIS NAME            00217900
         CLC   CDHDNAME,0(R3)      WANT THIS NAME                       00218000
         BE    E0040               YES                                  00218100
         A     R3,NAMTBLLN         BUMP TO NEXT TABLE ENTRY             00218200
         B     E0030                                                    00218300
E0040    EQU   *                                                        00218400
         SP    NAMTBLNO,=P'1'      SUB FROM NO. ACTIVE ENTRIE 2602137   00218410
         CLI   SELTYPE,C'T'        ARE WE USING TABLE SELECT            00218500
         BNE   E0041               NO                                   00218600
         CLI   19(R3),X'00'        SKIP THIS ENTRY?           2602137   00218610
         BE    E0015               YES - DONT WANT THIS NAME  2602137   00218620
         MVC   SAVNMTBL,0(R3)      SAVE TABLE ENTRY                     00218700
         CLC   SVNMSECT(2),=C'SP'  DUMMY IU SECTION           2024126   00218710
         BNE   E0041               NO, CONTINUE               2024126   00218720
         MVC   SVNMSECT,=C'DTA'    ACTUAL SECTION IS DTA      2024126   00218730
E0041    EQU   *                                                        00218800
         CLC   WKSECTID,SVSECTID   SAME SECTION AS LAST DSN             00219000
         BE    E0080               YES                                  00219100
         CLC   SVSECTID,SPACES     ANY PREVIOUS SECTION                 00219200
         BE    E0045               NO                                   00219300
E0042    EQU   *                                                        00219400
         MVC   CARDSAVE,CARDIN     SAVE INPUT CARD                      00219500
         MVC   CARDIN,SPACES                                            00219600
         MVC   CARDIN(L'SECTEND),SECTEND                                00219700
         BAL   R10,G0010           GENERATE SECTION END JCL             00219800
         MVC   CARDIN,CARDSAVE     RESTORE ORIGINAL INPUT CARD          00219900
         CLI   EOJFLAG,C'1'        WAS THIS AN EOJ PASS                 00220000
         BE    Z0020               YES                                  00220100
E0045    EQU   *                                                        00220200
         MVC   SVSECTID,WKSECTID                                        00220300
         MVC   CARDSAVE,CARDIN     SAVE INPUT CARD                      00220400
         MVC   CARDIN,SPACES       CLEAR INPUT AREA                     00220500
         MVC   CARDIN(L'SVSECTHD),SVSECTHD PUT SECT HDR IN INPUT AREA   00220600
         BAL   R10,G0010           PUT OUT SECTION HEADER JCL           00220700
         MVC   CARDIN,CARDSAVE     RESTORE ORIGINAL INPUT CARD          00220800
         B     E0080                                                    00220900
E0070    EQU   *                                                        00221000
         CLI   SKIPREAD,C'1'       IS SKIP READ SWITCH ON               00221100
         BE    E0080               YES - DON'T READ ONE RECORD          00221200
         BAL   R14,DBLKREAD        READ INPUT FILE                      00221300
E0080    EQU   *                                                        00221400
         MVI   SKIPREAD,C'0'       RESET SKIP READ SWITCH               00221500
         BAL   R10,G0010           PUT OUT DATA SET CARD                00221600
         CLC   CDEODSN,DSNEND      END OF DATA SET                      00221700
         BNE   E0070               NO                                   00221800
         CP    NAMTBLNO,=P'0'      ANY NAMES REMAINING                  00221900
         BNE   E0015               YES - GET NEXT NAME                  00222000
         B     Z0010               NO - EOJ                             00222100
         EJECT                                                          00222200
*********************************************************************** 00222300
*        GENERAL OUTPUT ROUTINE                                       * 00222400
*********************************************************************** 00222500
G0010    EQU   *                                                        00222600
         BAL   R1,PUSHSTAK         PUT RETURN ADDR IN STACK             00222700
         AIF   ('&SYSPARM' EQ 'EXIT').G0010                             00222800
         CLI   DIRFLAG,C'1'        ARE WE PRINTING A DIRECTORY          00222900
         BE    H0100               YES                                  00223000
         MVI   OUTPTFLG,C'1'       SET OUTPUT CREATED FLAG              00223100
.G0010   ANOP                                                           00223200
*********************************************************************** 00223300
*        CHECK FOR SECTION AND DATA SET HEADERS AND TRAILERS          * 00223400
*********************************************************************** 00223500
         CLI   CARDIN,C'*'         COULD THIS BE A HEADER/TRAILER CARD  00223600
         BNE   G0020               NO                                   00223700
         LA    R10,G0200           SET RETURN ADDR FOR HDRS AND TRLRS   00223800
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00223900
         BE    GSH010              YES                                  00224000
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00224100
         BE    GDH010              YES                                  00224200
         CLC   CDEODSN,DSNEND      IS THIS A DATA SET TRAILER           00224300
         BE    GDT010              YES                                  00224400
         CLC   CDEOSECT,SECTEND    IS THIS A SECTION TRAILER            00224500
         BE    GST010              YES                                  00224600
*********************************************************************** 00224700
*        PROCESS DETAIL RECORDS                                       * 00224800
*********************************************************************** 00224900
G0020    EQU   *                                                        00225000
         CLI   NODTAFLG,C'1'       IS NODATA FLAG ON                    00225100
         BE    G0200               YES - SKIP DETAIL OUTPUT             00225200
         ICM   R1,B'1111',WKSCVRAD GET VER/REP TABLE POINTER            00225300
         BZ    G0050               BR IF NO POINTER                     00225400
G0030    EQU   *                                                        00225500
         SR    R15,R15             CLEAR LENGTH REGISTER                00225600
         IC    R15,3(0,R1)         GET COMPARE/MOVE LENGTH              00225700
         EX    R15,VERCOMP         EXECUTE VERIFY COMPARE               00225800
         BNE   G0040               DO NOT MOVE IF NOT EQUAL             00225900
         EX    R15,VERMOVE         EXECUTE REPLACE MOVE                 00226000
         MVI   VRFLAG,C'2'         INDICATE VER/REP DATA USED           00226100
G0040    EQU   *                                                        00226200
         LA    R1,VRTBLNG(0,R1)    BUMP TO NEXT V/R TABLE ENTRY         00226300
         CLC   0(3,R1),=C'ALL'     IS IT 'ALL' VER/REP                  00226400
         BE    G0030               YES - CHECK NEXT VER/REP             00226500
         CLC   WKSECTYP,0(R1)      IS IT THE SAME SECTION               00226600
         BE    G0030               YES - CHECK NEXT VER/REP             00226700
G0050    EQU   *                                                        00226800
         CLC   SVSECTNM,=CL3'CTC' IS MEMBER IN THE CTC SECTION          00226900
         BE    G0055              YES - CHECK FILTER OPTION             00227000
         CLC   SVSECTNM,=CL3'CPY' IS MEMBER IN THE CPY SECTION          00227100
         BE    G0055              YES - CHECK FILTER OPTION             00227200
         CLC   SVSECTNM,=CL3'COM' IS MEMBER IN THE COM SECTION          00227300
         BE    G0055              YES - CHECK FILTER OPTION   9713161   00227310
         CLC   SVSECTNM,=CL3'PGM' IN THE PGM SECTION?         9713161   00227320
         BE    G0055              YES - CHECK FILTER OPTION   9713161   00227330
         CLC   SVSECTNM,=CL3'REL' IN THE REL SECTION?         9713161   00227340
         BE    G0055              YES - CHECK FILTER OPTION             00227400
         B     G0150              NO  - NO FILTERING                    00227500
G0055    EQU   *                                                        00227600
         CLC   COB2NAME,CDSVNAME  SAME NAME AS BEFORE                   00227700
         BE    G0070              YES                                   00227800
         MVC   COB2NAME,CDSVNAME  SAVE NAME                             00227900
         MVI   COB2FLAG,C'0'      RESET COBOL II FLAG                   00228000
         CLC   CDSVTYPE,=C'ANSCB' IS THIS A COBOL MODULE                00228100
         BE    G0060              YES                                   00228200
         CLC   CDSVTYPE,=C'COBOL' IS THIS A COBOL MODULE                00228300
         BE    G0060              YES                                   00228400
         CLC   CDSVTYPE,=C'COBVS' IS THIS A COBOL MODULE                00228500
         BE    G0060              YES                                   00228600
         CLC   CDSVTYPE,=C'COBII' IS THIS A COBOL MODULE                00228700
         BE    G0060              YES                                   00228800
         CLC   CDSVTYPE,=C'COB12' IS THIS A COBOL MODULE                00228900
         BE    G0060              YES                                   00229000
         CLC   CDSVTYPE,=C'COPYC' IS THIS A COBOL COPY BOOK             00229100
         BNE   G0150              NO                                    00229200
G0060    EQU   *                                                        00229300
         CLI   COB2PROC,C'2'                                            00229600
         BNE   G0070                                          2024183   00229700
         MVI   COB2FLAG,C'1'      SET COBOL II FILTER FLAG              00229800
G0070    EQU   *                                                        00229900
         CLI   COB2FLAG,C'1'      WANT COBOL II FILTER                  00230000
         BNE   G0150              NO                                    00230100
         CLC   CARDIN+1(3),=CL3'CBL'  IS THIS A CBL CARD                00230200
         BE    G0150              YES - PASS IT ON                      00230300
         CLI   CARDIN+6,C'1'      WANT ONLY RECORDS WITH A 1 OR A 2     00230400
         BL    G0150                 IN COLUMN 7                        00230500
         BE    G0130                                          2024183   00230600
         CLI   CARDIN+6,C'2'                                            00230700
         BNE   G0150                                          2024183   00230900
         MVI   CARDIN+6,C' '      SPACE OUT COL 7                       00231900
         B     G0150                                                    00232000
G0130    EQU   *                                                        00232100
         MVI   CARDIN+6,C'*'      MAKE CARD A COMMENT                   00232200
G0150    EQU   *                                                        00232300
         AIF   ('&SYSPARM' NE 'EXIT').G0190                             00232400
         AIF   (NOT &PAN OR '&SYSPARM' NE 'EXIT').G0180                 00232500
*********************************************************************** 00232600
*        PANVALET EXIT - CHECK FOR PANVALET OR JCL STATEMENTS         * 00232700
*********************************************************************** 00232800
         CLC   CARDIN(2),=C'++'    IS IT A PANVALET COMMAND             00232900
         BE    G0170               YES                                  00233000
         CLC   CARDIN(2),=C'--'    IS IT A PANVALET COMMAND             00233100
         BE    G0170               YES                                  00233200
         CLC   CARDIN(2),=C'//'    IS IT A //                           00233300
         BE    G0170               YES                                  00233400
         CLC   CARDIN(2),=C'/*'    IS IT A /*                           00233500
         BE    G0170               YES                                  00233600
         CLC   CARDIN(2),=C'/&&'   IS IT A /&&                          00233700
         BE    G0170               YES                                  00233800
         CLC   CARDIN(4),=C'* $$'  IS IT A POWER COMMAND                00233900
         BE    G0170               YES                                  00234000
         B     G0180                                                    00234100
G0170    EQU   *                                                        00234200
         MVI   CARDIN,C'$'         CHANGE FIRST CHAR TO A DOLLAR SIGN   00234300
G0180    EQU   *                                                        00234400
         AGO   .G0190                                                   00234500
.G0180   ANOP                                                           00234600
         AIF   (NOT &LIB OR '&SYSPARM' NE 'EXIT').G0190                 00234700
*********************************************************************** 00234800
*        LIBRARIAN EXIT - CHECK FOR LIBRARIAN OR JCL STATEMENTS       * 00234900
*********************************************************************** 00235000
         CLI   CARDIN,C'-'         IS IT A LIBRARIAN COMMAND            00235100
         BNE   G0190               NO                                   00235200
         MVI   CARDIN,C'='         CHANGE FIRST CHAR TO EQUAL SIGN      00235300
G0190    EQU   *                                                        00235400
.G0190   ANOP                                                           00235500
         LA    R0,CARDIN           POINT TO OUTPUT RECORD               00235600
         BAL   R10,GOUT010         OUTPUT CARD                          00235700
G0200    EQU   *                                                        00235800
         BAL   R15,POPSTAK         RETURN                               00235900
         SPACE 3                                                        00236000
VERCOMP  CLC   CARDIN(0),4(R1)     EXECUTED COMPARE FOR VERIFY          00236100
VERMOVE  MVC   CARDIN(0),14(R1)    EXECUTED MOVE FOR REPLACE            00236200
         EJECT                                                          00236300
*********************************************************************** 00236400
*        GENERATE SECTION HEADER JCL                                  * 00236500
*********************************************************************** 00236600
GSH010   EQU   *                                                        00236700
         BAL   R1,PUSHSTAK         PUT RETURN ADDR IN STACK             00236800
         MVC   SVSECTHD,CARDIN     SAVE SECTION HEADER                  00236900
         MVC   WKSECTYP,CDHDSCNM   SAVE SECTION ID                      00237000
         MVC   SVSECTID,CDHDSCNM   SAVE SECTION ID                      00237100
         L     R4,SECTBLAD         GET ADDR SECTION TABLE               00237200
         AIF   ('&SYSPARM' EQ 'EXIT').GSH020                            00237300
         ZAP   DSCNT,=P'0'         ZERO DATA SET COUNTER                00237400
.GSH020  ANOP                                                           00237500
GSH020   EQU   *                                                        00237600
         CLI   0(R4),X'FF'         END OF TABLE                         00237700
         BE    Z9080               YES - ERROR                          00237800
         CLC   CDHDSCNM,0(R4)      IS THIS THE RIGHT SECTION            00237900
         BE    GSH030              YES                                  00238000
         LA    R4,SECTBLNG(0,R4)   BUMP TO NEXT TABLE ENTRY             00238100
         B     GSH020                                                   00238200
GSH030   EQU   *                                                        00238300
         MVC   WKSECTBL,0(R4)      MOVE TABLE ENTRY TO WORK AREA        00238400
         L     R4,WKSCSHAD         POINT TO SECTION HEADER JCL          00238500
         MVC   WKJCLTYP,=C'SH'     INDICATE SECTION HEADER JCL          00238600
         B     GCM010              GO TO COMMON OUTPUT ROUTINE          00238700
         SPACE 3                                                        00238800
*********************************************************************** 00238900
*        GENERATE SECTION TRAILER JCL                                 * 00239000
*********************************************************************** 00239100
GST010   EQU   *                                                        00239200
         BAL   R1,PUSHSTAK         PUT RETURN ADDR IN STACK             00239300
         L     R4,WKSCSTAD         POINT TO SECTION TRAILER JCL         00239400
         MVC   WKJCLTYP,=C'ST'     INDICATE SECTION TRAILER JCL         00239500
         B     GCM010              GO TO COMMON OUTPUT ROUTINE          00239600
         EJECT                                                          00239700
*********************************************************************** 00239800
*        GENERATE DATA SET HEADER JCL                                 * 00239900
*********************************************************************** 00240000
GDH010   EQU   *                                                        00240100
         MVC   SVDSNHD,CARDIN      SAVE DSN HEADER CARD                 00240200
         MVC   SVDSNHD2,SPACES                                          00240300
         MVC   SVDSNHD3,SPACES                                          00240400
         MVC   SVDSNHD4,SPACES                                          00240500
         MVC   SVDSNHD5,SPACES                                          00240600
GDH020   EQU   *                                                        00240700
         BAL   R14,DBLKREAD        READ INPUT FILE                      00240800
         CLC   CARDIN(4),DSNKEY    IS THIS A DSN HEADER X RECORD        00240900
         BNE   GDH030              NO                                   00241000
         TM    CARDIN+4,X'F0'      IS THIS A DSN HEADER X RECORD        00241100
         BNO   GDH030              NO                                   00241200
         CLI   CARDIN+5,C'='       IS THIS A DSN HEADER X RECORD        00241300
         BNE   GDH030              NO                                   00241400
         PACK  DBLWORD,CARDIN+4(1) PACK DSN HEADER NUMBER               00241500
         CVB   R1,DBLWORD          CONVERT IT TO BINARY                 00241600
         MH    R1,=H'80'           MULTIPLY BY 80                       00241700
         LA    R1,SVDSNHD-80(R1)   POINT TO DSN HEADER SAVE AREA        00241800
         MVC   0(80,R1),CARDIN     SAVE DSN HEADER X RECORD             00241900
         B     GDH020                                                   00242000
GDH030   EQU   *                                                        00242100
         MVI   SKIPREAD,C'1'       SET SKIP READ FLAG                   00242200
         MVI   NODTAFLG,C'0'       RESET NODATA FLAG                    00242300
         AIF   ('&SYSPARM' EQ 'EXIT').GDH040                            00242400
         CLI   NOHDGFLG,C'1'       IS NO-HEADING FLAG ON                00242500
         BE    GDH040              YES - DO NOT FORCE TOP OF PAGE       00242600
         ZAP   LINECTR,=P'999'     FORCE TOP OF PAGE                    00242700
GDH040   EQU   *                                                        00242800
.GDH040  ANOP                                                           00242900
         BAL   R1,PUSHSTAK         PUT RETURN ADDR IN STACK             00243000
         AIF   ('&SYSPARM' EQ 'EXIT').GDH090                            00243100
         AIF   ('&OPSYS' EQ 'VSE').GDH045                               00243200
         MVC   PDSNAME,CDSVNAME    PUT DSN IN PDS HEADER                00243300
         CLI   SELTYPE,C'T'        ARE WE DOING A TABLE SELECT          00243400
         BNE   GDH045              NO                                   00243500
         CLI   SVNEWNAM,C' '       ANY RENAME FIELD                     00243600
         BE    GDH045              NO - USE ORIGINAL NAME               00243700
         CLC   SVNMSECT,WKSCID     IS THIS THE RIGHT SECTION            00243800
         BNE   GDH045              NO - USE ORIGINAL NAME               00243900
         MVC   PDSNAME,SVNEWNAM    SET NEW NAME                         00244000
GDH045   EQU   *                                                        00244100
.GDH045  ANOP                                                           00244200
         CLI   OUTDEV,C'S'         IS OUTPUT A PDS OR SUBLIBRARY        00244300
         BE    GDH090              YES - DONT CHECK FOR BREAK           00244400
         CP    DSCNT,DSCUTOFF      ARE WE AT THE DATA SET CUTOFF LIMIT  00244500
         BE    GDH060              YES - CLOSE GROUP                    00244600
         CP    DSCNT,DSLIMIT       ARE WE AT THE DATA SET LIMIT         00244700
         BE    GDH060              YES - CLOSE GROUP                    00244800
         AP    DSCNT,=P'1'         ADD 1 TO DATA SET COUNTER            00244900
         CLI   TPLIMFLG,C'1'       WAS A TPLIMIT CARD ENTERED           00245000
         BNE   GDH090              NO - DON'T BREAK OUTPUT STREAM       00245100
         PACK  WKSTMT,CDSVSTMT     GET NO. STMTS FROM HEADER            00245200
         AP    WKSTMT,TPSTMT       WILL THIS DATA SET GO OVER LIMIT     00245300
         CP    WKSTMT,TPLIMIT         FOR MAX. NO. CARDS                00245400
         BNH   GDH090              NO                                   00245500
GDH060   EQU   *                                                        00245600
         BAL   R10,GST010          PUT OUT SECTION TRAILER JCL          00245700
         CP    DSCNT,DSCUTOFF      ARE WE AT THE DATA SET CUTOFF LIMIT  00245800
         BE    Z0020               YES - GO TO EOJ                      00245900
         BAL   R10,GEND010         PUT OUT END JCL                      00246000
         AIF   ('&OPSYS' NE 'VSE').GDH080                               00246100
         CLI   OUTDEV,C'T'         IS OUTPUT A TAPE                     00246200
         BNE   GDH070              NO - DON'T CLOSE AND OPEN OUTPUT     00246300
         L     R1,OUTFILAD         GET OUTPUT TAPE FILE ADDR            00246400
         CLOSE (1)                 CLOSE TAPE FILE                      00246500
         L     R14,TAPEOUAD        GET TAPEOUT DTF ADDR                 00246600
         L     R15,TAPESVAD        GET TAPESAVE ADDR                    00246700
         MVC   0(TAPELNG,R14),0(R15) RESTORE TAPE DTF                   00246800
         L     R1,OUTFILAD         GET OUTPUT TAPE FILE ADDR            00246900
         OPEN  (1)                 OPEN NEW TAPE                        00247000
         AP    NOTPOUT,=P'1'       ADD 1 TO NO. OF TAPES OUTPUT         00247100
         B     GDH080                                                   00247200
GDH070   EQU   *                                                        00247300
         CLI   OUTDEV,C'P'         IS OUTPUT A PUNCH                    00247400
         BNE   GDH080              NO                                   00247500
         CLI   SEGFLAG,C'1'        DO I WANT TO SEGMENT                 00247600
         BNE   GDH080              NO                                   00247700
         BAL   R10,GSEG010         PUT OUT NEW PUN CARD                 00247800
.GDH080  ANOP                                                           00247900
GDH080   EQU   *                                                        00248000
         ZAP   TPSTMT,=P'0'        RESET NO. OF STMTS COUNTER           00248100
         BAL   R10,GBEG010         GENERATE BEGIN STATEMENTS            00248200
         MVC   CARDSAVE,CARDIN     SAVE INPUT CARD                      00248300
         MVC   CARDIN,SPACES       CLEAR INPUT AREA                     00248400
         MVC   CARDIN(L'SVSECTHD),SVSECTHD PUT SECT HDR IN INPUT AREA   00248500
         MVC   WKSECTYP,CDHDSCNM   RESTORE WORK SECTION TYPE            00248600
         BAL   R10,GSH010          PUT OUT SECTION HEADER JCL           00248700
         MVC   CARDIN,CARDSAVE     RESTORE INPUT CARD                   00248800
         ZAP   DSCNT,=P'1'         MOVE 1 TO DATA SET COUNTER           00248900
.GDH090  ANOP                                                           00249000
GDH090   EQU   *                                                        00249100
         AIF   ('&OPSYS' EQ 'MVS').GDH095                     2024183   00249110
         AIF   (NOT &LIBRM).GDH095                                      00249200
         CLI   OUTDEV,C'S'         IS OUTPUT A SUBLIBRARY               00249300
         BE    GDH100              YES                                  00249400
GDH095   EQU   *                                                        00249500
.GDH095  ANOP                                                           00249600
         L     R4,WKSCDHAD         POINT TO DATA SET HEADER JCL         00249700
         MVC   WKJCLTYP,=C'DH'     INDICATE DATA SET HEADER JCL         00249800
         B     GCM010              GO TO COMMON OUTPUT ROUTINE          00249900
         AIF   ('&OPSYS' EQ 'MVS').GDH150E                    2024183   00249910
         AIF   (NOT &LIBRM).GDH150E                                     00250000
GDH100   EQU   *                                                        00250100
         MVC   MEMNAME,CDSVNAME    MOVE NAME                            00250200
         CLI   SELTYPE,C'T'        ARE WE DOING A TABLE SELECT          00250300
         BNE   GDH105              NO                                   00250400
         CLI   SVNEWNAM,C' '       ANY RENAME FIELD                     00250500
         BE    GDH105              NO - USE ORIGINAL NAME               00250600
         CLC   SVNMSECT,WKSCID     IS THIS THE RIGHT SECTION            00250700
         BNE   GDH105              NO - USE ORIGINAL NAME               00250800
         MVC   MEMNAME,SVNEWNAM    SET NEW NAME                         00250900
GDH105   EQU   *                                                        00251000
         MVC   MEMTYPE,SPACES      CLEAR MEMBER TYPE                    00251100
         MVC   MEMTYPE(3),=CL3'SRC'     INDICATE SOURCE MEMBER          00251200
         MVC   MEMTYPE+3(3),SVSECTID    INDICATE SECTION ID             00251300
         CLC   CDSVTYPE,=C'COPYC'  IS THIS COBOL COPY                   00251400
         BE    GDH120              YES                                  00251500
         CLC   CDSVTYPE,=C'ANSCB'  IS THIS COBOL                        00251600
         BE    GDH120              YES                                  00251700
         CLC   CDSVTYPE,=C'COBOL'  IS THIS COBOL II                     00251800
         BE    GDH120              YES                                  00251900
         CLC   CDSVTYPE,=C'COPYA'  IS THIS ASSEMBLER COPY/MACRO         00252000
         BE    GDH140              YES                                  00252100
         CLC   CDSVTYPE,=C'ASMB '  IS THIS ASSEMBLER                    00252200
         BE    GDH140              YES                                  00252300
         B     GDH140                                                   00252400
GDH110   EQU   *                                                        00252500
         MVI   MEMTYPE+6,C'A'      SET ASSEMBLER MEMTYPE                00252600
         CLC   SVSECTID,=C'MAC'    IS THIS THE MACRO SECTION            00252700
         BNE   GDH140              NO                                   00252800
         CLC   CDSVTYPE,=C'OBJCT'  IS THIS AN OBJECT (EDECK)            00252900
         BNE   GDH140              NO                                   00253000
         MVI   MEMTYPE+6,C'O'      INDICATE AN EDECK                    00253100
         B     GDH140                                                   00253200
GDH120   EQU   *                                                        00253300
         MVI   MEMTYPE+6,C'C'      SET COBOL MEMTYPE                    00253400
         CLC   CDSVTYPE,=C'COBOL'  IS THIS COBOL II                     00253500
         BNE   GDH140              NO                                   00253600
         MVI   MEMTYPE+7,C'2'      SET COBOL II MEMTYPE                 00253700
GDH140   EQU   *                                                        00253800
         LA    IALCBR1,LIBRDCB     POINT TO LIBR CONTROL BLOCK          00253900
         USING INLCIALC,IALCBR1                                         00254000
         CLI   REPOPTN,C'Y'        DO I REPLACE MEMBERS                 00254100
         BE    GDH150              YES                                  00254200
         LIBRM OPEN,TYPEFLE=(OUTPUT,NOREPLACE),LDCB=LIBRDCB             00254300
         B     GDH095                                                   00254400
GDH150   EQU   *                                                        00254500
         LIBRM OPEN,TYPEFLE=(OUTPUT,REPLACE),LDCB=LIBRDCB               00254600
         B     GDH095                                                   00254700
.GDH150E ANOP                                                           00254800
         EJECT                                                          00254900
*********************************************************************** 00255000
*        GENERATE DATA SET TRAILER JCL                                * 00255100
*********************************************************************** 00255200
GDT010   EQU   *                                                        00255300
         BAL   R1,PUSHSTAK         PUT RETURN ADDR IN STACK             00255400
         AIF   ('&SYSPARM' EQ 'EXIT').GDT011                            00255500
         AIF   ('&OPSYS' EQ 'MVS').GDT010                     2024183   00255550
         AIF   (NOT &LIBRM).GDT011                            2024183   00255600
.GDT010  ANOP                                                 2024183   00255650
         CLI   OUTDEV,C'S'         IS OUTPUT A PDS OR SUBLIB            00255700
         BNE   GDT011              NO                                   00255800
         LA    R10,GDT020          POINT RETURN TO GDT020 TO FINISH PDS 00255900
         BAL   R1,PUSHSTAK         PUT RETURN ADDR IN STACK             00256000
GDT011   EQU   *                                                        00256100
.GDT011  ANOP                                                           00256200
         L     R4,WKSCDTAD         POINT TO DATA SET TRAILER JCL        00256300
         MVC   WKJCLTYP,=C'DT'     INDICATE DATA SET TRAILER JCL        00256400
         B     GCM010              GO TO COMMON OUTPUT ROUTINE          00256500
         AIF   ('&OPSYS' EQ 'VSE').GDT050                               00256600
         AIF   ('&SYSPARM' EQ 'EXIT').GDT999E                           00256700
GDT020   EQU   *                   RETURN HERE WHEN OUTPUT IS A PDS     00256800
         MVC   PRTBUF,PRTCLR                                  9913407   00256810
         MVI   PRTCTL,X'09'        PRINT AND SPACE            9913407   00256820
         MVC   PRTLNE(8),PDSNAME                              9913407   00256830
         BAL   R14,PUTPRT          PRINT MESSAGE              9913407   00256840
         L     R0,PDSBUFPT         GET PDS BUFFER POINTER               00256900
         S     R0,PDSBUFAD         SUBTRACT PDS BUFFER ADDR             00257000
         BZ    GDT025              IF ZERO DONT NEED TO WRITE SHORT BLK 00257100
         L     R1,PDSOUTAD         GET ADDR OF PDS DCB                  00257200
         STH   R0,DCBBLKSI         PUT SHORT BLKSIZE INTO DCB           00257300
         L     R2,PDSBUFAD         GET PDS BUFFER ADDR                  00257400
         WRITE PDSDECB1,SF,PDSOUT,(2),'S' WRITE PDS BUFFER              00257500
         CHECK PDSDECB1                   WAIT FOR COMPLETION           00257600
GDT025   EQU   *                                                        00257700
         L     R1,PDSOUTAD         GET ADDR OF PDS DCB                  00257800
         CLI   REPOPTN,C'Y'        REPLACE=YES OPTION                   00257900
         BE    GDT030              YES                                  00258000
         STOW  (1),PDSNAME,A       CLOSE OUT THE PDS MEMBER             00258100
         B     GDT040                                                   00258200
GDT030   EQU   *                                                        00258300
         STOW  (1),PDSNAME,R       CLOSE OUT THE PDS MEMBER             00258400
GDT040   EQU   *                                                        00258500
         CH    R15,=H'8'           ANY ERROR WITH STOW                  00258600
         BH    Z9230               YES                                  00258700
         MVC   PDSBUFPT,PDSBUFAD   RESET BUFFER POINTER                 00258800
         MVC   PDSREMLN,PDSMAXBK   RESET REMAINING LENGTH               00258900
         L     R1,PDSOUTAD         GET ADDR OF PDS DCB                  00259000
         MVC   DCBBLKSI,PDSMAXBK   RESTORE MAX BLOCK SIZE               00259100
         BAL   R15,POPSTAK         RETURN                               00259200
         AGO   .GDT999E                                                 00259300
.GDT050  ANOP                                                           00259400
         AIF   ('&OPSYS' EQ 'MVS').GDT999E                    2024183   00259450
         AIF   (NOT &LIBRM).GDT999E                                     00259500
GDT020   EQU   *                   RETURN HERE WHEN OUTPUT IS A SUBLIB  00259600
         LIBRM CLOSE,LDCB=LIBRDCB                                       00259700
         BAL   R15,POPSTAK         RETURN                               00259800
.GDT999E ANOP                                                           00259900
         SPACE 3                                                        00260000
*********************************************************************** 00260100
*        GENERATE BEG JCL                                             * 00260200
*********************************************************************** 00260300
GBEG010  EQU   *                                                        00260400
         BAL   R1,PUSHSTAK         PUT RETURN ADDR IN STACK             00260500
         L     R4,SECTBLAD         GET SECTION TABLE ADDR               00260600
         SH    R4,=H'4'            BACK UP TO BEG OFFSET                00260700
         AH    R4,0(0,R4)          BUMP TO BEG JCL SECTION              00260800
         L     R4,4(0,R4)          LOAD BEG JCL POINTER                 00260900
         MVC   WKSECTYP,=C'BEG'    INDICATE BEG JCL                     00261000
         MVC   WKJCLTYP,=C'BEG'    INDICATE BEG JCL                     00261100
         B     GCM010              GO TO COMMON OUTPUT ROUTINE          00261200
         SPACE 3                                                        00261300
*********************************************************************** 00261400
*        GENERATE END JCL                                             * 00261500
*********************************************************************** 00261600
GEND010  EQU   *                                                        00261700
         BAL   R1,PUSHSTAK         PUT RETURN ADDR IN STACK             00261800
         L     R4,SECTBLAD         GET SECTION TABLE ADDR               00261900
         SH    R4,=H'4'            BACK UP TO BEG OFFSET                00262000
         AH    R4,2(0,R4)          BUMP TO END JCL SECTION              00262100
         L     R4,4(0,R4)          LOAD END JCL POINTER                 00262200
         MVC   WKSECTYP,=C'END'    INDICATE END JCL                     00262300
         MVC   WKJCLTYP,=C'END'    INDICATE END JCL                     00262400
         B     GCM010              GO TO COMMON OUTPUT ROUTINE          00262500
         EJECT                                                          00262600
*********************************************************************** 00262700
*        COMMON SH, ST, DH, DT OUTPUT PROCESSING                      * 00262800
*********************************************************************** 00262900
GCM010   EQU   *                                                        00263000
         LA    R15,GCM010          TELL POPSTAK  WHERE I WAS            00263100
         LTR   R4,R4               ANY JCL TO BE GENERATED              00263200
         BZ    POPSTAK             NO - RETURN                          00263300
         CLC   9(6,R4),=C'NODATA'  IS THIS A NODATA CONTROL CARD        00263400
         BE    GCM135              YES - SET NODATA FLAG AND RETURN     00263500
GCM015   EQU   *                                                        00263600
         LA    R5,9(0,R4)          POINT TO BEGINNING OF PROTOTYPE JCL  00263700
         LA    R6,CARDWORK         POINT TO OUTPUT AREA                 00263800
         MVC   CARDWORK,SPACES     CLEAR OUTPUT AREA                    00263900
         MVC   CARDWORK+71(1),71(R4) MOVE COL. 72 TO OUTPUT AREA        00264000
         LA    R7,61               SET INITIAL SCAN LENGTH (62 BYTES)   00264100
         LA    R10,70              SET LIMIT FOR OUTPUT LNG (71 BYTES)  00264200
GCM020   EQU   *                                                        00264300
         SR    R1,R1               CLEAR R1                             00264400
         EX    R7,GCMSCAN          SCAN FOR DELIMITER                   00264500
         BZ    GCM110              NO DELIMITER FOUND                   00264600
GCM030   EQU   *                                                        00264700
         LR    R8,R1               GET SCAN HIT ADDR                    00264800
         SR    R8,R5               CALC LNG OF FIELD BEFORE VARIABLE    00264900
         LTR   R8,R8               CHK FOR ZERO LENGTH                  00265000
         BZ    GCM035              DON'T MOVE ANYTHING IF NO LENGTH     00265100
         BCTR  R8,0                SUBTRACT 1 FOR EXECUTE               00265200
         CR    R8,R10              IS REM OUT LNG LESS THAN INP LNG     00265300
         BNH   GCM031              NO                                   00265400
         LR    R8,R10              YES - FORCE TO REM OUT LNG           00265500
GCM031   EQU   *                                                        00265600
         EX    R8,GCMMOVE1         MOVE FIELD BEFORE VARIABLE NAME      00265700
         SR    R10,R8              SUBTRACT FROM REMAINING OUTPUT LNG   00265800
         BCTR  R10,0                                                    00265900
         LTR   R10,R10             ANY LENGTH LEFT IN OUTPUT CARD       00266000
         BM    GCM120              NO - PUT OUT CARD                    00266100
         LA    R6,1(R8,R6)         BUMP UP TO OUTPUT FIELD              00266200
GCM035   EQU   *                                                        00266300
         SR    R7,R8               ADJUST REMAINING SCAN LENGTH         00266400
         BCTR  R7,0                                                     00266500
         LR    R5,R1               POINT INPUT ADDR TO SCAN HIT ADDR    00266600
         LA    R3,KEYWDTBL         GET ADDR OF KEYWORD TABLE            00266700
GCM040   EQU   *                                                        00266800
         SR    R9,R9                                                    00266900
         IC    R9,0(0,R3)          GET COMPARE LENGTH                   00267000
         EX    R9,GCMCLC           IS THIS THE RIGHT VARIABLE NAME      00267100
         BE    GCM050              YES                                  00267200
         LA    R3,16(0,R3)         BUMP TO NEXT TABLE ENTRY             00267300
         CLI   0(R3),X'FF'         END OF TABLE                         00267400
         BNE   GCM040              NO                                   00267500
         STC   R2,0(0,R6)          MOVE DELIMITER CHAR TO OUTPUT CARD   00267600
         LA    R6,1(0,R6)          POINT TO NEXT OUTPUT POSITION        00267700
         LA    R5,1(0,R5)          POINT TO NEXT SCAN POSITION          00267800
         BCTR  R7,0                ADJUST REMAINING LENGTH              00267900
         BCTR  R10,0                                                    00268000
         B     GCM020              SCAN AGAIN                           00268100
GCM050   EQU   *                                                        00268200
         LA    R5,2(9,R5)          BUMP OVER VARIABLE NAME              00268300
         SR    R7,R9               ADJUST REMAINING SCAN LENGTH         00268400
         BCTR  R7,0                                                     00268500
         BCTR  R7,0                                                     00268600
         IC    R9,12(0,R3)         GET MOVE LENGTH                      00268700
         MVC   GCM055BD(2),14(R3)  GET FROM FIELD BASE/DISP FROM TABLE  00268800
GCM055   LA    R15,0               GET FROM ADDR - BASE/DISP IS ALTERED 00268900
GCM055BD EQU   *-2                 BASE/DISP FIELD OF PREV INSTRUCTION  00269000
         CLI   12(R3),X'FF'        IS THIS A SPECIAL PROCESSING FIELD   00269100
         BER   15                  YES - BRANCH TO ROUTINE              00269200
GCM060   EQU   *                                                        00269300
         LTR   R15,R15             ANY FIELD TO BE INSERTED             00269400
         BZ    GCM100              NO                                   00269500
         CR    R9,R10              IS FIELD TOO LONG TO FIT             00269600
         BNH   GCM070              NO - MOVE FIELD                      00269700
         LR    R9,R10              FORCE FIELD TO REMAINING LNG         00269800
GCM070   EQU   *                                                        00269900
         EX    R9,GCMMOVE2         MOVE FIELD TO OUTPUT                 00270000
         LA    R6,1(R9,R6)         BUMP TO NEW OUTPUT POSITION          00270100
         SR    R10,R9              CALC NEW AVAILABLE OUTPUT LENGTH     00270200
         BCTR  R10,0                                                    00270300
         CLI   0(R5),C' '          WAS POSITION AFTER KEYWORD A SPACE   00270400
         BE    GCM100              YES - DON'T BACKUP OVER TRAIL BLNKS  00270500
GCM080   EQU   *                                                        00270600
         BCTR  R6,0                BACKUP OVER TRAILING SPACES          00270700
         CLI   0(R6),C' '          IS THIS A SPACE                      00270800
         BNE   GCM090              NO - BUMP UP ONE POSITION            00270900
         LA    R10,1(0,R10)        ADD ONE TO OUTPUT AVAILABLE LNG      00271000
         B     GCM080                                                   00271100
GCM090   EQU   *                                                        00271200
         LA    R6,1(0,R6)          BUMP UP ONE POSITION FOR NON-SPACE   00271300
GCM100   EQU   *                                                        00271400
         LTR   R7,R7               ANY LENGTH LEFT IN PROTOTYPE CARD    00271500
         BM    GCM120              NO - PUT OUT CARD                    00271600
         LTR   R10,R10             ANY LENGTH LEFT IN OUTPUT CARD       00271700
         BM    GCM120              NO - PUT OUT CARD                    00271800
         B     GCM020              YES - GET NEXT FIELD                 00271900
GCM110   EQU   *                                                        00272000
         CR    R7,R10              IS REM OUT LNG LESS THAN INP LNG     00272100
         BNH   GCM111              NO                                   00272200
         LR    R7,R10              YES - FORCE TO REM OUT LNG           00272300
GCM111   EQU   *                                                        00272400
         EX    R7,GCMMOVE1         MOVE REMAINDER OF CARD               00272500
GCM120   EQU   *                                                        00272600
         LA    R0,CARDWORK         POINT TO OUTPUT CARD                 00272700
         MVI   IOCODE,C'3'         INDICATE GENERATED CARD              00272800
         BAL   R10,GOUT020         WRITE OUTPUT CARD                    00272900
GCM130   EQU   *                                                        00273000
         LA    R4,80(0,R4)         BUMP TO NEXT JCL CARD                00273100
         CLC   0(5,R4),WKSECTYP    SAME SECTION AND JCL TYPES           00273200
         BE    GCM135              YES - CHECK FOR 'NODATA' CARD        00273300
         CLC   0(3,R4),=C'ALL'     IS THIS AN 'ALL' SECTION CARD        00273400
         BNE   GCM140              NO - RETURN                          00273500
         CLC   3(2,R4),WKJCLTYP    IS THIS THE SAME JCL TYPE            00273600
         BNE   GCM140              NO - RETURN                          00273700
GCM135   EQU   *                                                        00273800
         CLC   9(6,R4),=C'NODATA'  IS THIS A NODATA CONTROL CARD        00273900
         BNE   GCM015              NO - PROCESS THIS PROTOTYPE CARD     00274000
         MVI   NODTAFLG,C'1'       SET FLAG FOR NODATA                  00274100
GCM140   EQU   *                                                        00274200
         BAL   R15,POPSTAK         RETURN                               00274300
GCMSCAN  TRT   0(0,R5),SCANTBL                                          00274400
GCMMOVE1 MVC   0(0,R6),0(R5)                                            00274500
GCMMOVE2 MVC   0(0,R6),0(R15)                                           00274600
GCMCLC   CLC   1(0,R3),1(R1)                                            00274700
         SPACE 3                                                        00274800
*********************************************************************** 00274900
*        GENERAL RETURN TO PROCESSING ROUTINE                         * 00275000
*********************************************************************** 00275100
POPSTAK  EQU   *                                                        00275200
         ST    R15,STACKFRM        SAVE FROM ADDR FOR TRACING           00275300
         L     R15,STACKPTR        GET STACK POINTER                    00275400
         SH    R15,STACKLNG        BACK UP ONE ENTRY                    00275500
         ST    R15,STACKPTR        SAVE NEW STACK POINTER               00275600
         L     R10,0(0,R15)        LOAD RETURN ADDR                     00275700
         MVI   0(R15),X'FF'        INDICATE RETURN HAS BEEN TAKEN       00275800
         BR    R10                 BRANCH TO RETURN ADDR                00275900
         SPACE 3                                                        00276000
PUSHSTAK EQU   *                                                        00276100
         L     R15,STACKPTR        PUT RETURN ADDR IN STACK             00276200
         CLI   0(R15),X'FE'                                             00276300
         BNE   *+6                                                      00276400
         DC    X'0000'                                                  00276500
         ST    R10,0(0,R15)                                             00276600
         AH    R15,STACKLNG                                             00276700
         ST    R15,STACKPTR                                             00276800
         BR    R1                                                       00276900
         SPACE 3                                                        00277000
         AIF   ('&OPSYS' NE 'VSE').GOUT010                              00277100
         AIF   ('&SYSPARM' EQ 'EXIT').GOUT010                           00277200
*********************************************************************** 00277300
*        ISSUE POWER SEGMENT MACRO TO SEGMENT PUNCH OUTPUT            * 00277400
*********************************************************************** 00277500
GSEG010  EQU   *                                                        00277600
         MVC   GSEGSEG+10(8),CDSVNAME MAKE NEW SEGMENT NAME             00277700
GSEGSEG  SEGMENT DEVADDR=SYSPCH,JECL=PWRPUN,NAME=XXXXXXXX               00277800
         BR    R10                                                      00277900
.GOUT010 ANOP                                                           00278000
         EJECT                                                          00278100
*********************************************************************** 00278200
*        WRITE OUTPUT FILE                                            * 00278300
*********************************************************************** 00278400
GOUT010  EQU   *                                                        00278500
         MVI   IOCODE,C'1'         INDICATE BEFORE A WRITE              00278600
GOUT020  EQU   *                                                        00278700
         BAL   R1,PUSHSTAK         PUT RETURN ADDR IN STACK             00278800
         ST    R0,EXITPARM         SAVE ADDR OF RECORD                  00278900
         MVI   RTNCODE,C'N'        PRESET RETURN CODE TO NO             00279000
         LR    R14,R0              GET ADDR OF OUTPUT RECORD            00279100
         CLC   0(7,R14),=C'*EXITON' COMMAND TO TURN EXIT ON             00279200
         BNE   GOUT030             NO                                   00279300
         NI    GOUT030+1,X'0F'     SET NOP TO NOT BRANCH                00279400
         B     GOUT070             SKIP THIS CARD                       00279500
GOUT030  NOP   GOUT050                                                  00279600
         CLC   0(8,R14),=C'*EXITOFF'  COMMAND TO TURN EXIT OFF          00279700
         BNE   GOUT040               NO                                 00279800
         OI    GOUT030+1,X'F0'       SET NOP TO BRANCH                  00279900
         B     GOUT070               SKIP THIS CARD                     00280000
GOUT040  EQU   *                                                        00280100
         MVC   EXITSEC,SVSECTID    MOVE SECTION ID TO EXIT PARAMETERS   00280200
         ICM   R15,B'1111',DXITADDR GET DYNAMIC EXIT ROUTINE ADDR       00280300
         BZ    GOUT043             NO EXIT - DO NOT CALL                00280400
         LA    R1,EXITPARM         LOAD ADDRESS OF EXIT PARAMETERS      00280500
         BALR  R14,R15             CALL EXIT ROUTINE                    00280600
GOUT043  EQU   *                                                        00280700
         ICM   R15,B'1111',EXITADDR GET PERMANENT EXIT ROUTINE ADDR     00280800
         BZ    GOUT045             NO EXIT - DO NOT CALL                00280900
         LA    R1,EXITPARM         LOAD ADDRESS OF EXIT PARAMETERS      00281000
         BALR  R14,R15             CALL EXIT ROUTINE                    00281100
GOUT045  EQU   *                                                        00281200
         CLI   IOCODE,C'X'         EXIT SAID SKIP THIS OUTPUT RECORD    00281300
         BE    GOUT070             YES                                  00281400
GOUT050  EQU   *                                                        00281500
         LA    R15,GOUT050         TELL POPSTAK  WHERE I WAS            00281600
         CLI   IOCODE,C'0'         INITIAL CALL TO EXIT                 00281700
         BE    POPSTAK             YES - RETURN                         00281800
         CLI   IOCODE,C'9'         FINAL CALL TO EXIT                   00281900
         BE    POPSTAK             YES - RETURN                         00282000
         AIF   ('&SYSPARM' NE 'EXIT').GOUT060                           00282100
         L     R1,EXTIOCD          GET EXIT PARAMETERS ADDR             00282200
         L     R2,EXTIOREC         GET EXIT RECORD ADDR                 00282300
         LR    R14,R0              GET RECORD ADDR IN R14               00282400
         MVC   0(80,R2),0(R14)     MOVE RECORD TO EXITS RECORD AREA     00282500
         AIF   (&LIB AND '&SYSPARM' EQ 'EXIT').GOUT50L                  00282600
         USING PANCODES,R1                                    9913801   00282610
         MVI   PANIO1,C'A'         INDICATE USER INPUT RECORD           00282700
         DROP  R1                                             9913801   00282710
         AGO   .GOUT055                                                 00282800
.GOUT50L ANOP                                                           00282900
         MVI   1(R1),X'08'         INDICATE USER INSERT RECORD          00283000
.GOUT055 ANOP                                                           00283100
         STM   R2,R10,MYSAVEAR     SAVE MY REGISTERS                    00283200
         B     EXIT                                                     00283300
GOUT055  EQU   *                                                        00283400
         LM    R2,R10,MYSAVEAR     RELOAD MY REGISTERS                  00283500
         AGO   .GOUT070                                                 00283600
.GOUT060 ANOP                                                           00283700
         L     R1,OUTFILAD         GET OUTPUT FILE ADDR                 00283800
         CLI   OUTDEV,C'L'         IS THIS A PRINT OUTPUT               00283900
         BE    GOUT080             YES - SET UP FOR PRINT               00284000
         EJECT                                                          00284100
GOUT060  EQU   *                                                        00284200
         AIF   ('&OPSYS' EQ 'MVS').GOU060M                    2024183   00284250
         AIF   (NOT &LIBRM).GOU060E                           2024183   00284300
.GOU060M ANOP                                                 2024183   00284350
         CLI   OUTDEV,C'S'         IS THIS A PDS OR SUBLIB OUTPUT       00284400
         BNE   GOUT065             NO - DO A REGULAR PUT                00284500
         AIF   ('&OPSYS' NE 'MVS').GOU060V                              00284600
*********************************************************************** 00284700
*        WRITE TO PDS FILE                                            * 00284800
*********************************************************************** 00284900
         LR    R2,R0               GET ADDR OF RECORD                   00285000
         L     R15,PDSBUFPT        GET PDS BUFFER POINTER FOR NEXT REC  00285100
         MVC   0(80,R15),0(R2)     MOVE RECORD TO PDS BUFFER            00285200
         LA    R15,80(0,R15)       BUMP TO NEXT BUFFER POSITION         00285300
         ST    R15,PDSBUFPT        SAVE BUFFER POINTER                  00285400
         LH    R15,PDSREMLN        GET PDS BUFFER REMAINING LNG         00285500
         SH    R15,=H'80'          SUBTRACT LENGTH OF RECORD            00285600
         STH   R15,PDSREMLN        SAVE PDS BUFFER REMAINING LNG        00285700
         BP    GOUT066             IF BUFFER NOT FULL, DONT WRITE       00285800
         L     R2,PDSBUFAD         GET PDS OUTPUT BUFFER ADDR           00285900
         WRITE PDSDECB2,SF,PDSOUT,(2),'S'  WRITE PDS BUFFER             00286000
         CHECK PDSDECB2                    WAIT FOR I/O COMPLETION      00286100
         MVC   PDSBUFPT,PDSBUFAD   RESET BUFFER POINTER                 00286200
         MVC   PDSREMLN,PDSMAXBK   RESET REMAINING LENGTH               00286300
         B     GOUT066                                                  00286400
         AGO   .GOU060E                                                 00286500
.GOU060V ANOP                                                           00286600
*********************************************************************** 00286700
*        WRITE TO LIBR SUBLIBRARY                                     * 00286800
*********************************************************************** 00286900
         LIBRM PUT,LDCB=LIBRDCB                                         00287000
         B     GOUT066                                                  00287100
.GOU060E ANOP                                                           00287200
         SPACE 3                                                        00287300
*********************************************************************** 00287400
*        WRITE TO SEQUENTIAL FILE                                     * 00287500
*********************************************************************** 00287600
GOUT065  EQU   *                                                        00287700
.GOUT065 ANOP                                                           00287800
         PUT   (1),(0)                                                  00287900
GOUT066  EQU   *                                                        00288000
         AP    TPSTMT,=P'1'        ADD 1 TO NO. STMTS OUTPUT            00288100
.GOUT070 ANOP                                                           00288200
GOUT070  EQU   *                                                        00288300
         LA    R15,GOUT070         TELL POPSTAK  WHERE I WAS            00288400
         CLI   RTNCODE,C'Y'        DID EXIT WANT A RETURN               00288500
         BNE   POPSTAK             NO - RETURN TO CALLING ROUTINE       00288600
         MVI   IOCODE,C'2'         INDICATE AN EXIT REQUESTED RETURN    00288700
         L     R0,EXITPARM         RELOAD RECORD ADDR                   00288800
         B     GOUT020                                                  00288900
         AIF   ('&SYSPARM' EQ 'EXIT').GSP0000                           00289000
         EJECT                                                          00289100
*********************************************************************** 00289200
*        WRITE TO PRINT FILE                                          * 00289300
*********************************************************************** 00289400
GOUT080  EQU   *                                                        00289500
         CLC   SVSECTID,=C'DOC'    IS THIS IN THE DOC SECTION           00289600
         BE    GOUT100             YES - PRINT WITH ASA CTL             00289700
         CLC   SVSECTID,=C'DTA'    IS THIS IN THE DTA SECTION           00289800
         BNE   GOUT081             NO - MUST PRINT IT WITH MACHINE CTL  00289900
         CLC   CDSVTYPE,=C'OTHER'  IS THE TYPE 'OTHER'                  00290000
         BE    GOUT100             YES - MUST PRINT IT WITH ASA CTL     00290100
GOUT081  EQU   *                                                        00290200
         CP    LINECTR,LINELMT     ARE WE AT END OF PAGE                00290300
         BL    GOUT090             NO                                   00290400
         ST    R0,RECADDR          SAVE DETAIL RECORD ADDR              00290500
         MVI   HDNGTYPE,C'O'       INDICATE TYPE OF HEADING (ONLY)      00290600
         BAL   R14,PUTPRT          GO PRINT HEADINGS                    00290700
         MVI   HDNGTYPE,C'T'       INDICATE TYPE OF HEADING (DETAIL)    00290800
         CLI   NOHDGFLG,C'1'       ARE WE NOT PRINTING ANY DETAIL       00290900
         BE    GOUT085             YES - SKIP HEADING DETAIL            00291000
         BAL   R14,H0150           SET UP DIRECTORY DETAIL LINE 1       00291100
         BAL   R14,PUTPRT          PRINT DIRECTORY DETAIL LINE 1        00291200
         BAL   R14,H0190           SET UP DIRECTORY DETAIL LINE 2       00291300
         MVI   PRTCTL,X'11'        WRITE AND SPACE 2 COMMAND IF DATA    00291400
         BAL   R14,PUTPRT          PRINT DIRECTORY DETAIL LINE          00291500
GOUT085  EQU   *                                                        00291600
         L     R0,RECADDR          GET DETAIL RECORD ADDR               00291700
GOUT090  EQU   *                                                        00291800
         LR    R15,R0              GET RECORD ADDRESS                   00291900
         MVC   PRTBUF,PRTCLR                                            00292000
         MVI   PRTCTL,X'09'        WRITE AND SPACE 1 COMMAND CODE       00292100
         MVC   PRTREC,0(R15)       MOVE RECORD TO PRINT BUFFER          00292200
         BAL   R14,PUTPRT          PRINT THE RECORD                     00292300
         B     GOUT066                                                  00292400
         EJECT                                                          00292500
*********************************************************************** 00292600
*        TRANSLATE PRINT WITH ASA CHARACTERS TO USE MACHINE CODES.    * 00292700
*        MEMBERS MUST BE IN THE DTA SECTION WITH A TYPE OF OTHER.     * 00292800
*********************************************************************** 00292900
GOUT100  EQU   *                                                        00293000
         CLI   NOCCOPT,C'1'        NO CARRIAGE CTL OPTION ON            00293100
         BE    GOUT081             YES - NORMAL PRINT                   00293200
         MVC   PRTBUF,PRTCLR       CLEAR PRINT BUFFER                   00293300
         LR    R2,R0               GET RECORD ADDRESS                   00293400
         CLI   0(R2),C'+'          NO SPACE CONTROL CODE                00293500
         BE    GOUT105             YES                                  00293600
         CLI   0(R2),C' '          SPACE 1 CONTROL CODE                 00293700
         BNE   *+8                 NO                                   00293800
         MVI   PRTCTL,X'0B'        SET SPACE 1 COMMAND CODE             00293900
         CLI   0(R2),C'0'          SPACE 2 CONTROL CODE                 00294000
         BNE   *+8                 NO                                   00294100
         MVI   PRTCTL,X'13'        SET SPACE 2 COMMAND CODE             00294200
         CLI   0(R2),C'-'          SPACE 3 CONTROL CODE                 00294300
         BNE   *+8                 NO                                   00294400
         MVI   PRTCTL,X'1B'        SET SPACE 3 COMMAND CODE             00294500
         CLI   0(R2),C'1'          NEW PAGE CONTROL CODE                00294600
         BNE   *+8                 NO                                   00294700
         MVI   PRTCTL,X'8B'        SET CHANNEL 1 IMMED COMMAND CODE     00294800
         BAL   R14,PUTPRT          EXECUTE THE SPACING COMMAND          00294900
GOUT105  EQU   *                                                        00295000
         MVI   PRTCTL,X'01'        SET WRITE W/O SPACING CODE           00295100
         MVC   PRTREC(79),1(R2)    MOVE RECORD TO PRINT BUFFER          00295200
         BAL   R14,PUTPRT          PRINT THE LINE                       00295300
         ZAP   LINECTR,=P'0'       DO NOT COUNT LINES HERE              00295400
         B     GOUT066                                                  00295500
         EJECT                                                          00295600
*********************************************************************** 00295700
*        PRINT OUTPUT ROUTINE                                         * 00295800
*********************************************************************** 00295900
PUTPRT   EQU   *                   PRINT HEADINGS                       00296000
         ST    R14,PRTR14          SAVE RETURN REGISTER                 00296100
         ST    R10,PRTR10          SAVE REG 10                          00296200
         CLI   HDNGTYPE,C'O'       PRINT HEADINGS ONLY                  00296300
         BE    PRTHD1              YES                                  00296400
         CP    LINECTR,LINELMT     ARE WE AT END OF PAGE                00296500
         BL    PRINTRET            NO                                   00296600
         MVC   SAVEPRTL,PRTBUF     SAVE PRINT LINE                      00296700
PRTHD1   EQU   *                                                        00296800
         MVI   PRTCTL,X'8B'        SKIP TO TOP-OF-PAGE COMMAND CODE     00296900
         BAL   R10,CALLPRT         SKIP TO TOP-OF-PAGE                  00297000
         ZAP   LINECTR,=P'0'       RESET LINE COUNTER                   00297100
         MVC   DIRHD2AP,CDHDAPPL   MOVE APPL CODE TO HEADING            00297200
         MVC   DIRHD2RN,CDHDAPRN   MOVE RELEASE NO. TO HEADING          00297300
         CLC   CDHDAPTM,=C'000'    IS THERE A TEMP NUMBER               00297400
         BNH   PRTHD2              NO                                   00297500
         MVI   DIRHD2TP,C'.'       MOVE PERIOD TO HEADING               00297600
         MVC   DIRHD2TP+1(2),CDHDAPTM+1  MOVE TEMP NUMBER TO HEADING    00297700
PRTHD2   EQU   *                                                        00297800
         AP    PAGECTR,=P'1'       ADD 1 TO PAGE COUNTER                00297900
         MVC   DIRHD1PG,=X'40202120'                                    00298000
         ED    DIRHD1PG,PAGECTR                                         00298100
         MVC   PRTBUF,PRTCLR                                            00298200
         MVC   PRTBUF(L'DIRHDNG1),DIRHDNG1                              00298300
         BAL   R10,CALLPRT         PRINT HEADING LINE 1                 00298400
         CLI   HDNGTYPE,C'E'       ARE WE PRINTING ERROR MESSAGES       00298500
         BE    HDNGRET             YES - RETURN                         00298600
         MVC   PRTBUF(L'DIRHDNG2),DIRHDNG2                              00298700
         BAL   R10,CALLPRT         PRINT HEADING LINE 2                 00298800
         CLI   HDNGTYPE,C'I'       ARE WE PRINTING INPUT CARDS          00298900
         BNE   CKPRTHD3            NO - CHK FOR DIRECTORY OR DETAIL     00299000
         L     R10,=A(INPHDNG1)                               9713437   00299200
         MVC   PRTBUF(L'INPHDNG1),0(R10)                      9713437   00299300
         BAL   R10,CALLPRT         PRINT HEADING LINE INPUT 1           00299400
         L     R10,=A(INPHDNG2)                               9713437   00299500
         MVC   PRTBUF(L'INPHDNG2),0(R10)                      9713437   00299600
         BAL   R10,CALLPRT         PRINT HEADING LINE INPUT 2           00299700
         B     HDNGRET                                                  00299800
CKPRTHD3 EQU   *                                                        00300100
         CLI   HDNGTYPE,C'D'       ARE WE PRINTING A DIRECTORY          00300200
         BE    PRTHD3              YES - PRINT HEADING 3                00300300
         CLI   NOHDGFLG,C'1'       ARE WE NOT PRINTING ANY DETAIL       00300400
         BE    HDNGRET             YES - SKIP HEADING LINES 3 THRU 7    00300500
PRTHD3   EQU   *                                                        00300600
         CLC   DIRHD3AP,SPACES     ANY INFO IN HEADINGS 3, 4, OR 5      00300700
         BE    PRTHD6              NO - PRINT HEADINGS 6 AND 7          00300800
         MVC   PRTBUF(L'DIRHDNG3),DIRHDNG3                              00300900
         BAL   R10,CALLPRT         PRINT HEADING LINE 3                 00301000
         MVC   PRTBUF(L'DIRHDNG4),DIRHDNG4                              00301100
         BAL   R10,CALLPRT         PRINT HEADING LINE 4                 00301200
         MVC   PRTBUF(L'DIRHDNG5),DIRHDNG5                              00301300
         BAL   R10,CALLPRT         PRINT HEADING LINE 5                 00301400
PRTHD6   EQU   *                                                        00301500
         CLC   HDSECTID,SVSECTID   SAME SECTION AS BEFORE               00301600
         BE    PRTHD6C             YES - DON'T LOOK UP SECTION          00301700
         MVC   HDSECTID,SVSECTID   SAVE NEW SECTION ID                  00301800
         MVC   DIRHD6SD,SPACES                                          00301900
         L     R15,SECTBLAD        GET ADDR OF SECTION TABLE            00302000
PRTHD6A  EQU   *                                                        00302100
         CLI   0(R15),X'FF'        END OF TABLE                         00302200
         BE    PRTHD6C             YES                                  00302300
         CLC   HDSECTID,0(R15)     FIND ENTRY IN SECTION TABLE          00302400
         BE    PRTHD6B                                                  00302500
         LA    R15,SECTBLNG(0,R15)                                      00302600
         B     PRTHD6A                                                  00302700
PRTHD6B  EQU   *                                                        00302800
         MVC   DIRHD6SD,30(R15)    MOVE SECTION DESC TO HEADING         00302900
PRTHD6C  EQU   *                                                        00303000
         MVC   PRTBUF(L'DIRHDNG6),DIRHDNG6                              00303100
         BAL   R10,CALLPRT         PRINT HEADING LINE 6                 00303200
         MVC   PRTBUF(L'DIRHDNG7),DIRHDNG7                              00303300
         BAL   R10,CALLPRT         PRINT HEADING LINE 7                 00303400
         MVC   PRTBUF(L'DIRHDNG8),DIRHDNG8                              00303500
         BAL   R10,CALLPRT         PRINT HEADING LINE 8                 00303600
HDNGRET  EQU   *                                                        00303700
         CLI   HDNGTYPE,C'O'       PRINT HEADINGS ONLY                  00303800
         BE    PRTRET1             YES - JUST RETURN                    00303900
         MVC   PRTBUF,SAVEPRTL     RESTORE PRINT LINE                   00304000
PRINTRET EQU   *                                                        00304100
         BAL   R10,CALLPRT                                              00304200
PRTRET1  EQU   *                                                        00304300
         L     R10,PRTR10          GET REG 10                           00304400
         L     R14,PRTR14          GET RETURN ADDR                      00304500
         BR    R14                 RETURN                               00304600
PRTR10   DC    F'0'                                                     00304700
PRTR14   DC    F'0'                                                     00304800
         EJECT                                                          00304900
CALLPRT  EQU   *                                                        00305000
         L     R1,PRTOUTAD         GET PRINT DTF/DCB ADDRESS            00305100
         LA    R0,PRTBUF           GET PRINT LINE ADDRESS               00305200
         PUT   (1),(0)                                                  00305300
         CLI   PRTCTL,X'01'        WRITE AND NO SPACE                   00305400
         BE    CALLPRTE            YES - RETURN                         00305500
         AP    LINECTR,=P'1'       ADD ONE TO LINE COUNTER              00305600
         CLI   PRTCTL,X'09'        WRITE AND SPACE 1                    00305700
         BE    CALLPRTE            YES - RETURN                         00305800
         CLI   PRTCTL,X'0B'        SPACE 1                              00305900
         BE    CALLPRTE            YES - RETURN                         00306000
         AP    LINECTR,=P'1'       ADD ONE MORE TO LINE COUNTER         00306100
         CLI   PRTCTL,X'11'        WRITE AND SPACE 2                    00306200
         BE    CALLPRTE            YES - RETURN                         00306300
         CLI   PRTCTL,X'13'        SPACE 2                              00306400
         BE    CALLPRTE            YES - RETURN                         00306500
         AP    LINECTR,=P'1'       ADD ONE MORE TO LINE COUNTER         00306600
         CLI   PRTCTL,X'19'        WRITE AND SPACE 3                    00306700
         BE    CALLPRTE            YES - RETURN                         00306800
         CLI   PRTCTL,X'1B'        SPACE 3                              00306900
         BE    CALLPRTE            YES - RETURN                         00307000
CALLPRTE EQU   *                                                        00307100
         MVC   PRTBUF,PRTCLR                                            00307200
         BR    R10                 RETURN                               00307300
*********************************************************************** 00307400
*        PRINT DIRECTORY LISTING                                      * 00307500
*********************************************************************** 00307600
H0100    EQU   *                                                        00307700
         CLC   CDHDSECT,SECTKEY    IS THIS A SECTION HEADER             00307800
         BNE   H0110               NO                                   00307900
         CLI   DIRSCTID,C' '       IS THIS THE FIRST SECTION            00308000
         BE    H0105               YES                                  00308100
         BAL   R14,H0200           PRINT SECTION TOTALS                 00308200
H0105    EQU   *                                                        00308300
         MVC   DIRSCTID,CDHDSCNM   SAVE SECTION ID                      00308400
         MVC   SVSECTID,CDHDSCNM   SAVE SECTION ID                      00308500
         ZAP   LINECTR,=P'999'     FORCE HEADINGS                       00308600
H0110    EQU   *                                                        00308700
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00308800
         BNE   H0120               NO - RETURN TO READ NEXT RECORD      00308900
         MVI   HDNGTYPE,C'D'       INDICATE TYPE OF HEADING (DIRECTORY) 00309000
         MVC   SVDSNHD,CARDIN      SAVE DSN HEADER CARD                 00309100
         MVC   SVDSNHD2,SPACES     CLEAR DSN2 AND DSN3 SAVE AREAS       00309200
         MVC   SVDSNHD3,SPACES                                          00309300
H0112    EQU   *                                                        00309400
         BAL   R14,DBLKREAD        READ INPUT FILE                      00309500
         CLC   CARDIN(4),DSNKEY    IS THIS A DSN HEADER X RECORD        00309600
         BNE   H0115               NO                                   00309700
         TM    CARDIN+4,X'F0'      IS THIS A DSN HEADER X RECORD        00309800
         BNO   H0115               NO                                   00309900
         CLI   CARDIN+5,C'='       IS THIS A DSN HEADER X RECORD        00310000
         BNE   H0115               NO                                   00310100
         PACK  DBLWORD,CARDIN+4(1) PACK DSN HEADER NUMBER               00310200
         CVB   R1,DBLWORD          CONVERT IT TO BINARY                 00310300
         MH    R1,=H'80'           MULTIPLY BY 80                       00310400
         LA    R1,SVDSNHD-80(R1)   POINT TO DSN HEADER SAVE AREA        00310500
         MVC   0(80,R1),CARDIN     SAVE DSN HEADER X RECORD             00310600
         B     H0112               READ NEXT RECORD                     00310700
H0115    EQU   *                                                        00310800
         BAL   R14,H0150           SET UP DIRECTORY DETAIL LINE         00310900
         BAL   R14,PUTPRT          PRINT DIRECTORY DETAIL LINE          00311000
         BAL   R14,H0190           SET UP DIRECTORY DETAIL LINE 2       00311100
         BAL   R14,PUTPRT          PRINT DIRECTORY DETAIL LINE          00311200
         AP    SECTSTMT,WKSTMT     ADD TO TOTAL NO. STMTS THIS SECT     00311300
         AP    SECTDSNS,=P'1'      ADD TO NO. OF DATA SETS THIS SECT    00311400
         AP    TPSTMT,WKSTMT       ADD TO TOTAL NO. STATEMENTS          00311500
         AP    NODSNS,=P'1'        ADD TO NO. OF DATA SETS              00311600
H0120    EQU   *                                                        00311700
         BAL   R15,POPSTAK         RETURN                               00311800
         EJECT                                                          00311900
*********************************************************************** 00312000
*        SET UP DIRECTORY DETAIL LINE 1                               * 00312100
*********************************************************************** 00312200
H0150    EQU   *                   SET UP DIRECTORY DETAIL INFO         00312300
         MVC   PRTBUF,PRTCLR                                            00312400
         MVC   DIRDSN,CDSVNAME     MOVE DATA SET NAME                   00312500
         MVC   DIRONDSN,CDAPONNM   MOVE ONLINE DATA SET NAME            00312600
         MVC   DIRTYPE,CDSVTYPE    MOVE DATA SET TYPE                   00312700
         CLI   CDSVCBL2,C'1'       COBOL II FLAG SET 4 COBOLVS          00312800
         BE    H0152               YES                                  00312900
         CLI   CDSVCBL2,C'3'       COBOL II FLAG SET 4 COBOLII          00313000
         BE    H0152                                                    00313100
         B     H0153                                                    00313200
H0152    EQU   *                                                        00313300
         MVC   DIRCBL2,CDSVCBL2    MOVE COBOL II FLAG                   00313400
H0153    EQU   *                                                        00313500
         CLI   TYPEINST,C'?'       DO I INDICATE OPSYS                  00313600
         BNE   H0155               NO                                   00313700
         MVI   DIRDSN+8,C'.'                                            00313800
         MVC   DIRDSN+9(1),CDSVOPS PUT OPSYS IN PRINT LINE              00313900
H0155    EQU   *                                                        00314000
         LA    R1,ACTIONTB                                              00314100
         CLI   TYPEINST,C'I'       IS THIS AN INITIAL TYPE INSTALL      00314200
         BE    H0170               YES - FORCE ALL ACTIONS TO "ADD"     00314300
H0160    EQU   *                                                        00314400
         CLC   CDSVACT,0(R1)                                            00314500
         BE    H0170                                                    00314600
         LA    R1,ACTTABLN(0,R1)                                        00314700
         CLI   0(R1),X'FF'                                              00314800
         BNE   H0160                                                    00314900
H0170    EQU   *                                                        00315000
         MVC   DIRACTN,1(R1)                                            00315100
         AP    8(4,R1),=P'1'       ADD 1 TO SECTION COUNTER             00315200
         AP    12(4,R1),=P'1'      ADD 1 TO TOTAL COUNTER               00315300
         CLC   HDSECTID,=C'LNK'    IS IT A LNK SECTION                  00315400
         BNE   H0180               NO                                   00315500
         CLI   CDSVACT,C'B'        IS IT A B ACTION CODE                00315600
         BNE   H0180               NO                                   00315700
         MVC   DIRACTN,=C'LINK   ' CHANGE ACTION TO LINK                00315800
H0180    EQU   *                                                        00315900
         MVC   DIRSTMT,=X'40206B2020206B202120'                         00316000
         PACK  WKSTMT,CDSVSTMT                                          00316100
         ED    DIRSTMT,WKSTMT      EDIT NO. OF STATEMENTS               00316200
         MVC   DIRLEVEL,=X'40202120'                                    00316300
         PACK  WKLVL,CDSVLVL                                            00316400
         ED    DIRLEVEL,WKLVL      MOVE PAN LEVEL NUMBER                00316500
         MVC   DIRDESC,CDSVCOM     MOVE COMMENT                         00316600
         MVI   PRTCTL,X'09'        PRINT AND SPACE ONE COMMAND CODE     00316700
         BR    R14                 RETURN                               00316800
         SPACE 3                                                        00316900
*********************************************************************** 00317000
*        SET UP DIRECTORY DETAIL LINE 2                               * 00317100
*********************************************************************** 00317200
H0190    EQU   *                   SET UP DIRECTORY DETAIL INFO         00317300
         MVC   PRTBUF,PRTCLR                                            00317400
         CLC   CDAPBTNM,SPACES     ANY BATCH NAME                       00317500
         BE    4(0,R14)            NO - RETURN +4                       00317600
         MVI   PRTCTL,X'09'        PRINT AND SPACE ONE COMMAND CODE     00317700
         MVC   DIRONDSN,CDAPBTNM   MOVE BATCH DATA SET NAME             00317800
         BR    R14                 RETURN                               00317900
         EJECT                                                          00318000
*********************************************************************** 00318100
*        SET UP AND PRINT SECTION TOTALS                              * 00318200
*********************************************************************** 00318300
H0200    EQU   *                                                        00318400
         ST    R14,H0200SAV        SAVE R14                             00318500
         CP    SECTDSNS,=P'0'      ANY TOTALS TO PRINT                  00318600
         BE    H0220               NO                                   00318700
         ZAP   DBLWORD,LINELMT     GET LINES PER PAGE                   00318800
         SP    DBLWORD,=P'12'      SUBTRACT NO. LINES FOR TOTALS        00318900
         MVI   HDNGTYPE,C'D'       INDICATE TYPE OF HEADING (DIRECTORY) 00319000
         MVI   PRTCTL,X'0B'        SPACE ONE LINE COMMAND CODE          00319100
         BAL   R14,PUTPRT          SPACE ONE LINE                       00319200
         MVI   PRTCTL,X'11'        PRINT AND SPACE TWO COMMAND CODE     00319300
         MVC   DIRSECTT,=CL34'TOTAL DATA SETS THIS SECTION'             00319400
         MVC   DIRSECTN,=X'40206B2020206B202120'                        00319500
         ED    DIRSECTN,SECTDSNS   PRINT NO. OF DATA SETS THIS SECTION  00319600
         BAL   R14,PUTPRT          PRINT LINE                           00319700
         MVI   PRTCTL,X'11'        PRINT AND SPACE TWO COMMAND CODE     00319800
         MVC   DIRSECTT,=CL34'TOTAL STATEMENTS THIS SECTION'            00319900
         MVC   DIRSECTN,=X'40206B2020206B202120'                        00320000
         ED    DIRSECTN,SECTSTMT   PRINT NO. OF STATEMENTS THIS SECTION 00320100
         BAL   R14,PUTPRT          PRINT LINE                           00320200
         LA    R2,ACTIONTB+8       POINT TO SECTION COUNTER             00320300
         BAL   R14,H0250           SET UP AND PRINT ACTION TOTALS       00320400
H0220    EQU   *                                                        00320500
         CLC   HDSECTID,=C'BFS'    IS THIS BATCH/FIAS SUBROUTINES       00320600
         BNE   H0225               NO                                   00320700
         MVC   PRTBUF(L'BFSNOTE1),BFSNOTE1                              00320800
         BAL   R14,PUTPRT          PRINT BFS SECTION NOTE               00320900
         MVC   PRTBUF(L'BFSNOTE2),BFSNOTE2                              00321000
         BAL   R14,PUTPRT          PRINT BFS SECTION NOTE               00321100
H0225    EQU   *                                                        00321200
         CLC   HDSECTID,=C'APA'    IS THIS APA SECTION                  00321300
         BNE   H0230               NO                                   00321400
         MVC   PRTBUF(L'BFSNOTE1),BFSNOTE1                              00321500
         BAL   R14,PUTPRT          PRINT APA SECTION NOTE               00321600
         MVC   PRTBUF(L'APANOTE2),APANOTE2                              00321700
         BAL   R14,PUTPRT          PRINT APA SECTION NOTE               00321800
H0230    EQU   *                                                        00321900
         ZAP   SECTDSNS,=P'0'      CLEAR COUNTER                        00322000
         ZAP   SECTSTMT,=P'0'      CLEAR COUNTER                        00322100
         ZAP   ACTIONTB+8(4),=P'0'  CLEAR SECTION ACTION COUNTERS       00322200
         ZAP   ACTIONTB+24(4),=P'0'                                     00322300
         ZAP   ACTIONTB+40(4),=P'0'                                     00322400
         ZAP   ACTIONTB+56(4),=P'0'                                     00322500
         ZAP   ACTIONTB+72(4),=P'0'                                     00322600
         ZAP   ACTIONTB+88(4),=P'0'                                     00322700
         L     R14,H0200SAV        GET RETURN ADDR                      00322800
         BR    R14                 RETURN                               00322900
H0200SAV DC    F'0'                                                     00323000
         EJECT                                                          00323100
*********************************************************************** 00323200
*        SET UP AND PRINT ACTION TOTALS                               * 00323300
*********************************************************************** 00323400
H0250    EQU   *                                                        00323500
*        R2 POINTS TO FIRST ACTION TOTAL COUNTER.  EACH ADDITIONAL      00323600
*        COUNTER IS 16 BYTES FROM THE PREVIOUS ONE.                     00323700
         ST    R14,H0250R14              SAVE R14                       00323800
         MVC   PRTBUF,PRTCLR             CLEAR PRINT LINE               00323900
         MVC   PRTBUF(L'ACTRECP1),ACTRECP1  MOVE ACTION HEADING         00324000
         BAL   R14,PUTPRT                PRINT ACTION TOTAL LINE 1      00324100
         ZAP   DBLWORD,=P'0'             CLEAR TOTAL COUNTER            00324200
         MVI   PRTCTL,X'09'              SET WRITE AND SPACE 1          00324300
         MVC   ACTATOTD,=CL11'ADD =      '  MOVE DESCRIPTION            00324400
         MVC   ACTATOTN,=X'402020202120' MOVE EDIT MASK TO PRINT LINE   00324500
         ED    ACTATOTN,1(R2)            EDIT ADD TOTAL                 00324600
         AP    DBLWORD,0(4,R2)           ADD TO TOTAL COUNTER           00324700
         MVC   ACTBTOTD,=CL11'RECOMPILE ='  MOVE DESCRIPTION            00324800
         MVC   ACTBTOTN,=X'402020202120' MOVE EDIT MASK TO PRINT LINE   00324900
         ED    ACTBTOTN,17(R2)           EDIT RECOMPILE TOTAL           00325000
         AP    DBLWORD,16(4,R2)          ADD TO TOTAL COUNTER           00325100
         MVC   ACTCTOTD,=CL11'CHANGE =   '  MOVE DESCRIPTION            00325200
         MVC   ACTCTOTN,=X'402020202120' MOVE EDIT MASK TO PRINT LINE   00325300
         ED    ACTCTOTN,33(R2)           EDIT CHANGE TOTAL              00325400
         AP    DBLWORD,32(4,R2)          ADD TO TOTAL COUNTER           00325500
         MVC   ACTDTOTD,=CL11'DELETE =   '  MOVE DESCRIPTION            00325600
         MVC   ACTDTOTN,=X'402020202120' MOVE EDIT MASK TO PRINT LINE   00325700
         ED    ACTDTOTN,49(R2)           EDIT DELETE TOTAL              00325800
         AP    DBLWORD,48(4,R2)          ADD TO TOTAL COUNTER           00325900
         BAL   R14,PUTPRT                PRINT ACTION TOTAL LINE 2      00326000
         MVI   PRTCTL,X'11'              SET WRITE AND SPACE 2          00326100
         MVC   ACTATOTD,=CL11'REPLACE =  '  MOVE DESCRIPTION            00326200
         MVC   ACTATOTN,=X'402020202120' MOVE EDIT MASK TO PRINT LINE   00326300
         ED    ACTATOTN,65(R2)           EDIT REPLACE TOTAL             00326400
         AP    DBLWORD,64(4,R2)          ADD TO TOTAL COUNTER           00326500
         MVC   ACTBTOTD,=CL11'STATIC =   '  MOVE DESCRIPTION            00326600
         MVC   ACTBTOTN,=X'402020202120' MOVE EDIT MASK TO PRINT LINE   00326700
         ED    ACTBTOTN,81(R2)           EDIT STATIC TOTAL              00326800
         AP    DBLWORD,80(4,R2)          ADD TO TOTAL COUNTER           00326900
         MVC   ACTCTOTD,=CL11'TOTAL =    '  MOVE DESCRIPTION            00327000
         MVC   ACTCTOTN,=X'402020202120' MOVE EDIT MASK TO PRINT LINE   00327100
         ED    ACTCTOTN,DBLWORD+5        EDIT TOTAL                     00327200
         BAL   R14,PUTPRT                PRINT ACTION TOTAL LINE 3      00327300
         L     R14,H0250R14              GET RETURN ADDR                00327400
         BR    R14                       RETURN                         00327500
H0250R14 DC    F'0'                                                     00327600
.GSP0000 ANOP                                                           00327700
         EJECT                                                          00354500
         AIF   ('&OPSYS' NE 'VSE').GSP2000                              00354600
*********************************************************************** 00354700
*        GSP1000 SERIES RESERVED FOR VSE SPECIFIC ROUTINES            * 00354800
*********************************************************************** 00354900
         SPACE 3                                                        00356900
*********************************************************************** 00359200
*        SPECIAL PROCESSING FOR DATA SET NAME                         * 00359300
*********************************************************************** 00359400
GSP1200  EQU   *                                                        00359500
         CLI   3(R4),C'S'          ARE WE PROCESSING A SECTION CARD     00359600
         BE    GSP1230             YES - DATA SET NAME IS INVALID HERE  00359700
         CLI   SELTYPE,C'T'        ARE WE USING NAME SELECT TABLE       00359800
         BE    GSP1250             YES                                  00359900
GSP1210  EQU   *                                                        00360000
         LA    R9,L'CDSVNAME-1     GET DATA SET NAME LENGTH             00360100
         CLC   CARDWORK(6),=CL6'// JOB'  ARE WE PROCESSING VSE JOB CARD 00360200
         BNE   GSP1240                NO - GO BACK                      00360300
         LA    R15,CDSVNAME+7      POINT TO LAST BYTE OF NAME           00360400
GSP1220  EQU   *                                                        00360500
         CLI   0(R15),C' '         IS THIS BYTE A SPACE                 00360600
         BNE   GSP1240             NO - GO BACK                         00360700
         BCTR  R15,0               BACK UP ONE BYTE                     00360800
         BCT   R9,GSP1220          SUBTRACT 1 FROM LENGTH AND CHK AGAIN 00360900
GSP1230  EQU   *                                                        00361000
         SR    R15,R15             CLEAR R15 - NO NAME FOUND            00361100
         B     GCM060              GO BACK                              00361200
GSP1240  EQU   *                                                        00361300
         LA    R15,CDSVNAME        GET DATA SET NAME ADDR               00361400
         B     GCM060              GO BACK AND INSERT NAME              00361500
GSP1250  EQU   *                                                        00361600
         CLI   SVNEWNAM,C' '       ANY RENAME FIELD                     00361700
         BE    GSP1210             NO - USE ORIGINAL NAME               00361800
         CLC   SVNMSECT,WKSCID     IS THIS THE RIGHT SECTION            00361900
         BNE   GSP1210             NO - USE ORIGINAL NAME               00362000
         LA    R9,L'SVNEWNAM-1     GET NEW NAME FIELD LENGTH            00362100
         CLC   CARDWORK(6),=CL6'// JOB'  ARE WE PROCESSING VSE JOB CARD 00362200
         BNE   GSP1270                NO - GO BACK                      00362300
         LA    R15,SVNEWNAM+7      POINT TO LAST BYTE OF NAME           00362400
GSP1260  EQU   *                                                        00362500
         CLI   0(R15),C' '         IS THIS BYTE A SPACE                 00362600
         BNE   GSP1270             NO - GO BACK                         00362700
         BCTR  R15,0               BACK UP ONE BYTE                     00362800
         BCT   R9,GSP1260          SUBTRACT 1 FROM LENGTH AND CHK AGAIN 00362900
         B     GSP1230             GO BACK                              00363000
GSP1270  EQU   *                                                        00363100
         LA    R15,SVNEWNAM        GET NEW NAME FIELD ADDRESS           00363200
         B     GCM060              GO BACK AND INSERT NAME              00363300
         EJECT                                                          00363400
.GSP2000 ANOP                                                           00365300
         AIF   ('&OPSYS' NE 'MVS').GSP3000                              00365400
*********************************************************************** 00365500
*        GSP2000 SERIES RESERVED FOR MVS SPECIFIC ROUTINES            * 00365600
*********************************************************************** 00365700
         SPACE 3                                                        00365800
*********************************************************************** 00365900
*        SPECIAL PROCESSING FOR DATA SET NAME                         * 00366000
*********************************************************************** 00366100
GSP2000  EQU   *                                                        00366200
         CLI   3(R4),C'S'          ARE WE PROCESSING A SECTION CARD     00366300
         BE    GSP2030             YES - DATA SET NAME IS INVALID HERE  00366400
         CLI   SELTYPE,C'T'        ARE WE USING NAME SELECT TABLE       00366500
         BE    GSP2020             YES                                  00366600
GSP2010  EQU   *                                                        00366700
         LA    R9,L'CDSVNAME-1     SET DATA SET NAME LENGTH             00366800
         LA    R15,CDSVNAME        POINT TO DATA SET NAME               00366900
         B     GCM060                                                   00367000
GSP2020  EQU   *                                                        00367100
         CLI   SVNEWNAM,C' '       ANY RENAME FIELD                     00367200
         BE    GSP2010             NO - USE ORIGINAL NAME               00367300
         CLC   SVNMSECT,WKSCID     IS THIS THE RIGHT SECTION            00367400
         BNE   GSP2010             NO - USE ORIGINAL NAME               00367500
         LA    R9,L'SVNEWNAM-1     GET NEW NAME FIELD LENGTH            00367600
         LA    R15,SVNEWNAM        GET NEW NAME FIELD ADDRESS           00367700
         B     GCM060                                                   00367800
GSP2030  EQU   *                                                        00367900
         SR    R15,R15             CLEAR R15 - NO NAME FOUND            00368000
         B     GCM060              GO BACK                              00368100
         EJECT                                                          00368200
.GSP3000 ANOP                                                           00368300
         AIF   (&LIB AND '&SYSPARM' EQ 'EXIT').GSP4000                  00368400
         AIF   (NOT &PAN).GSP4000                                       00368500
*********************************************************************** 00368600
*        GSP3000 SERIES RESERVED FOR PANVALET SPECIFIC ROUTINES       * 00368700
*********************************************************************** 00368800
         SPACE 3                                                        00368900
*********************************************************************** 00369000
*        SPECIAL PROCESSING FOR PANVALET FORMAT CODES                 * 00369100
*        TRANSLATE THE TYPE FIELD ON THE DATA SET HEADER TO THE       * 00369200
*        FORMAT ACCEPTED BY PANVALET.                                 * 00369300
*********************************************************************** 00369400
GSP3000  EQU   *                                                        00369500
         LA    R15,FORMATTB        GET ADDR OF PANVALET FORMAT TABLE    00369600
GSP3010  EQU   *                                                        00369700
         CLI   0(R15),X'FF'        END OF TABLE                         00369800
         BE    GSP3020             YES                                  00369900
         CLC   CDSVTYPE,0(R15)     IS THIS THE RIGHT TYPE               00370000
         BE    GSP3020             YES                                  00370100
         LA    R15,14(0,R15)       BUMP TO NEXT ENTRY                   00370200
         B     GSP3010                                                  00370300
GSP3020  EQU   *                                                        00370400
         IC    R9,5(0,R15)         GET FIELD LENGTH                     00370500
         LA    R15,6(0,R15)        GET FIELD ADDR                       00370600
         B     GCM060              RETURN                               00370700
         SPACE 3                                                        00370800
FORMATTB DC    CL5'ASMB ',X'02',CL8'BAL     '     PANVALET FORMAT TABLE 00370900
         DC    CL5'COBOL',X'04',CL8'COBOL   '                           00371000
         DC    CL5'ANSCB',X'07',CL8'ANSCOBOL'                           00371100
         DC    CL5'COB72',X'07',CL8'COBOL-72'                           00371200
         DC    CL5'OBJCT',X'05',CL8'OBJECT  '                           00371300
         DC    CL5'JCL  ',X'02',CL8'JCL     '                           00371400
         DC    CL5'DATA ',X'03',CL8'DATA    '                           00371500
         DC    CL5'OTHER',X'04',CL8'OTHER   '                           00371600
         DC    CL5'COPYA',X'02',CL8'BAL     '                           00371700
         DC    CL5'COPYC',X'07',CL8'ANSCOBOL'                           00371800
         DC    XL5'FFFFFFFFFF',X'04',CL8'OTHER   '                      00371900
*        TABLE FORMAT                                                   00372000
*        FORMAT TYPE FROM DATA SET HEADER   CL5                         00372100
*        LENGTH OF DATA TO BE INSERTED      XL1                         00372200
*        DATA TO BE INSERTED                CL8                         00372300
         DS    0H                  REALIGN INSTRUCTIONS                 00372400
         EJECT                                                          00372500
.GSP4000 ANOP                                                           00372600
         AIF   (&PAN AND '&SYSPARM' EQ 'EXIT').GSP5000                  00372700
         AIF   (NOT &LIB).GSP5000                                       00372800
*********************************************************************** 00372900
*        GSP4000 SERIES RESERVED FOR LIBRARIAN SPECIFIC ROUTINES      * 00373000
*********************************************************************** 00373100
         SPACE 3                                                        00373200
*********************************************************************** 00373300
*        SPECIAL PROCESSING FOR LIBRARIAN LANGUAGE CODES              * 00373400
*        TRANSLATE THE TYPE FIELD ON THE DATA SET HEADER TO THE       * 00373500
*        FORMAT ACCEPTED BY LIBRARIAN                                 * 00373600
*********************************************************************** 00373700
GSP4000  EQU   *                                                        00373800
         L     R15,IUSECTAD        GET SECTION TABLE ADDRESS            00373900
         AH    R15,2(0,R15)        ADD OFFSET TO LIBRARIAN LANG TABLE   00374000
         C     R15,IUSECTAD        WAS OFFSET ZERO                      00374100
         BE    GSP4040             YES - NO TABLE GENNED                00374200
         MVC   LIBTBLLN,8(R15)     SAVE LENGTH OF EACH ENTRY            00374300
         LA    R15,16(0,R15)       BUMP OVER EYECATCHER AND LENGTH      00374400
GSP4010  EQU   *                                                        00374500
         CLC   WKSCID,0(R15)       IS THIS THE RIGHT SECTION            00374600
         BNE   GSP4020             NO                                   00374700
         CLI   3(R15),C' '         ANY LANG ENTRY IN TABLE              00374800
         BE    GSP4030             NO - USE LIBR LANG                   00374900
         CLC   CDSVTYPE,3(R15)     IS THIS THE RIGHT TYPE               00375000
         BE    GSP4030             YES                                  00375100
GSP4020  EQU   *                                                        00375200
         AH    R15,LIBTBLLN        BUMP TO NEXT ENTRY                   00375300
         CLI   0(R15),X'FF'        END OF TABLE                         00375400
         BNE   GSP4010             NO                                   00375500
GSP4030  EQU   *                                                        00375600
         LA    R9,2                GET FIELD LENGTH                     00375700
         LA    R15,8(0,R15)        GET FIELD ADDR                       00375800
         B     GCM060              RETURN                               00375900
GSP4040  EQU   *                                                        00376000
         LA    R9,2                GET FIELD LENGTH                     00376100
         LA    R15,=CL3'OTH'       GET FIELD ADDR                       00376200
         B     GCM060              RETURN                               00376300
         SPACE 3                                                        00376400
LIBTBLLN DC    H'0'                                                     00376500
         DS    0H                  REALIGN INSTRUCTIONS                 00376600
         EJECT                                                          00376700
*********************************************************************** 00376800
*        SPECIAL PROCESSING FOR LIBRARIAN SEQ OR SEQCHK PARAMETERS    * 00376900
*              SEQ=&SEQ  OR  SEQCHK=&SEQ                              * 00377000
*********************************************************************** 00377100
GSP4100  EQU   *                                                        00377200
         CLC   SVSECTNM,=C'MAP'        IS THIS A CICS MAP               00377300
         BE    GSP4105                                                  00377400
         CLC   CDSVTYPE,=C'ASMB '      IS IT ASSEMBLER                  00377500
         BE    GSP4110                 YES                              00377600
         CLC   CDSVTYPE,=C'COPYA'      IS IT ASSEMBLER COPY BOOK        00377700
         BE    GSP4110                 YES                              00377800
         CLC   CDSVTYPE,=C'ANSCB'      IS IT COBOL                      00377900
         BE    GSP4120                 YES                              00378000
         CLC   CDSVTYPE,=C'COBOL'      IS IT COBOL                      00378100
         BE    GSP4120                 YES                              00378200
         CLC   CDSVTYPE,=C'COB72'      IS IT COBOL                      00378300
         BE    GSP4120                 YES                              00378400
         CLC   CDSVTYPE,=C'COPYC'      IS IT COBOL COPY BOOK            00378500
         BE    GSP4120                 YES                              00378600
GSP4105  EQU   *                                                        00378700
         LA    R9,L'OTHSEQ-1           GET OTHER TYPE LENGTH            00378800
         LA    R15,OTHSEQ              GET OTHER TYPE ADDR              00378900
         B     GCM060                  RETURN                           00379000
GSP4110  EQU   *                                                        00379100
         LA    R9,L'ASMSEQ-1           GET ASSEM TYPE LENGTH            00379200
         LA    R15,ASMSEQ              GET ASSEM TYPE ADDR              00379300
         B     GCM060                  RETURN                           00379400
GSP4120  EQU   *                                                        00379500
         LA    R9,L'COBSEQ-1           GET COBOL TYPE LENGTH            00379600
         LA    R15,COBSEQ              GET COBOL TYPE ADDR              00379700
         B     GCM060                  RETURN                           00379800
         SPACE 3                                                        00379900
OTHSEQ   DC    C'/81,6,100,100/'                                        00380000
ASMSEQ   DC    C'/73,8,100,100/'                                        00380100
COBSEQ   DC    C'/01,6,100,100/'                                        00380200
         DS    0H                  REALIGN INSTRUCTIONS                 00380300
         EJECT                                                          00380400
.GSP5000 ANOP                                                           00380500
*********************************************************************** 00384700
*        DISTRIBUTION FILE INPUT ROUTINE                              * 00384800
*********************************************************************** 00384900
DBLKREAD EQU   *                                                        00385000
         STM   R0,R15,READSAVE     SAVE REGISTERS                       00385100
         NOP   P0010               NO                                   00385200
         OI    *-3,X'F0'           SET NOP TO BRANCH AFTER THIS         00385300
         BAL   R7,P0300            GET INPUT FILE BLOCK                 00385400
         STM   R8,R9,READREGS      SAVE FILE I/O REGISTERS              00385500
         XC    2(2,R8),2(R8)       IS BLOCK A VARIABLE LENGTH FORMAT    00385600
         BNZ   P0010               NO - DEFAULT IS FIXED BLOCK          00385700
         MVI   INPTYPE,C'V'        SET VARIABLE FORMAT FLAG             00385800
         LA    R8,4(0,R8)          BUMP OVER BLOCK DESCRIPTOR WORD      00385900
         SH    R9,=H'4'            ADJUST BLOCK LENGTH                  00386000
         STM   R8,R9,READREGS      SAVE FILE I/O REGISTERS              00386100
P0010    EQU   *                                                        00386200
         LM    R8,R9,READREGS      GET FILE I/O REGISTERS               00386300
         CLI   INPTYPE,C'V'        IS INPUT FILE VARIABLE FORMAT        00386400
         BE    P0050               YES                                  00386500
*********************************************************************** 00386600
*        PROCESS FIXED LENGTH FORMAT FILE                             * 00386700
*********************************************************************** 00386800
         LTR   R9,R9               IS INPUT BLOCK FINISHED              00386900
         BNZ   P0020               NO                                   00387000
         BAL   R7,P0300            GET INPUT FILE BLOCK                 00387100
P0020    EQU   *                                                        00387200
         MVC   CARDIN,0(R8)        MOVE RECORD TO RETURN AREA           00387300
         LA    R8,80(0,R8)         BUMP TO NEXT RECORD                  00387400
         SH    R9,=H'80'           GET REMAINING AREA IN BUFFER         00387500
         B     P0100               RETURN                               00387600
*********************************************************************** 00387700
*        PROCESS VARIABLE LENGTH FORMAT FILE                          * 00387800
*********************************************************************** 00387900
P0050    EQU   *                                                        00388000
         LTR   R9,R9               IS INPUT BLOCK FINISHED              00388100
         BNZ   P0060               NO                                   00388200
         BAL   R7,P0300            GET INPUT FILE BLOCK                 00388300
         LA    R8,4(0,R8)          BUMP OVER BLOCK DESCRIPTOR WORD      00388400
         SH    R9,=H'4'            ADJUST BLOCK LENGTH                  00388500
P0060    EQU   *                                                        00388600
         LA    R8,4(0,R8)          BUMP OVER RECORD DESCRIPTOR WORD     00388700
         SH    R9,=H'4'            ADJUST BLOCK LENGTH                  00388800
*********************************************************************** 00388900
*        DECOMPRESS RECORD TO 80 BYTES                                * 00389000
*********************************************************************** 00389100
         MVC   CARDIN,SPACES       CLEAR RECORD RETURN AREA             00389200
         LA    R10,CARDIN          GET RECORD RETURN ADDR               00389300
         SR    R1,R1               CLEAR COUNT REG                      00389400
         SR    R2,R2               CLEAR REG 2                          00389500
P0070    EQU   *                                                        00389600
         IC    R2,0(0,R8)          GET LENGTH BYTE                      00389700
         LR    R3,R2               PUT LENGTH INTO REG 3                00389800
         SRL   R2,4                SHIFT OFF NO. SPACE COUNT            00389900
         N     R3,=F'15'           CLEAR NON-SPACE COUNT                00390000
         LTR   R4,R2               GET NON-SPACE COUNT IN REG 4         00390100
         BZ    P0080               BR IF NO SPACES                      00390200
         BCTR  R4,0                SUBTRACT 1 FOR EXECUTE OF MVC        00390300
         EX    R4,MVCNBLNK         MOVE NON-SPACES                      00390400
P0080    EQU   *                                                        00390500
         LA    R8,1(R2,R8)         INCREMENT INPUT OVER NON-SPACES      00390600
         SR    R9,R2               SUBTRACT NON-SPACE LENGTH FROM REM   00390700
         BCTR  R9,0                SUBTRACT 1 MORE FOR CONTROL BYTE     00390800
         AR    R10,R2              INCREMENT OUTPUT OVER NON-SPACES     00390900
         AR    R10,R3              INCREMENT OUTPUT OVER SPACES         00391000
         AR    R1,R2               ADD NO. NON-SPACES TO COUNT          00391100
         AR    R1,R3               ADD NO. SPACES TO COUNT              00391200
         CH    R1,=H'80'           AT END OF RECORD                     00391300
         BL    P0070               NO - PROCESS NEXT FIELD              00391400
*********************************************************************** 00391500
*        RETURN TO CALLER                                             * 00391600
*********************************************************************** 00391700
P0100    EQU   *                                                        00391800
         STM   R8,R9,READREGS      SAVE FILE I/O REGISTERS              00391900
         CLI   TYPEINST,C'?'       ARE WE LOOKING AT EVERYTHING         00392000
         BE    P0200               YES - RETURN                         00392100
         CLC   CDEOSECT,SECTEND    IS THIS AN END-OF-SECTION            00392200
         BE    P0200               YES - RETURN                         00392300
         CLC   CDHDDSN,DSNKEY      IS THIS A DATA SET HEADER            00392400
         BE    P0110               YES - CHK IT OUT                     00392500
         CLI   SKIPDSN,C'1'        ARE WE SKIPPING THIS DATA SET        00392600
         BE    P0010               YES - GO READ AGAIN                  00392700
         B     P0200               NO - RETURN                          00392800
P0110    EQU   *                                                        00392900
         MVI   SKIPDSN,C'0'        RESET SKIP FLAG                      00393000
         AIF   ('&OPSYS' EQ 'MVS').P0110                                00393100
         CLI   CDHDOPS,C'M'        IS THIS AN MVS MODULE                00393200
         BNE   P0200               NO - RETURN                          00393300
         AGO   .P0111                                                   00393400
.P0110   ANOP                                                           00393500
         CLI   CDHDOPS,C'D'        IS THIS A VSE MODULE                 00393600
         BE    P0111               YES - SKIP IT                        00393700
         CLI   CDHDOPS,C'V'        IS THIS A VSE MODULE                 00393800
         BNE   P0200               NO - RETURN                          00393900
P0111    EQU   *                                                        00394000
.P0111   ANOP                                                           00394100
         MVI   SKIPDSN,C'1'        SET SKIP FLAG                        00394200
         B     P0010               GET NEXT RECORD                      00394300
P0200    EQU   *                                                        00394400
         LM    R0,R15,READSAVE     RESTORE REGISTERS                    00394500
         BR    R14                 RETURN                               00394600
         SPACE 3                                                        00394700
P0300    EQU   *                                                        00394800
         L     R1,FILEINAD         GET INPUT FILE ADDR                  00394900
         GET   (1)                 GET INPUT BLOCK                      00395000
         AIF   ('&OPSYS' EQ 'VSE').P0301                                00395100
         LR    R8,R1               SAVE BLOCK ADDR                      00395200
         L     R1,FILEINAD         GET INPUT FILE ADDR                  00395300
         USING IHADCB,R1                                                00395400
         LH    R9,DCBLRECL         GET BLOCK LENGTH                     00395500
         DROP  R1                                                       00395600
.P0301   ANOP                                                           00395700
         BR    R7                                                       00395800
         SPACE 3                                                        00395900
READREGS DC    2F'0'                                                    00396000
READSAVE DC    16F'0'                                                   00396100
MVCNBLNK MVC   0(0,R10),1(R8)                                           00396200
SKIPDSN  DC    CL1'0'                                                   00396300
         DS    0H                                                       00396400
         EJECT                                                          00396500
         AIF   ('&SYSPARM' EQ 'EXIT').Z0010                             00396600
*********************************************************************** 00396700
*        COPY AND EXPAND PROCESSING                                   * 00396800
*********************************************************************** 00396900
Q0010    EQU   *                                                        00397000
         BAL   R14,DBLKREAD        READ RECORD                          00397100
         CLI   SYSPARM+4,C'P'      DO I WANT PRINT COPY OUTPUT          00397200
         BE    Q0020               YES                                  00397300
         LA    R0,CARDIN           POINT TO RECORD                      00397400
         L     R1,OUTFILAD         GET OUTPUT FILE ADDRESS              00397500
         PUT   (1),(0)             WRITE EXPANDED OUTPUT RECORD         00397600
         B     Q0010               READ NEXT RECORD                     00397700
Q0020    EQU   *                                                        00397800
         MVI   HDNGTYPE,C'I'       INDICATE TYPE OF HEADING (INPUT)     00397900
         MVC   PRTBUF,PRTCLR       CLEAR PRINT LINE                     00398000
         MVI   PRTCTL,X'09'        WRITE AND SPACE 1 COMMAND CODE       00398100
         MVC   PRTREC,CARDIN       MOVE RECORD TO PRINT BUFFER          00398200
         BAL   R14,PUTPRT          PRINT THE RECORD                     00398300
         B     Q0010               READ NEXT RECORD                     00398400
         EJECT                                                          00398500
         AIF   ('&OPSYS' NE 'VSE').Z0010                                00398600
*********************************************************************** 00398700
*        REPRO PROCESSING                                             * 00398800
*********************************************************************** 00398900
R0010    EQU   *                                                        00399000
         MVI   REPROFLG,C'1'       TURN ON REPRO FLAG                   00399100
         OPEN  CARDFIL             OPEN CARD INPUT FILE                 00399200
R0020    EQU   *                                                        00399300
         GET   CARDFIL             READ INPUT CARD                      00399400
         LA    R3,CARDIN           POINT TO INPUT AREA                  00399500
         LA    R4,CARDWORK         POINT TO WORK AREA                   00399600
         LA    R5,72               SET SCAN LIMIT                       00399700
         MVC   CARDWORK,SPACES     CLEAR WORK AREA                      00399800
R0030    EQU   *                                                        00399900
         CLI   0(R3),C' '          FIND FIRST NON-BLANK                 00400000
         BNE   R0040                                                    00400100
         LA    R3,1(0,R3)                                               00400200
         BCT   R5,R0030                                                 00400300
         B     R0020               READ NEXT CARD IF ALL BLANK          00400400
R0040    EQU   *                                                        00400500
         CLC   0(6,R3),=CL6'PUNCH' IS OPERATION A PUNCH                 00400600
         BNE   R0020               NO - READ NEXT CARD                  00400700
         LA    R3,6(0,R3)          BUMP OVER PUNCH OPERATOR             00400800
         SH    R5,=H'6'            FIX REMAINING LENGTH                 00400900
R0050    EQU   *                                                        00401000
         CLI   0(R3),C''''         FIND FIRST QUOTE                     00401100
         BE    R0060                                                    00401200
         LA    R3,1(0,R3)                                               00401300
         BCT   R5,R0050                                                 00401400
         B     R0020               READ NEXT CARD IF NO QUOTE           00401500
R0060    EQU   *                                                        00401600
         LA    R3,1(0,R3)          BUMP OVER QUOTE                      00401700
         BCTR  R5,0                FIX REMAINING LENGTH                 00401800
R0070    EQU   *                                                        00401900
         CLI   0(R3),C''''         CHK FOR ENDING QUOTE                 00402000
         BNE   R0080               NOT A QUOTE                          00402100
         CLI   1(R3),C''''         CHK FOR DOUBLE QUOTE                 00402200
         BNE   R0100               NOT DOUBLE QUOTE - PUT OUT CARD      00402300
R0080    EQU   *                                                        00402400
         MVC   0(1,R4),0(R3)       MOVE DATA FROM INPUT CARD TO WORK    00402500
         CLC   0(2,R3),=CL2''''''  IS THIS A DOUBLE QUOTE               00402600
         BE    R0090               YES - BUMP 2 BYTES                   00402700
         CLC   0(2,R3),=CL2'&&&&'  IS THIS A DOUBLE AMPERSAND           00402800
         BE    R0090               YES - BUMP 2 BYTES                   00402900
         LA    R3,1(0,R3)          BUMP UP INPUT POINTER                00403000
         LA    R4,1(0,R4)          BUMP UP WORK POINTER                 00403100
         BCT   R5,R0070            FIX REMAINING LENGTH AND LOOP BACK   00403200
         B     R0100               PUT OUT CARD                         00403300
R0090    EQU   *                                                        00403400
         LA    R3,2(0,R3)          BUMP UP INPUT POINTER 2 BYTES        00403500
         LA    R4,1(0,R4)          BUMP UP OUTPUT POINTER               00403600
         SH    R5,=H'2'            FIX REMAINING LENGTH                 00403700
         BP    R0070               LOOP BACK IF ANY LENGTH REMAINING    00403800
R0100    EQU   *                                                        00403900
         LA    R1,PCHCCB           POINT TO PUNCH CCB                   00404000
         EXCP  (1)                 WRITE OUTPUT RECORD                  00404100
         WAIT  (1)                 WAIT FOR I/O TO FINISH               00404200
         B     R0020               READ NEXT CARD                       00404300
R0110    EQU   *                                                        00404400
         CLOSE CARDFIL                                                  00404500
         EOJ                                                            00404600
         DS    0D                                                       00404700
PCHCCB   CCB   SYSPCH,PCHCCW,X'8000'                                    00404800
PCHCCW   CCW   X'01',CARDWORK,X'20',80                                  00404900
         EJECT                                                          00405000
*********************************************************************** 00405100
*        POSITION DISTRIBUTION TAPE TO VSE BACKUP FILE                * 00405200
*********************************************************************** 00405300
R0200    EQU   *                                                        00405400
         LA    R1,TPINCCB                                               00405500
         MVI   TPINCCW,X'3F'       SET FSF COMMAND CODE                 00405600
         EXCP  (1)                 FORWARD SPACE ONE FILE               00405700
         WAIT  (1)                                                      00405800
         MVI   TPINCCW,X'02'       SET READ COMMAND CODE                00405900
         EXCP  (1)                 READ NEXT RECORD                     00406000
         WAIT  (1)                                                      00406100
         TM    4(R1),X'01'         WAS TAPE MARK READ                   00406200
         BZ    R0200               NO - SKIP ANOTHER FILE               00406300
         EOJ                                                            00406400
         SPACE 3                                                        00406500
         DS    0D                                                       00406600
TPINCCB  CCB   SYS004,TPINCCW                                           00406700
TPINCCW  CCW   X'02',TPINBUF,X'30',1     READ W/SLI+SKIP                00406800
TPINBUF  DC    D'0'                                                     00406900
         EJECT                                                          00407000
.Z0010   ANOP                                                           00407100
*********************************************************************** 00407200
*        END OF JOB PROCESSING                                        * 00407300
*********************************************************************** 00407400
Z0010    EQU   *                                                        00407500
         MVI   EOJFLAG,C'1'        SET EOJ FLAG                         00407600
         CLI   SELTYPE,C'N'        WERE WE DOING NAME SELECT            00407700
         BE    Z0015               YES                                  00407800
         CLI   SELTYPE,C'T'        SELECT TABLE                         00407900
         BNE   Z0020               NO                                   00408000
Z0015    EQU   *                                                        00408100
         CP    NAMSELNO,NAMTBLNO   ANY NAMES FOUND                      00408200
         BNE   E0042               YES - GO PUT OUT SECTION TRAILER JCL 00408300
Z0020    EQU   *                                                        00408400
         BAL   R10,GEND010         PUT OUT END JCL                      00408500
         MVC   CARDWORK,SPACES                                          00408600
         MVC   SVDSNHD,SPACES                                           00408700
         LA    R0,CARDWORK                                              00408800
         MVI   IOCODE,C'9'         INDICATE EOJ CALL TO USER EXIT       00408900
         BAL   R10,GOUT020         CALL ANY USER EXIT                   00409000
         CLI   VRFLAG,C'1'         DID WE HAVE V/R DATA AND NOT USE IT  00409100
         BNE   Z0021               NO                                   00409200
         BAL   R3,Z9140            PUT OUT INFO MESSAGE                 00409300
Z0021    EQU   *                                                        00409400
         L     R2,FILEINAD         GET INPUT FILE ADDR                  00409500
         AIF   ('&OPSYS' EQ 'MVS').Z0021M                               00409600
         CLOSE (2)                 CLOSE INPUT FILE                     00409700
         AGO   .Z0021E                                                  00409800
.Z0021M  ANOP                                                           00409900
         CLOSE ((2))                                                    00410000
.Z0021E  ANOP                                                           00410100
         AIF   ('&OPSYS' NE 'VSE').Z0022                                00410200
         CLOSE CSLFILE                                                  00410300
         AIF   ('&SYSPARM' EQ 'EXIT').Z0070                             00410400
         CLI   OUTDEV,C'T'         WERE WE WRITING AN OUTPUT TAPE       00410500
         BNE   Z0022               NO - CLOSE FILE                      00410600
         CP    NOTPOUT,=P'0'       DID WE HAVE MULTIPLE TAPES OUT       00410700
         BNE   Z0022               YES - CLOSE FILE W/UNLOAD            00410800
         L     R1,TAPEOUAD         GET OUTPUT TAPE DTF ADDR             00410900
         NI    X'20'(R1),X'DF'     TURN OFF UNLOAD BIT IN TAPE DTF      00411000
Z0022    EQU   *                                                        00411100
.Z0022   ANOP                                                           00411200
         AIF   ('&SYSPARM' EQ 'EXIT').Z0070                             00411300
         CLI   OUTDEV,C'L'         WERE WE PRINTING                     00411400
         BE    Z0023               YES - DEFER CLOSE TO LATER           00411500
         CLI   OUTDEV,C'C'         WERE WE COPYING                      00411600
         BNE   Z0022C              NO - CLOSE OUTPUT FILE NOW           00411700
         CLI   SYSPARM+4,C'P'      WERE WE COPYING TO PRINT             00411800
         BE    Z0023               YES - DEFER CLOSE TO LATER           00411900
Z0022C   EQU   *                                                        00412000
         L     R2,OUTFILAD         GET OUTPUT FILE ADDR                 00412100
         AIF   ('&OPSYS' EQ 'MVS').MVSCLOS                              00412200
         CLOSE (2)                                                      00412300
         AGO   .Z0023                                                   00412400
.MVSCLOS ANOP                                                           00412500
         CLOSE ((2))                                                    00412600
         CLI   OUTDEV,C'S'         WAS OUTPUT A PDS                     00412700
         BNE   Z0023               NO                                   00412800
         L     R15,UCBADDR         GET UCB ADDRESS                      00412900
         USING UCBCMSEG,R15                                             00413000
         TM    UCBTBYT2,UCBRR      IS THIS A SHARED DASD                00413100
         BZ    Z0022               NO - CHK FOR ENQ                     00413200
         DROP  15                                                       00413300
*        IF SHARED DASD, DEQ ON UCB                                     00413400
         DEQ   (SPFEDIT,JFCBDSNM,44,SYSTEMS),RET=HAVE,UCB=UCBADDR       00413500
         B     Z0023                                                    00413600
Z0022    EQU   *                                                        00413700
*        PDS NOT SHARED DOES NOT NEED DEQ                               00413800
         TM    JFCBIND2,JFCSHARE   IS DISP=SHR                          00413900
         BZ    Z0023               NO - DONT NEED DEQ                   00414000
         DEQ   (SPFEDIT,JFCBDSNM,44,SYSTEMS),RET=HAVE                   00414100
.Z0023   ANOP                                                           00414200
Z0023    EQU   *                                                        00414300
         CLI   DIRFLAG,C'1'        WERE WE PRINTING A DIRECTORY         00414400
         BNE   Z0030               NO                                   00414500
         BAL   R14,H0200           YES - PRINT SECTION TOTALS           00414600
         MVC   PRTBUF,PRTCLR                                            00414700
         MVI   PRTCTL,X'0B'        SPACE ONE LINE COMMAND CODE          00414800
         BAL   R14,PUTPRT          SPACE ONE LINE                       00414900
         MVI   PRTCTL,X'09'        PRINT AND SPACE ONE COMMAND CODE     00415000
         MVC   DIRSECTT(15),=C'TOTAL DATA SETS'                         00415100
         MVC   DIRSTMT,=X'40206B2020206B202120'                         00415200
         ED    DIRSTMT,NODSNS      PRINT NO. OF DATA SETS               00415300
         BAL   R14,PUTPRT          PRINT THIS LINE                      00415400
         MVI   PRTCTL,X'11'        PRINT AND SPACE TWO COMMAND CODE     00415500
         MVC   DIRSECTT(16),=C'TOTAL STATEMENTS'                        00415600
         MVC   DIRSTMT,=X'40206B2020206B202120'                         00415700
         ED    DIRSTMT,TPSTMT      PRINT NO. OF STATEMENTS              00415800
         BAL   R14,PUTPRT          PRINT THIS LINE                      00415900
         LA    R2,ACTIONTB+12      POINT TO ACTION TOTAL COUNTERS       00416000
         BAL   R14,H0250           SET UP AND PRINT ACTION TOTALS       00416100
Z0030    EQU   *                                                        00416200
         CLOSE PRTOUT                                                   00416300
         SR    R15,R15                                                  00416400
         CLI   OUTPTFLG,C'1'       WAS ANY OUTPUT CREATED               00416500
         BE    *+8                 YES                                  00416600
         LA    R15,1               SET NO-OUTPUT RETURN CODE            00416700
         AIF   ('&OPSYS' EQ 'MVS').Z0060                                00416800
         EOJ   RC=(15)                                                  00416900
         AGO   .Z0100                                                   00417000
.Z0060   ANOP                                                           00417100
         L     R13,SAVEAREA+4                                           00417200
         L     R14,12(0,R13)                                            00417300
         LM    R0,R12,20(R13)                                           00417400
         BR    R14                                                      00417500
         AGO   .Z0100                                                   00417600
.Z0070   ANOP                                                           00417700
Z0070    EQU   *                                                        00417800
         L     R1,EXTIOCD          GET EXIT CODES ADDR                  00417900
         AIF   (&LIB AND '&SYSPARM' EQ 'EXIT').Z0070L                   00418000
         USING PANCODES,R1                                              00418100
         MVI   PANIO1,C'G'         INDICATE END OF INPUT                00418200
         AGO   .Z0070E                                                  00418300
.Z0070L  ANOP                                                           00418400
         MVI   1(R1),X'00'         INDICATE END OF INPUT                00418500
         B     EXIT                                                     00418600
LIBSKIP  EQU   *                                                        00418700
         L     R1,EXTIOCD          GET EXIT CODES ADDR                  00418800
         MVI   1(R1),X'0C'         INDICATE DELETE RECORD               00418900
         B     EXIT                                                     00419000
LIBEXIT  EQU   *                                                        00419100
         L     R1,EXTIOCD          GET EXIT CODES ADDR                  00419200
         MVI   1(R1),X'04'         INDICATE NORMAL RETURN               00419300
.Z0070E  ANOP                                                           00419400
EXIT     EQU   *                                                        00419500
         L     R13,SAVEAREA+4                                           00419600
         LM    R14,12,12(R13)                                           00419700
         BR    R14                                                      00419800
.Z0100   ANOP                                                           00419900
         EJECT                                                          00420000
*********************************************************************** 00420100
*        SET UP ERROR MESSAGES FOR PROCESSING STUFF                   * 00420200
*        R1 - ADDR OF OUTPUT MESSAGE                                  * 00420300
*        R3 - RETURN ADDRESS IF NOT A CANCEL                          * 00420400
*********************************************************************** 00420500
Z9080    EQU   *                                                        00420600
         LA    R1,MSG8             GET MESSAGE ADDR                     00420700
         B     Z9500               PUT OUT MESSAGE                      00420800
Z9110    EQU   *                                                        00420900
         LA    R1,MSG11            GET MESSAGE ADDR                     00421000
         B     Z9500               PUT OUT MESSAGE                      00421100
Z9140    EQU   *                                                        00421200
         LA    R1,MSG14            GET MESSAGE ADDR                     00421300
         MVI   CNCLFLAG,C'8'       INDICATE DO NOT CANCEL               00421400
         B     Z9500               PUT OUT MESSAGE                      00421500
Z9150    EQU   *                                                        00421600
         LA    R1,MSG15            GET MESSAGE ADDR                     00421700
         LA    R3,Z0021            SET RETURN ADDR                      00421800
         MVI   CNCLFLAG,C'8'       INDICATE DO NOT CANCEL               00421900
         B     Z9500               PUT OUT MESSAGE                      00422000
Z9200    EQU   *                                                        00422100
         MVC   MSG20+34(8),CDSVNAME PUT DATA SET NAME IN MESSAGE        00422200
         LA    R1,MSG20            GET MESSAGE ADDR                     00422300
         B     Z9500               PUT OUT MESSAGE                      00422400
         AIF   ('&OPSYS' EQ 'VSE').Z9260                                00422500
Z9210    EQU   *                                                        00422600
         LA    R1,MSG21            GET MESSAGE ADDR                     00422700
         CVD   R15,DBLWORD         CONVERT RTN CODE TO PACKED DECIMAL   00422800
         UNPK  MSG21+38(2),DBLWORD+6(2) UNPACK RETURN CODE              00422900
         OI    MSG21+39,X'F0'      FIX SIGN ON LAST CHARACTER           00423000
         B     Z9500               PUT OUT MESSAGE                      00423100
Z9220    EQU   *                                                        00423200
         LA    R1,MSG22            GET MESSAGE ADDR                     00423300
         CVD   R15,DBLWORD         CONVERT RTN CODE TO PACKED DECIMAL   00423400
         UNPK  MSG22+24(2),DBLWORD+6(2) UNPACK RETURN CODE              00423500
         OI    MSG22+25,X'F0'      FIX SIGN ON LAST CHARACTER           00423600
         B     Z9500               PUT OUT MESSAGE                      00423700
Z9230    EQU   *                                                        00423800
         LA    R1,MSG23            GET MESSAGE ADDR                     00423900
         CVD   R15,DBLWORD         CONVERT RTN CODE TO PACKED DECIMAL   00424000
         UNPK  MSG23+20(2),DBLWORD+6(2) UNPACK RETURN CODE              00424100
         OI    MSG23+21,X'F0'      FIX SIGN ON LAST CHARACTER           00424200
         B     Z9500               PUT OUT MESSAGE                      00424300
.Z9260   ANOP                                                           00424400
Z9260    EQU   *                                                        00424500
         MVI   MSG26+2,C'6'        SET MSG NO TO 26                     00424600
         MVC   MSG26+4(3),=CL3'ONL' SET KEYWORD NAME IN MSG             00424700
Z9261    EQU   *                                                        00424800
         MVC   MSG26+33(8),CDSVNAME PUT DATA SET NAME IN MESSAGE        00424900
         LA    R1,MSG26            GET MESSAGE ADDR                     00425000
         B     Z9500               PUT OUT MESSAGE                      00425100
Z9270    EQU   *                                                        00425200
         MVI   MSG26+2,C'7'        SET MSG NO TO 27                     00425300
         MVC   MSG26+4(3),=CL3'BAT' SET KEYWORD NAME IN MSG             00425400
         B     Z9261               FILL IN REST OF MESSAGE              00425500
         AIF   ('&OPSYS' EQ 'MVS').Z9350E                     2024183   00425550
         AIF   (NOT &LIBRM).Z9350E                                      00425600
Z9350    EQU   *                                                        00425700
         LA    R1,MSG35            GET MESSAGE ADDR                     00425800
         LA    R3,Z0021            GET RETURN ADDR                      00425900
         B     Z9500               PUT OUT MESSAGE                      00426000
.Z9350E  ANOP                                                           00426100
*********************************************************************** 00426200
*        ERROR MESSAGE PROCESSING                                     * 00426300
*        R1 - ADDR OF OUTPUT MESSAGE                                  * 00426400
*        R3 - RETURN ADDRESS IF NOT A CANCEL                          * 00426500
*********************************************************************** 00426600
Z9500    EQU   *                                                        00426700
         MVC   CSLBUF,SPACES                                            00426800
         MVC   CSLBUF(4),=C'DBLK'                                       00426900
         MVC   CSLBUF+4(2),1(R1)   PUT MSG NO. IN MSG                   00427000
         MVI   CSLBUF+7,C'-'                                            00427100
         SR    R2,R2                                                    00427200
         IC    R2,0(0,R1)          GET MESSAGE LENGTH                   00427300
         SH    R2,=H'5'            ADJUST MESSAGE LENGTH FOR EXECUTE    00427400
         EX    R2,MOVEMSG          PUT CONSOLE MESSAGE TEXT IN BUFFER   00427500
         MVC   MSGACT,3(R1)        SAVE ACTION CODE FROM MSG            00427600
         AIF   ('&OPSYS' NE 'VSE').Z9501                                00427700
         L     R1,CSLFILAD                                              00427800
         PUT   (1)                                                      00427900
         AGO   .Z9502                                                   00428000
.Z9501   ANOP                                                           00428100
         LA    R1,WTOLST           GET WTO PARM LIST                    00428200
         LA    R2,14(0,R2)         GET WHOLE MSG LENGTH +4 FOR WTO LIST 00428300
         STH   R2,WTOLST           SAVE LENGTH IN WTO PARAMETER LIST    00428400
         MVC   WTOLST+4(70),CSLBUF MOVE MSG FOR WTO                     00428500
*        WTO   MF=(E,(1))          EXECUTE WTO                          00428600
.Z9502   ANOP                                                           00428700
         AIF   ('&SYSPARM' EQ 'EXIT').Z9510                             00428800
         MVI   HDNGTYPE,C'E'       INDICATE TYPE OF HEADING (ERROR)     00428900
*        IF THIS ERROR MESSAGE IS CAUSED BY AN INPUT CARD, THE CARD HAS 00429000
*        ALREADY BEEN PRINTED AT THE A0230 LABEL.  IF NOT, WE DON'T     00429100
*        HAVE A CARD TO PRINT ANYWAY.                                   00429200
         MVC   PRTBUF,PRTCLR                                            00429300
         MVI   PRTCTL,X'09'        PRINT AND SPACE ONE COMMAND CODE     00429400
         MVC   PRTLNE+40(80),CSLBUF     MOVE CONSOLE MSG TO PRINT MSG   00429500
         BAL   R14,PUTPRT          PRINT ERROR MSG                      00429600
.Z9510   ANOP                                                           00429700
         CLI   CNCLFLAG,C'9'       DO WE CANCEL ANYTHING                00429800
         BE    Z9530               YES                                  00429900
         CLI   MSGACT,C'A'         DO WE RETURN                         00430000
         BER   R3                  YES                                  00430100
         CLI   MSGACT,C'B'         DELAYED CANCEL                       00430200
         BE    Z9520               YES                                  00430300
         CLI   MSGACT,C'C'         CANCEL NOW                           00430400
         BE    Z9530               YES                                  00430500
         CLI   MSGACT,C'D'         CANCEL WITH NO DUMP                  00430600
         BNE   Z9520               NO - DEFAULT TO DELAYED CANCEL       00430700
         MVI   CNCLFLAG,C'7'       YES - BUT INDICATE NO DUMP           00430800
         B     Z9530                                                    00430900
Z9520    EQU   *                                                        00431000
         MVI   CNCLFLAG,C'1'       SET CANCEL FLAG                      00431100
         BR    3                                                        00431200
Z9530    EQU   *                                                        00431300
         MVC   CSLBUF,SPACES                                            00431400
         MVC   CSLBUF(L'MSG99),MSG99                                    00431500
         AIF   ('&OPSYS' NE 'VSE').Z9530                                00431600
         L     R1,CSLFILAD                                              00431700
         PUT   (1)                                                      00431800
         CLI   DUMPFLAG,C'1'       FORCE A DUMP                         00431900
         BE    Z9535               YES                                  00432000
         AIF   ('&SYSPARM' EQ 'EXIT').Z9540D                            00432100
         CLI   CNCLFLAG,C'7'       JUST CANCEL ONLY - NO DUMP           00432200
         BE    Z9540               YES                                  00432300
Z9535    EQU   *                                                        00432400
         DUMP                                                           00432500
Z9540    EQU   *                                                        00432600
         CANCEL                                                         00432700
         AGO   .Z9560                                                   00432800
.Z9540D  ANOP                                                           00432900
         B     Z0070               FORCE END OF INPUT TO EXIT           00433000
Z9535    EQU   *                                                        00433100
         DUMP                                                           00433200
         AGO   .Z9560                                                   00433300
.Z9530   ANOP                                                           00433400
         LA    R1,WTOLST           GET WTO PARM LIST                    00433500
         LA    R2,L'MSG99+4        GET WHOLE MSG LENGTH +4 FOR WTO LIST 00433600
         STH   R2,WTOLST           SAVE LENGTH IN WTO PARAMETER LIST    00433700
         MVC   WTOLST+4(70),CSLBUF MOVE MSG FOR WTO                     00433800
*        WTO   MF=(E,(1))          EXECUTE WTO                          00433900
         CLI   DUMPFLAG,C'1'       FORCE A DUMP                         00434000
         BE    Z9535               YES                                  00434100
         AIF   ('&SYSPARM' EQ 'EXIT').Z9540M                            00434200
         CLI   CNCLFLAG,C'7'       JUST CANCEL ONLY - NO DUMP           00434300
         BE    Z9540               YES                                  00434400
Z9535    EQU   *                                                        00434500
         ABEND 999,DUMP,STEP                                            00434600
Z9540    EQU   *                                                        00434700
         ABEND 999,,STEP                                                00434800
         AGO   .Z9560                                                   00434900
.Z9540M  ANOP                                                           00435000
         B     Z0070               FORCE END OF INPUT TO EXIT           00435100
Z9535    EQU   *                                                        00435200
         ABEND 999,DUMP,STEP                                            00435300
.Z9560   ANOP                                                           00435400
MOVEMSG  MVC   CSLBUF+9(0),4(1)                                         00435500
         EJECT                                                          00435600
*********************************************************************** 00435700
*        WORKING STORAGE                                              * 00435800
*********************************************************************** 00435900
         DS    0D                                                       00436000
CARDIN   DC    CL80' '             WORK AREA FOR CARD IMAGE RECORDS     00436100
*                                                                       00436200
         ORG   CARDIN                                                   00436300
CDHDAPID DS    CL6                 APPLICATION CARD HEADER ID           00436400
         DS    CL74                                                     00436500
*                                                                       00436600
         ORG   CARDIN                                                   00436700
HDR1CD   DS    0CL36                                                    00436800
HDR1CDID DS    CL6                 HEADER 1 CARD ID - *HDR1=            00436900
HDR1APKY DS    CL30                TAPE KEY FIELD                       00437000
*                                                                       00437100
         ORG   CARDIN                                                   00437200
HDR2CD   DS    0CL50                                                    00437300
HDR2CDID DS    CL6                 HEADER 1 CARD ID - *HDR2=            00437400
HDR2APNM DS    CL44                APPLICATION NAME                     00437500
*                                                                       00437600
         ORG   CARDIN                                                   00437700
HDR3CD   DS    0CL36                                                    00437800
HDR3CDID DS    CL6                 HEADER 1 CARD ID - *HDR3=            00437900
HDR3COMP DS    CL30                TAPE COMPONENT DESCRIPTION FIELD     00438000
*                                                                       00438100
         ORG   CARDIN                                                   00438200
HDR4CD   DS    0CL80                                                    00438300
HDR4CDID DS    CL6                 HEADER 1 CARD ID - *HDR4=            00438400
HDR4SECT DS    CL3                 SECTION ID                           00438500
         DS    CL1                                                      00438600
HDR4DESC DS    CL30                SECTION NAME                         00438700
*                                                                       00438800
         ORG   CARDIN                                                   00438900
CDHDSECT DS    CL9                 SECTION HEADER ID                    00439000
CDHDSCNM DS    CL3                 SECTION HEADER NAME                  00439100
*                                                                       00439200
         ORG   CARDIN                                                   00439300
CDHDDSN  DS    CL5                 DATA SET HEADER ID                   00439400
CDHDNAME DS    CL8                 DATA SET NAME                        00439500
         DS    CL1                                                      00439600
CDHDTYPE DS    CL5                 DATA SET TYPE                        00439700
CDHDCBL2 DS    CL1                 COBOL II FLAG                        00439800
CDHDSTMT DS    CL5                 NO. STMTS IN DATA SET                00439900
CDHDOPS  DS    CL1                 SOURCE OPERATING SYSTEM PANVALET     00440000
CDHDOPSD EQU   C'D'                VSE ONLY MODULE                      00440100
CDHDOPSV EQU   C'V'                VSE ONLY MODULE                      00440200
CDHDOPSM EQU   C'M'                MVS ONLY MODULE                      00440300
CDHDOPSC EQU   C'S'                COMMON MODULE                        00440400
CDHDLVL  DS    CL3                 SI PANVALET LEVEL NO.                00440500
CDHDACT  DS    CL1                 UPDATE ACTION CODE                   00440600
ACTADD   EQU   C'A'                DATA SET ADDED                       00440700
ACTCOMP  EQU   C'B'                DATA SET NEEDS COMPILING             00440800
ACTCHG   EQU   C'C'                DATA SET CHANGED                     00440900
ACTDEL   EQU   C'D'                DATA SET DELETED                     00441000
ACTREP   EQU   C'R'                DATA SET REPLACED                    00441100
ACTSTAT  EQU   C' '                DATA SET NOT CHANGED                 00441200
CDHDCOM  DS    CL50                DATA SET DESCRIPTION                 00441300
*                                                                       00441400
         ORG   CARDIN                                                   00441500
CDHDDSN2 DS    CL6                 DATA SET HEADER 2 ID                 00441600
CDHDFINM DS    CL8                 FIAS DATA SET NAME                   00441700
         DS    CL1                                                      00441800
CDHDBTNM DS    CL8                 API BATCH NAME                       00441900
*                                                                       00442000
         ORG   CARDIN                                                   00442100
CDEODSN  DS    CL16                END OF DATA SET ID                   00442200
*                                                                       00442300
         ORG   CARDIN                                                   00442400
CDEOSECT DS    CL15                END OF SECTION ID                    00442500
*                                                                       00442600
         ORG   CARDIN                                                   00442700
CDINJCKY DS    CL5            PROTOTYPE JCL CARD ID                     00442800
CDINSECT DS    CL1            SAVE AREA IN PROTOTYPE JCL FOR SECT KEY   00442900
CDINTYPE DS    CL1            SAVE AREA IN PROTOTYPE JCL FOR TYPE KEY   00443000
         DS    CL2                                                      00443100
CDINJCL  DS    CL71                                                     00443200
         ORG                                                            00443300
         SPACE 3                                                        00443400
APPLCD   DC    CL80' '                                                  00443500
         ORG   APPLCD                                                   00443600
APPLCDID DS    CL6                 APPLICATION CARD ID - *APPL=         00443700
CDHDAPPL DS    CL2                 APPLICATION ID                       00443800
         DS    CL12                                                     00443900
CDHDAPSC DS    CL21                SECTION TABLE LEVEL ID AND FLAGS     00444000
         DS    CL9                                                      00444100
CDHDAPRN DS    CL4                 RELEASE NO.                          00444200
CDHDAPTM DS    CL3                 TEMP UPDATE NO.                      00444300
         DS    CL23                                           2024183   00444600
         ORG                                                            00444700
         SPACE 3                                                        00444800
SVDSNHD  DC    CL80' '             SAVE AREA FOR DATA SET HEADER CARD   00444900
         ORG   SVDSNHD                                                  00445000
         DS    CL5                                                      00445100
CDSVNAME DS    CL8                 DATA SET NAME                        00445200
         DS    CL1                                                      00445300
CDSVTYPE DS    CL5                 DATA SET TYPE                        00445400
CDSVCBL2 DS    CL1                 COBOL II FLAG                        00445500
CDSVSTMT DS    CL5                 NO. STMTS IN DATA SET                00445600
CDSVOPS  DS    CL1                 SOURCE OPERATING SYSTEM PANVALET     00445700
CDSVLVL  DS    CL3                 SI PANVALET LEVEL NO.                00445800
CDSVACT  DS    CL1                 UPDATE ACTION CODE                   00445900
CDSVCOM  DS    CL50                DATE SET DESCRIPTION                 00446000
         ORG                                                            00446100
SVDSNHD2 DC    CL80' '             SAVE AREA FOR DATA SET HEADER 2 CARD 00446200
         ORG   SVDSNHD2                                                 00446300
         DS    CL6                                                      00446400
CDSVFINM DS    CL8                 FIAS DATA SET NAME                   00446500
CDAPONNM EQU   CDSVFINM            API ONLINE NAME                      00446600
         DS    CL1                                                      00446700
CDAPBTNM DS    CL8                 API BATCH NAME                       00446800
         ORG                                                            00446900
SVDSNHD3 DC    CL80' '             SAVE AREA FOR DATA SET HEADER 3 CARD 00447000
SVDSNHD4 DC    CL80' '             SAVE AREA FOR DATA SET HEADER 4 CARD 00447100
SVDSNHD5 DC    CL80' '             SAVE AREA FOR DATA SET HEADER 5 CARD 00447200
         SPACE 3                                                        00447300
CARDSAVE DC    CL80' '             SAVE AREA FOR INPUT                  00447400
CARDWORK DC    CL80' '             WORK AREA TO BUILD JCL CARD          00447500
CSLBUF   DC    CL80' '             CONSOLE I/O AREA                     00447600
SPACES   DC    CL80' '             CONSTANT TO CLEAR WORK AREAS         00447700
SECTKEY  DC    CL9'*SECTION='                                           00447800
DSNKEY   DC    CL5'*DSN='                                               00447900
DSNEND   DC    CL16'*END OF DATA SET'                                   00448000
SECTEND  DC    CL15'*END OF SECTION'                                    00448100
SVSECTHD DS    0CL12               SAVE AREA FOR SECTION HEADER CARD    00448200
         DC    CL9' '                                                   00448300
SVSECTNM DC    CL3' '                                                   00448400
         EJECT                                                          00448500
DBLWORD  DC    D'0'                                                     00448600
*                            TABLE DEFAULTS TO "END OF TABLE"           00448700
IUSECTAD DC    F'0'          ADDRESS OF VALID SECTION CODES             00448800
JCLTBLAD DC    A(HEXFF)      JCL TABLE ADDR                             00448900
JCLTBLOC DC    A(HEXFF)      END OF JCL TABLE ADDR                      00449000
JCLTBLSZ DC    F'32000'      STORAGE FOR PROTOTYPE JCL (400 ENTRIES)    00449100
VRTBLAD  DC    A(HEXFF)      VER/REP TABLE ADDR                         00449200
VRTBLOC  DC    A(HEXFF)      CURRENT VER/REP TABLE ADDR                 00449300
VRTBLSZ  DC    F'720'        STORAGE FOR VER/REP TABLE (30 ENTRIES)     00449400
NAMTBLAD DC    A(HEXFF)      NAME TABLE ADDR                            00449500
NAMTBLOC DC    A(HEXFF)      END OF NAME SELECT TABLE ADDR              00449600
NAMTBLSZ DC    F'16000'      STORAGE FOR NAME SELECT TABLE (2000 ENT)   00449700
NAMTBLLN DC    F'8'          NAME SELECT TABLE ENTRY LENGTH             00449800
NAMEXCAD DC    A(HEXFF)      NAME EXCLUDE TABLE ADDR                    00449900
NAMEXLOC DC    A(HEXFF)      END OF NAME EXCLUDE TABLE ADDR             00450000
NAMEXCSZ DC    F'8000'       STORAGE FOR NAME EXCLUDE TABLE (1000 ENT)  00450100
SCANTBAD DC    F'0'          SCAN TRT TABLE ADDR                        00450200
SECCRDAD DC    F'0'          ADDR OF SECTION= CARD SECTION              00450300
SVALVRAD DC    F'0'          SAVE AREA FOR ALL VR JCL POINTER           00450400
FILEINAD DC    A(TAPEIN)     POINTER TO INPUT FILE DTF/DCB              00450500
TAPEINAD DC    A(TAPEIN)                                                00450600
         AIF   ('&OPSYS' EQ 'MVS').STACK                                00450700
DISKINAD DC    A(DISKIN)                                                00450800
CSLFILAD DC    A(CSLFILE)                                               00450900
.STACK   ANOP                                                           00451000
STACKKEY DC    CL8'STACK'    STACKID IN DUMP                            00451100
STACKPTR DC    A(STACK)      RETURN STACK POINTER                       00451200
STACK    DC    10F'0'        RETURN STACK                               00451300
         DC    X'FEFEFEFE'                                              00451400
STACKFRM DC    F'0'          ADDR OF LAST BRANCH TO POPSTAK             00451500
STACKLNG DC    H'4'          LENGTH OF EACH STACK ENTRY                 00451600
*                                                                       00451700
WKHDAPSC DC    XL64'00'      SECTION FLAGS OF SECTION SELECT LIST       00451800
WKSECTFL DC    XL64'00'      SECTION FLAGS OF SECTIONS ON INPUT         00451900
HEXFF    DC    8X'FF'                                                   00452000
WORKID   DC    XL2'00'                                                  00452100
NAMTBLNO DC    PL3'0'        NO. NAMES REMAINING IN SELECT TABLE        00452200
NAMSELNO DC    PL3'0'        NO. NAMES IN NAME SELECT TABLE             00452300
NAMEXCNO DC    PL2'0'        NO. NAMES IN NAME EXCLUDE TABLE            00452400
SELTYPE  DC    CL1'A'        DEFAULT TO ALL SECTIONS                    00452500
SELEXC   DC    CL1'S'        DEFAULT TO SELECT PREFIX=        9914000   00452550
TYPEINST DC    CL1'I'        DEFAULT TO TYPEINSTALL = INITIAL           00452600
INPTYPE  DC    CL1'F'        INPUT FILE FORMAT CODE                     00452700
CNCLFLAG DC    CL1'0'        DELAYED CANCEL FLAG                        00452800
REPROFLG DC    CL1'0'        REPRO PROCESSING FLAG                      00452900
MSGACT   DC    CL1' '        ACTION CODE FROM CONSOLE MESSAGE           00453000
DUMPFLAG DC    CL1'0'        FORCE DUMP FLAG                            00453100
VRFLAG   DC    CL1'0'        VERIFY/REPLACE USE FLAG                    00453200
NOCCOPT  DC    CL1'0'        NO CARRIAGE CTL OPTION                     00453300
EOJFLAG  DC    CL1'0'        INDICATE EOJ PROCESSING                    00453400
NODTAFLG DC    CL1'0'        INDICATE NO DETAIL DATA OUTPUT             00453500
SKIPREAD DC    CL1'1'        SKIP DETAIL READ FLAG                      00453600
OUTPTFLG DC    CL1'0'        OUTPUT CREATED FLAG                        00453700
STRTNAME DC    CL8' '        STARTING NAME IN A SECTION                 00453800
SYSPARM  DC    CL8' '        SYSPARM DATA                               00453900
DIRSCTID DC    CL3' '                                                   00454000
WKSECTID DC    CL3' '                                                   00454100
SVSECTID DC    CL3' '                                                   00454200
WRKSEC   DC    CL5' '                                                   00454300
WKSECTYP DC    CL3' '              DO NOT SEPARATE THIS AND THE NEXT    00454400
WKJCLTYP DC    CL2' '                  FIELD                            00454500
COB2NAME DC    CL8' '                                                   00454600
COB2PROC DC    CL1'0'              COBOL II FILTER OPTION               00454700
COB2FLAG DC    CL1'0'                                                   00454800
         AIF   ('&SYSPARM' EQ 'EXIT').MYSAVEA                           00454900
REPOPTN  DC    CL1'N'              PDS REPLACE OPTION                   00455000
         AIF   ('&OPSYS' EQ 'MVS').PDSADDR                              00455100
TAPCPYAD DC    A(TAPECPY)                                               00455200
DSKCPYAD DC    A(DISKCPY)                                               00455300
TAPESVAD DC    A(TAPESAVE)                                              00455400
DISKOUAD DC    A(DISKOUT)                                               00455500
PCHOUTAD DC    A(PCHOUT)                                                00455600
OUTDEV   DC    CL1'L'              OUTPUT DEVICE TYPE CODE              00455700
SEGFLAG  DC    CL1'0'              SEGMENT WANTED FLAG                  00455800
         DS    0F                                                       00455900
PWRPUN   DC    CL80'* $$ PUN'      POWER PUN CARD FOR SEGMENT           00456000
         AIF   ('&OPSYS' EQ 'MVS').RECADDR                    2024183   00456050
         AIF   (NOT &LIBRM).RECADDR                                     00456100
         DS    0D                                                       00456200
LIBNAME  DC    CL8' '                                                   00456300
SUBLIBNM DC    CL8' '                                                   00456400
MEMNAME  DC    CL8' '                                                   00456500
MEMTYPE  DC    CL8' '                                                   00456600
LIBRDCB  DC    (IALCLEN)X'00'                                           00456700
         AGO   .RECADDR                                                 00456800
.PDSADDR ANOP                                                           00456900
OUTDEV   DC    CL1'T'              OUTPUT DEVICE TYPE CODE              00457000
PDSNAME  DC    CL8' '              NAME OF PDS ENTRY                    00457100
         DC    XL4'00'             THIS MUST BE HERE FOR STOW           00457200
PDSOUTAD DC    A(PDSOUT)                                                00457300
PDSEXLST DC    X'87',AL3(JFCBAREA)                                      00457400
JFCBAREA DC    XL176'00'           WORK AREA FOR PDS JFCB               00457500
JFCBDSNM EQU   JFCBAREA,44         DATA SET NAME                        00457600
JFCBIND2 EQU   JFCBAREA+87,1                                            00457700
JFCSHARE EQU   X'08'               DISP=SHR                             00457800
         ORG                                                            00457900
UCBWKAR  DC    XL128'00'                                                00458000
UCBADDR  DC    F'0'                                                     00458100
PDSBUFAD DC    F'0'                                                     00458200
PDSBUFPT DC    F'0'                                                     00458300
PDSMAXBK DC    H'0'                                                     00458400
PDSREMLN DC    H'0'                                                     00458500
SPFEDIT  DC    CL8'SPFEDIT'                                             00458600
.RECADDR ANOP                                                           00458700
RECADDR  DC    F'0'                SAVE AREA FOR REG 0 FOR OUTPUT PRINT 00458800
OUTFILAD DC    F'0'                OUTPUT FILE ADDR                     00458900
CARDFIAD DC    A(CARDFIL)                                               00459000
TAPEOUAD DC    A(TAPEOUT)                                               00459100
PRTOUTAD DC    A(PRTOUT)                                                00459200
EXPAND   DC    CL6'EXPAND'                                              00459300
HDSECTID DC    CL3' '              SAVE AREA FOR HEADINGS SECTION ID    00459400
DIRFLAG  DC    CL1'0'              INDICATE DIRECTORY ONLY FLAG         00459500
NOHDGFLG DC    CL1'0'              INDICATE NO HEADING DETAIL OUTPUT    00459600
HDNGTYPE DC    CL1' '              HEADING TYPE PROCESSING FLAG         00459700
CARDFLAG DC    CL1'0'              CARDS READ FLAG                      00459800
TPLIMFLG DC    CL1'0'              TPLIMIT CARD ENTERED FLAG            00459900
LINECTR  DC    PL2'999'            LINE COUNTER FOR PRINT OUTPUT        00460000
LINELMT  DC    PL2'060'            LINE LIMIT ON PAGE FOR PRINT OUTPUT  00460100
PAGECTR  DC    PL2'0'                                                   00460200
WKLVL    DC    PL2'0'                                                   00460300
NOTPOUT  DC    PL2'0'              NO. OF OUTPUT TAPES MINUS ONE        00460400
NODSNS   DC    PL4'0'              COUNTER FOR NUMBER OF DATA SETS      00460500
WKSTMT   DC    PL4'0'                                                   00460600
SECTDSNS DC    PL4'0'              COUNTER FOR NO. DATA SETS IN SECT    00460700
SECTSTMT DC    PL4'0'              COUNTER FOR NO. STMTS IN SECTION     00460800
TPSTMT   DC    PL4'0'              COUNTER FOR NO. STMTS ON DIST TAPE   00460900
TPLIMIT  DC    PL4'9999999'        MAX. NO. CARDS ON ONE TAPE VOLUME    00461000
DSCNT    DC    PL4'0'              COUNTER FOR NO. OF DATA SETS         00461100
DSLIMIT  DC    PL4'9999999'        MAX. NO. DATA SETS PER OUTPUT GROUP  00461200
DSCUTOFF DC    PL4'9999999'        STOP AT THIS NO. DATA SETS           00461300
         AGO   .MSG8                                                    00461400
.MYSAVEA ANOP                                                           00461500
MYSAVEAR DC    12F'0'              SAVE AREA FOR MY REGISTERS           00461600
SAVEPARM DS    0CL8                                                     00461700
EXTIOREC DC    F'0'                ADDR OF EXIT IO RECORD               00461800
EXTIOCD  DC    F'0'                ADDR OF EXIT IO/RETURN CODES         00461900
PROCSW   DC    CL1'0'              EXIT PROCESSING SWITCH               00462000
.MSG8    ANOP                                                           00462100
MSG8     DC    AL1(MSG11-*)                                             00462200
         DC    C'08CINVALID SECTION ID ON DISTRIBUTION TAPE'            00462300
MSG11    DC    AL1(MSG14-*)                                             00462400
         DC    C'11CSTART DATA SET NAME NOT IN SELECTED SECTION'        00462500
MSG14    DC    AL1(MSG15-*)                                             00462600
         DC    C'14ANO VERIFY DATA FOUND IN THIS RUN'                   00462700
MSG15    DC    AL1(MSG20-*)                                             00462800
         DC    C'15ADISTRIBUTION TAPE CONTAINS NO SELECTED SECTIONS'    00462900
MSG20    DC    AL1(MSG20E-*)                                            00463000
         DC    C'20AFIASNAME INVALID FOR DATA SET XXXXXXXX - *NONAME* SX00463100
               UBSTITUTED'                                              00463200
MSG20E   EQU   *                                                        00463300
         AIF   ('&OPSYS' NE 'MVS').MSG23E                               00463400
MSG21    DC    AL1(MSG22-*)                                             00463500
         DC    C'21CGETMAIN FAILED FOR PDS BUFFER, RC=XX'               00463600
MSG22    DC    AL1(MSG23-*)                                             00463700
         DC    C'22CUCB SCAN FAILED, RC=XX'                             00463800
MSG23    DC    AL1(MSG23E-*)                                            00463900
         DC    C'23CSTOW FAILED, RC=XX'                                 00464000
MSG23E   EQU   *                                                        00464100
.MSG23E  ANOP                                                           00464200
MSG26    DC    AL1(MSG26E-*)                                            00464300
         DC    C'26AXXXNAME INVALID FOR DATA SET XXXXXXXX - *NONAME* SUX00464400
               BSTITUTED'                                               00464500
MSG26E   EQU   *                                                        00464600
         AIF   ('&OPSYS' EQ 'MVS').MSG35E                     2024183   00464610
         AIF   (NOT &LIBRM).MSG35E                                      00464700
MSG35    DC    AL1(MSG35E-*)                                            00464800
         DC    C'35CNO TARGET LIBRARY OR SUBLIBRARY ENTERED'            00464900
MSG35E   EQU   *                                                        00465000
.MSG35E  ANOP                                                           00465100
MSG99    DC    C'DBLK99 - JOB ABORTED DUE TO ERRORS'                    00465200
         EJECT                                                          00465300
*        STATIC AND DYNAMIC PROCESSING EXIT PARAMETER AREA              00465400
         WXTRN IUDSTXIT                                                 00465500
EXITADDR DC    V(IUDSTXIT)         PERMANENT EXIT ADDR                  00465600
DXITADDR DC    F'0'                DYNAMIC EXIT ADDR                    00465700
EXITPARM DC    F'0'                ADDR OF OUTPUT RECORD STORED HERE    00465800
         DC    A(EXITFLGS)                                              00465900
         DC    X'80'                                                    00466000
         DC    AL3(SVDSNHD)                                             00466100
EXITFLGS DS    0CL12               CONTROL FLAGS FOR USER EXIT          00466200
IOCODE   DC    CL1'0'              IOCODE FOR USER EXIT                 00466300
*              0 = INITIAL CALL                                         00466400
*              1 = BEFORE TAPE INPUT RECORD IS WRITTEN TO OUTPUT        00466500
*              2 = EXIT REQUESTED RETURN                                00466600
*              3 = BEFORE GENERATED RECORD IS WRITTEN TO OUTPUT         00466700
*              9 = EOJ CALL                                             00466800
*              I = INSERT RECORD TO OUTPUT (SET BY EXIT)                00466900
*              X = SKIP OUTPUT RECORD (SET BY EXIT)                     00467000
RTNCODE  DC    CL1'N'              USER RETURN CODE FOR USER EXIT       00467100
EXITSEC  DC    CL3' '              SECTION ID FOR PASSING TO USER EXIT  00467200
EXITREL  DC    CL7' '              RELEASE AND TEMP NUMBER (4.3)        00467300
EXITAPPL DC    CL2' '              APPLICATION ID FOR USER EXIT         00467400
         SPACE 3                                                        00467500
*        ACTION CODE DESCRIPTION AND COUNTER TABLE                      00467600
         DS    0D                                                       00467700
ACTIONTB DC    CL8'AADD    ',2PL4'0'                                    00467800
         DC    CL8'BCOMPILE',2PL4'0'                                    00467900
         DC    CL8'CCHANGE ',2PL4'0'                                    00468000
         DC    CL8'DDELETE ',2PL4'0'                                    00468100
         DC    CL8'RREPLACE',2PL4'0'                                    00468200
         DC    CL8' STATIC ',2PL4'0'                                    00468300
         DC    X'FF'                                                    00468400
ACTTABLN EQU   16                                                       00468500
         DS    0D                                                       00468600
SCANTBL  DC    XL256'00'           SCAN TRT TABLE                       00468700
         ORG   SCANTBL+C'&&'       OFFSET TO AMPERSAND                  00468800
         DC    C'&&'                                                    00468900
         ORG                                                            00469000
*                                                                       00469100
*        THIS TRANSLATE TABLE INDICATES WHAT DATA SET ACTIONS ARE TO    00469200
*        BE SELECTED                                                    00469300
*                                                                       00469400
         DS    0D                                                       00469500
ACTTBL   DC    XL256'00'                                                00469600
         ORG   ACTTBL+C' '                                              00469700
         DC    C' '                                                     00469800
         ORG   ACTTBL+C'A'                                              00469900
         DC    C'ABC'                                                   00470000
         ORG   ACTTBL+C'R'                                              00470100
         DC    C'R'                                                     00470200
         ORG   ACTTBL+C'S'                                              00470300
         DC    C'S'                                                     00470400
         ORG                                                            00470500
         SPACE 3                                                        00470600
*                                                                       00470700
*        THIS TABLE INDICATES WHAT DATA SET LANGUAGES ARE TO BE         00470800
*        SELECTED.                                                      00470900
*                                                                       00471000
LNGTBLOC DC    A(LANGTBL)          LANGUAGE SELECT TABLE ADDR           00471100
LANGTBL  DC    10XL5'FEFEFEFEFE'                                        00471200
         DC    X'FFFF'                                                  00471300
         SPACE 3                                                        00471400
*                                                                       00471500
*        THIS TABLE INDICATES WHAT APPLICATION PREFIXES ARE TO BE       00471600
*        SELECTED.                                                      00471700
*                                                                       00471800
SELPFXPT DC    A(SELPFXTB)                                              00471900
SELPFXTB DC    10XL8'FEFEFEFEFEFEFEFE'      SELECT PREFIX TABLE         00472000
         DC    X'FFFF'                                                  00472100
         SPACE 3                                                        00472200
SAVNMTBL DS    0CL20                                                    00472300
SVSRCNAM DC    CL8' '                                                   00472400
SVNEWNAM DC    CL8' '                                                   00472500
SVNMSECT DC    CL3' '                                                   00472600
         DC    CL1' '                                                   00472700
         SPACE 3                                                        00472800
         DS    0F                                                       00472900
WKSECTBL DC    CL30' '        WORK AREA FOR SECTION TABLE               00473000
         ORG   WKSECTBL                                                 00473100
WKSCID   DS    CL3            SECTION ID                                00473200
         DS    CL1                                                      00473300
WKSCSHAD DS    CL4            ADDR OF START OF SECTION HEADER JCL       00473400
WKSCDHAD DS    CL4            ADDR OF START OF DATA SET HEADER JCL      00473500
WKSCVRAD DS    CL4            ADDR OF START OF VERIFY/REPLACE DATA      00473600
WKSCDTAD DS    CL4            ADDR OF START OF DATA SET TRAILER JCL     00473700
WKSCSTAD DS    CL4            ADDR OF START OF SECTION TRAILER JCL      00473800
         ORG                                                            00473900
SECTBLAD DC    A(SECTBL+4)                                              00474000
SECTBLNG EQU   60                                                       00474100
SECTBLN  DC    AL2(SECTBLNG)                                            00474200
SECSELAD DC    A(SECSELTB)                                              00474300
SECSELTB DC    50XL4'00'           SECTION SELECT TABLE                 00474400
         DC    XL4'FFFFFFFF'                                            00474500
SECEXCAD DC    A(SECEXCTB)                                              00474600
SECEXCTB DC    50XL4'00'           SECTION EXCLUDE TABLE                00474700
         DC    XL4'FFFFFFFF'                                            00474800
SELSECT  DC    CL3' '              SELECT SECTION NAME                  00474900
SECTBLNO DC    PL2'000'            NO. OF SECTIONS SELECTED             00475000
SECEXCNO DC    PL2'000'            NO. OF SECTIONS EXCLUDED             00475100
*                                                                       00475200
VRTBLNG  EQU   24                                                       00475300
*        VER/REP TABLE FORMAT IS                                        00475400
*              SECTION ID          CL3                                  00475500
*              VER/REP LENGTH - 1  XL1                                  00475600
*              VERIFY DATA         CL10                                 00475700
*              REPLACE DATA        CL10                                 00475800
         EJECT                                                          00475900
*                                                                       00476000
*        THIS IS A TABLE OF KEYWORDS WHICH MAY APPEAR IN THE            00476100
*        PROTOTYPE JCL.  THE FORMAT IS:                                 00476200
*              LENGTH - 1 OF THE KEYWORD                         XL1    00476300
*              THE KEYWORD                                       CL11   00476400
*              LENGTH - 1 OF THE FIELD IN THE DATA SET HEADER    XL1    00476500
*                 OR THE RECEIVING FIELD IF LESS THAN THE               00476600
*                 SENDING FIELD.                                        00476700
*                 IF THIS FIELD IS X'FF', THE FOLLOWING FIELD           00476800
*                 IS A BRANCH ADDRESS FOR SPECIAL PROCESSING            00476900
*              FILLER - NOT USED                                 XL1    00477000
*              ADDRESS OF THE FIELD IN THE DATA SET HEADER       S      00477100
*                 OR SPECIAL PROCESSING BRANCH ADDRESS IN               00477200
*                 BASE/DISPLACEMENT FORMAT                              00477300
*                                                                       00477400
KEYWDTBL DS    0F                                                       00477500
         DC    X'04',CL11'LEVEL      ',X'0200',S(CDSVLVL)               00478000
         DC    X'06',CL11'COMMENT    ',X'2F00',S(CDSVCOM)               00478100
         AIF   ('&OPSYS' NE 'MVS').NOMVSTB                              00479000
         DC    X'03',CL11'NAME       ',X'FF00',S(GSP2000)               00479100
.NOMVSTB ANOP                                                           00479600
         AIF   ('&OPSYS' NE 'VSE').NOVSETB                              00479700
         DC    X'03',CL11'NAME       ',X'FF00',S(GSP1200)               00480000
.NOVSETB ANOP                                                           00480300
         AIF   (NOT &PAN).NOPANTB                                       00480400
         DC    X'05',CL11'FORMAT     ',X'FF00',S(GSP3000)               00480500
.NOPANTB ANOP                                                           00480600
         AIF   (NOT &LIB).NOLBTBD                                       00480700
         DC    X'03',CL11'DESC       ',X'1E00',S(CDSVCOM)               00480800
         DC    X'03',CL11'LANG       ',X'FF00',S(GSP4000)               00480900
         DC    X'02',CL11'SEQ        ',X'FF00',S(GSP4100)               00481000
.NOLBTBD ANOP                                                           00481100
         DC    X'FFFF'                                                  00481500
         EJECT                                                          00481600
         AIF   ('&SYSPARM' EQ 'EXIT').ENDPRT                            00481700
DIRHDNG1 DS    0CL77                                                    00481800
         DC    XL1'11'             PRINT AND SPACE 2 COMMAND CODE       00481900
DIRHD1DT DC    CL8' '                                                   00482000
         DC    CL8' '                                                   00482100
         DC    CL52' FIDELITY INSTALLATION SYSTEM DIRECTORY'  0354773   00482200
         DC    CL4'PAGE'                                                00482300
DIRHD1PG DC    CL4' '                                                   00482400
DIRHDNG2 DS    0CL86                                                    00482500
         DC    XL1'11'             PRINT AND SPACE 2 COMMAND CODE       00482600
DIRHD2TM DC    CL8' '                                                   00482700
         DC    CL6' '                                                   00482800
         DC    CL19'APPLICATION CODE - '                                00482900
DIRHD2AP DC    CL2' '                                                   00483000
         DC    CL6' '                                                   00483100
DIRHD2RT DC    CL14'RELEASE NO. - '                                     00483200
DIRHD2RN DC    CL4' '                                                   00483300
DIRHD2TP DC    CL3' '                                                   00483400
         DC    CL6' '                                                   00483500
         DC    CL17'IUDBKSRC/IU001   '                                  00483600
DIRHDNG3 DS    0CL67                                                    00483700
         DC    XL1'09'             PRINT AND SPACE 1 COMMAND CODE       00483800
         DC    CL22' '                                                  00483900
DIRHD3AP DC    CL44' '                                                  00484000
DIRHDNG4 DS    0CL53                                                    00484100
         DC    XL1'09'             PRINT AND SPACE 1 COMMAND CODE       00484200
         DC    CL22' '                                                  00484300
DIRHD4CO DC    CL30' '                                                  00484400
DIRHDNG5 DS    0CL53                                                    00484500
         DC    XL1'11'             PRINT AND SPACE 2 COMMAND CODE       00484600
         DC    CL22' '                                                  00484700
DIRHD5KY DC    CL30' '                                                  00484800
DIRHDNG6 DS    0CL53                                                    00484900
         DC    XL1'11'             PRINT AND SPACE 2 COMMAND CODE       00485000
         DC    CL12' '                                                  00485100
         DC    CL10'SECTION:  '                                         00485200
DIRHD6SD DC    CL30' '                                                  00485300
DIRHDNG7 DS    0CL55                                                    00485400
         DC    XL1'09'             PRINT AND SPACE 1 COMMAND CODE       00485500
         DC    CL52' MODULE    ONLINE/'                                 00485600
         DC    CL2'SI'                                                  00485700
         SPACE 3                                                        00485800
DIRHDNG8 DS    0CL70                                                    00485900
         DC    XL1'11'             PRINT AND SPACE 2 COMMAND CODE       00486000
         DC    CL51'  NAME    BATCH NAME  TYPE   ACTION    NO. STMTS'   00486100
         DC    CL18'LEVEL  DESCRIPTION'                                 00486200
         SPACE 3                                                        00486300
ACTRECP1 DS    0CL14                                                    00486400
         DC    X'09'                                                    00486500
         DC    CL13'ACTION RECAP:'                                      00486600
         SPACE 3                                                        00486700
BFSNOTE1 DS    0CL51                                                    00486800
         DC    XL1'09'             PRINT AND SPACE 1 COMMAND CODE       00486900
         DC    CL50'EACH MODULE MUST BE COMPILED/ASSEMBLED TWO TIMES -' 00487000
BFSNOTE2 DS    0CL68                                                    00487100
         DC    XL1'11'             PRINT AND SPACE 2 COMMAND CODE       00487200
         DC    CL46'FOR BATCH USE WITH MODULE NAME AND FOR ONLINE '     00487300
         DC    CL21'USE WITH ONLINE NAME.'                              00487400
         SPACE 3                                                        00487500
APANOTE2 DS    0CL67                                                    00487600
         DC    XL1'11'             PRINT AND SPACE 2 COMMAND CODE       00487700
         DC    CL45'FOR BATCH USE WITH BATCH NAME AND FOR ONLINE '      00487800
         DC    CL21'USE WITH ONLINE NAME.'                              00487900
         EJECT                                                          00488000
PRTCLR   DC    CL1' '                                                   00488100
PRTBUF   DS    0CL121              WORK AREA FOR PRINT OUTPUT           00488200
PRTCTL   DC    CL1' '                                                   00488300
PRTLNE   DC    CL120' '                                                 00488400
*                                                                       00488500
         ORG   PRTLNE                                                   00488600
PRTREC   DS    CL80                                                     00488700
         DS    CL40                                                     00488800
*                                                                       00488900
         ORG   PRTLNE                                                   00489000
DIRDETL  DS    0CL120                                                   00489100
DIRDSN   DS    CL8                                                      00489200
         DS    CL3                                                      00489300
DIRONDSN DS    CL8                                                      00489400
         DS    CL3                                                      00489500
DIRTYPE  DS    CL5                                                      00489600
DIRCBL2  DS    CL1                                                      00489700
         DS    CL1                                                      00489800
DIRACTN  DS    CL7                                                      00489900
DIRSTMT  DS    CL10                                                     00490000
         DS    CL4                                                      00490100
DIRLEVEL DS    CL4                                                      00490200
         DS    CL4                                                      00490300
DIRDESC  DS    CL50                                                     00490400
*                                                                       00490500
         ORG   PRTLNE                                                   00490600
DIRSECTT DS    CL34                                                     00490700
DIRSECTN DS    CL10                                                     00490800
*                                                                       00490900
         ORG   PRTLNE                                                   00491000
ACTATOTD DS    CL11                                                     00491100
ACTATOTN DS    CL6                                                      00491200
         DS    CL4                                                      00491300
ACTBTOTD DS    CL11                                                     00491400
ACTBTOTN DS    CL6                                                      00491500
         DS    CL4                                                      00491600
ACTCTOTD DS    CL11                                                     00491700
ACTCTOTN DS    CL6                                                      00491800
         DS    CL4                                                      00491900
ACTDTOTD DS    CL11                                                     00492000
ACTDTOTN DS    CL6                                                      00492100
         ORG                                                            00492200
SAVEPRTL DC    CL121' '                                                 00492300
         EJECT                                                          00492400
.ENDPRT  ANOP                                                           00492500
         LTORG                                                          00492600
         EJECT                                                          00492700
         AIF   ('&OPSYS' NE 'VSE').MVSDCBS                              00492800
CSLFILE  DTFCN DEVADDR=SYSLOG,IOAREA1=CSLBUF,BLKSIZE=80,               X00492900
               RECFORM=FIXUNB,TYPEFLE=INPUT                             00493000
         EJECT                                                          00493100
         AIF   (&LIB).LIB003                                  9913801   00493110
TAPEIN   DTFMT BLKSIZE=10000,DEVADDR=SYS004,EOFADDR=Z0010,FILABL=STD,  X00493200
               IOAREA1=TPIN1,IOAREA2=TPIN2,RECFORM=UNDEF,              X00493300
               TYPEFLE=INPUT,IOREG=(8),RECSIZE=(9)                      00493400
TPIN1    DS    0CL10000  DUMMY I/O AREAS FOR TAPEIN                     00493500
TPIN2    DS    0CL10000  THE REAL I/O AREAS ARE ALLOCATED FROM GETVIS   00493600
         EJECT                                                          00493700
DISKIN   DTFSD BLKSIZE=10000,DEVADDR=SYS004,EOFADDR=Z0010,DEVICE=3350, X00493800
               RECFORM=UNDEF,TYPEFLE=INPUT,IOREG=(8),RECSIZE=(9)        00493900
         AGO   .LIB004                                        9913801   00493905
.LIB003  ANOP                                                 9913801   00493910
* THE FOLLOWING STATEMENT(S) MODIFIED BY                      9913801   00493919
TAPEIN   DTFMT BLKSIZE=10000,DEVADDR=SYS010,EOFADDR=Z0010,FILABL=STD,  X00493920
               IOAREA1=TPIN1,IOAREA2=TPIN2,RECFORM=UNDEF,              X00493930
               TYPEFLE=INPUT,IOREG=(8),RECSIZE=(9)                      00493940
TPIN1    DS    0CL10000  DUMMY I/O AREAS FOR TAPEIN           9913801   00493950
TPIN2    DS    0CL10000  ACTUAL I/O AREAS ALLOCATED BY GETVIS 9913801   00493960
         EJECT                                                9913801   00493970
* THE FOLLOWING STATEMENT(S) MODIFIED BY                      9913801   00493979
DISKIN   DTFSD BLKSIZE=10000,DEVADDR=SYS020,EOFADDR=Z0010,DEVICE=3350, X00493980
               RECFORM=UNDEF,TYPEFLE=INPUT,IOREG=(8),RECSIZE=(9)        00493990
.LIB004  ANOP                                                 9913801   00493995
         EJECT                                                          00494000
         AIF   ('&SYSPARM' EQ 'EXIT').SECTBL                            00494100
CARDFIL  DTFDI DEVADDR=SYSIPT,IOAREA1=CARDIN,EOFADDR=A3000,RECSIZE=80   00494200
         EJECT                                                          00494300
TAPEOUT  DTFMT BLKSIZE=80,DEVADDR=SYS005,FILABL=NO,IOAREA1=OUTBUF1,    X00494400
               IOAREA2=OUTBUF2,WORKA=YES,RECFORM=FIXUNB,TYPEFLE=OUTPUT,X00494500
               REWIND=UNLOAD                                            00494600
TAPELNG  EQU   *-TAPEOUT                                                00494700
TAPESAVE DS    (TAPELNG)CL1                                             00494800
         EJECT                                                          00494900
TAPECPY  DTFMT BLKSIZE=10000,DEVADDR=SYS005,FILABL=STD,IOAREA1=OUTBUF1,X00495000
               IOAREA2=OUTBUF2,WORKA=YES,RECFORM=FIXBLK,TYPEFLE=OUTPUT,X00495100
               REWIND=UNLOAD,RECSIZE=80                                 00495200
         EJECT                                                          00495300
DISKCPY  DTFSD BLKSIZE=10008,WORKA=YES,RECSIZE=80,                     X00495400
               DEVICE=3330,RECFORM=FIXBLK,TYPEFLE=OUTPUT                00495500
         EJECT                                                          00495600
DISKOUT  DTFSD BLKSIZE=88,IOAREA1=OUTBUF1,IOAREA2=OUTBUF2,WORKA=YES,   X00495700
               DEVICE=3330,RECFORM=FIXUNB,TYPEFLE=OUTPUT                00495800
         EJECT                                                          00495900
PCHOUT   DTFCD DEVADDR=SYSPCH,IOAREA1=OUTBUF1,                         X00496000
               WORKA=YES,BLKSIZE=80,DEVICE=2540,                       X00496100
               RECFORM=FIXUNB,SSELECT=2,TYPEFLE=OUTPUT                  00496200
OUTBUF1  DS    CL88                                                     00496300
OUTBUF2  DS    CL88                                                     00496400
         EJECT                                                          00496500
PRTOUT   DTFPR DEVADDR=SYSLST,IOAREA1=PRTBUF1,IOAREA2=PRTBUF2,         X00496600
               WORKA=YES,BLKSIZE=121,CTLCHR=YES,DEVICE=PRT1,           X00496700
               RECFORM=FIXUNB                                           00496800
PRTBUF1  DS    CL121                                                    00496900
PRTBUF2  DS    CL121                                                    00497000
         EJECT                                                          00497100
         AGO   .SECTBL                                                  00497200
.MVSDCBS ANOP                                                           00497300
WTOLST   WTO   '1...5...10...15...20...25...30...35...40...45...50...55X00497400
               ...60...65...70',MF=L                                    00497500
         EJECT                                                          00497600
TAPEIN   DCB   DSORG=PS,MACRF=GL,EODAD=Z0010,DDNAME=SYSUT1,            X00497700
               RECFM=U                                                  00497800
         EJECT                                                          00497900
         AIF   ('&SYSPARM' EQ 'EXIT').SECTBL                            00498000
PDSOUT   DCB   DSORG=PO,MACRF=(R,W),DDNAME=SYSUT2,EXLST=PDSEXLST        00498100
         EJECT                                                          00498200
CARDFIL  DCB   DSORG=PS,MACRF=GM,EODAD=A3000,DDNAME=SYSIN,             X00498300
               RECFM=FB,LRECL=80                                        00498400
         EJECT                                                          00498500
TAPEOUT  DCB   DSORG=PS,MACRF=PM,DDNAME=SYSUT2,RECFM=FB,LRECL=80        00498600
         EJECT                                                          00498700
PRTOUT   DCB   DSORG=PS,MACRF=PM,DDNAME=SYSPRINT,RECFM=FBM,            X00498800
               LRECL=121,BLKSIZE=1210                                   00498900
         EJECT                                                          00499000
.SECTBL  ANOP                                                           00499100
*                                                                       00499200
*        THIS TABLE SAVES THE BEGINNING ADDRESSES OF THE PROTOTYPE JCL  00499300
*        FOR EACH SECTION. THE FORMAT OF EACH ENTRY IS:                 00499400
*                                                                       00499500
*        DS    CL3      SECTION ID (FROM HDR4 RECORDS ON TAPE)          00499600
*        DS    XL1      INTERNAL SECTION ID FOR SORTING, ETC.           00499700
*        DS    F        ADDR OF START OF SECTION HEADER JCL             00499800
*        DS    F        ADDR OF START OF DATA SET HEADER JCL            00499900
*        DS    F        ADDR OF START OF VERIFY/REPLACE DATA            00500000
*        DS    F        ADDR OF START OF DATA SET TRAILER JCL           00500100
*        DS    F        ADDR OF START OF SECTION TRAILER JCL            00500200
*        DS    XL6      FILLER (NOT USED)                               00500300
*        DS    CL30     SECTION DESCRIPTION (FROM HDR4 RECORDS ON TAPE) 00500400
*                                                                       00500500
SECTBL   DS    0D                                                       00500600
         DC    AL2(BEGSECT-SECTBL)     DISP TO 'BEG' SECTION ENTRY      00500700
         DC    AL2(ENDSECT-SECTBL)     DISP TO 'END' SECTION ENTRY      00500800
         DC    CL3'ALL',X'00',5F'0',XL6'00',CL30' '                     00500900
         DC    CL3'XXX',X'01',5F'0',XL6'00',CL30' '                     00501000
         DC    CL3'XXX',X'02',5F'0',XL6'00',CL30' '                     00501100
         DC    CL3'XXX',X'03',5F'0',XL6'00',CL30' '                     00501200
         DC    CL3'XXX',X'04',5F'0',XL6'00',CL30' '                     00501300
         DC    CL3'XXX',X'05',5F'0',XL6'00',CL30' '                     00501400
         DC    CL3'XXX',X'06',5F'0',XL6'00',CL30' '                     00501500
         DC    CL3'XXX',X'07',5F'0',XL6'00',CL30' '                     00501600
         DC    CL3'XXX',X'08',5F'0',XL6'00',CL30' '                     00501700
         DC    CL3'XXX',X'09',5F'0',XL6'00',CL30' '                     00501800
         DC    CL3'XXX',X'0A',5F'0',XL6'00',CL30' '                     00501900
         DC    CL3'XXX',X'0B',5F'0',XL6'00',CL30' '                     00502000
         DC    CL3'XXX',X'0C',5F'0',XL6'00',CL30' '                     00502100
         DC    CL3'XXX',X'0D',5F'0',XL6'00',CL30' '                     00502200
         DC    CL3'XXX',X'0E',5F'0',XL6'00',CL30' '                     00502300
         DC    CL3'XXX',X'0F',5F'0',XL6'00',CL30' '                     00502400
         DC    CL3'XXX',X'10',5F'0',XL6'00',CL30' '                     00502500
         DC    CL3'XXX',X'11',5F'0',XL6'00',CL30' '                     00502600
         DC    CL3'XXX',X'12',5F'0',XL6'00',CL30' '                     00502700
         DC    CL3'XXX',X'13',5F'0',XL6'00',CL30' '                     00502800
         DC    CL3'XXX',X'14',5F'0',XL6'00',CL30' '                     00502900
         DC    CL3'XXX',X'15',5F'0',XL6'00',CL30' '                     00503000
         DC    CL3'XXX',X'16',5F'0',XL6'00',CL30' '                     00503100
         DC    CL3'XXX',X'17',5F'0',XL6'00',CL30' '                     00503200
         DC    CL3'XXX',X'18',5F'0',XL6'00',CL30' '                     00503300
         DC    CL3'XXX',X'19',5F'0',XL6'00',CL30' '                     00503400
         DC    CL3'XXX',X'1A',5F'0',XL6'00',CL30' '                     00503500
         DC    CL3'XXX',X'1B',5F'0',XL6'00',CL30' '                     00503600
         DC    CL3'XXX',X'1C',5F'0',XL6'00',CL30' '                     00503700
         DC    CL3'XXX',X'1D',5F'0',XL6'00',CL30' '                     00503800
         DC    CL3'XXX',X'1E',5F'0',XL6'00',CL30' '                     00503900
         DC    CL3'XXX',X'1F',5F'0',XL6'00',CL30' '                     00504000
         DC    CL3'XXX',X'20',5F'0',XL6'00',CL30' '                     00504100
         DC    CL3'XXX',X'21',5F'0',XL6'00',CL30' '                     00504200
         DC    CL3'XXX',X'22',5F'0',XL6'00',CL30' '                     00504300
         DC    CL3'XXX',X'23',5F'0',XL6'00',CL30' '                     00504400
         DC    CL3'XXX',X'24',5F'0',XL6'00',CL30' '                     00504500
         DC    CL3'XXX',X'25',5F'0',XL6'00',CL30' '                     00504600
         DC    CL3'XXX',X'26',5F'0',XL6'00',CL30' '                     00504700
         DC    CL3'XXX',X'27',5F'0',XL6'00',CL30' '                     00504800
         DC    CL3'XXX',X'28',5F'0',XL6'00',CL30' '                     00504900
         DC    CL3'XXX',X'29',5F'0',XL6'00',CL30' '                     00505000
         DC    CL3'XXX',X'2A',5F'0',XL6'00',CL30' '                     00505100
         DC    CL3'XXX',X'2B',5F'0',XL6'00',CL30' '                     00505200
         DC    CL3'XXX',X'2C',5F'0',XL6'00',CL30' '                     00505300
         DC    CL3'XXX',X'2D',5F'0',XL6'00',CL30' '                     00505400
         DC    CL3'XXX',X'2E',5F'0',XL6'00',CL30' '                     00505500
         DC    CL3'XXX',X'2F',5F'0',XL6'00',CL30' '                     00505600
         DC    CL3'XXX',X'30',5F'0',XL6'00',CL30' '                     00505700
         DC    CL3'XXX',X'31',5F'0',XL6'00',CL30' '                     00505800
         DC    CL3'XXX',X'32',5F'0',XL6'00',CL30' '                     00505900
         DC    CL3'XXX',X'33',5F'0',XL6'00',CL30' '                     00506000
         DC    CL3'XXX',X'34',5F'0',XL6'00',CL30' '                     00506100
         DC    CL3'XXX',X'35',5F'0',XL6'00',CL30' '                     00506200
         DC    CL3'XXX',X'36',5F'0',XL6'00',CL30' '                     00506300
         DC    CL3'XXX',X'37',5F'0',XL6'00',CL30' '                     00506400
         DC    CL3'XXX',X'38',5F'0',XL6'00',CL30' '                     00506500
         DC    CL3'XXX',X'39',5F'0',XL6'00',CL30' '                     00506600
         DC    CL3'XXX',X'3A',5F'0',XL6'00',CL30' '                     00506700
         DC    CL3'XXX',X'3B',5F'0',XL6'00',CL30' '                     00506800
         DC    CL3'XXX',X'3C',5F'0',XL6'00',CL30' '                     00506900
         DC    CL3'XXX',X'3D',5F'0',XL6'00',CL30' '                     00507000
         DC    CL3'XXX',X'3E',5F'0',XL6'00',CL30' '                     00507100
         DC    CL3'XXX',X'3F',5F'0',XL6'00',CL30' '                     00507200
BEGSECT  DC    CL3'BEG',X'40',5F'0',XL6'00',CL30' '                     00507300
ENDSECT  DC    CL3'END',X'41',5F'0',XL6'00',CL30' '                     00507400
         DC    X'FFFF'                                                  00507500
         EJECT                                                          00507600
         AIF   (NOT &PAN OR '&SYSPARM' NE 'EXIT').ENDMOD                00507700
PANCODES DSECT                                                          00507800
PANIO1   DS    CL1                                                      00507900
         DS    CL1                                                      00508000
PANRTN   DS    CL1                                                      00508100
         SPACE 3                                                        00508200
.ENDMOD  ANOP                                                           00508300
         AIF   ('&OPSYS' NE 'VSE').MVSDSCT                              00508400
         AIF   ('&SYSPARM' EQ 'EXIT').LPLDSCT                           00508500
         EJECT                                                          00508600
         DIMOD TYPEFLE=INPUT                                            00508700
         EJECT                                                          00508800
         CDMOD RECFORM=FIXUNB,TYPEFLE=OUTPUT,WORKA=YES,DEVICE=2540      00508900
         EJECT                                                          00509000
         PRMOD RECFORM=FIXUNB,CTLCHR=YES,IOAREA2=YES,WORKA=YES,        X00509100
               DEVICE=PRT1                                              00509200
         EJECT                                                          00509300
.LPLDSCT ANOP                                                           00509400
         LPLDCT                                                         00509500
         EJECT                                                          00509600
         AGO   .END                                                     00509700
.MVSDSCT ANOP                                                           00509800
         AIF   ('&SYSPARM' EQ 'EXIT').NOUCB                             00509900
UCBCMSEG DSECT                                                          00510000
         DS    XL17        SKIP OVER FIRST PART OF UCB COMMON SECTION   00510100
UCBTBYT2 DS    XL1         UCB OPTION FLAGS                             00510200
UCBRR    EQU   X'20'       DEVICE IS SHARABLE BETWEEN TWO CPU'S         00510300
         SPACE 3                                                        00510400
.NOUCB   ANOP                                                           00510500
         PRINT NOGEN                                                    00510600
         DCBD  DSORG=PO,DEVD=DA                                         00510700
         PRINT GEN                                                      00510800
         EJECT                                                          00510900
.END     ANOP                                                           00511000