*     * FO5238*13/05/11 AUTO PROYECTO REBORN                            00000100
* COMM AREAS                                                            00000100
         DC    CL3'DSM',CL8'RMCMST00',CL4'    ',CL10'          '        00000200
         DC    CL3'DSM',CL8'RMCMSTPG',CL4'    ',CL10'          '        00000300
         DC    CL3'DSM',CL8'RMCMNA00',CL4'    ',CL10'          '        00000400
         DC    CL3'DSM',CL8'RMLNAI01',CL4'    ',CL10'          '        00000500
         DC    CL3'DSM',CL8'RMLNAITL',CL4'    ',CL10'          '        00000600
         DC    CL3'DSM',CL8'RMCMSS00',CL4'    ',CL10'          '        00000700
* MASTER DAGS                                                           00000800
         DC    CL3'DSM',CL8'RMMSRTCS',CL4'    ',CL10'          '        00000900
         DC    CL3'DSM',CL8'RMMSPHCS',CL4'    ',CL10'          '        00001000
         DC    CL3'DSM',CL8'RMMSPECS',CL4'    ',CL10'          '        00001100
         DC    CL3'DSM',CL8'RMMSEMCS',CL4'    ',CL10'          '        00001200
         DC    CL3'DSM',CL8'RMMSCOCS',CL4'    ',CL10'          '        00001300
         DC    CL3'DSM',CL8'RMMSCCCS',CL4'    ',CL10'          '        00001400
         DC    CL3'DSM',CL8'RMMSCNCS',CL4'    ',CL10'          '        00001500
         DC    CL3'DSM',CL8'RMMSCRCS',CL4'    ',CL10'          '        00001600
         DC    CL3'DSM',CL8'RMMSRMCS',CL4'    ',CL10'          '        00001700
         DC    CL3'DSM',CL8'RMMSRTNM',CL4'    ',CL10'          '        00001800
         DC    CL3'DSM',CL8'RMMSRTAD',CL4'    ',CL10'          '        00001900
         DC    CL3'DSM',CL8'RMMSCSRL',CL4'    ',CL10'          '        00002000
         DC    CL3'DSM',CL8'RMMSACRL',CL4'    ',CL10'          '        00002100
         DC    CL3'DSM',CL8'RMMSNMRL',CL4'    ',CL10'          '        00002200
         DC    CL3'DSM',CL8'RMMSADRL',CL4'    ',CL10'          '        00002300
         DC    CL3'DSM',CL8'RMMSNMXR',CL4'    ',CL10'          '        00002400
         DC    CL3'DSM',CL8'RMMSADXR',CL4'    ',CL10'          '        00002500
         DC    CL3'DSM',CL8'RMMSIDXR',CL4'    ',CL10'          '        00002600
         DC    CL3'DSM',CL8'RMMSPHXR',CL4'    ',CL10'          '        00002700
         DC    CL3'DSM',CL8'RMMSRTSE',CL4'    ',CL10'          '        00002800
         DC    CL3'DSM',CL8'RMMSRTSS',CL4'    ',CL10'          '        00002900
         DC    CL3'DSM',CL8'RMMSRTAR',CL4'    ',CL10'          '        00003000
         DC    CL3'DSM',CL8'RMMSCRAR',CL4'    ',CL10'          '        00003100
         DC    CL3'DSM',CL8'RMMSDPAR',CL4'    ',CL10'          '        00003200
         DC    CL3'DSM',CL8'RMMSLNAR',CL4'    ',CL10'          '        00003300
         DC    CL3'DSM',CL8'RMMSNAAR',CL4'    ',CL10'          '        00003400
         DC    CL3'DSM',CL8'RMMSPAAR',CL4'    ',CL10'          '        00003500
         DC    CL3'DSM',CL8'RMMSRTHB',CL4'    ',CL10'          '        00003510
* TRAN DAGS                                                             00003600
         DC    CL3'DSM',CL8'RMTRST00',CL4'    ',CL10'          '        00003700
         DC    CL3'DSM',CL8'RMTRCLLS',CL4'    ',CL10'          '        00003800
         DC    CL3'DSM',CL8'RMTRCLPR',CL4'    ',CL10'          '        00003900
         DC    CL3'DSM',CL8'RMTRRTCS',CL4'    ',CL10'          '        00004000
         DC    CL3'DSM',CL8'RMTRPHCS',CL4'    ',CL10'          '        00004100
         DC    CL3'DSM',CL8'RMTRPECS',CL4'    ',CL10'          '        00004200
         DC    CL3'DSM',CL8'RMTREMCS',CL4'    ',CL10'          '        00004300
         DC    CL3'DSM',CL8'RMTRCOCS',CL4'    ',CL10'          '        00004400
         DC    CL3'DSM',CL8'RMTRCCCS',CL4'    ',CL10'          '        00004500
         DC    CL3'DSM',CL8'RMTRCNCS',CL4'    ',CL10'          '        00004600
         DC    CL3'DSM',CL8'RMTRCRCS',CL4'    ',CL10'          '        00004700
         DC    CL3'DSM',CL8'RMTRRMCS',CL4'    ',CL10'          '        00004800
         DC    CL3'DSM',CL8'RMTRRTNM',CL4'    ',CL10'          '        00004900
         DC    CL3'DSM',CL8'RMTRRTAD',CL4'    ',CL10'          '        00005000
         DC    CL3'DSM',CL8'RMTRCSRL',CL4'    ',CL10'          '        00005100
         DC    CL3'DSM',CL8'RMTRACRL',CL4'    ',CL10'          '        00005200
         DC    CL3'DSM',CL8'RMTRNMRL',CL4'    ',CL10'          '        00005300
         DC    CL3'DSM',CL8'RMTRADRL',CL4'    ',CL10'          '        00005400
         DC    CL3'DSM',CL8'RMTRAI01',CL4'    ',CL10'          '        00005500
         DC    CL3'DSM',CL8'RMTRRL01',CL4'    ',CL10'          '        00005600
         DC    CL3'DSM',CL8'RMTRACBL',CL4'    ',CL10'          '        00005700
         DC    CL3'DSM',CL8'RMTRNA00',CL4'    ',CL10'          '        00005800
         DC    CL3'DSM',CL8'RMTRSS00',CL4'    ',CL10'          '        00005900
         DC    CL3'DSM',CL8'RMTRRTSE',CL4'    ',CL10'          '        00006000
         DC    CL3'DSM',CL8'RMTRRTSS',CL4'    ',CL10'          '        00006100
         DC    CL3'DSM',CL8'RMTRAPSS',CL4'    ',CL10'          '        00006200
         DC    CL3'DSM',CL8'RMTRACSS',CL4'    ',CL10'          '        00006300
         DC    CL3'DSM',CL8'RMTRCSSS',CL4'    ',CL10'          '        00006400
         DC    CL3'DSM',CL8'RMTRRLSS',CL4'    ',CL10'          '        00006500
         DC    CL3'DSM',CL8'RMTRSBSS',CL4'    ',CL10'          '        00006600
         DC    CL3'DSM',CL8'RMTRRTAR',CL4'    ',CL10'          '        00006700
         DC    CL3'DSM',CL8'RMTRCRAR',CL4'    ',CL10'          '        00006800
         DC    CL3'DSM',CL8'RMTRDPAR',CL4'    ',CL10'          '        00006900
         DC    CL3'DSM',CL8'RMTRLNAR',CL4'    ',CL10'          '        00007000
         DC    CL3'DSM',CL8'RMTRNAAR',CL4'    ',CL10'          '        00007100
         DC    CL3'DSM',CL8'RMTRRTHB',CL4'    ',CL10'          '        00007110
* RM PARMS DAGS                                                         00007200
         DC    CL3'DSM',CL8'RMCTOP01',CL4'    ',CL10'          '        00007300
         DC    CL3'DSM',CL8'RMCTOPAA',CL4'    ',CL10'          '        00007400
         DC    CL3'DSM',CL8'RMCTOPAD',CL4'    ',CL10'          '        00007500
         DC    CL3'DSM',CL8'RMCTRLNA',CL4'    ',CL10'          '        00007600
         DC    CL3'DSM',CL8'RMCTRLCA',CL4'    ',CL10'          '        00007700
         DC    CL3'DSM',CL8'RMCTRLCC',CL4'    ',CL10'          '        00007800
         DC    CL3'DSM',CL8'RMCTRLLT',CL4'    ',CL10'          '        00007900