*     * FO5238*13/05/11 AUTO PROYECTO REBORN                            00000100
******************************************************************      00000100
*DICTIONARY OBJECT RMDAGRMWKAD03                                 *      00000200
* GENERATED 06/07/93  08.07.53                                   *      00000300
*PARSED STANDARDIZED ADDRESS COMM AREA                           *      00000400
******************************************************************      00000500
RMDSAD03 DSECT                         NAME-ADDR-PARSING-OUT.           00000600
WK3RETCD DS    CL1                     PRS-ADDR-RETURN-CD               00000700
WK3NBRLI DS    CL1                     NBR-LINES-PARSED                 00000800
WK3PRSAD DS    0CL125                  PARSED-STRT-ADDR.                00000900
WK3HOUSE DS    CL10                    HOUSE-NBR                        00001000
WK3DIR   DS    CL10                    DIR                              00001100
WK3STNME DS    CL25                    STRT-NAME                        00001200
WK3STTYP DS    CL10                    STRT-TYPE                        00001300
WK3ADTYP DS    CL10                    SUB-ADDR-TYP                     00001400
WK3ADNBR DS    CL10                    SUB-ADDR-NBR                     00001500
WK3ADOVF DS    CL50                    ADDR-OVRFL                       00001600
         EJECT                                                          00001700