*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************** 00000000
* ***                KEYWORD TABLE ROUTINES REQUEST BLOCK         *** * 00001000
*********************************************************************** 00002000
         SPACE                                                          00003000
KRQDSCT  DSECT                                                          00004000
KRQREQ   DS    CL4                 REQUEST CODE                         00005000
KRQSEV   DS    XL2                 SEVERITY CODE                        00006000
KRQRET   DS    XL2                 RETURN CODE                          00007000
KRQLOC   DS    F                   ADDRESS OF REQUESTED DATA (LOC MODE) 00008000
KRQTLOC  DS    F                   ADDRESS OF KEYWORD TABLE ENTRY       00009000
KRQKWDS  EQU   *                   BEGINNING OF KEYWORD LIST            00010000