*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
SAC9CRQD DSECT                         COMMAND REQUEST DAG              00001000
CRQACTN  DS    CL6                     ACTION                           00002000
CRQRSLT  DS    XL2                     RESULT                           00003000
CRQLGTH  EQU   *-SAC9CRQD              LENGTH OF SAC9CRQD               00004000