*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************** 00001000
*                    ** HISTORY OF REVISIONS **                       * 00002000
* DESCRIPTION                                                 CHNG ID * 00003000
* ___________________________________________________________ _______ * 00004000
* 10/14/08 GN5717 INITIAL DISTRIBUTION                        ~~~5717   00005001
*********************************************************************** 00006000
** SAD9FUDA - REQUEST COMMAREA FOR SADUFTIL                             00007000
SAD9FUDA DSECT                                                          00008000
SADFUMMA DS    0CL56          COMM AREA FOR USE IN SADSCDDB             00009000
SADFUDAG DS    CL8           DAG NAME FOR USE IN SADSCDDB               00010000
SADFUELE DS    CL30          COBOL ELEMENT FOR USE IN SADSCDDB          00011000
SADFUIAD DS    XL4           INPUT ADDRESS FOR USE IN SADSCDDB          00012000
SADFUOAD DS    XL4           OUTPUT ELEMENT FOR USE IN SADSCDDB         00013000
SADFUDLN DS    XL4           LENGTH OF DATA                             00014000
SADFULEN DS    XL4           LENGTH OF DAG                              00015000
SADFURTN DS    CL2           RETURN CODE                                00016000
SADFULNC EQU   *-SADFUMMA    ..LENGTH COMM AREA                         00017000