*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************** 00000000
*                                                                     * 00001000
* SAD9EQ1A - EQUATE DATA - LOOKUP EQUATE DESCRIPTION FROM CODE        * 00002000
*                                                                     * 00003000
*********************************************************************** 00004000
DE1MAP   DSECT                                                          00005000
DE1RECLN DS    HL2                 RECORD LENGTH                        00006000
DE1KEY   DS   0CL18                RECORD KEY                           00007000
DE1ELEID DS    CL8                 ELEMENT ID                           00008000
DE1CODE  DS    CL10                FILE DATA (CODE)                     00009000
DE1BIDIR DS    CL1                 BIDIRECTIONAL LOOKUP FLAG (Y/N)      00010000
DE1DATLN DS    HL2                 DESCRIPTION DATA LENGTH              00011000
DE1DATA  DS    CL40                EQUATE DATA (DESCRIPTION)            00012000