*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************** 00000000
*                                                                     * 00001000
* SAD9EQ2A - EQUATE DATA - LOOKUP FILE CODE FROM EXTERNAL DESCRIPTION * 00002000
*                                                                     * 00003000
*********************************************************************** 00004000
DE2MAP   DSECT                                                          00005000
DE2RECLN DS    HL2                 RECORD LENGTH                        00006000
DE2KEY   DS   0CL48                RECORD KEY                           00007000
DE2ELEID DS    CL8                 ELEMENT ID                           00008000
DE2DATA  DS    CL40                EQUATE DATA (DESCRIPTION)            00009000
DE2DATLN DS    HL2                 CODE DATA LENGTH                     00010000
DE2CODE  DS    CL10                FILE DATA (CODE)                     00011000