*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
         MACRO                                                          00000000
         SAP8004M &DSECT=YES,&TYPE=P                                    00001000
         AIF   ('&DSECT' EQ 'YES').M04DSCT                              00002000
&TYPE.45AREA  DS    0F                                                  00003000
         AGO   .M04CONT                                                 00004000
.M04DSCT ANOP                                                           00005000
&TYPE.45AREA DSECT                                                      00006000
.M04CONT ANOP                                                           00007000
**********************************************************************  00008000
*        FIELD DESCRIPTION TABLE ENTRY                               *  00009000
**********************************************************************  00010000
&TYPE.45FLDID DS    XL2    FIELD NUMBER                                 00011000
&TYPE.45DESC  DS    H      FIELD DESCRIPTION                            00012000
&TYPE.45LGTH  EQU   *-&TYPE.45AREA                                      00013000
         MEND                                                           00014000