*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*---------------------------------------------------------------------* 00000010
*                  ** COPYBOOK DESCRIPTION **                         * 00000020
* PARMS MEMBER CONTROL AREA.                                          * 00000030
*                                                                     * 00000040
*---------------------------------------------------------------------* 00000050
*                  ** HISTORY OF REVISIONS **                         * 00000060
*                                                                     * 00000070
* DESCRIPTION                                                 CHNG ID * 00000080
* __________________________________________________________  _______ * 00000090
* 03/24/03  ADD OFFSET TO P30AREA SO SAP0083B HAS ACCESS      0334673 * 00000996
*---------------------------------------------------------------------* 00000998
SAP9PMCD DSECT               PARMS MEMBER CONTROL FOR CHANGE CNTL       00001000
PMCACTN  DS    CL3                     ACTION   - ADD,DEL,CMP           00002000
PMCSTOP  DS    CL1                     STOP     - Y,N                   00003000
PMCSEL   DS    CL1                     SELECTED - Y,N                   00004000
PMCEXCP  DS    CL1                     EXCEPT   - Y,N                   00005000
PMCTYPE  DS    CL3                     TYPE     - VAN,PRD,BTH           00006000
PMCVRDS  DS    XL4                     VAN - READS                      00007000
PMCVSELD DS    XL4                     VAN - SELECTED                   00008000
PMCVADDS DS    XL4                     VAN - ADDS                       00009000
PMCVCHGS DS    XL4                     VAN - CHGS                       00010000
PMCVDELS DS    XL4                     VAN - DELS                       00011000
PMCVEQUS DS    XL4                     VAN - EQUALS                     00012000
PMCPRDS  DS    XL4                     PRD - READS                      00013000
PMCPSELD DS    XL4                     PRD - SELECTED                   00014000
PMCPADDS DS    XL4                     PRD - ADDS                       00015000
PMCPCHGS DS    XL4                     PRD - CHGS                       00016000
PMCPDELS DS    XL4                     PRD - DELS                       00017000
PMCPEQUS DS    XL4                     PRD - EQUALS                     00018000
PMCCNFLT DS    XL4                     CONFLICTS              2500317   00018010
PMCPCRIN DS    CL1                     CREATE PCR             2500317   00018020
PMCFILL  DS    CL2                     FILLER                 0334673   00018025
PMC30OFF DS    XL4                     OFFSET TO P30AREA      0334673   00018030
PMCLGTH  EQU   *-SAP9PMCD              LENGTH OF SAP9PMCD               00019000