*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************** 00001000
*                    ** HISTORY OF REVISIONS **                       * 00002000
* DESCRIPTION                                                 CHNG ID * 00003000
* ___________________________________________________________ _______ * 00004000
* 10/14/08 GN5717 INITIAL DISTRIBUTION                        ~~~5717   00005001
*********************************************************************** 00006000
** SAP9UDGA - USED TO GIVE ACCESS TO THE PARMS DAG ADDRESS              00007000
SAPUDGAD DSECT                                                          00008000
USRDADDR DS    XL4           ADDRESS IN USER DAG FOR SAP0092B           00009000
USRDGLEN DS    XL4           LENGTH OF  USER DAG IN STORAGE             00010000
USRDSLEN EQU   *-USRDADDR    ..LENGTH USER AREA                         00011000