*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
P60AREA  DSECT             WORK DATA GROUP                              00000100
**********************************************************************  00000200
*        LAYOUT OF PARMS SCREEN MANAGER WORK DATA GROUP              *  00000300
**********************************************************************  00000400
*                                                                       00000500
P60DATE  DS    CL8                 SCREEN INPUT DATE MMDDCCYY 2602675   00000600
P60SDR1  DS    CL8                     SDR # 1 FOR SID BEING DISPLAYED  00000700
P60SEQ   DS    CL2                     SDR SEQ NUMBER                   00000800
P60MENU  DS    CL8                     ORIGINATING MENU SDR NAME        00000900
P60STAT  DS    CL1                     DISPLAY STATUS                   00001000
P60MKLG  DS    XL2                     MEMBER KEY LGTH                  00001100
P60VARDG DS    CL1                     VAR LGTH DAG                     00001200
P60UDGID DS    CL8                     USER DATA GROUP ID               00001300
P60PDEX  DS    CL8                     PRE-DISPLAY EXIT PGM             00001400
P60SID   DS    CL8                     STRUCTURE ID - CURRENT           00001500
P602CTL  DS    CL2                     CONTROL 1 - CURRENT - TWO BYTE   00001600
P602CTLP DS    CL2                     CONTROL 1 - PREV    - TWO BYTE   00001700
P604CTL  DS    CL4                     CONTROL 1 - FOUR BYTE            00001800
P604CTLA DS    CL4                     CONTROL 1 - AUDIT SCREEN FIID    00001900
P60LGTH  EQU *-P60AREA                                                  00002000
*                                                                       00002100