*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
* THE FOLLOWING STATEMENT(S) MODIFIED BY                      1035884   00009999
SAHTMLRX DSECT                                                          00010000
HTMLRX   DS    0XL171                                         1035884   00020000
HTMLRECL DS    XL02          ..RECORD LENGTH                  1035884   00030000
HTMLRN   DS    PL03          ..REPORT NUMBER                  1035884   00040000
HTMLNB   DS    XL02          ..NUMBER BREAKS                  1035884   00050000
HTMLTL   DS    PL03          ..TOTAL LINE LIMIT               1035884   00051000
HTMLRB   DS    9CL18         ..REPORT EVENT CODES             1035884   00060000