*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*                                                                     * 00001000
*********************************************************************** 00002000
*                                                                     * 00003000
* * * * * * *         S   C   R   I   P   T             * * * * * * * * 00004000
*                                                                     * 00005000
*      SCRIPT RECORD FORMAT                                           * 00006000
*                                                                     * 00007000
*********************************************************************** 00008000
         SPACE 3                                                        00009000
SCRIPT   DS    0F                                                       00010000
SCPTLGTH DS    XL2                 LENGTH OF DAG                        00011000
SCPTNAME DS    CL08                SCRIPT NAME                          00012000
SCPTDESC DS    CL40                SCRIPT DESCRIPTION                   00013000
SCPTNBR  DS    XL2                 NUMBER OF SCRIPT ENTRIES             00014000
SCPTMODS DS    20CL8               CONTROL MODULE NAMES                 00015000
SCPTTERM DS    CL08                TERMINATOR                           00016000
SCPTLEN  EQU   *-SCRIPT                                                 00017000
*                                                                     * 00018000
*********************************************************************** 00019000