*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
* *** COPY BOOK: SAS9PRMD                                               00001000
* *** PARM= STATEMENT FROM EXEC JCL STMT                                00002000
* ***                                                                   00004000
SAS9PRMD DSECT                                                          00005000
*                  (OFFSET)                                             00006000
S9PARMLN DS    XL2     0     LENGTH OF PARM STATEMENT 100 MAXIMUM       00007000
S9PARMBD DS    CL100   2     BODY OF PARM STMT                          00008000
S9PARMXX EQU   *-S9PARMLN    ..LENGTH OF AREA                           00009000