*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*                                                                     * 00001000
*********************************************************************** 00002000
*                                                                     * 00003000
* * * * * * *           S  A  D  D  E  T                * * * * * * * * 00004000
*                                                                     * 00005000
*      DATA DICTIONARY DAG EDIT INFORMATION TABLES TABLE              * 00006000
*                                                                     * 00007000
*********************************************************************** 00008000
         SPACE 3                                                        00009000
SADDETT  DSECT                                                          00010000
SDDETDGN DS    CL08                DATA GROUP NAME                      00011000
SDDETADR DS    CL04                ADDR OF DAG EDIT INFO TABLE          00012000
SDDETLGN DS    AL02                LENGTH OF  ' '     ' '               00013000
         DS    0F                                                       00014000
SDDETLEN EQU   *-SADDETT                                                00015000
DSMELEN  EQU   *-SADDETT                                                00016000
*                                                                     * 00017000
*********************************************************************** 00018000