*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
         MACRO                                                          00000100
&LABEL   SAS9LDAM &DSECT=YES                                            00000200
         LCLC  &LDALAB                                                  00000300
&LDALAB  SETC  'SASLDA'                                                 00000400
         AIF   ('&LABEL' EQ '').GLABEL                                  00000500
&LDALAB  SETC  '&LABEL'                                                 00000600
.GLABEL  ANOP                                                           00000700
*---------------------------------------------------------------------* 00000800
*                     LOG DATA AREA                                   * 00000900
*                                                                     * 00001000
* THIS MACRO DEFINES THE FORMAT OF EACH DAG STORED IN THE TSLOG PDA   * 00001100
* AND EACH DAG IN THE INTERNAL LOG CHAIN MAINTAINED BY SASERVO DURING * 00001200
* THE PROCESSING OF THE 'LOG' API COMMAND.                            * 00001300
*                                                                     * 00001400
*---------------------------------------------------------------------* 00001500
*                  ** HISTORY OF REVISIONS **                         * 00001600
*                                                                     * 00001700
*                                                                     * 00001800
* DESCRIPTION                                                  CHGID  * 00001900
* __________________________________________________________  _______ * 00002000
*                                                                     * 00002100
* 02/01/1995  INITIAL DISTRIBUTION                                    * 00002200
*                                                                     * 00002300
*---------------------------------------------------------------------* 00002400
         AIF   ('&DSECT' EQ 'YES').DSECT                                00002500
&LDALAB  DS    0F                                                       00002600
         AGO   .LDASTRT                                                 00002700
.DSECT   ANOP                                                           00002800
&LDALAB  DSECT                                                          00002900
.LDASTRT ANOP                                                           00003000
&LDALAB.EY  DS     CL8                 EYECATCHER '** LDA**'            00003100
&LDALAB.LL  DS     XL2                 LOGGED LENGTH OF DAG             00003200
&LDALAB.ML  DS     XL2                 MAXIMUM LENGTH OF DAG            00003300
&LDALAB.ID  DS     CL8                 DAG IDENTIFIER                   00003400
&LDALAB.NM  DS     CL8                 DAG NAME                         00003500
&LDALAB.LG  EQU    *-&LDALAB.EY        LENGTH OF LDA HEADER             00003600
&LDALAB.DD  DS     0CL1                START OF DAG DATA                00003700
         MEND                                                           00003800