000100 DEFINE PROC SCCAPKSF ().
000200*--------------------------------------------------------------*
000300*    NAME: SC REFORMATTER FOR SCTRBP01-SORT-FIELDS AREA        *
000400*                                                              *
000500*    FUNCTIONS:                                                *
000600*                                                              *
000700*       PACKS THE APPROPRIATE FIELDS OF SCTRBP01 INTO THE SORT *
000800*       FIELDS AREA TO BE USED IN THE SORT PATTERN DEFINITION  *
000900*       IN PARMS.  PACKING THE KEY FIELDS IS REQUIRED TO STAY  *
001000*       WITHIN THE 80-BYTE VARIABLE SORT FIELDS AREA LIMIT     *
001100*       IMPOSED BY THE ARCHITECTURE.                           *
001200*                                                              *
001300*    USE EXAMPLE:                                              *
001400*        EXEC API                                              *
001500*            PROC SCCAPKSF ()                                  *
001600*        END-EXEC.                                             *
001700*--------------------------------------------------------------*
001800*
001900 WORKING-STORAGE SECTION.
002000 01  SCCAPKSF-WORK-SC-KEY.
002100     05  SCCAPKSF-WORK-SC-CTLS       PIC 9(16).
002200     05  SCCAPKSF-WORK-SC-CUST-NBR   PIC 9(14).
002300
002400 01  SCCAPKSF-WORK-APPL-KEY.
002500     05  SCCAPKSF-WORK-APPL-FIRST-15 PIC 9(15).
002600     05  SCCAPKSF-WORK-APPL-NEXT-15  PIC 9(15).
002700     05  SCCAPKSF-WORK-APPL-LAST-13  PIC 9(13).
002800
002900 LINKAGE SECTION.
003000 SCTRBP01 MOD,KEEP.    /* SC TRANSACTION/LOGGING DAG       */
003100
003200 PROCEDURE DIVISION.
003300 SCCAPKSF-PROC.
003400
003500     MOVE SCTRBP01-CDR-SC-KEY       TO SCCAPKSF-WORK-SC-KEY.
003600     MOVE SCCAPKSF-WORK-SC-CTLS     TO SCTRBP01-SORT-SC-CTLS.
003700     MOVE SCCAPKSF-WORK-SC-CUST-NBR TO SCTRBP01-SORT-SC-CUST-NBR.
003800     MOVE SCTRBP01-CDR-APPL-ID      TO SCTRBP01-SORT-APPL-ID.
003900     MOVE SCTRBP01-CDR-APPL-KEY     TO SCCAPKSF-WORK-APPL-KEY.
004000*    EXAMINE SCCAPKSF-WORK-APPL-KEY                               0409001
004001     INSPECT SCCAPKSF-WORK-APPL-KEY                               0409001
004100                REPLACING ALL SPACES BY ZEROS.
004200*    EXAMINE SCCAPKSF-WORK-APPL-KEY                               0409001
004201     INSPECT SCCAPKSF-WORK-APPL-KEY                               0409001
004300                REPLACING ALL LOW-VALUES BY ZEROS.
004400     MOVE SCCAPKSF-WORK-APPL-FIRST-15
004500                                   TO SCTRBP01-SORT-APPL-KEY-F15.
004600     MOVE SCCAPKSF-WORK-APPL-NEXT-15
004700                                   TO SCTRBP01-SORT-APPL-KEY-N15.
004800     MOVE SCCAPKSF-WORK-APPL-LAST-13
004900                                   TO SCTRBP01-SORT-APPL-KEY-L13.
005000
005100 SCCAPKSF-999-EXIT.
005200     EXIT.
005300     END-PROC.