*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
SIDSLKCA DSECT                     DSECT FOR FILINK COMMON AREA         00001000
LINKPPTN DS    CL08                NAME OF PROGRAM IN PPT TO LINK TO    00002000
LINKRC   DS    CL02                FILINK RETURN CODE                   00003000
LINKEMSG DS    CL40                FILINK ERROR MESSAGE PASSBACK        00004000
LINKSICA DS    CL17                SICALL PARAMETER AREA      2024422   00004100
         DS    CL13                FILLER                     2024422   00005000
LINKDSLN EQU   *-SIDSLKCA          LENGTH OF AREA                       00006000