*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
SIDSVSRC DSECT                                                          00000100
SIVSRC   DS    PL04                VSAM RETURN CODE PASS BACK AREA      00000200
SIVSR15  DS    PL04                VSAM R15 RETURN CODE PASS BACK AREA  00000300
         DS    CL32                                                     00000400