*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
SIDSMESS DS    0F                      'SIMESS' CONTROL AREA            00001000
MESSPGM  DC    CL8' '                  CALLING PROGRAM                  00002000
MESSNO   DC    CL4' '                  MESSAGE NUMBER                   00003000
MESSRET  DC    H'0'                    RETURN CODE                      00004000
MESSOPT  DC    CL100' '                OPTIONAL MESSAGE AREA            00005000