*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*     * FO5238*05/12/11 PROYECTO UPGRADE SYSTEMATIC
******************************************************************      00000100
*DICTIONARY OBJECT SIDAGSIWKAD03                                 *      00000200
* GENERATED 06/07/93  08.07.53                                   *      00000300
*PARSED STANDARDIZED ADDRESS COMM AREA                           *      00000400
* ***CONTAINS MODIFICATIONS FOR INTERBANK GAP RM003           RMIB003   00000410
******************************************************************      00000500
SIDSAD03 DSECT                         NAME-ADDR-PARSING-OUT.           00000600
WK3RETCD DS    CL1                     PRS-ADDR-RETURN-CD               00000700
WK3CSZCD DS    CL1                     CITY-STATE-ZIP-RC                00000710
WK3NBRLI DS    CL1                     NBR-LINES-PARSED                 00000800
WK3PRSAD DS    0CL125                  PARSED-STRT-ADDR.                00000900
WK3HOUSE DS    CL10                    HOUSE-NBR                        00001000
WK3DIR   DS    CL10                    DIR                              00001100
WK3STNME DS    CL25                    STRT-NAME                        00001200
WK3STTYP DS    CL10                    STRT-TYPE                        00001300
WK3ADTYP DS    CL10                    SUB-ADDR-TYP                     00001400
WK3ADNBR DS    CL10                    SUB-ADDR-NBR                     00001500
WK3ADOVF DS    CL50                    ADDR-OVRFL                       00001600
*WK3CITY  DS    CL20                    CITY                  RMIB003   00001610
*WK3ST    DS    CL20                    STATE                 RMIB003   00001620
WK3CITY  DS    CL20                    DISTRICT               RMIB003   00001621
WK3ST    DS    CL20                    PROVINCE               RMIB003   00001622
WK3DEPT  DS    CL20                    DEPT                   RMIB003   00001625
*WK3ZIP   DS    CL10                    ZIP                   RMIB003   00001630
WK3ZIP   DS    CL10                    POSTAL CODE            RMIB003   00001631
WK3WALK  DS    CL2                     WALK SEQ CD                      00001640
WK3CTRY  DS    CL20                    COUNTRY                          00001650
WK3MAIL  DS    CL1                     MAILL-CD                         00001660
WK3SPI   DS    CL1                     PRT-SPEC-INSTR-CD                00001670
WK3PCIND DS    CL1                     PRT-CTRY-IND                     00001680
WK3USPRI DS    CL1                     US-POSTAL-REQ-IND                00001690
         EJECT                                                          00001700