*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*** BEGINNING OF COPYBOOK SIDSSIOB ***                                  00000100
***  NEW COPYBOOK FOR FILE SEGMENTATION                     ***         00000200
*** ASSEMBLER EQUIVALENT FOR SIWSSIOB                       ***         00000201
SCBASE   DSECT                                                          00000202
SCBPTNM  DS    0CL7      FULL PROTOTYPE NAME                            00000203
SCBPRON  DS    CL6       PROTOTYPE IO MODULE NAME                       00000204
SCBPROT  DS    CL1       PROTOTYPE FILE TYPE (VSAM,/SEQUENTIAL)         00000205
SCBPROV  EQU   C'V'      VSAM PROTOTYPE                                 00000206
SCBPROS  EQU   C'S'      SEQUENTIAL PROTOTYPE                           00000207
SCBIONM  DS    0CL7      ACTUAL FILE NAME                               00000208
SCBFAPP  DS    CL2       APPLICATION PREFIX                             00000209
SCBFID   DS    CL2       FILE ID WITHIN APPLICATION                     00000210
SCBSGNO  DS    CL2       SEGMENT/GROUP NUMBER                           00000211
SCBFTP   DS    CL1       FILE TYPE (VSAM/SEQUENTIAL)                    00000212
SCBFS    EQU   C'S'      SEQUENTIAL FILE                                00000213
SCBFV    EQU   C'V'      VSAM FILE                                      00000214
SCBRTCD  DS    CL1       RETURN CODE                                    00000215
         DS    CL5       FILLER (CURRENTLY NOT USED)                    00001700
*** END OF COPYBOOK SIDSSIOB ***                                        00001701