*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*---------------------------------------------------------------------* 00000010
*                               SIDTXMIT                              * 00000020
*                              SIXMIT  AREA                           * 00000030
*---------------------------------------------------------------------* 00000040
*                  ** HISTORY OF REVISIONS **                         * 00000050
* DESCRIPTION                                                 CHNGID  * 00000060
* __________________________________________________________  _______ * 00000070
* 05/01/97 ALLOW 211 BYTE RECORD FOR DBCS PRINTING USING TRC  9913481 * 00000096
* 06/22/95 REMOVE THE XMTXLT  FLAG                            2602409 * 00000098
*---------------------------------------------------------------------* 00000099
XMTREC   DS    0CL211        TRANSMIT FILE RECORD DESCRIPTION 9913481   00000100
XMTSPLAR DS    0CL77         SPOOL CONTROL AREA                         00000200
XMTCD    DS    CL1           CODE                                       00000300
XMTFORM  DS    CL1           FORM                                       00000400
XMTPGM   DS    0CL8          PROGRAM                                    00000500
XMTAPPL  DS    CL2               APPLICATION                            00000600
XMTMAIN  DS    CL2               MAINLINE NUMBER                        00000700
XMTUSER  DS    CL4               USER IDENTIFICATION                    00000800
XMTRPTNO DS    CL3           REPORT NUMBER                              00000900
XMTBCRSW DS    CL1           BCR CONTROL BREAK SWITCH                   00001000
XMTBCRCL DS    0CL22         BCR CONTROLS                               00001100
XMTBCRC1 DS    CL2               CONTROL 1                              00001200
XMTBCRC2 DS    CL3               CONTROL 2                              00001300
XMTBCRC3 DS    CL3               CONTROL 3                              00001400
XMTBCRC4 DS    CL4               CONTROL 4                              00001500
         DS    CL10              FILLER                                 00001600
         ORG   XMTBCRCL                                                 00001700
XMXBCRC1 DS    CL4           FMS CUSTOMER NUMBER                        00001800
XMXRESP  DS    CL18          FMS RESPONSIBILITY NUMBER                  00001900
         ORG                                                            00002000
XMTRPTSW DS    CL1           RPT CONTROL BREAK SWITCH                   00002100
XMTRPTCL DS    0CL22         RPT CONTROLS                               00002200
XMTRPTC1 DS    CL2               CONTROL 1                              00002300
XMTRPTC2 DS    CL3               CONTROL 2                              00002400
XMTRPTC3 DS    CL3               CONTROL 3                              00002500
XMTRPTC4 DS    CL4               CONTROL 4                              00002600
         DS    CL10              FILLER                                 00002700
XMTBSTAT DS    CL1           BILLING STATUS SWITCH                      00002800
XMTLNENO DS    PL4           LINE NUMBER (PACKED S9(7))                 00002900
XMTLNETY DS    CL1           LINE TYPE                                  00003000
XMTSUBTY DS    CL1           SUB TYPE                                   00003100
XMTRPTLV DS    CL1           REPORT LEVEL                               00003200
XMTPRTID DS    CL1           PRINT FILE ID                              00003300
XMTEXTFL DS    CL1           3800 EXTENDED PROCESSING FLAG              00003400
XMTEXTLN DS    XL2           3800 LINE LENGTH BINARY                    00003500
         DS    CL1           FILLLER                          2602409   00003600
         DS    CL5           FILLER                                     00003700
XMTPRTLN DS    0CL134        PRINT LINE                       9913481   00003800
XMTPLCTL DS    CL1           PRINT CONTROL CHARACTER                    00003900
XMTPLTRC DS    CL1           PRINT TRC                        9913481   00003910
XMTPRTDT DS    CL132         PRINT LINE DATA                            00004000