       01  SIMM010I.
           02  FILLER PIC X(12).
           02  MTIMEL    COMP  PIC  S9(4).
           02  MTIMEF    PICTURE X.
           02  FILLER REDEFINES MTIMEF.
             03 MTIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MTIMEI  PIC X(8).
           02  MDATEL    COMP  PIC  S9(4).
           02  MDATEF    PICTURE X.
           02  FILLER REDEFINES MDATEF.
             03 MDATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MDATEI  PIC X(10).
           02  MOPROL    COMP  PIC  S9(4).
           02  MOPROF    PICTURE X.
           02  FILLER REDEFINES MOPROF.
             03 MOPROA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MOPROI  PIC X(3).
           02  MFHORL    COMP  PIC  S9(4).
           02  MFHORF    PICTURE X.
           02  FILLER REDEFINES MFHORF.
             03 MFHORA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MFHORI  PIC X(1).
           02  MDBANL    COMP  PIC  S9(4).
           02  MDBANF    PICTURE X.
           02  FILLER REDEFINES MDBANF.
             03 MDBANA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MDBANI  PIC X(2).
           02  MNDEPL    COMP  PIC  S9(4).
           02  MNDEPF    PICTURE X.
           02  FILLER REDEFINES MNDEPF.
             03 MNDEPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MNDEPI  PIC X(14).
           02  MPAPEL    COMP  PIC  S9(4).
           02  MPAPEF    PICTURE X.
           02  FILLER REDEFINES MPAPEF.
             03 MPAPEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MPAPEI  PIC X(7).
           02  MDCTRL    COMP  PIC  S9(4).
           02  MDCTRF    PICTURE X.
           02  FILLER REDEFINES MDCTRF.
             03 MDCTRA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MDCTRI  PIC X(4).
           02  MDMONL    COMP  PIC  S9(4).
           02  MDMONF    PICTURE X.
           02  FILLER REDEFINES MDMONF.
             03 MDMONA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MDMONI  PIC X(3).
           02  MDOFIL    COMP  PIC  S9(4).
           02  MDOFIF    PICTURE X.
           02  FILLER REDEFINES MDOFIF.
             03 MDOFIA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MDOFII  PIC X(3).
           02  MDNUML    COMP  PIC  S9(4).
           02  MDNUMF    PICTURE X.
           02  FILLER REDEFINES MDNUMF.
             03 MDNUMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MDNUMI  PIC X(10).
           02  MTIPOL    COMP  PIC  S9(4).
           02  MTIPOF    PICTURE X.
           02  FILLER REDEFINES MTIPOF.
             03 MTIPOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MTIPOI  PIC X(1).
           02  MNCHEL    COMP  PIC  S9(4).
           02  MNCHEF    PICTURE X.
           02  FILLER REDEFINES MNCHEF.
             03 MNCHEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MNCHEI  PIC X(4).
           02  MICHEL    COMP  PIC  S9(4).
           02  MICHEF    PICTURE X.
           02  FILLER REDEFINES MICHEF.
             03 MICHEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MICHEI  PIC X(14).
           02  MDESCL    COMP  PIC  S9(4).
           02  MDESCF    PICTURE X.
           02  FILLER REDEFINES MDESCF.
             03 MDESCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MDESCI  PIC X(19).
           02  MGSEC0L    COMP  PIC  S9(4).
           02  MGSEC0F    PICTURE X.
           02  FILLER REDEFINES MGSEC0F.
             03 MGSEC0A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC0I  PIC X(4).
           02  MGCHE0L    COMP  PIC  S9(4).
           02  MGCHE0F    PICTURE X.
           02  FILLER REDEFINES MGCHE0F.
             03 MGCHE0A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE0I  PIC X(10).
           02  MGDIG0L    COMP  PIC  S9(4).
           02  MGDIG0F    PICTURE X.
           02  FILLER REDEFINES MGDIG0F.
             03 MGDIG0A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG0I  PIC X(1).
           02  MGBAN0L    COMP  PIC  S9(4).
           02  MGBAN0F    PICTURE X.
           02  FILLER REDEFINES MGBAN0F.
             03 MGBAN0A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN0I  PIC X(2).
           02  MGOFI0L    COMP  PIC  S9(4).
           02  MGOFI0F    PICTURE X.
           02  FILLER REDEFINES MGOFI0F.
             03 MGOFI0A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI0I  PIC X(3).
           02  MGCTA0L    COMP  PIC  S9(4).
           02  MGCTA0F    PICTURE X.
           02  FILLER REDEFINES MGCTA0F.
             03 MGCTA0A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA0I  PIC X(10).
           02  MGDGT0L    COMP  PIC  S9(4).
           02  MGDGT0F    PICTURE X.
           02  FILLER REDEFINES MGDGT0F.
             03 MGDGT0A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT0I  PIC X(2).
           02  MGIMP0L    COMP  PIC  S9(4).
           02  MGIMP0F    PICTURE X.
           02  FILLER REDEFINES MGIMP0F.
             03 MGIMP0A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP0I  PIC X(14).
           02  MGSEC1L    COMP  PIC  S9(4).
           02  MGSEC1F    PICTURE X.
           02  FILLER REDEFINES MGSEC1F.
             03 MGSEC1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC1I  PIC X(4).
           02  MGCHE1L    COMP  PIC  S9(4).
           02  MGCHE1F    PICTURE X.
           02  FILLER REDEFINES MGCHE1F.
             03 MGCHE1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE1I  PIC X(10).
           02  MGDIG1L    COMP  PIC  S9(4).
           02  MGDIG1F    PICTURE X.
           02  FILLER REDEFINES MGDIG1F.
             03 MGDIG1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG1I  PIC X(1).
           02  MGBAN1L    COMP  PIC  S9(4).
           02  MGBAN1F    PICTURE X.
           02  FILLER REDEFINES MGBAN1F.
             03 MGBAN1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN1I  PIC X(2).
           02  MGOFI1L    COMP  PIC  S9(4).
           02  MGOFI1F    PICTURE X.
           02  FILLER REDEFINES MGOFI1F.
             03 MGOFI1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI1I  PIC X(3).
           02  MGCTA1L    COMP  PIC  S9(4).
           02  MGCTA1F    PICTURE X.
           02  FILLER REDEFINES MGCTA1F.
             03 MGCTA1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA1I  PIC X(10).
           02  MGDGT1L    COMP  PIC  S9(4).
           02  MGDGT1F    PICTURE X.
           02  FILLER REDEFINES MGDGT1F.
             03 MGDGT1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT1I  PIC X(2).
           02  MGIMP1L    COMP  PIC  S9(4).
           02  MGIMP1F    PICTURE X.
           02  FILLER REDEFINES MGIMP1F.
             03 MGIMP1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP1I  PIC X(14).
           02  MGSEC2L    COMP  PIC  S9(4).
           02  MGSEC2F    PICTURE X.
           02  FILLER REDEFINES MGSEC2F.
             03 MGSEC2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC2I  PIC X(4).
           02  MGCHE2L    COMP  PIC  S9(4).
           02  MGCHE2F    PICTURE X.
           02  FILLER REDEFINES MGCHE2F.
             03 MGCHE2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE2I  PIC X(10).
           02  MGDIG2L    COMP  PIC  S9(4).
           02  MGDIG2F    PICTURE X.
           02  FILLER REDEFINES MGDIG2F.
             03 MGDIG2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG2I  PIC X(1).
           02  MGBAN2L    COMP  PIC  S9(4).
           02  MGBAN2F    PICTURE X.
           02  FILLER REDEFINES MGBAN2F.
             03 MGBAN2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN2I  PIC X(2).
           02  MGOFI2L    COMP  PIC  S9(4).
           02  MGOFI2F    PICTURE X.
           02  FILLER REDEFINES MGOFI2F.
             03 MGOFI2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI2I  PIC X(3).
           02  MGCTA2L    COMP  PIC  S9(4).
           02  MGCTA2F    PICTURE X.
           02  FILLER REDEFINES MGCTA2F.
             03 MGCTA2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA2I  PIC X(10).
           02  MGDGT2L    COMP  PIC  S9(4).
           02  MGDGT2F    PICTURE X.
           02  FILLER REDEFINES MGDGT2F.
             03 MGDGT2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT2I  PIC X(2).
           02  MGIMP2L    COMP  PIC  S9(4).
           02  MGIMP2F    PICTURE X.
           02  FILLER REDEFINES MGIMP2F.
             03 MGIMP2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP2I  PIC X(14).
           02  MGSEC3L    COMP  PIC  S9(4).
           02  MGSEC3F    PICTURE X.
           02  FILLER REDEFINES MGSEC3F.
             03 MGSEC3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC3I  PIC X(4).
           02  MGCHE3L    COMP  PIC  S9(4).
           02  MGCHE3F    PICTURE X.
           02  FILLER REDEFINES MGCHE3F.
             03 MGCHE3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE3I  PIC X(10).
           02  MGDIG3L    COMP  PIC  S9(4).
           02  MGDIG3F    PICTURE X.
           02  FILLER REDEFINES MGDIG3F.
             03 MGDIG3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG3I  PIC X(1).
           02  MGBAN3L    COMP  PIC  S9(4).
           02  MGBAN3F    PICTURE X.
           02  FILLER REDEFINES MGBAN3F.
             03 MGBAN3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN3I  PIC X(2).
           02  MGOFI3L    COMP  PIC  S9(4).
           02  MGOFI3F    PICTURE X.
           02  FILLER REDEFINES MGOFI3F.
             03 MGOFI3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI3I  PIC X(3).
           02  MGCTA3L    COMP  PIC  S9(4).
           02  MGCTA3F    PICTURE X.
           02  FILLER REDEFINES MGCTA3F.
             03 MGCTA3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA3I  PIC X(10).
           02  MGDGT3L    COMP  PIC  S9(4).
           02  MGDGT3F    PICTURE X.
           02  FILLER REDEFINES MGDGT3F.
             03 MGDGT3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT3I  PIC X(2).
           02  MGIMP3L    COMP  PIC  S9(4).
           02  MGIMP3F    PICTURE X.
           02  FILLER REDEFINES MGIMP3F.
             03 MGIMP3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP3I  PIC X(14).
           02  MGSEC4L    COMP  PIC  S9(4).
           02  MGSEC4F    PICTURE X.
           02  FILLER REDEFINES MGSEC4F.
             03 MGSEC4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC4I  PIC X(4).
           02  MGCHE4L    COMP  PIC  S9(4).
           02  MGCHE4F    PICTURE X.
           02  FILLER REDEFINES MGCHE4F.
             03 MGCHE4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE4I  PIC X(10).
           02  MGDIG4L    COMP  PIC  S9(4).
           02  MGDIG4F    PICTURE X.
           02  FILLER REDEFINES MGDIG4F.
             03 MGDIG4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG4I  PIC X(1).
           02  MGBAN4L    COMP  PIC  S9(4).
           02  MGBAN4F    PICTURE X.
           02  FILLER REDEFINES MGBAN4F.
             03 MGBAN4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN4I  PIC X(2).
           02  MGOFI4L    COMP  PIC  S9(4).
           02  MGOFI4F    PICTURE X.
           02  FILLER REDEFINES MGOFI4F.
             03 MGOFI4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI4I  PIC X(3).
           02  MGCTA4L    COMP  PIC  S9(4).
           02  MGCTA4F    PICTURE X.
           02  FILLER REDEFINES MGCTA4F.
             03 MGCTA4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA4I  PIC X(10).
           02  MGDGT4L    COMP  PIC  S9(4).
           02  MGDGT4F    PICTURE X.
           02  FILLER REDEFINES MGDGT4F.
             03 MGDGT4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT4I  PIC X(2).
           02  MGIMP4L    COMP  PIC  S9(4).
           02  MGIMP4F    PICTURE X.
           02  FILLER REDEFINES MGIMP4F.
             03 MGIMP4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP4I  PIC X(14).
           02  MGSEC5L    COMP  PIC  S9(4).
           02  MGSEC5F    PICTURE X.
           02  FILLER REDEFINES MGSEC5F.
             03 MGSEC5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC5I  PIC X(4).
           02  MGCHE5L    COMP  PIC  S9(4).
           02  MGCHE5F    PICTURE X.
           02  FILLER REDEFINES MGCHE5F.
             03 MGCHE5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE5I  PIC X(10).
           02  MGDIG5L    COMP  PIC  S9(4).
           02  MGDIG5F    PICTURE X.
           02  FILLER REDEFINES MGDIG5F.
             03 MGDIG5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG5I  PIC X(1).
           02  MGBAN5L    COMP  PIC  S9(4).
           02  MGBAN5F    PICTURE X.
           02  FILLER REDEFINES MGBAN5F.
             03 MGBAN5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN5I  PIC X(2).
           02  MGOFI5L    COMP  PIC  S9(4).
           02  MGOFI5F    PICTURE X.
           02  FILLER REDEFINES MGOFI5F.
             03 MGOFI5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI5I  PIC X(3).
           02  MGCTA5L    COMP  PIC  S9(4).
           02  MGCTA5F    PICTURE X.
           02  FILLER REDEFINES MGCTA5F.
             03 MGCTA5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA5I  PIC X(10).
           02  MGDGT5L    COMP  PIC  S9(4).
           02  MGDGT5F    PICTURE X.
           02  FILLER REDEFINES MGDGT5F.
             03 MGDGT5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT5I  PIC X(2).
           02  MGIMP5L    COMP  PIC  S9(4).
           02  MGIMP5F    PICTURE X.
           02  FILLER REDEFINES MGIMP5F.
             03 MGIMP5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP5I  PIC X(14).
           02  MGSEC6L    COMP  PIC  S9(4).
           02  MGSEC6F    PICTURE X.
           02  FILLER REDEFINES MGSEC6F.
             03 MGSEC6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC6I  PIC X(4).
           02  MGCHE6L    COMP  PIC  S9(4).
           02  MGCHE6F    PICTURE X.
           02  FILLER REDEFINES MGCHE6F.
             03 MGCHE6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE6I  PIC X(10).
           02  MGDIG6L    COMP  PIC  S9(4).
           02  MGDIG6F    PICTURE X.
           02  FILLER REDEFINES MGDIG6F.
             03 MGDIG6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG6I  PIC X(1).
           02  MGBAN6L    COMP  PIC  S9(4).
           02  MGBAN6F    PICTURE X.
           02  FILLER REDEFINES MGBAN6F.
             03 MGBAN6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN6I  PIC X(2).
           02  MGOFI6L    COMP  PIC  S9(4).
           02  MGOFI6F    PICTURE X.
           02  FILLER REDEFINES MGOFI6F.
             03 MGOFI6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI6I  PIC X(3).
           02  MGCTA6L    COMP  PIC  S9(4).
           02  MGCTA6F    PICTURE X.
           02  FILLER REDEFINES MGCTA6F.
             03 MGCTA6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA6I  PIC X(10).
           02  MGDGT6L    COMP  PIC  S9(4).
           02  MGDGT6F    PICTURE X.
           02  FILLER REDEFINES MGDGT6F.
             03 MGDGT6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT6I  PIC X(2).
           02  MGIMP6L    COMP  PIC  S9(4).
           02  MGIMP6F    PICTURE X.
           02  FILLER REDEFINES MGIMP6F.
             03 MGIMP6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP6I  PIC X(14).
           02  MGSEC7L    COMP  PIC  S9(4).
           02  MGSEC7F    PICTURE X.
           02  FILLER REDEFINES MGSEC7F.
             03 MGSEC7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC7I  PIC X(4).
           02  MGCHE7L    COMP  PIC  S9(4).
           02  MGCHE7F    PICTURE X.
           02  FILLER REDEFINES MGCHE7F.
             03 MGCHE7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE7I  PIC X(10).
           02  MGDIG7L    COMP  PIC  S9(4).
           02  MGDIG7F    PICTURE X.
           02  FILLER REDEFINES MGDIG7F.
             03 MGDIG7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG7I  PIC X(1).
           02  MGBAN7L    COMP  PIC  S9(4).
           02  MGBAN7F    PICTURE X.
           02  FILLER REDEFINES MGBAN7F.
             03 MGBAN7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN7I  PIC X(2).
           02  MGOFI7L    COMP  PIC  S9(4).
           02  MGOFI7F    PICTURE X.
           02  FILLER REDEFINES MGOFI7F.
             03 MGOFI7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI7I  PIC X(3).
           02  MGCTA7L    COMP  PIC  S9(4).
           02  MGCTA7F    PICTURE X.
           02  FILLER REDEFINES MGCTA7F.
             03 MGCTA7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA7I  PIC X(10).
           02  MGDGT7L    COMP  PIC  S9(4).
           02  MGDGT7F    PICTURE X.
           02  FILLER REDEFINES MGDGT7F.
             03 MGDGT7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT7I  PIC X(2).
           02  MGIMP7L    COMP  PIC  S9(4).
           02  MGIMP7F    PICTURE X.
           02  FILLER REDEFINES MGIMP7F.
             03 MGIMP7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP7I  PIC X(14).
           02  MGSEC8L    COMP  PIC  S9(4).
           02  MGSEC8F    PICTURE X.
           02  FILLER REDEFINES MGSEC8F.
             03 MGSEC8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC8I  PIC X(4).
           02  MGCHE8L    COMP  PIC  S9(4).
           02  MGCHE8F    PICTURE X.
           02  FILLER REDEFINES MGCHE8F.
             03 MGCHE8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE8I  PIC X(10).
           02  MGDIG8L    COMP  PIC  S9(4).
           02  MGDIG8F    PICTURE X.
           02  FILLER REDEFINES MGDIG8F.
             03 MGDIG8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG8I  PIC X(1).
           02  MGBAN8L    COMP  PIC  S9(4).
           02  MGBAN8F    PICTURE X.
           02  FILLER REDEFINES MGBAN8F.
             03 MGBAN8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN8I  PIC X(2).
           02  MGOFI8L    COMP  PIC  S9(4).
           02  MGOFI8F    PICTURE X.
           02  FILLER REDEFINES MGOFI8F.
             03 MGOFI8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI8I  PIC X(3).
           02  MGCTA8L    COMP  PIC  S9(4).
           02  MGCTA8F    PICTURE X.
           02  FILLER REDEFINES MGCTA8F.
             03 MGCTA8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA8I  PIC X(10).
           02  MGDGT8L    COMP  PIC  S9(4).
           02  MGDGT8F    PICTURE X.
           02  FILLER REDEFINES MGDGT8F.
             03 MGDGT8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT8I  PIC X(2).
           02  MGIMP8L    COMP  PIC  S9(4).
           02  MGIMP8F    PICTURE X.
           02  FILLER REDEFINES MGIMP8F.
             03 MGIMP8A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP8I  PIC X(14).
           02  MGSEC9L    COMP  PIC  S9(4).
           02  MGSEC9F    PICTURE X.
           02  FILLER REDEFINES MGSEC9F.
             03 MGSEC9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSEC9I  PIC X(4).
           02  MGCHE9L    COMP  PIC  S9(4).
           02  MGCHE9F    PICTURE X.
           02  FILLER REDEFINES MGCHE9F.
             03 MGCHE9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHE9I  PIC X(10).
           02  MGDIG9L    COMP  PIC  S9(4).
           02  MGDIG9F    PICTURE X.
           02  FILLER REDEFINES MGDIG9F.
             03 MGDIG9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIG9I  PIC X(1).
           02  MGBAN9L    COMP  PIC  S9(4).
           02  MGBAN9F    PICTURE X.
           02  FILLER REDEFINES MGBAN9F.
             03 MGBAN9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBAN9I  PIC X(2).
           02  MGOFI9L    COMP  PIC  S9(4).
           02  MGOFI9F    PICTURE X.
           02  FILLER REDEFINES MGOFI9F.
             03 MGOFI9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFI9I  PIC X(3).
           02  MGCTA9L    COMP  PIC  S9(4).
           02  MGCTA9F    PICTURE X.
           02  FILLER REDEFINES MGCTA9F.
             03 MGCTA9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTA9I  PIC X(10).
           02  MGDGT9L    COMP  PIC  S9(4).
           02  MGDGT9F    PICTURE X.
           02  FILLER REDEFINES MGDGT9F.
             03 MGDGT9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGT9I  PIC X(2).
           02  MGIMP9L    COMP  PIC  S9(4).
           02  MGIMP9F    PICTURE X.
           02  FILLER REDEFINES MGIMP9F.
             03 MGIMP9A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMP9I  PIC X(14).
           02  MGSECAL    COMP  PIC  S9(4).
           02  MGSECAF    PICTURE X.
           02  FILLER REDEFINES MGSECAF.
             03 MGSECAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSECAI  PIC X(4).
           02  MGCHEAL    COMP  PIC  S9(4).
           02  MGCHEAF    PICTURE X.
           02  FILLER REDEFINES MGCHEAF.
             03 MGCHEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHEAI  PIC X(10).
           02  MGDIGAL    COMP  PIC  S9(4).
           02  MGDIGAF    PICTURE X.
           02  FILLER REDEFINES MGDIGAF.
             03 MGDIGAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIGAI  PIC X(1).
           02  MGBANAL    COMP  PIC  S9(4).
           02  MGBANAF    PICTURE X.
           02  FILLER REDEFINES MGBANAF.
             03 MGBANAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBANAI  PIC X(2).
           02  MGOFIAL    COMP  PIC  S9(4).
           02  MGOFIAF    PICTURE X.
           02  FILLER REDEFINES MGOFIAF.
             03 MGOFIAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFIAI  PIC X(3).
           02  MGCTAAL    COMP  PIC  S9(4).
           02  MGCTAAF    PICTURE X.
           02  FILLER REDEFINES MGCTAAF.
             03 MGCTAAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTAAI  PIC X(10).
           02  MGDGTAL    COMP  PIC  S9(4).
           02  MGDGTAF    PICTURE X.
           02  FILLER REDEFINES MGDGTAF.
             03 MGDGTAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGTAI  PIC X(2).
           02  MGIMPAL    COMP  PIC  S9(4).
           02  MGIMPAF    PICTURE X.
           02  FILLER REDEFINES MGIMPAF.
             03 MGIMPAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMPAI  PIC X(14).
           02  MGSECBL    COMP  PIC  S9(4).
           02  MGSECBF    PICTURE X.
           02  FILLER REDEFINES MGSECBF.
             03 MGSECBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGSECBI  PIC X(4).
           02  MGCHEBL    COMP  PIC  S9(4).
           02  MGCHEBF    PICTURE X.
           02  FILLER REDEFINES MGCHEBF.
             03 MGCHEBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCHEBI  PIC X(10).
           02  MGDIGBL    COMP  PIC  S9(4).
           02  MGDIGBF    PICTURE X.
           02  FILLER REDEFINES MGDIGBF.
             03 MGDIGBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDIGBI  PIC X(1).
           02  MGBANBL    COMP  PIC  S9(4).
           02  MGBANBF    PICTURE X.
           02  FILLER REDEFINES MGBANBF.
             03 MGBANBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGBANBI  PIC X(2).
           02  MGOFIBL    COMP  PIC  S9(4).
           02  MGOFIBF    PICTURE X.
           02  FILLER REDEFINES MGOFIBF.
             03 MGOFIBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGOFIBI  PIC X(3).
           02  MGCTABL    COMP  PIC  S9(4).
           02  MGCTABF    PICTURE X.
           02  FILLER REDEFINES MGCTABF.
             03 MGCTABA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGCTABI  PIC X(10).
           02  MGDGTBL    COMP  PIC  S9(4).
           02  MGDGTBF    PICTURE X.
           02  FILLER REDEFINES MGDGTBF.
             03 MGDGTBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGDGTBI  PIC X(2).
           02  MGIMPBL    COMP  PIC  S9(4).
           02  MGIMPBF    PICTURE X.
           02  FILLER REDEFINES MGIMPBF.
             03 MGIMPBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MGIMPBI  PIC X(14).
           02  MMSGL    COMP  PIC  S9(4).
           02  MMSGF    PICTURE X.
           02  FILLER REDEFINES MMSGF.
             03 MMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MMSGI  PIC X(79).
       01  SIMM010O REDEFINES SIMM010I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  MTIMEC    PICTURE X.
           02  MTIMEP    PICTURE X.
           02  MTIMEH    PICTURE X.
           02  MTIMEV    PICTURE X.
           02  MTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  MDATEC    PICTURE X.
           02  MDATEP    PICTURE X.
           02  MDATEH    PICTURE X.
           02  MDATEV    PICTURE X.
           02  MDATEO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MOPROC    PICTURE X.
           02  MOPROP    PICTURE X.
           02  MOPROH    PICTURE X.
           02  MOPROV    PICTURE X.
           02  MOPROO PIC 999.
           02  FILLER PICTURE X(3).
           02  MFHORC    PICTURE X.
           02  MFHORP    PICTURE X.
           02  MFHORH    PICTURE X.
           02  MFHORV    PICTURE X.
           02  MFHORO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDBANC    PICTURE X.
           02  MDBANP    PICTURE X.
           02  MDBANH    PICTURE X.
           02  MDBANV    PICTURE X.
           02  MDBANO PIC 99.
           02  FILLER PICTURE X(3).
           02  MNDEPC    PICTURE X.
           02  MNDEPP    PICTURE X.
           02  MNDEPH    PICTURE X.
           02  MNDEPV    PICTURE X.
           02  MNDEPO  PIC X(14).
           02  FILLER PICTURE X(3).
           02  MPAPEC    PICTURE X.
           02  MPAPEP    PICTURE X.
           02  MPAPEH    PICTURE X.
           02  MPAPEV    PICTURE X.
           02  MPAPEO PIC 9999999.
           02  FILLER PICTURE X(3).
           02  MDCTRC    PICTURE X.
           02  MDCTRP    PICTURE X.
           02  MDCTRH    PICTURE X.
           02  MDCTRV    PICTURE X.
           02  MDCTRO PIC 9999.
           02  FILLER PICTURE X(3).
           02  MDMONC    PICTURE X.
           02  MDMONP    PICTURE X.
           02  MDMONH    PICTURE X.
           02  MDMONV    PICTURE X.
           02  MDMONO PIC 999.
           02  FILLER PICTURE X(3).
           02  MDOFIC    PICTURE X.
           02  MDOFIP    PICTURE X.
           02  MDOFIH    PICTURE X.
           02  MDOFIV    PICTURE X.
           02  MDOFIO PIC 999.
           02  FILLER PICTURE X(3).
           02  MDNUMC    PICTURE X.
           02  MDNUMP    PICTURE X.
           02  MDNUMH    PICTURE X.
           02  MDNUMV    PICTURE X.
           02  MDNUMO PIC 9999999999.
           02  FILLER PICTURE X(3).
           02  MTIPOC    PICTURE X.
           02  MTIPOP    PICTURE X.
           02  MTIPOH    PICTURE X.
           02  MTIPOV    PICTURE X.
           02  MTIPOO PIC 9.
           02  FILLER PICTURE X(3).
           02  MNCHEC    PICTURE X.
           02  MNCHEP    PICTURE X.
           02  MNCHEH    PICTURE X.
           02  MNCHEV    PICTURE X.
           02  MNCHEO PIC 9999.
           02  FILLER PICTURE X(3).
           02  MICHEC    PICTURE X.
           02  MICHEP    PICTURE X.
           02  MICHEH    PICTURE X.
           02  MICHEV    PICTURE X.
           02  MICHEO PIC ZZZZZZZ,ZZ9.99.
           02  FILLER PICTURE X(3).
           02  MDESCC    PICTURE X.
           02  MDESCP    PICTURE X.
           02  MDESCH    PICTURE X.
           02  MDESCV    PICTURE X.
           02  MDESCO  PIC X(19).
           02  FILLER PICTURE X(3).
           02  MGSEC0C    PICTURE X.
           02  MGSEC0P    PICTURE X.
           02  MGSEC0H    PICTURE X.
           02  MGSEC0V    PICTURE X.
           02  MGSEC0O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE0C    PICTURE X.
           02  MGCHE0P    PICTURE X.
           02  MGCHE0H    PICTURE X.
           02  MGCHE0V    PICTURE X.
           02  MGCHE0O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG0C    PICTURE X.
           02  MGDIG0P    PICTURE X.
           02  MGDIG0H    PICTURE X.
           02  MGDIG0V    PICTURE X.
           02  MGDIG0O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN0C    PICTURE X.
           02  MGBAN0P    PICTURE X.
           02  MGBAN0H    PICTURE X.
           02  MGBAN0V    PICTURE X.
           02  MGBAN0O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI0C    PICTURE X.
           02  MGOFI0P    PICTURE X.
           02  MGOFI0H    PICTURE X.
           02  MGOFI0V    PICTURE X.
           02  MGOFI0O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA0C    PICTURE X.
           02  MGCTA0P    PICTURE X.
           02  MGCTA0H    PICTURE X.
           02  MGCTA0V    PICTURE X.
           02  MGCTA0O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT0C    PICTURE X.
           02  MGDGT0P    PICTURE X.
           02  MGDGT0H    PICTURE X.
           02  MGDGT0V    PICTURE X.
           02  MGDGT0O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP0C    PICTURE X.
           02  MGIMP0P    PICTURE X.
           02  MGIMP0H    PICTURE X.
           02  MGIMP0V    PICTURE X.
           02  MGIMP0O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSEC1C    PICTURE X.
           02  MGSEC1P    PICTURE X.
           02  MGSEC1H    PICTURE X.
           02  MGSEC1V    PICTURE X.
           02  MGSEC1O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE1C    PICTURE X.
           02  MGCHE1P    PICTURE X.
           02  MGCHE1H    PICTURE X.
           02  MGCHE1V    PICTURE X.
           02  MGCHE1O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG1C    PICTURE X.
           02  MGDIG1P    PICTURE X.
           02  MGDIG1H    PICTURE X.
           02  MGDIG1V    PICTURE X.
           02  MGDIG1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN1C    PICTURE X.
           02  MGBAN1P    PICTURE X.
           02  MGBAN1H    PICTURE X.
           02  MGBAN1V    PICTURE X.
           02  MGBAN1O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI1C    PICTURE X.
           02  MGOFI1P    PICTURE X.
           02  MGOFI1H    PICTURE X.
           02  MGOFI1V    PICTURE X.
           02  MGOFI1O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA1C    PICTURE X.
           02  MGCTA1P    PICTURE X.
           02  MGCTA1H    PICTURE X.
           02  MGCTA1V    PICTURE X.
           02  MGCTA1O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT1C    PICTURE X.
           02  MGDGT1P    PICTURE X.
           02  MGDGT1H    PICTURE X.
           02  MGDGT1V    PICTURE X.
           02  MGDGT1O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP1C    PICTURE X.
           02  MGIMP1P    PICTURE X.
           02  MGIMP1H    PICTURE X.
           02  MGIMP1V    PICTURE X.
           02  MGIMP1O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSEC2C    PICTURE X.
           02  MGSEC2P    PICTURE X.
           02  MGSEC2H    PICTURE X.
           02  MGSEC2V    PICTURE X.
           02  MGSEC2O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE2C    PICTURE X.
           02  MGCHE2P    PICTURE X.
           02  MGCHE2H    PICTURE X.
           02  MGCHE2V    PICTURE X.
           02  MGCHE2O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG2C    PICTURE X.
           02  MGDIG2P    PICTURE X.
           02  MGDIG2H    PICTURE X.
           02  MGDIG2V    PICTURE X.
           02  MGDIG2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN2C    PICTURE X.
           02  MGBAN2P    PICTURE X.
           02  MGBAN2H    PICTURE X.
           02  MGBAN2V    PICTURE X.
           02  MGBAN2O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI2C    PICTURE X.
           02  MGOFI2P    PICTURE X.
           02  MGOFI2H    PICTURE X.
           02  MGOFI2V    PICTURE X.
           02  MGOFI2O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA2C    PICTURE X.
           02  MGCTA2P    PICTURE X.
           02  MGCTA2H    PICTURE X.
           02  MGCTA2V    PICTURE X.
           02  MGCTA2O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT2C    PICTURE X.
           02  MGDGT2P    PICTURE X.
           02  MGDGT2H    PICTURE X.
           02  MGDGT2V    PICTURE X.
           02  MGDGT2O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP2C    PICTURE X.
           02  MGIMP2P    PICTURE X.
           02  MGIMP2H    PICTURE X.
           02  MGIMP2V    PICTURE X.
           02  MGIMP2O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSEC3C    PICTURE X.
           02  MGSEC3P    PICTURE X.
           02  MGSEC3H    PICTURE X.
           02  MGSEC3V    PICTURE X.
           02  MGSEC3O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE3C    PICTURE X.
           02  MGCHE3P    PICTURE X.
           02  MGCHE3H    PICTURE X.
           02  MGCHE3V    PICTURE X.
           02  MGCHE3O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG3C    PICTURE X.
           02  MGDIG3P    PICTURE X.
           02  MGDIG3H    PICTURE X.
           02  MGDIG3V    PICTURE X.
           02  MGDIG3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN3C    PICTURE X.
           02  MGBAN3P    PICTURE X.
           02  MGBAN3H    PICTURE X.
           02  MGBAN3V    PICTURE X.
           02  MGBAN3O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI3C    PICTURE X.
           02  MGOFI3P    PICTURE X.
           02  MGOFI3H    PICTURE X.
           02  MGOFI3V    PICTURE X.
           02  MGOFI3O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA3C    PICTURE X.
           02  MGCTA3P    PICTURE X.
           02  MGCTA3H    PICTURE X.
           02  MGCTA3V    PICTURE X.
           02  MGCTA3O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT3C    PICTURE X.
           02  MGDGT3P    PICTURE X.
           02  MGDGT3H    PICTURE X.
           02  MGDGT3V    PICTURE X.
           02  MGDGT3O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP3C    PICTURE X.
           02  MGIMP3P    PICTURE X.
           02  MGIMP3H    PICTURE X.
           02  MGIMP3V    PICTURE X.
           02  MGIMP3O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSEC4C    PICTURE X.
           02  MGSEC4P    PICTURE X.
           02  MGSEC4H    PICTURE X.
           02  MGSEC4V    PICTURE X.
           02  MGSEC4O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE4C    PICTURE X.
           02  MGCHE4P    PICTURE X.
           02  MGCHE4H    PICTURE X.
           02  MGCHE4V    PICTURE X.
           02  MGCHE4O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG4C    PICTURE X.
           02  MGDIG4P    PICTURE X.
           02  MGDIG4H    PICTURE X.
           02  MGDIG4V    PICTURE X.
           02  MGDIG4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN4C    PICTURE X.
           02  MGBAN4P    PICTURE X.
           02  MGBAN4H    PICTURE X.
           02  MGBAN4V    PICTURE X.
           02  MGBAN4O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI4C    PICTURE X.
           02  MGOFI4P    PICTURE X.
           02  MGOFI4H    PICTURE X.
           02  MGOFI4V    PICTURE X.
           02  MGOFI4O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA4C    PICTURE X.
           02  MGCTA4P    PICTURE X.
           02  MGCTA4H    PICTURE X.
           02  MGCTA4V    PICTURE X.
           02  MGCTA4O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT4C    PICTURE X.
           02  MGDGT4P    PICTURE X.
           02  MGDGT4H    PICTURE X.
           02  MGDGT4V    PICTURE X.
           02  MGDGT4O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP4C    PICTURE X.
           02  MGIMP4P    PICTURE X.
           02  MGIMP4H    PICTURE X.
           02  MGIMP4V    PICTURE X.
           02  MGIMP4O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSEC5C    PICTURE X.
           02  MGSEC5P    PICTURE X.
           02  MGSEC5H    PICTURE X.
           02  MGSEC5V    PICTURE X.
           02  MGSEC5O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE5C    PICTURE X.
           02  MGCHE5P    PICTURE X.
           02  MGCHE5H    PICTURE X.
           02  MGCHE5V    PICTURE X.
           02  MGCHE5O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG5C    PICTURE X.
           02  MGDIG5P    PICTURE X.
           02  MGDIG5H    PICTURE X.
           02  MGDIG5V    PICTURE X.
           02  MGDIG5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN5C    PICTURE X.
           02  MGBAN5P    PICTURE X.
           02  MGBAN5H    PICTURE X.
           02  MGBAN5V    PICTURE X.
           02  MGBAN5O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI5C    PICTURE X.
           02  MGOFI5P    PICTURE X.
           02  MGOFI5H    PICTURE X.
           02  MGOFI5V    PICTURE X.
           02  MGOFI5O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA5C    PICTURE X.
           02  MGCTA5P    PICTURE X.
           02  MGCTA5H    PICTURE X.
           02  MGCTA5V    PICTURE X.
           02  MGCTA5O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT5C    PICTURE X.
           02  MGDGT5P    PICTURE X.
           02  MGDGT5H    PICTURE X.
           02  MGDGT5V    PICTURE X.
           02  MGDGT5O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP5C    PICTURE X.
           02  MGIMP5P    PICTURE X.
           02  MGIMP5H    PICTURE X.
           02  MGIMP5V    PICTURE X.
           02  MGIMP5O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSEC6C    PICTURE X.
           02  MGSEC6P    PICTURE X.
           02  MGSEC6H    PICTURE X.
           02  MGSEC6V    PICTURE X.
           02  MGSEC6O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE6C    PICTURE X.
           02  MGCHE6P    PICTURE X.
           02  MGCHE6H    PICTURE X.
           02  MGCHE6V    PICTURE X.
           02  MGCHE6O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG6C    PICTURE X.
           02  MGDIG6P    PICTURE X.
           02  MGDIG6H    PICTURE X.
           02  MGDIG6V    PICTURE X.
           02  MGDIG6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN6C    PICTURE X.
           02  MGBAN6P    PICTURE X.
           02  MGBAN6H    PICTURE X.
           02  MGBAN6V    PICTURE X.
           02  MGBAN6O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI6C    PICTURE X.
           02  MGOFI6P    PICTURE X.
           02  MGOFI6H    PICTURE X.
           02  MGOFI6V    PICTURE X.
           02  MGOFI6O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA6C    PICTURE X.
           02  MGCTA6P    PICTURE X.
           02  MGCTA6H    PICTURE X.
           02  MGCTA6V    PICTURE X.
           02  MGCTA6O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT6C    PICTURE X.
           02  MGDGT6P    PICTURE X.
           02  MGDGT6H    PICTURE X.
           02  MGDGT6V    PICTURE X.
           02  MGDGT6O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP6C    PICTURE X.
           02  MGIMP6P    PICTURE X.
           02  MGIMP6H    PICTURE X.
           02  MGIMP6V    PICTURE X.
           02  MGIMP6O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSEC7C    PICTURE X.
           02  MGSEC7P    PICTURE X.
           02  MGSEC7H    PICTURE X.
           02  MGSEC7V    PICTURE X.
           02  MGSEC7O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE7C    PICTURE X.
           02  MGCHE7P    PICTURE X.
           02  MGCHE7H    PICTURE X.
           02  MGCHE7V    PICTURE X.
           02  MGCHE7O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG7C    PICTURE X.
           02  MGDIG7P    PICTURE X.
           02  MGDIG7H    PICTURE X.
           02  MGDIG7V    PICTURE X.
           02  MGDIG7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN7C    PICTURE X.
           02  MGBAN7P    PICTURE X.
           02  MGBAN7H    PICTURE X.
           02  MGBAN7V    PICTURE X.
           02  MGBAN7O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI7C    PICTURE X.
           02  MGOFI7P    PICTURE X.
           02  MGOFI7H    PICTURE X.
           02  MGOFI7V    PICTURE X.
           02  MGOFI7O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA7C    PICTURE X.
           02  MGCTA7P    PICTURE X.
           02  MGCTA7H    PICTURE X.
           02  MGCTA7V    PICTURE X.
           02  MGCTA7O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT7C    PICTURE X.
           02  MGDGT7P    PICTURE X.
           02  MGDGT7H    PICTURE X.
           02  MGDGT7V    PICTURE X.
           02  MGDGT7O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP7C    PICTURE X.
           02  MGIMP7P    PICTURE X.
           02  MGIMP7H    PICTURE X.
           02  MGIMP7V    PICTURE X.
           02  MGIMP7O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSEC8C    PICTURE X.
           02  MGSEC8P    PICTURE X.
           02  MGSEC8H    PICTURE X.
           02  MGSEC8V    PICTURE X.
           02  MGSEC8O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE8C    PICTURE X.
           02  MGCHE8P    PICTURE X.
           02  MGCHE8H    PICTURE X.
           02  MGCHE8V    PICTURE X.
           02  MGCHE8O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG8C    PICTURE X.
           02  MGDIG8P    PICTURE X.
           02  MGDIG8H    PICTURE X.
           02  MGDIG8V    PICTURE X.
           02  MGDIG8O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN8C    PICTURE X.
           02  MGBAN8P    PICTURE X.
           02  MGBAN8H    PICTURE X.
           02  MGBAN8V    PICTURE X.
           02  MGBAN8O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI8C    PICTURE X.
           02  MGOFI8P    PICTURE X.
           02  MGOFI8H    PICTURE X.
           02  MGOFI8V    PICTURE X.
           02  MGOFI8O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA8C    PICTURE X.
           02  MGCTA8P    PICTURE X.
           02  MGCTA8H    PICTURE X.
           02  MGCTA8V    PICTURE X.
           02  MGCTA8O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT8C    PICTURE X.
           02  MGDGT8P    PICTURE X.
           02  MGDGT8H    PICTURE X.
           02  MGDGT8V    PICTURE X.
           02  MGDGT8O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP8C    PICTURE X.
           02  MGIMP8P    PICTURE X.
           02  MGIMP8H    PICTURE X.
           02  MGIMP8V    PICTURE X.
           02  MGIMP8O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSEC9C    PICTURE X.
           02  MGSEC9P    PICTURE X.
           02  MGSEC9H    PICTURE X.
           02  MGSEC9V    PICTURE X.
           02  MGSEC9O PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHE9C    PICTURE X.
           02  MGCHE9P    PICTURE X.
           02  MGCHE9H    PICTURE X.
           02  MGCHE9V    PICTURE X.
           02  MGCHE9O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIG9C    PICTURE X.
           02  MGDIG9P    PICTURE X.
           02  MGDIG9H    PICTURE X.
           02  MGDIG9V    PICTURE X.
           02  MGDIG9O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBAN9C    PICTURE X.
           02  MGBAN9P    PICTURE X.
           02  MGBAN9H    PICTURE X.
           02  MGBAN9V    PICTURE X.
           02  MGBAN9O PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFI9C    PICTURE X.
           02  MGOFI9P    PICTURE X.
           02  MGOFI9H    PICTURE X.
           02  MGOFI9V    PICTURE X.
           02  MGOFI9O PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTA9C    PICTURE X.
           02  MGCTA9P    PICTURE X.
           02  MGCTA9H    PICTURE X.
           02  MGCTA9V    PICTURE X.
           02  MGCTA9O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGT9C    PICTURE X.
           02  MGDGT9P    PICTURE X.
           02  MGDGT9H    PICTURE X.
           02  MGDGT9V    PICTURE X.
           02  MGDGT9O  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMP9C    PICTURE X.
           02  MGIMP9P    PICTURE X.
           02  MGIMP9H    PICTURE X.
           02  MGIMP9V    PICTURE X.
           02  MGIMP9O PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSECAC    PICTURE X.
           02  MGSECAP    PICTURE X.
           02  MGSECAH    PICTURE X.
           02  MGSECAV    PICTURE X.
           02  MGSECAO PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHEAC    PICTURE X.
           02  MGCHEAP    PICTURE X.
           02  MGCHEAH    PICTURE X.
           02  MGCHEAV    PICTURE X.
           02  MGCHEAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIGAC    PICTURE X.
           02  MGDIGAP    PICTURE X.
           02  MGDIGAH    PICTURE X.
           02  MGDIGAV    PICTURE X.
           02  MGDIGAO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBANAC    PICTURE X.
           02  MGBANAP    PICTURE X.
           02  MGBANAH    PICTURE X.
           02  MGBANAV    PICTURE X.
           02  MGBANAO PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFIAC    PICTURE X.
           02  MGOFIAP    PICTURE X.
           02  MGOFIAH    PICTURE X.
           02  MGOFIAV    PICTURE X.
           02  MGOFIAO PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTAAC    PICTURE X.
           02  MGCTAAP    PICTURE X.
           02  MGCTAAH    PICTURE X.
           02  MGCTAAV    PICTURE X.
           02  MGCTAAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGTAC    PICTURE X.
           02  MGDGTAP    PICTURE X.
           02  MGDGTAH    PICTURE X.
           02  MGDGTAV    PICTURE X.
           02  MGDGTAO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMPAC    PICTURE X.
           02  MGIMPAP    PICTURE X.
           02  MGIMPAH    PICTURE X.
           02  MGIMPAV    PICTURE X.
           02  MGIMPAO PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MGSECBC    PICTURE X.
           02  MGSECBP    PICTURE X.
           02  MGSECBH    PICTURE X.
           02  MGSECBV    PICTURE X.
           02  MGSECBO PIC ZZZZ.
           02  FILLER PICTURE X(3).
           02  MGCHEBC    PICTURE X.
           02  MGCHEBP    PICTURE X.
           02  MGCHEBH    PICTURE X.
           02  MGCHEBV    PICTURE X.
           02  MGCHEBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDIGBC    PICTURE X.
           02  MGDIGBP    PICTURE X.
           02  MGDIGBH    PICTURE X.
           02  MGDIGBV    PICTURE X.
           02  MGDIGBO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MGBANBC    PICTURE X.
           02  MGBANBP    PICTURE X.
           02  MGBANBH    PICTURE X.
           02  MGBANBV    PICTURE X.
           02  MGBANBO PIC 99.
           02  FILLER PICTURE X(3).
           02  MGOFIBC    PICTURE X.
           02  MGOFIBP    PICTURE X.
           02  MGOFIBH    PICTURE X.
           02  MGOFIBV    PICTURE X.
           02  MGOFIBO PIC 999.
           02  FILLER PICTURE X(3).
           02  MGCTABC    PICTURE X.
           02  MGCTABP    PICTURE X.
           02  MGCTABH    PICTURE X.
           02  MGCTABV    PICTURE X.
           02  MGCTABO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MGDGTBC    PICTURE X.
           02  MGDGTBP    PICTURE X.
           02  MGDGTBH    PICTURE X.
           02  MGDGTBV    PICTURE X.
           02  MGDGTBO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MGIMPBC    PICTURE X.
           02  MGIMPBP    PICTURE X.
           02  MGIMPBH    PICTURE X.
           02  MGIMPBV    PICTURE X.
           02  MGIMPBO PIC ZZZZZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  MMSGC    PICTURE X.
           02  MMSGP    PICTURE X.
           02  MMSGH    PICTURE X.
           02  MMSGV    PICTURE X.
           02  MMSGO  PIC X(79).