       01  SIMM001I.
           02  FILLER PIC X(12).
           02  MTIMEL    COMP  PIC  S9(4).
           02  MTIMEF    PICTURE X.
           02  FILLER REDEFINES MTIMEF.
             03 MTIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MTIMEI  PIC X(8).
           02  MDATEL    COMP  PIC  S9(4).
           02  MDATEF    PICTURE X.
           02  FILLER REDEFINES MDATEF.
             03 MDATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MDATEI  PIC X(10).
           02  MOPCIONL    COMP  PIC  S9(4).
           02  MOPCIONF    PICTURE X.
           02  FILLER REDEFINES MOPCIONF.
             03 MOPCIONA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MOPCIONI  PIC X(2).
           02  MMSGL    COMP  PIC  S9(4).
           02  MMSGF    PICTURE X.
           02  FILLER REDEFINES MMSGF.
             03 MMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MMSGI  PIC X(68).
       01  SIMM001O REDEFINES SIMM001I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  MTIMEC    PICTURE X.
           02  MTIMEP    PICTURE X.
           02  MTIMEH    PICTURE X.
           02  MTIMEV    PICTURE X.
           02  MTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  MDATEC    PICTURE X.
           02  MDATEP    PICTURE X.
           02  MDATEH    PICTURE X.
           02  MDATEV    PICTURE X.
           02  MDATEO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MOPCIONC    PICTURE X.
           02  MOPCIONP    PICTURE X.
           02  MOPCIONH    PICTURE X.
           02  MOPCIONV    PICTURE X.
           02  MOPCIONO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  MMSGC    PICTURE X.
           02  MMSGP    PICTURE X.
           02  MMSGH    PICTURE X.
           02  MMSGV    PICTURE X.
           02  MMSGO  PIC X(68).