*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
         MACRO                                                          00000100
         SIRENT                                                         00000200
.*--------------------------------------------------------------------- 00000300
.*                   ** MACRO DESCRIPTION **                            00000400
.*                                                                      00000500
.* SIRENT IS THE MACRO TO PUNCH THE STATEMENT TO CATALOG REENTRANT      00000600
.*                                                                      00000700
.*--------------------------------------------------------------------- 00000800
.*                  ** HISTORY OF REVISIONS **                          00000900
.*                                                                      00001000
.* DESCRIPTION                                                CHNGID    00001100
.* __________________________________________________________ _______   00001200
.* 12/06/01 INITIAL DISTRIBUTION                              2024422   00001300
.*                                                                      00001400
.*--------------------------------------------------------------------- 00001500
         SPACE                                                          00001600
         COPY  SIOPTNS                                                  00001700
         AIF   (&VSE).NORENT                                            00001800
         PUNCH '  SETOPT PARM(REUS=RENT)'                               00001810
.NORENT  ANOP                                                           00001820
         MEND                                                           00001900