       01  SSTMM45I.
           02  FILLER PIC X(12).
           02  MFECHAL    COMP  PIC  S9(4).
           02  MFECHAF    PICTURE X.
           02  FILLER REDEFINES MFECHAF.
             03 MFECHAA    PICTURE X.
           02  MFECHAI  PIC X(10).
           02  MHORAL    COMP  PIC  S9(4).
           02  MHORAF    PICTURE X.
           02  FILLER REDEFINES MHORAF.
             03 MHORAA    PICTURE X.
           02  MHORAI  PIC X(8).
           02  MCTL02L    COMP  PIC  S9(4).
           02  MCTL02F    PICTURE X.
           02  FILLER REDEFINES MCTL02F.
             03 MCTL02A    PICTURE X.
           02  MCTL02I  PIC X(3).
           02  MCTL03L    COMP  PIC  S9(4).
           02  MCTL03F    PICTURE X.
           02  FILLER REDEFINES MCTL03F.
             03 MCTL03A    PICTURE X.
           02  MCTL03I  PIC X(3).
           02  MCTL04L    COMP  PIC  S9(4).
           02  MCTL04F    PICTURE X.
           02  FILLER REDEFINES MCTL04F.
             03 MCTL04A    PICTURE X.
           02  MCTL04I  PIC X(3).
           02  MACCTNOL    COMP  PIC  S9(4).
           02  MACCTNOF    PICTURE X.
           02  FILLER REDEFINES MACCTNOF.
             03 MACCTNOA    PICTURE X.
           02  MACCTNOI  PIC X(10).
           02  MNOMBROL    COMP  PIC  S9(4).
           02  MNOMBROF    PICTURE X.
           02  FILLER REDEFINES MNOMBROF.
             03 MNOMBROA    PICTURE X.
           02  MNOMBROI  PIC X(30).
           02  MDETALLD OCCURS 12 TIMES.
             03  MDETALLL    COMP  PIC  S9(4).
             03  MDETALLF    PICTURE X.
             03  MDETALLI  PIC X(79).
           02  MMSGL    COMP  PIC  S9(4).
           02  MMSGF    PICTURE X.
           02  FILLER REDEFINES MMSGF.
             03 MMSGA    PICTURE X.
           02  MMSGI  PIC X(79).
       01  SSTMM45O REDEFINES SSTMM45I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  MFECHAO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MHORAO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  MCTL02O PIC 999.
           02  FILLER PICTURE X(3).
           02  MCTL03O PIC 999.
           02  FILLER PICTURE X(3).
           02  MCTL04O PIC 999.
           02  FILLER PICTURE X(3).
           02  MACCTNOO PIC 9999999999.
           02  FILLER PICTURE X(3).
           02  MNOMBROO  PIC X(30).
           02  DFHMS1 OCCURS 12 TIMES.
             03  FILLER PICTURE X(2).
             03  MDETALLA    PICTURE X.
             03  MDETALLO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  MMSGO  PIC X(79).