       01  SSTM52I.
           02  FILLER PIC X(12).
           02  MHORA52L    COMP  PIC  S9(4).
           02  MHORA52F    PICTURE X.
           02  FILLER REDEFINES MHORA52F.
             03 MHORA52A    PICTURE X.
           02  MHORA52I  PIC X(8).
           02  MFECH52L    COMP  PIC  S9(4).
           02  MFECH52F    PICTURE X.
           02  FILLER REDEFINES MFECH52F.
             03 MFECH52A    PICTURE X.
           02  MFECH52I  PIC X(10).
           02  CTL0252L    COMP  PIC  S9(4).
           02  CTL0252F    PICTURE X.
           02  FILLER REDEFINES CTL0252F.
             03 CTL0252A    PICTURE X.
           02  CTL0252I  PIC X(3).
           02  CTL0352L    COMP  PIC  S9(4).
           02  CTL0352F    PICTURE X.
           02  FILLER REDEFINES CTL0352F.
             03 CTL0352A    PICTURE X.
           02  CTL0352I  PIC X(3).
           02  CTL0452L    COMP  PIC  S9(4).
           02  CTL0452F    PICTURE X.
           02  FILLER REDEFINES CTL0452F.
             03 CTL0452A    PICTURE X.
           02  CTL0452I  PIC X(3).
           02  NCTA52L    COMP  PIC  S9(4).
           02  NCTA52F    PICTURE X.
           02  FILLER REDEFINES NCTA52F.
             03 NCTA52A    PICTURE X.
           02  NCTA52I  PIC X(10).
           02  MMA013AL    COMP  PIC  S9(4).
           02  MMA013AF    PICTURE X.
           02  FILLER REDEFINES MMA013AF.
             03 MMA013AA    PICTURE X.
           02  MMA013AI  PIC X(1).
           02  MDE013AL    COMP  PIC  S9(4).
           02  MDE013AF    PICTURE X.
           02  FILLER REDEFINES MDE013AF.
             03 MDE013AA    PICTURE X.
           02  MDE013AI  PIC X(77).
           02  MMA023AL    COMP  PIC  S9(4).
           02  MMA023AF    PICTURE X.
           02  FILLER REDEFINES MMA023AF.
             03 MMA023AA    PICTURE X.
           02  MMA023AI  PIC X(1).
           02  MDE023AL    COMP  PIC  S9(4).
           02  MDE023AF    PICTURE X.
           02  FILLER REDEFINES MDE023AF.
             03 MDE023AA    PICTURE X.
           02  MDE023AI  PIC X(77).
           02  MMA033AL    COMP  PIC  S9(4).
           02  MMA033AF    PICTURE X.
           02  FILLER REDEFINES MMA033AF.
             03 MMA033AA    PICTURE X.
           02  MMA033AI  PIC X(1).
           02  MDE033AL    COMP  PIC  S9(4).
           02  MDE033AF    PICTURE X.
           02  FILLER REDEFINES MDE033AF.
             03 MDE033AA    PICTURE X.
           02  MDE033AI  PIC X(77).
           02  MMA043AL    COMP  PIC  S9(4).
           02  MMA043AF    PICTURE X.
           02  FILLER REDEFINES MMA043AF.
             03 MMA043AA    PICTURE X.
           02  MMA043AI  PIC X(1).
           02  MDE043AL    COMP  PIC  S9(4).
           02  MDE043AF    PICTURE X.
           02  FILLER REDEFINES MDE043AF.
             03 MDE043AA    PICTURE X.
           02  MDE043AI  PIC X(77).
           02  MMA053AL    COMP  PIC  S9(4).
           02  MMA053AF    PICTURE X.
           02  FILLER REDEFINES MMA053AF.
             03 MMA053AA    PICTURE X.
           02  MMA053AI  PIC X(1).
           02  MDE053AL    COMP  PIC  S9(4).
           02  MDE053AF    PICTURE X.
           02  FILLER REDEFINES MDE053AF.
             03 MDE053AA    PICTURE X.
           02  MDE053AI  PIC X(77).
           02  MMA063AL    COMP  PIC  S9(4).
           02  MMA063AF    PICTURE X.
           02  FILLER REDEFINES MMA063AF.
             03 MMA063AA    PICTURE X.
           02  MMA063AI  PIC X(1).
           02  MDE063AL    COMP  PIC  S9(4).
           02  MDE063AF    PICTURE X.
           02  FILLER REDEFINES MDE063AF.
             03 MDE063AA    PICTURE X.
           02  MDE063AI  PIC X(77).
           02  MMA073AL    COMP  PIC  S9(4).
           02  MMA073AF    PICTURE X.
           02  FILLER REDEFINES MMA073AF.
             03 MMA073AA    PICTURE X.
           02  MMA073AI  PIC X(1).
           02  MDE073AL    COMP  PIC  S9(4).
           02  MDE073AF    PICTURE X.
           02  FILLER REDEFINES MDE073AF.
             03 MDE073AA    PICTURE X.
           02  MDE073AI  PIC X(77).
           02  MMA083AL    COMP  PIC  S9(4).
           02  MMA083AF    PICTURE X.
           02  FILLER REDEFINES MMA083AF.
             03 MMA083AA    PICTURE X.
           02  MMA083AI  PIC X(1).
           02  MDE083AL    COMP  PIC  S9(4).
           02  MDE083AF    PICTURE X.
           02  FILLER REDEFINES MDE083AF.
             03 MDE083AA    PICTURE X.
           02  MDE083AI  PIC X(77).
           02  MMA093AL    COMP  PIC  S9(4).
           02  MMA093AF    PICTURE X.
           02  FILLER REDEFINES MMA093AF.
             03 MMA093AA    PICTURE X.
           02  MMA093AI  PIC X(1).
           02  MDE093AL    COMP  PIC  S9(4).
           02  MDE093AF    PICTURE X.
           02  FILLER REDEFINES MDE093AF.
             03 MDE093AA    PICTURE X.
           02  MDE093AI  PIC X(77).
           02  MMA103AL    COMP  PIC  S9(4).
           02  MMA103AF    PICTURE X.
           02  FILLER REDEFINES MMA103AF.
             03 MMA103AA    PICTURE X.
           02  MMA103AI  PIC X(1).
           02  MDE103AL    COMP  PIC  S9(4).
           02  MDE103AF    PICTURE X.
           02  FILLER REDEFINES MDE103AF.
             03 MDE103AA    PICTURE X.
           02  MDE103AI  PIC X(77).
           02  MMA113AL    COMP  PIC  S9(4).
           02  MMA113AF    PICTURE X.
           02  FILLER REDEFINES MMA113AF.
             03 MMA113AA    PICTURE X.
           02  MMA113AI  PIC X(1).
           02  MDE113AL    COMP  PIC  S9(4).
           02  MDE113AF    PICTURE X.
           02  FILLER REDEFINES MDE113AF.
             03 MDE113AA    PICTURE X.
           02  MDE113AI  PIC X(77).
           02  MMA123AL    COMP  PIC  S9(4).
           02  MMA123AF    PICTURE X.
           02  FILLER REDEFINES MMA123AF.
             03 MMA123AA    PICTURE X.
           02  MMA123AI  PIC X(1).
           02  MDE123AL    COMP  PIC  S9(4).
           02  MDE123AF    PICTURE X.
           02  FILLER REDEFINES MDE123AF.
             03 MDE123AA    PICTURE X.
           02  MDE123AI  PIC X(77).
           02  MMA133AL    COMP  PIC  S9(4).
           02  MMA133AF    PICTURE X.
           02  FILLER REDEFINES MMA133AF.
             03 MMA133AA    PICTURE X.
           02  MMA133AI  PIC X(1).
           02  MDE133AL    COMP  PIC  S9(4).
           02  MDE133AF    PICTURE X.
           02  FILLER REDEFINES MDE133AF.
             03 MDE133AA    PICTURE X.
           02  MDE133AI  PIC X(77).
           02  MMENS52L    COMP  PIC  S9(4).
           02  MMENS52F    PICTURE X.
           02  FILLER REDEFINES MMENS52F.
             03 MMENS52A    PICTURE X.
           02  MMENS52I  PIC X(79).
       01  SSTM52O REDEFINES SSTM52I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  MHORA52O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  MFECH52O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  CTL0252O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL0352O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CTL0452O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  NCTA52O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MMA013AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE013AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA023AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE023AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA033AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE033AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA043AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE043AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA053AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE053AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA063AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE063AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA073AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE073AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA083AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE083AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA093AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE093AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA103AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE103AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA113AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE113AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA123AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE123AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA133AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE133AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMENS52O  PIC X(79).