       01  SSTM53I.
           02  FILLER PIC X(12).
           02  MHORA53L    COMP  PIC  S9(4).
           02  MHORA53F    PICTURE X.
           02  FILLER REDEFINES MHORA53F.
             03 MHORA53A    PICTURE X.
           02  MHORA53I  PIC X(8).
           02  MFECH53L    COMP  PIC  S9(4).
           02  MFECH53F    PICTURE X.
           02  FILLER REDEFINES MFECH53F.
             03 MFECH53A    PICTURE X.
           02  MFECH53I  PIC X(10).
           02  DETAL01L    COMP  PIC  S9(4).
           02  DETAL01F    PICTURE X.
           02  FILLER REDEFINES DETAL01F.
             03 DETAL01A    PICTURE X.
           02  DETAL01I  PIC X(79).
           02  MMA015AL    COMP  PIC  S9(4).
           02  MMA015AF    PICTURE X.
           02  FILLER REDEFINES MMA015AF.
             03 MMA015AA    PICTURE X.
           02  MMA015AI  PIC X(1).
           02  MDE015AL    COMP  PIC  S9(4).
           02  MDE015AF    PICTURE X.
           02  FILLER REDEFINES MDE015AF.
             03 MDE015AA    PICTURE X.
           02  MDE015AI  PIC X(77).
           02  MMA025AL    COMP  PIC  S9(4).
           02  MMA025AF    PICTURE X.
           02  FILLER REDEFINES MMA025AF.
             03 MMA025AA    PICTURE X.
           02  MMA025AI  PIC X(1).
           02  MDE025AL    COMP  PIC  S9(4).
           02  MDE025AF    PICTURE X.
           02  FILLER REDEFINES MDE025AF.
             03 MDE025AA    PICTURE X.
           02  MDE025AI  PIC X(77).
           02  MMA035AL    COMP  PIC  S9(4).
           02  MMA035AF    PICTURE X.
           02  FILLER REDEFINES MMA035AF.
             03 MMA035AA    PICTURE X.
           02  MMA035AI  PIC X(1).
           02  MDE035AL    COMP  PIC  S9(4).
           02  MDE035AF    PICTURE X.
           02  FILLER REDEFINES MDE035AF.
             03 MDE035AA    PICTURE X.
           02  MDE035AI  PIC X(77).
           02  MMA045AL    COMP  PIC  S9(4).
           02  MMA045AF    PICTURE X.
           02  FILLER REDEFINES MMA045AF.
             03 MMA045AA    PICTURE X.
           02  MMA045AI  PIC X(1).
           02  MDE045AL    COMP  PIC  S9(4).
           02  MDE045AF    PICTURE X.
           02  FILLER REDEFINES MDE045AF.
             03 MDE045AA    PICTURE X.
           02  MDE045AI  PIC X(77).
           02  MMA055AL    COMP  PIC  S9(4).
           02  MMA055AF    PICTURE X.
           02  FILLER REDEFINES MMA055AF.
             03 MMA055AA    PICTURE X.
           02  MMA055AI  PIC X(1).
           02  MDE055AL    COMP  PIC  S9(4).
           02  MDE055AF    PICTURE X.
           02  FILLER REDEFINES MDE055AF.
             03 MDE055AA    PICTURE X.
           02  MDE055AI  PIC X(77).
           02  MMA065AL    COMP  PIC  S9(4).
           02  MMA065AF    PICTURE X.
           02  FILLER REDEFINES MMA065AF.
             03 MMA065AA    PICTURE X.
           02  MMA065AI  PIC X(1).
           02  MDE065AL    COMP  PIC  S9(4).
           02  MDE065AF    PICTURE X.
           02  FILLER REDEFINES MDE065AF.
             03 MDE065AA    PICTURE X.
           02  MDE065AI  PIC X(77).
           02  MMA075AL    COMP  PIC  S9(4).
           02  MMA075AF    PICTURE X.
           02  FILLER REDEFINES MMA075AF.
             03 MMA075AA    PICTURE X.
           02  MMA075AI  PIC X(1).
           02  MDE075AL    COMP  PIC  S9(4).
           02  MDE075AF    PICTURE X.
           02  FILLER REDEFINES MDE075AF.
             03 MDE075AA    PICTURE X.
           02  MDE075AI  PIC X(77).
           02  MMA085AL    COMP  PIC  S9(4).
           02  MMA085AF    PICTURE X.
           02  FILLER REDEFINES MMA085AF.
             03 MMA085AA    PICTURE X.
           02  MMA085AI  PIC X(1).
           02  MDE085AL    COMP  PIC  S9(4).
           02  MDE085AF    PICTURE X.
           02  FILLER REDEFINES MDE085AF.
             03 MDE085AA    PICTURE X.
           02  MDE085AI  PIC X(77).
           02  MMA095AL    COMP  PIC  S9(4).
           02  MMA095AF    PICTURE X.
           02  FILLER REDEFINES MMA095AF.
             03 MMA095AA    PICTURE X.
           02  MMA095AI  PIC X(1).
           02  MDE095AL    COMP  PIC  S9(4).
           02  MDE095AF    PICTURE X.
           02  FILLER REDEFINES MDE095AF.
             03 MDE095AA    PICTURE X.
           02  MDE095AI  PIC X(77).
           02  MMA105AL    COMP  PIC  S9(4).
           02  MMA105AF    PICTURE X.
           02  FILLER REDEFINES MMA105AF.
             03 MMA105AA    PICTURE X.
           02  MMA105AI  PIC X(1).
           02  MDE105AL    COMP  PIC  S9(4).
           02  MDE105AF    PICTURE X.
           02  FILLER REDEFINES MDE105AF.
             03 MDE105AA    PICTURE X.
           02  MDE105AI  PIC X(77).
           02  MMA115AL    COMP  PIC  S9(4).
           02  MMA115AF    PICTURE X.
           02  FILLER REDEFINES MMA115AF.
             03 MMA115AA    PICTURE X.
           02  MMA115AI  PIC X(1).
           02  MDE115AL    COMP  PIC  S9(4).
           02  MDE115AF    PICTURE X.
           02  FILLER REDEFINES MDE115AF.
             03 MDE115AA    PICTURE X.
           02  MDE115AI  PIC X(77).
           02  MMA125AL    COMP  PIC  S9(4).
           02  MMA125AF    PICTURE X.
           02  FILLER REDEFINES MMA125AF.
             03 MMA125AA    PICTURE X.
           02  MMA125AI  PIC X(1).
           02  MDE125AL    COMP  PIC  S9(4).
           02  MDE125AF    PICTURE X.
           02  FILLER REDEFINES MDE125AF.
             03 MDE125AA    PICTURE X.
           02  MDE125AI  PIC X(77).
           02  MMA135AL    COMP  PIC  S9(4).
           02  MMA135AF    PICTURE X.
           02  FILLER REDEFINES MMA135AF.
             03 MMA135AA    PICTURE X.
           02  MMA135AI  PIC X(1).
           02  MDE135AL    COMP  PIC  S9(4).
           02  MDE135AF    PICTURE X.
           02  FILLER REDEFINES MDE135AF.
             03 MDE135AA    PICTURE X.
           02  MDE135AI  PIC X(77).
           02  MMENS53L    COMP  PIC  S9(4).
           02  MMENS53F    PICTURE X.
           02  FILLER REDEFINES MMENS53F.
             03 MMENS53A    PICTURE X.
           02  MMENS53I  PIC X(79).
       01  SSTM53O REDEFINES SSTM53I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  MHORA53O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  MFECH53O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DETAL01O  PIC X(79).
           02  FILLER PICTURE X(3).
           02  MMA015AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE015AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA025AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE025AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA035AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE035AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA045AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE045AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA055AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE055AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA065AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE065AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA075AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE075AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA085AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE085AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA095AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE095AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA105AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE105AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA115AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE115AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA125AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE125AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMA135AO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MDE135AO  PIC X(77).
           02  FILLER PICTURE X(3).
           02  MMENS53O  PIC X(79).