***********************************************************************
*     * FO2730 25/08/13 JFOF MIGRACION ZOS/1.13 EN AMBIENTE PRD       *
*     * FO2730 09/06/13   * MIGRACION ZOS/1.13                        *
*     * BP0616 30/01/07   * CAMBIO PARA CHEQUEO EN ACEPTACION Y PRODUCC
*     * UR0932 * 02/06/04 * CAMBIO PARA CHEQUEO EN ACEPTACION Y PRODUCC
***********************************************************************
         MACRO                                                          00050000
&NAME    TEST05 &CC                                                     00054300
.********************************************************************** 00063100
.* MACRO NAME = MYMAC                                                 * 00063300
.********************************************************************** 00066100
         LCLA  &CTR                                                     00067200
&NAME    DS    0H                                                       00075800
         AIF   ('&CC' EQ '').E1                                         00080100
.SVC     SVC   13                 LINK TO ABEND ROUTINE                 00260700
         MEXIT                                                          00265000
.E1      IHBERMAC 28,303                                                00266400
         MEXIT                                                 @G860P1F 00267800
         MEND                                                           00300000