***********************************************************************
*   * * FO2730 25/08/13 JFOF MIGRACION ZOS/1.13 EN AMBIENTE PRD       *
*   * * FO2730 * 09/06/13 * JFOF MIGRACION ZOS/1.13                   *
*   * * BP0616 * 02/06/04 * CAMBIO PARA CHEQUEO EN ACEPTACION Y PRODUCC
***********************************************************************
THIS_BOOK DS 0CL80
         DS   CL80