***********************************************************************
*     * BP0616 * 19/09/11 *********************************************
***********************************************************************
TEST75_BK DS 0CL80
         DS   CL80