***********************************************************************
*     * BP0616 * 19/09/11 *********************************************
***********************************************************************
THIS_BOOK DS 0CL80
         DS   CL80