***********************************************************************
*   * * FO2730 25/08/13 JFOF MIGRACION ZOS/1.13 EN AMBIENTE V 2.0     *
***********************************************************************
THIS_BOOK DS 0CL80
         DS   CL80