*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************   00010000
*  TSTS2XML COPYBOOK:                                               *   00020000
*          COMMAREA FOR PASSING PARAMETERS BETWEEN THE JAVA         *   00030000
*          PROGRAMS TSTSXMLI/TSTSXMLO AND THE ASSEMBLER SUPPORT     *   00040000
*          PROGRAMS.                                                *   00050000
*********************************************************************   00060000
*                     ** HISTORY OF REVISIONS **                    *   00070000
*  DATE       DESCRIPTION                                     CHGID *   00080000
* -------------------------------------------------------------------   00090000
*  01/25/01   INITIAL DISTRIBUTION                            2024235   00100000
*********************************************************************   00110000
*    TSTSXMLI/TSTSXMLO COMMAREA                               2024235   00120000
TSTS2XML DS    0F                    START OF COMMAREA        2024235   00130000
INPADR   DS    F                     ADR OF MSG TO CONVERT    2024235   00140000
INPLEN   DS    F                     LENGTH OF MSG TO CONVERT 2024235   00150000
OUTADR   DS    F                     ADR OF CONVERTED MSG     2024235   00160000
OUTLEN   DS    F                     LENGTH OF CONVERTED MSG  2024235   00170000
XMLRC    DS    H                     TSTSXMLI/O RETURN CODE   2024235   00180000
XMLCAL   EQU   *-TSTS2XML            LENGTH OF XML CA         2024235   00190000