*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*=*------------------------------------------------------------*=*      00000100
*=*                                                            *=*      00000200
*=*            CICS EIB FUNCTION/RESPONSE TABLE                *=*      00000300
*=*                                                            *=*      00000400
*=*------------------------------------------------------------*=*      00000500
*=*            LAST MESSAGE CODE USED  =  TS9868               *=*      00000600
*=*------------------------------------------------------------*=*      00000700
*********************************************************************** 00000702
*                  ** HISTORY OF REVISIONS **                         * 00000704
*                                                                     * 00000706
* DESCRIPTION                                                 CHNGID  * 00000708
* __________________________________________________________  _______ * 00000710
*                                                                     * 00000712
* 01/28/03  REMOVE MIRROR LOGGING                             0324534 * 00000796
*********************************************************************** 00000798
         SPACE                                                          00000800
***** EIB FUNCTION/RESPONSE TABLE *****                                 00000900
         SPACE                                                          00001000
EFRTBL   DS  0C                                                         00001100
*=*------------------*=*                                                00001200
*=*   A D D R E S S  *=*                                                00001300
*=*      INVREQ      *=*                                                00001400
*=*------------------*=*                                                00001500
         SPACE 2                                                        00001600
EFRFUN   DC  X'0202'                       FUNCTION CODE                00001700
EFRRTN   DC  X'E00000000000'               RESPONSE CODE                00001800
EFRDSET  DC  C'     '                      DATASET NAME                 00001900
EFRMSGC  DC  C'9001'                       MESSAGE CODE                 00002000
EFRNTRYL EQU *-EFRTBL                      ENTRY LENGTH                 00002100
         SPACE 2                                                        00002200
*=*-------------------------------------*=*                             00002300
*=*   H A N D L E   C O N D I T I O N   *=*                             00002400
*=*-------------------------------------*=*                             00002500
         SPACE 2                                                        00002600
         DC  X'0204',X'E00000000000',C'     ',C'9002'     INVREQ        00002700
         SPACE 2                                                        00002800
*=*-------------------------*=*                                         00002900
*=*   H A N D L E   A I D   *=*                                         00003000
*=*-------------------------*=*                                         00003100
         SPACE 2                                                        00003200
         DC  X'0206',X'E00000000000',C'     ',C'9003'     INVREQ        00003300
         SPACE 2                                                        00003400
*=*-----------------*=*                                                 00003500
*=*   A S S I G N   *=*                                                 00003600
*=*-----------------*=*                                                 00003700
         SPACE 2                                                        00003800
         DC  X'0208',X'E00000000000',C'     ',C'9004'     INVREQ        00003900
         SPACE 2                                                        00004000
*=*-------------------------------------*=*                             00004100
*=*   I G N O R E   C O N D I T I O N   *=*                             00004200
*=*-------------------------------------*=*                             00004300
         SPACE 2                                                        00004400
         DC  X'020A',X'E00000000000',C'     ',C'9005'     INVREQ        00004500
         SPACE 2                                                        00004600
*=*-------------*=*                                                     00004700
*=*   P U S H   *=*                                                     00004800
*=*-------------*=*                                                     00004900
         SPACE 2                                                        00005000
         DC  X'020C',X'E00000000000',C'     ',C'9006'     INVREQ        00005100
         SPACE 2                                                        00005200
*=*-----------*=*                                                       00005300
*=*   P O P   *=*                                                       00005400
*=*-----------*=*                                                       00005500
         SPACE 2                                                        00005600
         DC  X'020E',X'E00000000000',C'     ',C'9007'     INVREQ        00005700
         SPACE 2                                                        00005800
*=*-------------------*=*                                               00005900
*=*   R E C E I V E   *=*                                               00006000
*=*-------------------*=*                                               00006100
         SPACE 2                                                        00006200
         DC  X'0402',X'040000000000',C'     ',C'9008'     EOF           00006300
         DC  X'0402',X'100000000000',C'     ',C'9009'     EODS          00006400
         DC  X'0402',X'C10000000000',C'     ',C'9010'     EOF           00006500
         DC  X'0402',X'C20000000000',C'     ',C'9011'     ENDINPT       00006600
         DC  X'0402',X'D20000000000',C'     ',C'9012'     SESSIONERR    00006700
         DC  X'0402',X'D20400000000',C'     ',C'9013'     SESSIONERR    00006800
         DC  X'0402',X'D20800000000',C'     ',C'9014'     SESSIONERR    00006900
         DC  X'0402',X'D20C00000000',C'     ',C'9015'     SESSIONERR    00007000
         DC  X'0402',X'D50000000000',C'     ',C'9016'     NOTALLOC      00007100
         DC  X'0402',X'E00000000000',C'     ',C'9017'     INVREQ        00007200
         DC  X'0402',X'E000001C0000',C'     ',C'9018'     INVREQ        00007300
         DC  X'0402',X'E00000200000',C'     ',C'9019'     INVREQ        00007400
         DC  X'0402',X'E10000000000',C'     ',C'9020'     LENGERR       00007500
         DC  X'0402',X'E10040000000',C'     ',C'9021'     LENGERR       00007600
         DC  X'0402',X'E10080000000',C'     ',C'9022'     LENGERR       00007700
         DC  X'0402',X'E100C0000000',C'     ',C'9023'     LENGERR       00007800
         DC  X'0402',X'E40000000000',C'     ',C'9024'     RDATT         00007900
         DC  X'0402',X'E50000000000',C'     ',C'9025'     SIGNAL        00008000
         DC  X'0402',X'E70000000000',C'     ',C'9026'     NOPASSBKRD    00008100
         DC  X'0402',X'F10000000000',C'     ',C'9027'     TERMERR       00008200
         DC  X'0402',X'002000000000',C'     ',C'9028'     EOC           00008300
         DC  X'0402',X'004000000000',C'     ',C'9029'     INBFMH        00008400
         SPACE 2                                                        00008500
*=*-------------*=*                                                     00008600
*=*   S E N D   *=*                                                     00008700
*=*-------------*=*                                                     00008800
         SPACE 2                                                        00008900
         DC  X'0404',X'D20000000000',C'     ',C'9030'     SESSIONERR    00009000
         DC  X'0404',X'D20400000000',C'     ',C'9031'     SESSIONERR    00009100
         DC  X'0404',X'D20800000000',C'     ',C'9032'     SESSIONERR    00009200
         DC  X'0404',X'D20C00000000',C'     ',C'9033'     SESSIONERR    00009300
         DC  X'0404',X'D50000000000',C'     ',C'9034'     NOTALLOC      00009400
         DC  X'0404',X'E00000000000',C'     ',C'9035'     INVREQ        00009500
         DC  X'0404',X'E00000140000',C'     ',C'9036'     INVREQ        00009600
         DC  X'0404',X'E000001C0000',C'     ',C'9037'     INVREQ        00009700
         DC  X'0404',X'E00000200000',C'     ',C'9038'     INVREQ        00009800
         DC  X'0404',X'E10000000000',C'     ',C'9039'     LENGERR       00009900
         DC  X'0404',X'E10400000000',C'     ',C'9040'     LENGERR       00010000
         DC  X'0404',X'E10800000000',C'     ',C'9041'     LENGERR       00010100
         DC  X'0404',X'E10C00000000',C'     ',C'9042'     LENGERR       00010200
         DC  X'0404',X'E30000000000',C'     ',C'9043'     WRBRK         00010300
         DC  X'0404',X'E50000000000',C'     ',C'9044'     SIGNAL        00010400
         DC  X'0404',X'E80000000000',C'     ',C'9045'     NOPASSBKWR    00010500
         DC  X'0404',X'EA0000000000',C'     ',C'9046'     IGREQCD       00010600
         DC  X'0404',X'EB0000000000',C'     ',C'9047'     CBIDERR       00010700
         DC  X'0404',X'F10000000000',C'     ',C'9048'     TERMERR       00010800
         DC  X'0404',X'002000000000',C'     ',C'9049'     EOC           00010900
         SPACE 2                                                        00011000
*=*---------------------*=*                                             00011100
*=*   C O N V E R S E   *=*                                             00011200
*=*---------------------*=*                                             00011300
         SPACE 2                                                        00011400
         DC  X'0406',X'040000000000',C'     ',C'9050'     EOF           00011500
         DC  X'0406',X'100000000000',C'     ',C'9051'     EODS          00011600
         DC  X'0406',X'C10000000000',C'     ',C'9052'     EOF           00011700
         DC  X'0406',X'D20000000000',C'     ',C'9053'     SESSIONERR    00011800
         DC  X'0406',X'D20400000000',C'     ',C'9054'     SESSIONERR    00011900
         DC  X'0406',X'D20800000000',C'     ',C'9055'     SESSIONERR    00012000
         DC  X'0406',X'D20C00000000',C'     ',C'9056'     SESSIONERR    00012100
         DC  X'0406',X'D50000000000',C'     ',C'9057'     NOTALLOC      00012200
         DC  X'0406',X'E00000000000',C'     ',C'9058'     INVREQ        00012300
         DC  X'0406',X'E000001C0000',C'     ',C'9059'     INVREQ        00012400
         DC  X'0406',X'E00000200000',C'     ',C'9060'     INVREQ        00012500
         DC  X'0406',X'E10000000000',C'     ',C'9061'     LENGERR       00012600
         DC  X'0406',X'E10400000000',C'     ',C'9062'     LENGERR       00012700
         DC  X'0406',X'E10800000000',C'     ',C'9063'     LENGERR       00012800
         DC  X'0406',X'E10C00000000',C'     ',C'9064'     LENGERR       00012900
         DC  X'0406',X'E30000000000',C'     ',C'9065'     WRBRK         00013000
         DC  X'0406',X'E40000000000',C'     ',C'9066'     RDATT         00013100
         DC  X'0406',X'E50000000000',C'     ',C'9067'     SIGNAL        00013200
         DC  X'0406',X'EA0000000000',C'     ',C'9068'     IGREQCD       00013300
         DC  X'0406',X'EB0000000000',C'     ',C'9069'     CBIDERR       00013400
         DC  X'0406',X'F10000000000',C'     ',C'9070'     TERMERR       00013500
         DC  X'0406',X'002000000000',C'     ',C'9071'     EOC           00013600
         DC  X'0406',X'004000000000',C'     ',C'9072'     INBFMH        00013700
         SPACE 2                                                        00013800
*=*-------------------------*=*                                         00013900
*=*   I S S U E   E O D S   *=*                                         00014000
*=*-------------------------*=*                                         00014100
         SPACE 2                                                        00014200
         DC  X'0408',X'E00000000000',C'     ',C'9073'     INVREQ        00014300
         DC  X'0408',X'E000001C0000',C'     ',C'9074'     INVREQ        00014400
         DC  X'0408',X'E00000200000',C'     ',C'9075'     INVREQ        00014500
         DC  X'0408',X'F10000000000',C'     ',C'9076'     TERMERR       00014600
         SPACE 2                                                        00014700
*=*-------------------------*=*                                         00014800
*=*   I S S U E   C O P Y   *=*                                         00014900
*=*-------------------------*=*                                         00015000
         SPACE 2                                                        00015100
         DC  X'040A',X'E00000000000',C'     ',C'9077'     INVREQ        00015200
         DC  X'040A',X'E000001C0000',C'     ',C'9078'     INVREQ        00015300
         DC  X'040A',X'E00000200000',C'     ',C'9079'     INVREQ        00015400
         DC  X'040A',X'E60000000000',C'     ',C'9080'     TERMIDERR     00015500
         DC  X'040A',X'F10000000000',C'     ',C'9081'     TERMERR       00015600
         SPACE 2                                                        00015700
*=*-------------------------------*=*                                   00015800
*=*   W A I T   T E R M I N A L   *=*                                   00015900
*=*-------------------------------*=*                                   00016000
         SPACE 2                                                        00016100
         DC  X'040C',X'D20000000000',C'     ',C'9082'     SESSIONERR    00016200
         DC  X'040C',X'D20400000000',C'     ',C'9083'     SESSIONERR    00016300
         DC  X'040C',X'D20800000000',C'     ',C'9084'     SESSIONERR    00016400
         DC  X'040C',X'D20C00000000',C'     ',C'9085'     SESSIONERR    00016500
         DC  X'040C',X'D50000000000',C'     ',C'9086'     NOTALLOC      00016600
         DC  X'040C',X'E00000000000',C'     ',C'9087'     INVREQ        00016700
         DC  X'040C',X'E000001C0000',C'     ',C'9088'     INVREQ        00016800
         DC  X'040C',X'E00000200000',C'     ',C'9089'     INVREQ        00016900
         DC  X'040C',X'E50000000000',C'     ',C'9090'     SIGNAL        00017000
         SPACE 2                                                        00017100
*=*-------------------------*=*                                         00017200
*=*   I S S U E   L O A D   *=*                                         00017300
*=*-------------------------*=*                                         00017400
         SPACE 2                                                        00017500
         DC  X'040E',X'E00000000000',C'     ',C'9091'     INVREQ        00017600
         DC  X'040E',X'E000001C0000',C'     ',C'9092'     INVREQ        00017700
         DC  X'040E',X'E00000200000',C'     ',C'9093'     INVREQ        00017800
         DC  X'040E',X'F10000000000',C'     ',C'9094'     TERMERR       00017900
         DC  X'040E',X'000000F60000',C'     ',C'9095'     NOSTART       00018000
         DC  X'040E',X'000000F70000',C'     ',C'9096'     NONVAL        00018100
         SPACE 2                                                        00018200
*=*---------------------------*=*                                       00018300
*=*   W A I T   S I G N A L   *=*                                       00018400
*=*---------------------------*=*                                       00018500
         SPACE 2                                                        00018600
         DC  X'0410',X'E00000000000',C'     ',C'9097'     INVREQ        00018700
         DC  X'0410',X'E000001C0000',C'     ',C'9098'     INVREQ        00018800
         DC  X'0410',X'E00000200000',C'     ',C'9099'     INVREQ        00018900
         DC  X'0410',X'E50000000000',C'     ',C'9100'     SIGNAL        00019000
         DC  X'0410',X'F10000000000',C'     ',C'9101'     TERMERR       00019100
         SPACE 2                                                        00019200
*=*---------------------------*=*                                       00019300
*=*   I S S U E   R E S E T   *=*                                       00019400
*=*---------------------------*=*                                       00019500
         SPACE 2                                                        00019600
         DC  X'0412',X'E00000000000',C'     ',C'9102'     INVREQ        00019700
         DC  X'0412',X'E000001C0000',C'     ',C'9103'     INVREQ        00019800
         DC  X'0412',X'E00000200000',C'     ',C'9104'     INVREQ        00019900
         SPACE 2                                                        00020000
*=*-------------------------------------*=*                             00020100
*=*   I S S U E   D I S C O N N E C T   *=*                             00020200
*=*-------------------------------------*=*                             00020300
         SPACE 2                                                        00020400
         DC  X'0414',X'D50000000000',C'     ',C'9105'     NOTALLOC      00020500
         DC  X'0414',X'E00000000000',C'     ',C'9106'     INVREQ        00020600
         DC  X'0414',X'E000001C0000',C'     ',C'9107'     INVREQ        00020700
         DC  X'0414',X'E00000200000',C'     ',C'9108'     INVREQ        00020800
         DC  X'0414',X'D20000000000',C'     ',C'9109'     SESSIONERR    00020900
         DC  X'0414',X'D20400000000',C'     ',C'9110'     SESSIONERR    00021000
         DC  X'0414',X'D20800000000',C'     ',C'9111'     SESSIONERR    00021100
         DC  X'0414',X'D20C00000000',C'     ',C'9112'     SESSIONERR    00021200
         DC  X'0414',X'F10000000000',C'     ',C'9113'     TERMERR       00021300
         SPACE 2                                                        00021400
*=*-----------------------------------*=*                               00021500
*=*   I S S U E   E N D O U T P U T   *=*                               00021600
*=*-----------------------------------*=*                               00021700
         SPACE 2                                                        00021800
         DC  X'0416',X'E00000000000',C'     ',C'9114'     INVREQ        00021900
         DC  X'0416',X'E000001C0000',C'     ',C'9115'     INVREQ        00022000
         DC  X'0416',X'E00000200000',C'     ',C'9116'     INVREQ        00022100
         SPACE 2                                                        00022200
*=*---------------------------------*=*                                 00022300
*=*   I S S U E   E R A S E A U P   *=*                                 00022400
*=*---------------------------------*=*                                 00022500
         SPACE 2                                                        00022600
         DC  X'0418',X'E00000000000',C'     ',C'9117'     INVREQ        00022700
         DC  X'0418',X'E000001C0000',C'     ',C'9118'     INVREQ        00022800
         DC  X'0418',X'E00000200000',C'     ',C'9119'     INVREQ        00022900
         DC  X'0418',X'F10000000000',C'     ',C'9120'     TERMERR       00023000
         SPACE 2                                                        00023100
*=*-------------------------------*=*                                   00023200
*=*   I S S U E   E N D F I L E   *=*                                   00023300
*=*-------------------------------*=*                                   00023400
         SPACE 2                                                        00023500
         DC  X'041A',X'E00000000000',C'     ',C'9121'     INVREQ        00023600
         DC  X'041A',X'E000001C0000',C'     ',C'9122'     INVREQ        00023700
         DC  X'041A',X'E00000200000',C'     ',C'9123'     INVREQ        00023800
         SPACE 2                                                        00023900
*=*---------------------------*=*                                       00024000
*=*   I S S U E   P R I N T   *=*                                       00024100
*=*---------------------------*=*                                       00024200
         SPACE 2                                                        00024300
         DC  X'041C',X'E00000000000',C'     ',C'9124'     INVREQ        00024400
         DC  X'041C',X'E000001C0000',C'     ',C'9125'     INVREQ        00024500
         DC  X'041C',X'E00000200000',C'     ',C'9126'     INVREQ        00024600
         DC  X'041C',X'F10000000000',C'     ',C'9127'     TERMERR       00024700
         SPACE 2                                                        00024800
*=*-----------------------------*=*                                     00024900
*=*   I S S U E   S I G N A L   *=*                                     00025000
*=*-----------------------------*=*                                     00025100
         SPACE 2                                                        00025200
         DC  X'041E',X'D50000000000',C'     ',C'9128'     NOTALLOC      00025300
         DC  X'041E',X'E00000000000',C'     ',C'9129'     INVREQ        00025400
         DC  X'041E',X'E000001C0000',C'     ',C'9130'     INVREQ        00025500
         DC  X'041E',X'E00000200000',C'     ',C'9131'     INVREQ        00025600
         DC  X'041E',X'D20000000000',C'     ',C'9132'     SESSIONERR    00025700
         DC  X'041E',X'D20400000000',C'     ',C'9133'     SESSIONERR    00025800
         DC  X'041E',X'D20800000000',C'     ',C'9134'     SESSIONERR    00025900
         DC  X'041E',X'D20C00000000',C'     ',C'9135'     SESSIONERR    00026000
         DC  X'041E',X'F10000000000',C'     ',C'9136'     TERMERR       00026100
         SPACE 2                                                        00026200
*=*---------------------*=*                                             00026300
*=*   A L L O C A T E   *=*                                             00026400
*=*---------------------*=*                                             00026500
         SPACE 2                                                        00026600
         DC  X'0420',X'D00000000000',C'     ',C'9137'     SYSIDERR      00026700
         DC  X'0420',X'D00400000000',C'     ',C'9138'     SYSIDERR      00026800
         DC  X'0420',X'D00800000000',C'     ',C'9139'     SYSIDERR      00026900
         DC  X'0420',X'D00C00000000',C'     ',C'9140'     SYSIDERR      00027000
         DC  X'0420',X'D20000000000',C'     ',C'9141'     SESSIONERR    00027100
         DC  X'0420',X'D20400000000',C'     ',C'9142'     SESSIONERR    00027200
         DC  X'0420',X'D20800000000',C'     ',C'9143'     SESSIONERR    00027300
         DC  X'0420',X'D20C00000000',C'     ',C'9144'     SESSIONERR    00027400
         DC  X'0420',X'D30000000000',C'     ',C'9145'     SYSBUSY       00027500
         DC  X'0420',X'D40000000000',C'     ',C'9146'     SESSBUSY      00027600
         DC  X'0420',X'E00000000000',C'     ',C'9147'     INVREQ        00027700
         DC  X'0420',X'E00000040000',C'     ',C'9148'     INVREQ        00027800
         DC  X'0420',X'E000001C0000',C'     ',C'9149'     INVREQ        00027900
         DC  X'0420',X'E00000200000',C'     ',C'9150'     INVREQ        00028000
         DC  X'0420',X'EB0000000000',C'     ',C'9151'     CBIDERR       00028100
         DC  X'0420',X'002000000000',C'     ',C'9152'     EOC           00028200
         SPACE 2                                                        00028300
*=*-------------*=*                                                     00028400
*=*   F R E E   *=*                                                     00028500
*=*-------------*=*                                                     00028600
         SPACE 2                                                        00028700
         DC  X'0422',X'D20000000000',C'     ',C'9153'     SESSIONERR    00028800
         DC  X'0422',X'D20400000000',C'     ',C'9154'     SESSIONERR    00028900
         DC  X'0422',X'D20800000000',C'     ',C'9155'     SESSIONERR    00029000
         DC  X'0422',X'D20C00000000',C'     ',C'9156'     SESSIONERR    00029100
         DC  X'0422',X'D50000000000',C'     ',C'9157'     NOTALLOC      00029200
         DC  X'0422',X'E00000000000',C'     ',C'9158'     INVREQ        00029300
         DC  X'0422',X'E00000080000',C'     ',C'9159'     INVREQ        00029400
         DC  X'0422',X'E000001C0000',C'     ',C'9160'     INVREQ        00029500
         DC  X'0422',X'E00000200000',C'     ',C'9161'     INVREQ        00029600
         SPACE 2                                                        00029700
*=*---------------*=*                                                   00029800
*=*   P O I N T   *=*                                                   00029900
*=*---------------*=*                                                   00030000
         SPACE 2                                                        00030100
         DC  X'0424',X'D20000000000',C'     ',C'9162'     SESSIONERR    00030200
         DC  X'0424',X'D20400000000',C'     ',C'9163'     SESSIONERR    00030300
         DC  X'0424',X'D20800000000',C'     ',C'9164'     SESSIONERR    00030400
         DC  X'0424',X'D20C00000000',C'     ',C'9165'     SESSIONERR    00030500
         DC  X'0424',X'D50000000000',C'     ',C'9166'     NOTALLOC      00030600
         DC  X'0424',X'E00000000000',C'     ',C'9167'     INVREQ        00030700
         DC  X'0424',X'E000001C0000',C'     ',C'9168'     INVREQ        00030800
         DC  X'0424',X'E00000200000',C'     ',C'9169'     INVREQ        00030900
         SPACE 2                                                        00031000
*=*-----------------------------*=*                                     00031100
*=*   B U I L D   A T T A C H   *=*                                     00031200
*=*-----------------------------*=*                                     00031300
         SPACE 2                                                        00031400
         DC  X'0426',X'E00000000000',C'     ',C'9170'     INVREQ        00031500
         DC  X'0426',X'E000001C0000',C'     ',C'9171'     INVREQ        00031600
         DC  X'0426',X'E00000200000',C'     ',C'9172'     INVREQ        00031700
         SPACE 2                                                        00031800
*=*----------------------------------*=*                                00031900
*=*   E X T R A C T    A T T A C H   *=*                                00032000
*=*----------------------------------*=*                                00032100
         SPACE 2                                                        00032200
         DC  X'0428',X'D20000000000',C'     ',C'9173'     SESSIONERR    00032300
         DC  X'0428',X'D20400000000',C'     ',C'9174'     SESSIONERR    00032400
         DC  X'0428',X'D20800000000',C'     ',C'9175'     SESSIONERR    00032500
         DC  X'0428',X'D20C00000000',C'     ',C'9176'     SESSIONERR    00032600
         DC  X'0428',X'D50000000000',C'     ',C'9177'     NOTALLOC      00032700
         DC  X'0428',X'EB0000000000',C'     ',C'9178'     CBIDERR       00032800
         DC  X'0428',X'E00000000000',C'     ',C'9179'     INVREQ        00032900
         DC  X'0428',X'E00000100000',C'     ',C'9180'     INVREQ        00033000
         DC  X'0428',X'E000001C0000',C'     ',C'9181'     INVREQ        00033100
         DC  X'0428',X'E00000200000',C'     ',C'9182'     INVREQ        00033200
         SPACE 2                                                        00033300
*=*----------------------------*=*                                      00033400
*=*   E X T R A C T    T C T   *=*                                      00033500
*=*----------------------------*=*                                      00033600
         SPACE 2                                                        00033700
         DC  X'042A',X'E00000000000',C'     ',C'9183'     INVREQ        00033800
         DC  X'042A',X'E00000180000',C'     ',C'9184'     INVREQ        00033900
         DC  X'042A',X'E000001C0000',C'     ',C'9185'     INVREQ        00034000
         DC  X'042A',X'E00000200000',C'     ',C'9186'     INVREQ        00034100
         SPACE 2                                                        00034200
*=*----------------------------*=*                                      00034300
*=*   W A I T    C O N V I D   *=*                                      00034400
*=*----------------------------*=*                                      00034500
         SPACE 2                                                        00034600
         DC  X'042C',X'D50000000000',C'     ',C'9187'     NOTALLOC      00034700
         DC  X'042C',X'E00000000000',C'     ',C'9188'     INVREQ        00034800
         DC  X'042C',X'E000001C0000',C'     ',C'9189'     INVREQ        00034900
         DC  X'042C',X'E00000200000',C'     ',C'9190'     INVREQ        00035000
         DC  X'042C',X'E50000000000',C'     ',C'9191'     SIGNAL        00035100
         SPACE 2                                                        00035200
*=*------------------------------------*=*                              00035300
*=*   E X T R A C T    P R O C E S S   *=*                              00035400
*=*------------------------------------*=*                              00035500
         SPACE 2                                                        00035600
         DC  X'042E',X'D50000000000',C'     ',C'9192'     NOTALLOC      00035700
         DC  X'042E',X'E00000000000',C'     ',C'9193'     INVREQ        00035800
         DC  X'042E',X'E000001C0000',C'     ',C'9194'     INVREQ        00035900
         DC  X'042E',X'E00000200000',C'     ',C'9195'     INVREQ        00036000
         SPACE 2                                                        00036100
*=*----------------------------*=*                                      00036200
*=*   I S S U E    A B E N D   *=*                                      00036300
*=*----------------------------*=*                                      00036400
         SPACE 2                                                        00036500
         DC  X'0430',X'D50000000000',C'     ',C'9196'     NOTALLOC      00036600
         DC  X'0430',X'E00000000000',C'     ',C'9197'     INVREQ        00036700
         DC  X'0430',X'E000001C0000',C'     ',C'9198'     INVREQ        00036800
         DC  X'0430',X'E00000200000',C'     ',C'9199'     INVREQ        00036900
         DC  X'0430',X'F10000000000',C'     ',C'9200'     TERMERR       00037000
         SPACE 2                                                        00037100
*=*------------------------------------*=*                              00037200
*=*   C O N N E C T    P R O C E S S   *=*                              00037300
*=*------------------------------------*=*                              00037400
         SPACE 2                                                        00037500
         DC  X'0432',X'D50000000000',C'     ',C'9201'     NOTALLOC      00037600
         DC  X'0432',X'E00000000000',C'     ',C'9202'     INVREQ        00037700
         DC  X'0432',X'E000000C0000',C'     ',C'9203'     INVREQ        00037800
         DC  X'0432',X'E000001C0000',C'     ',C'9204'     INVREQ        00037900
         DC  X'0432',X'E00000200000',C'     ',C'9205'     INVREQ        00038000
         DC  X'0432',X'E10000000000',C'     ',C'9206'     LENGERR       00038100
         DC  X'0432',X'E10400000000',C'     ',C'9207'     LENGERR       00038200
         DC  X'0432',X'E10800000000',C'     ',C'9208'     LENGERR       00038300
         DC  X'0432',X'E10C00000000',C'     ',C'9209'     LENGERR       00038400
         SPACE 2                                                        00038500
*=*------------------------------------------*=*                        00038600
*=*   I S S U E    C O N F I R M A T I O N   *=*                        00038700
*=*------------------------------------------*=*                        00038800
         SPACE 2                                                        00038900
         DC  X'0434',X'D50000000000',C'     ',C'9210'     NOTALLOC      00039000
         DC  X'0434',X'E00000000000',C'     ',C'9211'     INVREQ        00039100
         DC  X'0434',X'E000001C0000',C'     ',C'9212'     INVREQ        00039200
         DC  X'0434',X'E00000200000',C'     ',C'9213'     INVREQ        00039300
         DC  X'0434',X'F10000000000',C'     ',C'9214'     TERMERR       00039400
         SPACE 2                                                        00039500
*=*----------------------------*=*                                      00039600
*=*   I S S U E    E R R O R   *=*                                      00039700
*=*----------------------------*=*                                      00039800
         SPACE 2                                                        00039900
         DC  X'0436',X'D50000000000',C'     ',C'9215'     NOTALLOC      00040000
         DC  X'0436',X'E00000000000',C'     ',C'9216'     INVREQ        00040100
         DC  X'0436',X'E000001C0000',C'     ',C'9217'     INVREQ        00040200
         DC  X'0436',X'E00000200000',C'     ',C'9218'     INVREQ        00040300
         DC  X'0436',X'F10000000000',C'     ',C'9219'     TERMERR       00040400
         SPACE 2                                                        00040500
*=*--------------------------------*=*                                  00040600
*=*   I S S U E    P R E P A R E   *=*                                  00040700
*=*--------------------------------*=*                                  00040800
         SPACE 2                                                        00040900
         DC  X'0438',X'E00000000000',C'     ',C'9220'     INVREQ        00041000
         DC  X'0438',X'E000001C0000',C'     ',C'9221'     INVREQ        00041100
         DC  X'0438',X'E00000200000',C'     ',C'9222'     INVREQ        00041200
         SPACE 2                                                        00041300
*=*--------------------------*=*                                        00041400
*=*   I S S U E    P A S S   *=*                                        00041500
*=*--------------------------*=*                                        00041600
         SPACE 2                                                        00041700
         DC  X'043A',X'E00000000000',C'     ',C'9223'     INVREQ        00041800
         DC  X'043A',X'E000001C0000',C'     ',C'9224'     INVREQ        00041900
         DC  X'043A',X'E00000200000',C'     ',C'9225'     INVREQ        00042000
         DC  X'043A',X'E00000280000',C'     ',C'9226'     INVREQ        00042100
         SPACE 2                                                        00042200
*=*-------------------------------------*=*                             00042300
*=*   E X T R A C T   L O G O N M S G   *=*                             00042400
*=*-------------------------------------*=*                             00042500
         SPACE 2                                                        00042600
         DC  X'043C',X'E00000000000',C'     ',C'9227'     INVREQ        00042700
         DC  X'043C',X'E000001C0000',C'     ',C'9228'     INVREQ        00042800
         DC  X'043C',X'E00000200000',C'     ',C'9229'     INVREQ        00042900
         SPACE 2                                                        00043000
*=*-------------*=*                                                     00043100
*=*   R E A D   *=*                                                     00043200
*=*-------------*=*                                                     00043300
         SPACE 2                                                        00043400
         DC  X'0602',X'010000000000',C'     ',C'9230'     DSIDERR       00043500
         DC  X'0602',X'020000000000',C'     ',C'9231'     ILLOGIC       00043600
         DC  X'0602',X'020000000000',C'TS   ',C'9232'     ILLOGIC       00043700
         DC  X'0602',X'020000000000',C'TSEOR',C'9233'     ILLOGIC       00043800
         DC  X'0602',X'020000000000',C'TSITR',C'9234'     ILLOGIC       00043900
         DC  X'0602',X'020000000000',C'TSLOG',C'9235'     ILLOGIC       00044000
         DC  X'0602',X'020000000000',C'TSLGN',C'9235'     ILLOGIC       00044100
         DC  X'0602',X'080000000000',C'     ',C'9237'     INVREQ        00044400
         DC  X'0602',X'0C0000000000',C'     ',C'9238'     NOTOPEN       00044500
         DC  X'0602',X'0C0000000000',C'TS   ',C'9239'     NOTOPEN       00044600
         DC  X'0602',X'0C0000000000',C'TSEOR',C'9240'     NOTOPEN       00044700
         DC  X'0602',X'0C0000000000',C'TSITR',C'9241'     NOTOPEN       00044800
         DC  X'0602',X'0C0000000000',C'TSETR',C'9883' NOTOPEN 2501198   00044850
         DC  X'0602',X'0C0000000000',C'TSLOG',C'9242'     NOTOPEN       00044900
         DC  X'0602',X'0C0000000000',C'TSLGN',C'9242'     NOTOPEN       00045000
         DC  X'0602',X'0D0000000000',C'     ',C'9244'     DISABLED      00045300
         DC  X'0602',X'0D0000000000',C'TS   ',C'9245'     DISABLED      00045400
         DC  X'0602',X'0D0000000000',C'TSEOR',C'9246'     DISABLED      00045500
         DC  X'0602',X'0D0000000000',C'TSITR',C'9247'     DISABLED      00045600
         DC  X'0602',X'0D0000000000',C'TSLOG',C'9248'     DISABLED      00045700
         DC  X'0602',X'0D0000000000',C'TSLGN',C'9248'     DISABLED      00045800
         DC  X'0602',X'840000000000',C'     ',C'9250'     DUPKEY        00046100
         DC  X'0602',X'840000000000',C'TS   ',C'9251'     DUPKEY        00046200
         DC  X'0602',X'840000000000',C'TSEOR',C'9252'     DUPKEY        00046300
         DC  X'0602',X'840000000000',C'TSITR',C'9253'     DUPKEY        00046400
         DC  X'0602',X'800000000000',C'     ',C'9254'     IOERR         00046500
         DC  X'0602',X'800000000000',C'TS   ',C'9255'     IOERR         00046600
         DC  X'0602',X'800000000000',C'TSEOR',C'9256'     IOERR         00046700
         DC  X'0602',X'800000000000',C'TSITR',C'9257'     IOERR         00046800
         DC  X'0602',X'800000000000',C'TSLOG',C'9258'     IOERR         00046900
         DC  X'0602',X'800000000000',C'TSLGN',C'9258'     IOERR         00047000
         DC  X'0602',X'810000000000',C'     ',C'9260'     NOTFND        00047300
         DC  X'0602',X'810000000000',C'TS   ',C'9261'     NOTFND        00047400
         DC  X'0602',X'810000000000',C'TSEOR',C'9262'     NOTFND        00047500
         DC  X'0602',X'810000000000',C'TSITR',C'9263'     NOTFND        00047600
         DC  X'0602',X'810000000000',C'TSLOG',C'9264'     NOTFND        00047700
         DC  X'0602',X'810000000000',C'TSLGN',C'9264'     NOTFND        00047800
         DC  X'0602',X'D00000000000',C'     ',C'9266'     SYSIDERR      00048100
         DC  X'0602',X'D00400000000',C'     ',C'9267'     SYSIDERR      00048200
         DC  X'0602',X'D00800000000',C'     ',C'9268'     SYSIDERR      00048300
         DC  X'0602',X'D00C00000000',C'     ',C'9269'     SYSIDERR      00048400
         DC  X'0602',X'D10000000000',C'     ',C'9270'     ISCINVREQ     00048500
         DC  X'0602',X'D60000000000',C'     ',C'9271'     NOTAUTH       00048600
         DC  X'0602',X'E10000000000',C'     ',C'9272'     LENGERR       00048700
         DC  X'0602',X'E10000000000',C'TS   ',C'9273'     LENGERR       00048800
         DC  X'0602',X'E10000000000',C'TSEOR',C'9274'     LENGERR       00048900
         DC  X'0602',X'E10000000000',C'TSITR',C'9275'     LENGERR       00049000
         DC  X'0602',X'E10000000000',C'TSLOG',C'9276'     LENGERR       00049100
         DC  X'0602',X'E10000000000',C'TSLGN',C'9276'     LENGERR       00049200
         SPACE 2                                                        00049500
*=*---------------*=*                                                   00049600
*=*   W R I T E   *=*                                                   00049700
*=*---------------*=*                                                   00049800
         SPACE 2                                                        00049900
         DC  X'0604',X'010000000000',C'     ',C'9278'     DSIDERR       00050000
         DC  X'0604',X'020000000000',C'     ',C'9279'     ILLOGIC       00050100
         DC  X'0604',X'020000000000',C'TS   ',C'9280'     ILLOGIC       00050200
         DC  X'0604',X'020000000000',C'TSEOR',C'9281'     ILLOGIC       00050300
         DC  X'0604',X'020000000000',C'TSITR',C'9282'     ILLOGIC       00050400
         DC  X'0604',X'020000000000',C'TSLOG',C'9283'     ILLOGIC       00050500
         DC  X'0604',X'020000000000',C'TSLGN',C'9283'     ILLOGIC       00050600
         DC  X'0604',X'080000000000',C'     ',C'9285'     INVREQ        00050900
         DC  X'0604',X'0C0000000000',C'     ',C'9286'     NOTOPEN       00051000
         DC  X'0604',X'0C0000000000',C'TS   ',C'9287'     NOTOPEN       00051100
         DC  X'0604',X'0C0000000000',C'TSEOR',C'9288'     NOTOPEN       00051200
         DC  X'0604',X'0C0000000000',C'TSITR',C'9289'     NOTOPEN       00051300
         DC  X'0604',X'0C0000000000',C'TSLOG',C'9290'     NOTOPEN       00051400
         DC  X'0604',X'0C0000000000',C'TSLGN',C'9290'     NOTOPEN       00051500
         DC  X'0604',X'0D0000000000',C'     ',C'9292'     DISABLED      00051800
         DC  X'0604',X'0D0000000000',C'TS   ',C'9293'     DISABLED      00051900
         DC  X'0604',X'0D0000000000',C'TSEOR',C'9294'     DISABLED      00052000
         DC  X'0604',X'0D0000000000',C'TSITR',C'9295'     DISABLED      00052100
         DC  X'0604',X'0D0000000000',C'TSLOG',C'9296'     DISABLED      00052200
         DC  X'0604',X'0D0000000000',C'TSLGN',C'9296'     DISABLED      00052300
         DC  X'0604',X'820000000000',C'     ',C'9298'     DUPREC        00052600
         DC  X'0604',X'820000000000',C'TS   ',C'9299'     DUPREC        00052700
         DC  X'0604',X'820000000000',C'TSEOR',C'9300'     DUPREC        00052800
         DC  X'0604',X'820000000000',C'TSITR',C'9301'     DUPREC        00052900
         DC  X'0604',X'800000000000',C'     ',C'9302'     IOERR         00053000
         DC  X'0604',X'800000000000',C'TS   ',C'9303'     IOERR         00053100
         DC  X'0604',X'800000000000',C'TSEOR',C'9304'     IOERR         00053200
         DC  X'0604',X'800000000000',C'TSITR',C'9305'     IOERR         00053300
         DC  X'0604',X'800000000000',C'TSLOG',C'9306'     IOERR         00053400
         DC  X'0604',X'800000000000',C'TSLGN',C'9306'     IOERR         00053500
         DC  X'0604',X'830000000000',C'     ',C'9308'     NOSPACE       00053800
         DC  X'0604',X'830000000000',C'TS   ',C'9309'     NOSPACE       00053900
         DC  X'0604',X'830000000000',C'TSEOR',C'9310'     NOSPACE       00054000
         DC  X'0604',X'830000000000',C'TSITR',C'9311'     NOSPACE       00054100
         DC  X'0604',X'830000000000',C'TSLOG',C'9312'     NOSPACE       00054200
         DC  X'0604',X'830000000000',C'TSLGN',C'9312'     NOSPACE       00054300
         DC  X'0604',X'D00000000000',C'     ',C'9314'     SYSIDERR      00054600
         DC  X'0604',X'D00400000000',C'     ',C'9315'     SYSIDERR      00054700
         DC  X'0604',X'D00800000000',C'     ',C'9316'     SYSIDERR      00054800
         DC  X'0604',X'D00C00000000',C'     ',C'9317'     SYSIDERR      00054900
         DC  X'0604',X'D10000000000',C'     ',C'9318'     ISCINVREQ     00055000
         DC  X'0604',X'D60000000000',C'     ',C'9319'     NOTAUTH       00055100
         DC  X'0604',X'E10000000000',C'     ',C'9320'     LENGERR       00055200
         DC  X'0604',X'E10000000000',C'TS   ',C'9321'     LENGERR       00055300
         DC  X'0604',X'E10000000000',C'TSEOR',C'9322'     LENGERR       00055400
         DC  X'0604',X'E10000000000',C'TSITR',C'9323'     LENGERR       00055500
         DC  X'0604',X'E10000000000',C'TSLOG',C'9324'     LENGERR       00055600
         DC  X'0604',X'E10000000000',C'TSLGN',C'9324'     LENGERR       00055700
         SPACE 2                                                        00056000
*=*-------------------*=*                                               00056100
*=*   R E W R I T E   *=*                                               00056200
*=*-------------------*=*                                               00056300
         SPACE 2                                                        00056400
         DC  X'0606',X'010000000000',C'     ',C'9326'     DSIDERR       00056500
         DC  X'0606',X'020000000000',C'     ',C'9327'     ILLOGIC       00056600
         DC  X'0606',X'020000000000',C'TS   ',C'9328'     ILLOGIC       00056700
         DC  X'0606',X'020000000000',C'TSEOR',C'9329'     ILLOGIC       00056800
         DC  X'0606',X'020000000000',C'TSITR',C'9330'     ILLOGIC       00056900
         DC  X'0606',X'020000000000',C'TSLOG',C'9331'     ILLOGIC       00057000
         DC  X'0606',X'020000000000',C'TSLGN',C'9331'     ILLOGIC       00057100
         DC  X'0606',X'080000000000',C'     ',C'9333'     INVREQ        00057400
         DC  X'0606',X'0C0000000000',C'     ',C'9334'     NOTOPEN       00057500
         DC  X'0606',X'0C0000000000',C'TS   ',C'9335'     NOTOPEN       00057600
         DC  X'0606',X'0C0000000000',C'TSEOR',C'9336'     NOTOPEN       00057700
         DC  X'0606',X'0C0000000000',C'TSITR',C'9337'     NOTOPEN       00057800
         DC  X'0606',X'0C0000000000',C'TSLOG',C'9338'     NOTOPEN       00057900
         DC  X'0606',X'0C0000000000',C'TSLGN',C'9338'     NOTOPEN       00058000
         DC  X'0606',X'0D0000000000',C'     ',C'9340'     DISABLED      00058300
         DC  X'0606',X'0D0000000000',C'TS   ',C'9341'     DISABLED      00058400
         DC  X'0606',X'0D0000000000',C'TSEOR',C'9342'     DISABLED      00058500
         DC  X'0606',X'0D0000000000',C'TSITR',C'9343'     DISABLED      00058600
         DC  X'0606',X'0D0000000000',C'TSLOG',C'9344'     DISABLED      00058700
         DC  X'0606',X'0D0000000000',C'TSLGN',C'9344'     DISABLED      00058800
         DC  X'0606',X'820000000000',C'     ',C'9346'     DUPREC        00059100
         DC  X'0606',X'820000000000',C'TS   ',C'9347'     DUPREC        00059200
         DC  X'0606',X'820000000000',C'TSEOR',C'9348'     DUPREC        00059300
         DC  X'0606',X'820000000000',C'TSITR',C'9349'     DUPREC        00059400
         DC  X'0606',X'800000000000',C'     ',C'9350'     IOERR         00059500
         DC  X'0606',X'800000000000',C'TS   ',C'9351'     IOERR         00059600
         DC  X'0606',X'800000000000',C'TSEOR',C'9352'     IOERR         00059700
         DC  X'0606',X'800000000000',C'TSITR',C'9353'     IOERR         00059800
         DC  X'0606',X'800000000000',C'TSLOG',C'9354'     IOERR         00059900
         DC  X'0606',X'800000000000',C'TSLGN',C'9354'     IOERR         00060000
         DC  X'0606',X'830000000000',C'     ',C'9356'     NOSPACE       00060300
         DC  X'0606',X'830000000000',C'TS   ',C'9357'     NOSPACE       00060400
         DC  X'0606',X'830000000000',C'TSEOR',C'9358'     NOSPACE       00060500
         DC  X'0606',X'830000000000',C'TSITR',C'9359'     NOSPACE       00060600
         DC  X'0606',X'830000000000',C'TSLOG',C'9360'     NOSPACE       00060700
         DC  X'0606',X'830000000000',C'TSLGN',C'9360'     NOSPACE       00060800
         DC  X'0606',X'D00000000000',C'     ',C'9362'     SYSIDERR      00061100
         DC  X'0606',X'D00400000000',C'     ',C'9363'     SYSIDERR      00061200
         DC  X'0606',X'D00800000000',C'     ',C'9364'     SYSIDERR      00061300
         DC  X'0606',X'D00C00000000',C'     ',C'9365'     SYSIDERR      00061400
         DC  X'0606',X'D10000000000',C'     ',C'9366'     ISCINVREQ     00061500
         DC  X'0606',X'E10000000000',C'     ',C'9367'     LENGERR       00061600
         DC  X'0606',X'E10000000000',C'TS   ',C'9368'     LENGERR       00061700
         DC  X'0606',X'E10000000000',C'TSEOR',C'9369'     LENGERR       00061800
         DC  X'0606',X'E10000000000',C'TSITR',C'9370'     LENGERR       00061900
         DC  X'0606',X'E10000000000',C'TSLOG',C'9371'     LENGERR       00062000
         DC  X'0606',X'E10000000000',C'TSLGN',C'9371'     LENGERR       00062100
         DC  X'0606',X'D60000000000',C'     ',C'9373'     NOTAUTH       00062400
         SPACE 2                                                        00062500
*=*-----------------*=*                                                 00062600
*=*   D E L E T E   *=*                                                 00062700
*=*-----------------*=*                                                 00062800
         SPACE 2                                                        00062900
         DC  X'0608',X'010000000000',C'     ',C'9374'     DSIDERR       00063000
         DC  X'0608',X'020000000000',C'     ',C'9375'     ILLOGIC       00063100
         DC  X'0608',X'020000000000',C'TS   ',C'9376'     ILLOGIC       00063200
         DC  X'0608',X'020000000000',C'TSEOR',C'9377'     ILLOGIC       00063300
         DC  X'0608',X'020000000000',C'TSITR',C'9378'     ILLOGIC       00063400
         DC  X'0608',X'020000000000',C'TSLOG',C'9379'     ILLOGIC       00063500
         DC  X'0608',X'020000000000',C'TSLGN',C'9379'     ILLOGIC       00063600
         DC  X'0608',X'080000000000',C'     ',C'9381'     INVREQ        00063900
         DC  X'0608',X'0C0000000000',C'     ',C'9382'     NOTOPEN       00064000
         DC  X'0608',X'0C0000000000',C'TS   ',C'9383'     NOTOPEN       00064100
         DC  X'0608',X'0C0000000000',C'TSEOR',C'9384'     NOTOPEN       00064200
         DC  X'0608',X'0C0000000000',C'TSITR',C'9385'     NOTOPEN       00064300
         DC  X'0608',X'0C0000000000',C'TSLOG',C'9386'     NOTOPEN       00064400
         DC  X'0608',X'0C0000000000',C'TSLGN',C'9386'     NOTOPEN       00064500
         DC  X'0608',X'0D0000000000',C'     ',C'9388'     DISABLED      00064800
         DC  X'0608',X'0D0000000000',C'TS   ',C'9389'     DISABLED      00064900
         DC  X'0608',X'0D0000000000',C'TSEOR',C'9390'     DISABLED      00065000
         DC  X'0608',X'0D0000000000',C'TSITR',C'9391'     DISABLED      00065100
         DC  X'0608',X'0D0000000000',C'TSLOG',C'9392'     DISABLED      00065200
         DC  X'0608',X'0D0000000000',C'TSLGN',C'9392'     DISABLED      00065300
         DC  X'0608',X'800000000000',C'     ',C'9394'     IOERR         00065600
         DC  X'0608',X'800000000000',C'TS   ',C'9395'     IOERR         00065700
         DC  X'0608',X'800000000000',C'TSEOR',C'9396'     IOERR         00065800
         DC  X'0608',X'800000000000',C'TSITR',C'9397'     IOERR         00065900
         DC  X'0608',X'800000000000',C'TSLOG',C'9398'     IOERR         00066000
         DC  X'0608',X'800000000000',C'TSLGN',C'9398'     IOERR         00066100
         DC  X'0608',X'810000000000',C'     ',C'9400'     NOTFND        00066400
         DC  X'0608',X'810000000000',C'TS   ',C'9401'     NOTFND        00066500
         DC  X'0608',X'810000000000',C'TSEOR',C'9402'     NOTFND        00066600
         DC  X'0608',X'810000000000',C'TSITR',C'9403'     NOTFND        00066700
         DC  X'0608',X'810000000000',C'TSLOG',C'9404'     NOTFND        00066800
         DC  X'0608',X'810000000000',C'TSLGN',C'9404'     NOTFND        00066900
         DC  X'0608',X'D00000000000',C'     ',C'9406'     SYSIDERR      00067200
         DC  X'0608',X'D00400000000',C'     ',C'9407'     SYSIDERR      00067300
         DC  X'0608',X'D00800000000',C'     ',C'9408'     SYSIDERR      00067400
         DC  X'0608',X'D00C00000000',C'     ',C'9409'     SYSIDERR      00067500
         DC  X'0608',X'D10000000000',C'     ',C'9410'     ISCINVREQ     00067600
         DC  X'0608',X'D60000000000',C'     ',C'9411'     NOTAUTH       00067700
         SPACE 2                                                        00067800
*=*-----------------*=*                                                 00067900
*=*   U N L O C K   *=*                                                 00068000
*=*-----------------*=*                                                 00068100
         SPACE 2                                                        00068200
         DC  X'060A',X'010000000000',C'     ',C'9412'     DSIDERR       00068300
         DC  X'060A',X'020000000000',C'     ',C'9413'     ILLOGIC       00068400
         DC  X'060A',X'020000000000',C'TS   ',C'9414'     ILLOGIC       00068500
         DC  X'060A',X'020000000000',C'TSEOR',C'9415'     ILLOGIC       00068600
         DC  X'060A',X'020000000000',C'TSITR',C'9416'     ILLOGIC       00068700
         DC  X'060A',X'020000000000',C'TSLOG',C'9417'     ILLOGIC       00068800
         DC  X'060A',X'020000000000',C'TSLGN',C'9417'     ILLOGIC       00068900
         DC  X'060A',X'080000000000',C'     ',C'9419'     INVREQ        00069200
         DC  X'060A',X'0C0000000000',C'     ',C'9420'     NOTOPEN       00069300
         DC  X'060A',X'0C0000000000',C'TS   ',C'9421'     NOTOPEN       00069400
         DC  X'060A',X'0C0000000000',C'TSEOR',C'9422'     NOTOPEN       00069500
         DC  X'060A',X'0C0000000000',C'TSITR',C'9423'     NOTOPEN       00069600
         DC  X'060A',X'0C0000000000',C'TSLOG',C'9424'     NOTOPEN       00069700
         DC  X'060A',X'0C0000000000',C'TSLGN',C'9424'     NOTOPEN       00069800
         DC  X'060A',X'0D0000000000',C'     ',C'9426'     DISABLED      00070100
         DC  X'060A',X'0D0000000000',C'TS   ',C'9427'     DISABLED      00070200
         DC  X'060A',X'0D0000000000',C'TSEOR',C'9428'     DISABLED      00070300
         DC  X'060A',X'0D0000000000',C'TSITR',C'9429'     DISABLED      00070400
         DC  X'060A',X'0D0000000000',C'TSLOG',C'9430'     DISABLED      00070500
         DC  X'060A',X'0D0000000000',C'TSLGN',C'9430'     DISABLED      00070600
         DC  X'060A',X'800000000000',C'     ',C'9432'     IOERR         00070900
         DC  X'060A',X'800000000000',C'TS   ',C'9433'     IOERR         00071000
         DC  X'060A',X'800000000000',C'TSEOR',C'9434'     IOERR         00071100
         DC  X'060A',X'800000000000',C'TSITR',C'9435'     IOERR         00071200
         DC  X'060A',X'800000000000',C'TSLOG',C'9436'     IOERR         00071300
         DC  X'060A',X'800000000000',C'TSLGN',C'9436'     IOERR         00071400
         DC  X'060A',X'D00000000000',C'     ',C'9438'     SYSIDERR      00071700
         DC  X'060A',X'D00400000000',C'     ',C'9439'     SYSIDERR      00071800
         DC  X'060A',X'D00800000000',C'     ',C'9440'     SYSIDERR      00071900
         DC  X'060A',X'D00C00000000',C'     ',C'9441'     SYSIDERR      00072000
         DC  X'060A',X'D10000000000',C'     ',C'9442'     ISCINVREQ     00072100
         DC  X'060A',X'D60000000000',C'     ',C'9443'     NOTAUTH       00072200
         SPACE 2                                                        00072300
*=*-------------------*=*                                               00072400
*=*   S T A R T B R   *=*                                               00072500
*=*-------------------*=*                                               00072600
         SPACE 2                                                        00072700
         DC  X'060C',X'010000000000',C'     ',C'9444'     DSIDERR       00072800
         DC  X'060C',X'020000000000',C'     ',C'9445'     ILLOGIC       00072900
         DC  X'060C',X'020000000000',C'TS   ',C'9446'     ILLOGIC       00073000
         DC  X'060C',X'020000000000',C'TSEOR',C'9447'     ILLOGIC       00073100
         DC  X'060C',X'020000000000',C'TSITR',C'9448'     ILLOGIC       00073200
         DC  X'060C',X'020000000000',C'TSLOG',C'9449'     ILLOGIC       00073300
         DC  X'060C',X'020000000000',C'TSLGN',C'9449'     ILLOGIC       00073400
         DC  X'060C',X'080000000000',C'     ',C'9451'     INVREQ        00073700
         DC  X'060C',X'0C0000000000',C'     ',C'9452'     NOTOPEN       00073800
         DC  X'060C',X'0C0000000000',C'TS   ',C'9453'     NOTOPEN       00073900
         DC  X'060C',X'0C0000000000',C'TSEOR',C'9454'     NOTOPEN       00074000
         DC  X'060C',X'0C0000000000',C'TSITR',C'9455'     NOTOPEN       00074100
         DC  X'060C',X'0C0000000000',C'TSLOG',C'9456'     NOTOPEN       00074200
         DC  X'060C',X'0C0000000000',C'TSLGN',C'9456'     NOTOPEN       00074300
         DC  X'060C',X'0D0000000000',C'     ',C'9458'     DISABLED      00074600
         DC  X'060C',X'0D0000000000',C'TS   ',C'9459'     DISABLED      00074700
         DC  X'060C',X'0D0000000000',C'TSEOR',C'9460'     DISABLED      00074800
         DC  X'060C',X'0D0000000000',C'TSITR',C'9461'     DISABLED      00074900
         DC  X'060C',X'0D0000000000',C'TSLOG',C'9462'     DISABLED      00075000
         DC  X'060C',X'0D0000000000',C'TSLGN',C'9462'     DISABLED      00075100
         DC  X'060C',X'800000000000',C'     ',C'9464'     IOERR         00075400
         DC  X'060C',X'800000000000',C'TS   ',C'9465'     IOERR         00075500
         DC  X'060C',X'800000000000',C'TSEOR',C'9466'     IOERR         00075600
         DC  X'060C',X'800000000000',C'TSITR',C'9467'     IOERR         00075700
         DC  X'060C',X'800000000000',C'TSLOG',C'9468'     IOERR         00075800
         DC  X'060C',X'800000000000',C'TSLGN',C'9468'     IOERR         00075900
         DC  X'060C',X'810000000000',C'     ',C'9470'     NOTFND        00076200
         DC  X'060C',X'810000000000',C'TS   ',C'9471'     NOTFND        00076300
         DC  X'060C',X'810000000000',C'TSEOR',C'9472'     NOTFND        00076400
         DC  X'060C',X'810000000000',C'TSITR',C'9473'     NOTFND        00076500
         DC  X'060C',X'810000000000',C'TSLOG',C'9474'     NOTFND        00076600
         DC  X'060C',X'810000000000',C'TSLGN',C'9474'     NOTFND        00076700
         DC  X'060C',X'D00000000000',C'     ',C'9476'     SYSIDERR      00077000
         DC  X'060C',X'D00400000000',C'     ',C'9477'     SYSIDERR      00077100
         DC  X'060C',X'D00800000000',C'     ',C'9478'     SYSIDERR      00077200
         DC  X'060C',X'D00C00000000',C'     ',C'9479'     SYSIDERR      00077300
         DC  X'060C',X'D10000000000',C'     ',C'9480'     ISCINVREQ     00077400
         DC  X'060C',X'D60000000000',C'     ',C'9481'     NOTAUTH       00077500
         SPACE 2                                                        00077600
*=*---------------------*=*                                             00077700
*=*   R E A D N E X T   *=*                                             00077800
*=*---------------------*=*                                             00077900
         SPACE 2                                                        00078000
         DC  X'060E',X'010000000000',C'     ',C'9482'     DSIDERR       00078100
         DC  X'060E',X'020000000000',C'     ',C'9483'     ILLOGIC       00078200
         DC  X'060E',X'020000000000',C'TS   ',C'9484'     ILLOGIC       00078300
         DC  X'060E',X'020000000000',C'TSEOR',C'9485'     ILLOGIC       00078400
         DC  X'060E',X'020000000000',C'TSITR',C'9486'     ILLOGIC       00078500
         DC  X'060E',X'020000000000',C'TSLOG',C'9487'     ILLOGIC       00078600
         DC  X'060E',X'020000000000',C'TSLGN',C'9487'     ILLOGIC       00078700
         DC  X'060E',X'080000000000',C'     ',C'9489'     INVREQ        00079000
         DC  X'060E',X'0C0000000000',C'     ',C'9490'     NOTOPEN       00079100
         DC  X'060E',X'0C0000000000',C'TS   ',C'9491'     NOTOPEN       00079200
         DC  X'060E',X'0C0000000000',C'TSEOR',C'9492'     NOTOPEN       00079300
         DC  X'060E',X'0C0000000000',C'TSITR',C'9493'     NOTOPEN       00079400
         DC  X'060E',X'0C0000000000',C'TSLOG',C'9494'     NOTOPEN       00079500
         DC  X'060E',X'0C0000000000',C'TSLGN',C'9494'     NOTOPEN       00079600
         DC  X'060E',X'0D0000000000',C'     ',C'9496'     DISABLED      00079900
         DC  X'060E',X'0D0000000000',C'TS   ',C'9497'     DISABLED      00080000
         DC  X'060E',X'0D0000000000',C'TSEOR',C'9498'     DISABLED      00080100
         DC  X'060E',X'0D0000000000',C'TSITR',C'9499'     DISABLED      00080200
         DC  X'060E',X'0D0000000000',C'TSLOG',C'9500'     DISABLED      00080300
         DC  X'060E',X'0D0000000000',C'TSLGN',C'9500'     DISABLED      00080400
         DC  X'060E',X'0F0000000000',C'     ',C'9502'     ENDFILE       00080700
         DC  X'060E',X'800000000000',C'     ',C'9503'     IOERR         00080800
         DC  X'060E',X'800000000000',C'TS   ',C'9504'     IOERR         00080900
         DC  X'060E',X'800000000000',C'TSEOR',C'9505'     IOERR         00081000
         DC  X'060E',X'800000000000',C'TSITR',C'9506'     IOERR         00081100
         DC  X'060E',X'800000000000',C'TSLOG',C'9507'     IOERR         00081200
         DC  X'060E',X'800000000000',C'TSLGN',C'9507'     IOERR         00081300
         DC  X'060E',X'810000000000',C'     ',C'9509'     NOTFND        00081600
         DC  X'060E',X'810000000000',C'TS   ',C'9510'     NOTFND        00081700
         DC  X'060E',X'810000000000',C'TSEOR',C'9511'     NOTFND        00081800
         DC  X'060E',X'810000000000',C'TSITR',C'9512'     NOTFND        00081900
         DC  X'060E',X'810000000000',C'TSLOG',C'9513'     NOTFND        00082000
         DC  X'060E',X'810000000000',C'TSLGN',C'9513'     NOTFND        00082100
         DC  X'060E',X'840000000000',C'     ',C'9515'     DUPKEY        00082400
         DC  X'060E',X'840000000000',C'TS   ',C'9516'     DUPKEY        00082500
         DC  X'060E',X'840000000000',C'TSEOR',C'9517'     DUPKEY        00082600
         DC  X'060E',X'840000000000',C'TSSDR',C'9518'     DUPKEY        00082700
         DC  X'060E',X'D00000000000',C'     ',C'9519'     SYSIDERR      00082800
         DC  X'060E',X'D00400000000',C'     ',C'9520'     SYSIDERR      00082900
         DC  X'060E',X'D00800000000',C'     ',C'9521'     SYSIDERR      00083000
         DC  X'060E',X'D00C00000000',C'     ',C'9522'     SYSIDERR      00083100
         DC  X'060E',X'D10000000000',C'     ',C'9523'     ISCINVREQ     00083200
         DC  X'060E',X'D60000000000',C'     ',C'9524'     NOTAUTH       00083300
         DC  X'060E',X'E10000000000',C'     ',C'9525'     LENGERR       00083400
         DC  X'060E',X'E10000000000',C'TS   ',C'9526'     LENGERR       00083500
         DC  X'060E',X'E10000000000',C'TSEOR',C'9527'     LENGERR       00083600
         DC  X'060E',X'E10000000000',C'TSITR',C'9528'     LENGERR       00083700
         DC  X'060E',X'E10000000000',C'TSLOG',C'9529'     LENGERR       00083800
         DC  X'060E',X'E10000000000',C'TSLGN',C'9529'     LENGERR       00083900
         SPACE 2                                                        00084200
*=*---------------------*=*                                             00084300
*=*   R E A D P R E V   *=*                                             00084400
*=*---------------------*=*                                             00084500
         SPACE 2                                                        00084600
         DC  X'0610',X'010000000000',C'     ',C'9531'     DSIDERR       00084700
         DC  X'0610',X'020000000000',C'     ',C'9532'     ILLOGIC       00084800
         DC  X'0610',X'020000000000',C'TS   ',C'9533'     ILLOGIC       00084900
         DC  X'0610',X'020000000000',C'TSEOR',C'9534'     ILLOGIC       00085000
         DC  X'0610',X'020000000000',C'TSITR',C'9535'     ILLOGIC       00085100
         DC  X'0610',X'020000000000',C'TSLOG',C'9536'     ILLOGIC       00085200
         DC  X'0610',X'020000000000',C'TSLGN',C'9536'     ILLOGIC       00085300
         DC  X'0610',X'080000000000',C'     ',C'9538'     INVREQ        00085600
         DC  X'0610',X'0C0000000000',C'     ',C'9539'     NOTOPEN       00085700
         DC  X'0610',X'0C0000000000',C'TS   ',C'9540'     NOTOPEN       00085800
         DC  X'0610',X'0C0000000000',C'TSEOR',C'9541'     NOTOPEN       00085900
         DC  X'0610',X'0C0000000000',C'TSITR',C'9542'     NOTOPEN       00086000
         DC  X'0610',X'0C0000000000',C'TSLOG',C'9543'     NOTOPEN       00086100
         DC  X'0610',X'0C0000000000',C'TSLGN',C'9543'     NOTOPEN       00086200
         DC  X'0610',X'0D0000000000',C'     ',C'9545'     DISABLED      00086500
         DC  X'0610',X'0D0000000000',C'TS   ',C'9546'     DISABLED      00086600
         DC  X'0610',X'0D0000000000',C'TSEOR',C'9547'     DISABLED      00086700
         DC  X'0610',X'0D0000000000',C'TSITR',C'9548'     DISABLED      00086800
         DC  X'0610',X'0D0000000000',C'TSLOG',C'9549'     DISABLED      00086900
         DC  X'0610',X'0D0000000000',C'TSLGN',C'9549'     DISABLED      00087000
         DC  X'0610',X'0F0000000000',C'     ',C'9551'     ENDFILE       00087300
         DC  X'0610',X'E10000000000',C'     ',C'9552'     LENGERR       00087400
         DC  X'0610',X'E10000000000',C'TS   ',C'9553'     LENGERR       00087500
         DC  X'0610',X'E10000000000',C'TSEOR',C'9554'     LENGERR       00087600
         DC  X'0610',X'E10000000000',C'TSITR',C'9555'     LENGERR       00087700
         DC  X'0610',X'E10000000000',C'TSLOG',C'9556'     LENGERR       00087800
         DC  X'0610',X'E10000000000',C'TSLGN',C'9556'     LENGERR       00087900
         DC  X'0610',X'810000000000',C'     ',C'9558'     NOTFND        00088200
         DC  X'0610',X'810000000000',C'TS   ',C'9559'     NOTFND        00088300
         DC  X'0610',X'810000000000',C'TSEOR',C'9560'     NOTFND        00088400
         DC  X'0610',X'810000000000',C'TSITR',C'9561'     NOTFND        00088500
         DC  X'0610',X'810000000000',C'TSLOG',C'9562'     NOTFND        00088600
         DC  X'0610',X'810000000000',C'TSLGN',C'9562'     NOTFND        00088700
         DC  X'0610',X'840000000000',C'     ',C'9564'     DUPKEY        00089000
         DC  X'0610',X'840000000000',C'TS   ',C'9565'     DUPKEY        00089100
         DC  X'0610',X'840000000000',C'TSEOR',C'9566'     DUPKEY        00089200
         DC  X'0610',X'840000000000',C'TSITR',C'9567'     DUPKEY        00089300
         DC  X'0610',X'D00000000000',C'     ',C'9568'     SYSIDERR      00089400
         DC  X'0610',X'D00400000000',C'     ',C'9569'     SYSIDERR      00089500
         DC  X'0610',X'D00800000000',C'     ',C'9570'     SYSIDERR      00089600
         DC  X'0610',X'D00C00000000',C'     ',C'9571'     SYSIDERR      00089700
         DC  X'0610',X'D10000000000',C'     ',C'9572'     ISCINVREQ     00089800
         DC  X'0610',X'D60000000000',C'     ',C'9573'     NOTAUTH       00089900
         DC  X'0610',X'800000000000',C'     ',C'9574'     IOERR         00090000
         DC  X'0610',X'800000000000',C'TS   ',C'9575'     IOERR         00090100
         DC  X'0610',X'800000000000',C'TSEOR',C'9576'     IOERR         00090200
         DC  X'0610',X'800000000000',C'TSITR',C'9577'     IOERR         00090300
         DC  X'0610',X'800000000000',C'TSLOG',C'9578'     IOERR         00090400
         DC  X'0610',X'800000000000',C'TSLGN',C'9578'     IOERR         00090500
         SPACE 2                                                        00090800
*=*---------------*=*                                                   00090900
*=*   E N D B R   *=*                                                   00091000
*=*---------------*=*                                                   00091100
         SPACE 2                                                        00091200
         DC  X'0612',X'010000000000',C'     ',C'9580'     DSIDERR       00091300
         DC  X'0612',X'020000000000',C'     ',C'9581'     ILLOGIC       00091400
         DC  X'0612',X'020000000000',C'TS   ',C'9582'     ILLOGIC       00091500
         DC  X'0612',X'020000000000',C'TSEOR',C'9583'     ILLOGIC       00091600
         DC  X'0612',X'020000000000',C'TSITR',C'9584'     ILLOGIC       00091700
         DC  X'0612',X'020000000000',C'TSLOG',C'9585'     ILLOGIC       00091800
         DC  X'0612',X'020000000000',C'TSLGN',C'9585'     ILLOGIC       00091900
         DC  X'0612',X'080000000000',C'     ',C'9587'     INVREQ        00092200
         DC  X'0612',X'0C0000000000',C'     ',C'9588'     NOTOPEN       00092300
         DC  X'0612',X'0C0000000000',C'TS   ',C'9589'     NOTOPEN       00092400
         DC  X'0612',X'0C0000000000',C'TSEOR',C'9590'     NOTOPEN       00092500
         DC  X'0612',X'0C0000000000',C'TSITR',C'9591'     NOTOPEN       00092600
         DC  X'0612',X'0C0000000000',C'TSLOG',C'9592'     NOTOPEN       00092700
         DC  X'0612',X'0C0000000000',C'TSLGN',C'9592'     NOTOPEN       00092800
         DC  X'0612',X'0D0000000000',C'     ',C'9594'     DISABLED      00093100
         DC  X'0612',X'0D0000000000',C'TS   ',C'9595'     DISABLED      00093200
         DC  X'0612',X'0D0000000000',C'TSEOR',C'9596'     DISABLED      00093300
         DC  X'0612',X'0D0000000000',C'TSITR',C'9597'     DISABLED      00093400
         DC  X'0612',X'0D0000000000',C'TSLOG',C'9598'     DISABLED      00093500
         DC  X'0612',X'0D0000000000',C'TSLGN',C'9598'     DISABLED      00093600
         DC  X'0612',X'D00000000000',C'     ',C'9600'     SYSIDERR      00093900
         DC  X'0612',X'D00400000000',C'     ',C'9601'     SYSIDERR      00094000
         DC  X'0612',X'D00800000000',C'     ',C'9602'     SYSIDERR      00094100
         DC  X'0612',X'D00C00000000',C'     ',C'9603'     SYSIDERR      00094200
         DC  X'0612',X'D10000000000',C'     ',C'9604'     ISCINVREQ     00094300
         DC  X'0612',X'D60000000000',C'     ',C'9605'     NOTAUTH       00094400
         SPACE 2                                                        00094500
*=*-------------------*=*                                               00094600
*=*   R E S E T B R   *=*                                               00094700
*=*-------------------*=*                                               00094800
         SPACE 2                                                        00094900
         DC  X'0614',X'010000000000',C'     ',C'9606'     DSIDERR       00095000
         DC  X'0614',X'020000000000',C'     ',C'9607'     ILLOGIC       00095100
         DC  X'0614',X'020000000000',C'TS   ',C'9608'     ILLOGIC       00095200
         DC  X'0614',X'020000000000',C'TSEOR',C'9609'     ILLOGIC       00095300
         DC  X'0614',X'020000000000',C'TSITR',C'9610'     ILLOGIC       00095400
         DC  X'0614',X'020000000000',C'TSLOG',C'9611'     ILLOGIC       00095500
         DC  X'0614',X'020000000000',C'TSLGN',C'9611'     ILLOGIC       00095600
         DC  X'0614',X'080000000000',C'     ',C'9613'     INVREQ        00095900
         DC  X'0614',X'0C0000000000',C'     ',C'9614'     NOTOPEN       00096000
         DC  X'0614',X'0C0000000000',C'TS   ',C'9615'     NOTOPEN       00096100
         DC  X'0614',X'0C0000000000',C'TSEOR',C'9616'     NOTOPEN       00096200
         DC  X'0614',X'0C0000000000',C'TSITR',C'9617'     NOTOPEN       00096300
         DC  X'0614',X'0C0000000000',C'TSLOG',C'9618'     NOTOPEN       00096400
         DC  X'0614',X'0C0000000000',C'TSLGN',C'9618'     NOTOPEN       00096500
         DC  X'0614',X'0D0000000000',C'     ',C'9620'     DISABLED      00096800
         DC  X'0614',X'0D0000000000',C'TS   ',C'9621'     DISABLED      00096900
         DC  X'0614',X'0D0000000000',C'TSEOR',C'9622'     DISABLED      00097000
         DC  X'0614',X'0D0000000000',C'TSITR',C'9623'     DISABLED      00097100
         DC  X'0614',X'0D0000000000',C'TSLOG',C'9624'     DISABLED      00097200
         DC  X'0614',X'0D0000000000',C'TSLGN',C'9624'     DISABLED      00097300
         DC  X'0614',X'800000000000',C'     ',C'9626'     IOERR         00097600
         DC  X'0614',X'800000000000',C'TS   ',C'9627'     IOERR         00097700
         DC  X'0614',X'800000000000',C'TSEOR',C'9628'     IOERR         00097800
         DC  X'0614',X'800000000000',C'TSITR',C'9629'     IOERR         00097900
         DC  X'0614',X'800000000000',C'TSLOG',C'9630'     IOERR         00098000
         DC  X'0614',X'800000000000',C'TSLGN',C'9630'     IOERR         00098100
         DC  X'0614',X'810000000000',C'     ',C'9632'     NOTFND        00098400
         DC  X'0614',X'810000000000',C'TS   ',C'9633'     NOTFND        00098500
         DC  X'0614',X'810000000000',C'TSEOR',C'9634'     NOTFND        00098600
         DC  X'0614',X'810000000000',C'TSITR',C'9635'     NOTFND        00098700
         DC  X'0614',X'810000000000',C'TSLOG',C'9636'     NOTFND        00098800
         DC  X'0614',X'810000000000',C'TSLGN',C'9636'     NOTFND        00098900
         DC  X'0614',X'D00000000000',C'     ',C'9638'     SYSIDERR      00099200
         DC  X'0614',X'D00400000000',C'     ',C'9639'     SYSIDERR      00099300
         DC  X'0614',X'D00800000000',C'     ',C'9640'     SYSIDERR      00099400
         DC  X'0614',X'D00C00000000',C'     ',C'9641'     SYSIDERR      00099500
         DC  X'0614',X'D10000000000',C'     ',C'9642'     ISCINVREQ     00099600
         DC  X'0614',X'D60000000000',C'     ',C'9643'     NOTAUTH       00099700
         SPACE 2                                                        00099800
*=*-----------------------*=*                                           00099900
*=*   W R I T E Q   T D   *=*                                           00100000
*=*-----------------------*=*                                           00100100
         SPACE 2                                                        00100200
         DC  X'0802',X'020000000000',C'     ',C'9644'     QIDERR        00100300
         DC  X'0802',X'040000000000',C'     ',C'9645'     IOERR         00100400
         DC  X'0802',X'080000000000',C'     ',C'9646'     NOTOPEN       00100500
         DC  X'0802',X'100000000000',C'     ',C'9647'     NOSPACE       00100600
         DC  X'0802',X'D00000000000',C'     ',C'9648'     SYSIDERR      00100700
         DC  X'0802',X'D00400000000',C'     ',C'9649'     SYSIDERR      00100800
         DC  X'0802',X'D00800000000',C'     ',C'9650'     SYSIDERR      00100900
         DC  X'0802',X'D00C00000000',C'     ',C'9651'     SYSIDERR      00101000
         DC  X'0802',X'D10000000000',C'     ',C'9652'     ISCINVREQ     00101100
         DC  X'0802',X'D60000000000',C'     ',C'9653'     NOTAUTH       00101200
         DC  X'0802',X'E10000000000',C'     ',C'9654'     LENGERR       00101300
         SPACE 2                                                        00101400
*=*---------------------*=*                                             00101500
*=*   R E A D Q   T D   *=*                                             00101600
*=*---------------------*=*                                             00101700
         SPACE 2                                                        00101800
         DC  X'0804',X'010000000000',C'     ',C'9655'     QZERO         00101900
         DC  X'0804',X'020000000000',C'     ',C'9656'     QIDERR        00102000
         DC  X'0804',X'040000000000',C'     ',C'9657'     IOERR         00102100
         DC  X'0804',X'080000000000',C'     ',C'9658'     NOTOPEN       00102200
         DC  X'0804',X'C00000000000',C'     ',C'9659'     QBUSY         00102300
         DC  X'0804',X'D00000000000',C'     ',C'9660'     SYSIDERR      00102400
         DC  X'0804',X'D00400000000',C'     ',C'9661'     SYSIDERR      00102500
         DC  X'0804',X'D00800000000',C'     ',C'9662'     SYSIDERR      00102600
         DC  X'0804',X'D00C00000000',C'     ',C'9663'     SYSIDERR      00102700
         DC  X'0804',X'D10000000000',C'     ',C'9664'     ISCINVREQ     00102800
         DC  X'0804',X'D60000000000',C'     ',C'9665'     NOTAUTH       00102900
         DC  X'0804',X'E10000000000',C'     ',C'9666'     LENGERR       00103000
         SPACE 2                                                        00103100
*=*-------------------------*=*                                         00103200
*=*   D E L E T E Q   T D   *=*                                         00103300
*=*-------------------------*=*                                         00103400
         SPACE 2                                                        00103500
         DC  X'0806',X'020000000000',C'     ',C'9667'     QIDERR        00103600
         DC  X'0806',X'D00000000000',C'     ',C'9668'     SYSIDERR      00103700
         DC  X'0806',X'D00400000000',C'     ',C'9669'     SYSIDERR      00103800
         DC  X'0806',X'D00800000000',C'     ',C'9670'     SYSIDERR      00103900
         DC  X'0806',X'D00C00000000',C'     ',C'9671'     SYSIDERR      00104000
         DC  X'0806',X'D10000000000',C'     ',C'9672'     ISCINVREQ     00104100
         DC  X'0806',X'D60000000000',C'     ',C'9673'     NOTAUTH       00104200
         SPACE 2                                                        00104300
*=*-------------------------*=*                                         00104400
*=*   W R I T E Q   T S   *=*                                           00104500
*=*-------------------------*=*                                         00104600
         SPACE 2                                                        00104700
         DC  X'0A02',X'010000000000',C'     ',C'9674'     ITEMERR       00104800
         DC  X'0A02',X'020000000000',C'     ',C'9675'     QIDERR        00104900
         DC  X'0A02',X'040000000000',C'     ',C'9676'     IOERR         00105000
         DC  X'0A02',X'080000000000',C'     ',C'9677'     NOSPACE       00105100
         DC  X'0A02',X'200000000000',C'     ',C'9678'     INVREQ        00105200
         DC  X'0A02',X'D00000000000',C'     ',C'9679'     SYSIDERR      00105300
         DC  X'0A02',X'D00400000000',C'     ',C'9680'     SYSIDERR      00105400
         DC  X'0A02',X'D00800000000',C'     ',C'9681'     SYSIDERR      00105500
         DC  X'0A02',X'D00C00000000',C'     ',C'9682'     SYSIDERR      00105600
         DC  X'0A02',X'D10000000000',C'     ',C'9683'     ISCINVREQ     00105700
         DC  X'0A02',X'D60000000000',C'     ',C'9684'     NOTAUTH       00105800
         SPACE 2                                                        00105900
*=*---------------------*=*                                             00106000
*=*   R E A D Q   T S   *=*                                             00106100
*=*---------------------*=*                                             00106200
         SPACE 2                                                        00106300
         DC  X'0A04',X'010000000000',C'     ',C'9685'     ITEMERR       00106400
         DC  X'0A04',X'020000000000',C'     ',C'9686'     QIDERR        00106500
         DC  X'0A04',X'040000000000',C'     ',C'9687'     IOERR         00106600
         DC  X'0A04',X'200000000000',C'     ',C'9688'     INVREQ        00106700
         DC  X'0A04',X'D00000000000',C'     ',C'9689'     SYSIDERR      00106800
         DC  X'0A04',X'D00400000000',C'     ',C'9690'     SYSIDERR      00106900
         DC  X'0A04',X'D00800000000',C'     ',C'9691'     SYSIDERR      00107000
         DC  X'0A04',X'D00C00000000',C'     ',C'9692'     SYSIDERR      00107100
         DC  X'0A04',X'D10000000000',C'     ',C'9693'     ISCINVREQ     00107200
         DC  X'0A04',X'D60000000000',C'     ',C'9694'     NOTAUTH       00107300
         DC  X'0A04',X'E10000000000',C'     ',C'9695'     LENGERR       00107400
         SPACE 2                                                        00107500
*=*-------------------------*=*                                         00107600
*=*   D E L E T E Q   T S   *=*                                         00107700
*=*-------------------------*=*                                         00107800
         SPACE 2                                                        00107900
         DC  X'0A06',X'020000000000',C'     ',C'9696'     QIDERR        00108000
         DC  X'0A06',X'D00000000000',C'     ',C'9697'     SYSIDERR      00108100
         DC  X'0A06',X'D00400000000',C'     ',C'9698'     SYSIDERR      00108200
         DC  X'0A06',X'D00800000000',C'     ',C'9699'     SYSIDERR      00108300
         DC  X'0A06',X'D00C00000000',C'     ',C'9700'     SYSIDERR      00108400
         DC  X'0A06',X'D10000000000',C'     ',C'9701'     ISCINVREQ     00108500
         DC  X'0A06',X'D60000000000',C'     ',C'9702'     NOTAUTH       00108600
         SPACE 2                                                        00108700
*=*-------------------*=*                                               00108800
*=*   G E T M A I N   *=*                                               00108900
*=*-------------------*=*                                               00109000
         SPACE 2                                                        00109100
         DC  X'0C02',X'E10000000000',C'     ',C'9703'     LENGERR       00109200
         DC  X'0C02',X'E20000000000',C'     ',C'9704'     NOSTG         00109300
         SPACE 2                                                        00109400
*=*---------------------*=*                                             00109500
*=*   F R E E M A I N   *=*                                             00109600
*=*---------------------*=*                                             00109700
         SPACE 2                                                        00109800
         DC  X'0C04',X'E10000000000',C'     ',C'9705'     LENGERR       00109900
         DC  X'0C04',X'E20000000000',C'     ',C'9706'     NOSTG         00110000
         SPACE 2                                                        00110100
*=*-------------*=*                                                     00110200
*=*   L I N K   *=*                                                     00110300
*=*-------------*=*                                                     00110400
         SPACE 2                                                        00110500
         DC  X'0E02',X'010000000000',C'     ',C'9707'     PGMIDERR      00110600
         DC  X'0E02',X'D60000000000',C'     ',C'9708'     NOTAUTH       00110700
         DC  X'0E02',X'E00000000000',C'     ',C'9709'     INVREQ        00110800
         SPACE 2                                                        00110900
*=*-------------*=*                                                     00111000
*=*   X C T L   *=*                                                     00111100
*=*-------------*=*                                                     00111200
         SPACE 2                                                        00111300
         DC  X'0E04',X'010000000000',C'     ',C'9710'     PGMIDERR      00111400
         DC  X'0E04',X'D60000000000',C'     ',C'9711'     NOTAUTH       00111500
         DC  X'0E04',X'E00000000000',C'     ',C'9712'     INVREQ        00111600
         SPACE 2                                                        00111700
*=*-------------*=*                                                     00111800
*=*   L O A D   *=*                                                     00111900
*=*-------------*=*                                                     00112000
         SPACE 2                                                        00112100
         DC  X'0E06',X'010000000000',C'     ',C'9713'     PGMIDERR      00112200
         DC  X'0E06',X'D60000000000',C'     ',C'9714'     NOTAUTH       00112300
         DC  X'0E06',X'E00000000000',C'     ',C'9715'     INVREQ        00112400
         SPACE 2                                                        00112500
*=*-----------------*=*                                                 00112600
*=*   R E T U R N   *=*                                                 00112700
*=*-----------------*=*                                                 00112800
         SPACE 2                                                        00112900
         DC  X'0E08',X'D60000000000',C'     ',C'9716'     NOTAUTH       00113000
         DC  X'0E08',X'E00000000000',C'     ',C'9717'     INVREQ        00113100
         SPACE 2                                                        00113200
*=*-------------------*=*                                               00113300
*=*   R E L E A S E   *=*                                               00113400
*=*-------------------*=*                                               00113500
         SPACE 2                                                        00113600
         DC  X'0E0A',X'010000000000',C'     ',C'9718'     PGMIDERR      00113700
         DC  X'0E0A',X'D60000000000',C'     ',C'9719'     NOTAUTH       00113800
         DC  X'0E0A',X'E00000000000',C'     ',C'9720'     INVREQ        00113900
         SPACE 2                                                        00114000
*=*---------------*=*                                                   00114100
*=*   A B E N D   *=*                                                   00114200
*=*---------------*=*                                                   00114300
         SPACE 2                                                        00114400
         DC  X'0E0C',X'E00000000000',C'     ',C'9721'     INVREQ        00114500
         SPACE 2                                                        00114600
*=*-----------------------------*=*                                     00114700
*=*   H A N D L E   A B E N D   *=*                                     00114800
*=*-----------------------------*=*                                     00114900
         SPACE 2                                                        00115000
         DC  X'0E0E',X'010000000000',C'     ',C'9722'     PGMIDERR      00115100
         DC  X'0E0E',X'E00000000000',C'     ',C'9723'     INVREQ        00115200
         SPACE 2                                                        00115300
*=*-------------------*=*                                               00115400
*=*   A S K T I M E   *=*                                               00115500
*=*-------------------*=*                                               00115600
         SPACE 2                                                        00115700
         DC  X'1002',X'FF0000000000',C'     ',C'9724'     INVREQ        00115800
         SPACE 2                                                        00115900
*=*---------------*=*                                                   00116000
*=*   D E L A Y   *=*                                                   00116100
*=*---------------*=*                                                   00116200
         SPACE 2                                                        00116300
         DC  X'1004',X'200000000000',C'     ',C'9725'     EXPIRED       00116400
         DC  X'1004',X'FF0000000000',C'     ',C'9726'     INVREQ        00116500
         SPACE 2                                                        00116600
*=*-------------*=*                                                     00116700
*=*   P O S T   *=*                                                     00116800
*=*-------------*=*                                                     00116900
         SPACE 2                                                        00117000
         DC  X'1006',X'200000000000',C'     ',C'9727'     EXPIRED       00117100
         DC  X'1006',X'FF0000000000',C'     ',C'9728'     INVREQ        00117200
         SPACE 2                                                        00117300
*=*---------------*=*                                                   00117400
*=*   S T A R T   *=*                                                   00117500
*=*---------------*=*                                                   00117600
         SPACE 2                                                        00117700
         DC  X'1008',X'040000000000',C'     ',C'9729'     IOERR         00117800
         DC  X'1008',X'110000000000',C'     ',C'9730'     TRANSIDERR    00117900
         DC  X'1008',X'120000000000',C'     ',C'9731'     TERMIDERR     00118000
         DC  X'1008',X'D00000000000',C'     ',C'9732'     SYSIDERR      00118100
         DC  X'1008',X'D00400000000',C'     ',C'9733'     SYSIDERR      00118200
         DC  X'1008',X'D00800000000',C'     ',C'9734'     SYSIDERR      00118300
         DC  X'1008',X'D00C00000000',C'     ',C'9735'     SYSIDERR      00118400
         DC  X'1008',X'D10000000000',C'     ',C'9736'     ISCINVREQ     00118500
         DC  X'1008',X'D60000000000',C'     ',C'9737'     NOTAUTH       00118600
         DC  X'1008',X'FF0000000000',C'     ',C'9738'     INVREQ        00118700
         SPACE 2                                                        00118800
*=*---------------------*=*                                             00118900
*=*   R E T R I E V E   *=*                                             00119000
*=*---------------------*=*                                             00119100
         SPACE 2                                                        00119200
         DC  X'100A',X'010000000000',C'     ',C'9739'     ENDDATA       00119300
         DC  X'100A',X'040000000000',C'     ',C'9740'     IOERR         00119400
         DC  X'100A',X'140000000000',C'     ',C'9741'     INVTSREQ      00119500
         DC  X'100A',X'810000000000',C'     ',C'9742'     NOTFND        00119600
         DC  X'100A',X'D00000000000',C'     ',C'9743'     SYSIDERR      00119700
         DC  X'100A',X'D00400000000',C'     ',C'9744'     SYSIDERR      00119800
         DC  X'100A',X'D00800000000',C'     ',C'9745'     SYSIDERR      00119900
         DC  X'100A',X'D00C00000000',C'     ',C'9746'     SYSIDERR      00120000
         DC  X'100A',X'D10000000000',C'     ',C'9747'     ISCINVREQ     00120100
         DC  X'100A',X'D60000000000',C'     ',C'9748'     NOTAUTH       00120200
         DC  X'100A',X'E10000000000',C'     ',C'9749'     LENGERR       00120300
         DC  X'100A',X'E90000000000',C'     ',C'9750'     ENVDEFERR     00120400
         DC  X'100A',X'FF0000000000',C'     ',C'9751'     INVREQ        00120500
         SPACE 2                                                        00120600
*=*-----------------*=*                                                 00120700
*=*   C A N C E L   *=*                                                 00120800
*=*-----------------*=*                                                 00120900
         SPACE 2                                                        00121000
         DC  X'100C',X'810000000000',C'     ',C'9752'     NOTFND        00121100
         DC  X'100C',X'D00000000000',C'     ',C'9753'     SYSIDERR      00121200
         DC  X'100C',X'D00400000000',C'     ',C'9754'     SYSIDERR      00121300
         DC  X'100C',X'D00800000000',C'     ',C'9755'     SYSIDERR      00121400
         DC  X'100C',X'D00C00000000',C'     ',C'9756'     SYSIDERR      00121500
         DC  X'100C',X'D10000000000',C'     ',C'9757'     ISCINVREQ     00121600
         DC  X'100C',X'D60000000000',C'     ',C'9758'     NOTAUTH       00121700
         DC  X'100C',X'FF0000000000',C'     ',C'9759'     INVREQ        00121800
         SPACE 2                                                        00121900
*=*--------------------------*=*                                        00122000
*=*   W A I T    E V E N T   *=*                                        00122100
*=*--------------------------*=*                                        00122200
         SPACE 2                                                        00122300
         DC  X'1202',X'E00000000000',C'     ',C'9760'     INVREQ        00122400
         SPACE 2                                                        00122500
*=*-----------*=*                                                       00122600
*=*   E N Q   *=*                                                       00122700
*=*-----------*=*                                                       00122800
         SPACE 2                                                        00122900
         DC  X'1204',X'320000000000',C'     ',C'9761'     ENQBUSY       00123000
         DC  X'1204',X'E00000000000',C'     ',C'9762'     INVREQ        00123100
         SPACE 2                                                        00123200
*=*-----------*=*                                                       00123300
*=*   D E Q   *=*                                                       00123400
*=*-----------*=*                                                       00123500
         SPACE 2                                                        00123600
         DC  X'1206',X'E00000000000',C'     ',C'9763'     INVREQ        00123700
         SPACE 2                                                        00123800
*=*-------------------*=*                                               00123900
*=*   S U S P E N D   *=*                                               00124000
*=*-------------------*=*                                               00124100
         SPACE 2                                                        00124200
         DC  X'1208',X'E00000000000',C'     ',C'9764'     INVREQ        00124300
         SPACE 2                                                        00124400
*=*-------------------*=*                                               00124500
*=*   J O U R N A L   *=*                                               00124600
*=*-------------------*=*                                               00124700
         SPACE 2                                                        00124800
         DC  X'1402',X'010000000000',C'     ',C'9765'     JIDERR        00124900
         DC  X'1402',X'020000000000',C'     ',C'9766'     INVREQ        00125000
         DC  X'1402',X'050000000000',C'     ',C'9767'     NOTOPEN       00125100
         DC  X'1402',X'060000000000',C'     ',C'9768'     LENGERR       00125200
         DC  X'1402',X'070000000000',C'     ',C'9769'     IOERR         00125300
         DC  X'1402',X'090000000000',C'     ',C'9770'     NOJBUFSP      00125400
         DC  X'1402',X'D60000000000',C'     ',C'9771'     NOTAUTH       00125500
         SPACE 2                                                        00125600
*=*-----------------------------*=*                                     00125700
*=*   W A I T   J O U R N A L   *=*                                     00125800
*=*-----------------------------*=*                                     00125900
         SPACE 2                                                        00126000
         DC  X'1404',X'010000000000',C'     ',C'9772'     JIDERR        00126100
         DC  X'1404',X'020000000000',C'     ',C'9773'     INVREQ        00126200
         DC  X'1404',X'050000000000',C'     ',C'9774'     NOTOPEN       00126300
         DC  X'1404',X'070000000000',C'     ',C'9775'     IOERR         00126400
         DC  X'1404',X'D60000000000',C'     ',C'9776'     NOTAUTH       00126500
         SPACE 2                                                        00126600
*=*-----------------------*=*                                           00126700
*=*   S Y N C P O I N T   *=*                                           00126800
*=*-----------------------*=*                                           00126900
         SPACE 2                                                        00127000
         DC  X'1602',X'010000000000',C'     ',C'9777'     ROLLEDBACK    00127100
         SPACE 2                                                        00127200
*=*-----------------*=*                                                 00127300
*=*   R E S Y N C   *=*                                                 00127400
*=*-----------------*=*                                                 00127500
         SPACE 2                                                        00127600
         DC  X'1604',X'010000000000',C'     ',C'9778'     ROLLEDBACK    00127700
         SPACE 2                                                        00127800
*=*---------------------------*=*                                       00127900
*=*   R E C E I V E   M A P   *=*                                       00128000
*=*---------------------------*=*                                       00128100
         SPACE 2                                                        00128200
         DC  X'1802',X'002000000000',C'     ',C'9779'     UNEXPIN       00128300
         DC  X'1802',X'000004000000',C'     ',C'9780'     EODS          00128400
         DC  X'1802',X'000008000000',C'     ',C'9781'     EOC           00128500
         DC  X'1802',X'000200000000',C'     ',C'9782'     PARTNFAIL     00128600
         DC  X'1802',X'000400000000',C'     ',C'9783'     INVPARTN      00128700
         DC  X'1802',X'010000000000',C'     ',C'9784'     INVREQ        00128800
         DC  X'1802',X'040000000000',C'     ',C'9785'     MAPFAIL       00128900
         DC  X'1802',X'080000000000',C'     ',C'9786'     INVMPSZ       00129000
         DC  X'1802',X'E40000000000',C'     ',C'9787'     RDATT         00129100
         SPACE 2                                                        00129200
*=*---------------------*=*                                             00129300
*=*   S E N D   M A P   *=*                                             00129400
*=*---------------------*=*                                             00129500
         SPACE 2                                                        00129600
         DC  X'1804',X'000001000000',C'     ',C'9788'     OVERFLOW      00129700
         DC  X'1804',X'000010000000',C'     ',C'9789'     IGREQID       00129800
         DC  X'1804',X'000400000000',C'     ',C'9790'     INVPARTN      00129900
         DC  X'1804',X'001000000000',C'     ',C'9791'     INVLDC        00130000
         DC  X'1804',X'004000000000',C'     ',C'9792'     IGREQCD       00130100
         DC  X'1804',X'008000000000',C'     ',C'9793'     TSIOERR       00130200
         DC  X'1804',X'010000000000',C'     ',C'9794'     INVREQ        00130300
         DC  X'1804',X'020000000000',C'     ',C'9795'     RETPAGE       00130400
         DC  X'1804',X'080000000000',C'     ',C'9796'     INVMPSZ       00130500
         DC  X'1804',X'E30000000000',C'     ',C'9797'     WRBRK         00130600
         SPACE 2                                                        00130700
*=*-----------------------*=*                                           00130800
*=*   S E N D   T E X T   *=*                                           00130900
*=*-----------------------*=*                                           00131000
         SPACE 2                                                        00131100
         DC  X'1806',X'000010000000',C'     ',C'9798'     IGREQID       00131200
         DC  X'1806',X'000400000000',C'     ',C'9799'     INVPARTN      00131300
         DC  X'1806',X'001000000000',C'     ',C'9800'     INVLDC        00131400
         DC  X'1806',X'004000000000',C'     ',C'9801'     IGREQCD       00131500
         DC  X'1806',X'008000000000',C'     ',C'9802'     TSIOERR       00131600
         DC  X'1806',X'010000000000',C'     ',C'9803'     INVREQ        00131700
         DC  X'1806',X'020000000000',C'     ',C'9804'     RETPAGE       00131800
         DC  X'1806',X'E30000000000',C'     ',C'9805'     WRBRK         00131900
         SPACE 2                                                        00132000
*=*-----------------------*=*                                           00132100
*=*   S E N D   P A G E   *=*                                           00132200
*=*-----------------------*=*                                           00132300
         SPACE 2                                                        00132400
         DC  X'1808',X'004000000000',C'     ',C'9806'     IGREQCD       00132500
         DC  X'1808',X'008000000000',C'     ',C'9807'     TSIOERR       00132600
         DC  X'1808',X'010000000000',C'     ',C'9808'     INVREQ        00132700
         DC  X'1808',X'020000000000',C'     ',C'9809'     RETPAGE       00132800
         DC  X'1808',X'E30000000000',C'     ',C'9810'     WRBRK         00132900
         SPACE 2                                                        00133000
*=*-------------------------------*=*                                   00133100
*=*   P U R G E   M E S S A G E   *=*                                   00133200
*=*-------------------------------*=*                                   00133300
         SPACE 2                                                        00133400
         DC  X'180A',X'008000000000',C'     ',C'9811'     TSIOERR       00133500
         DC  X'180A',X'010000000000',C'     ',C'9812'     INVREQ        00133600
         SPACE 2                                                        00133700
*=*----------------*=*                                                  00133800
*=*    R O U T E   *=*                                                  00133900
*=*----------------*=*                                                  00134000
         SPACE 2                                                        00134100
         DC  X'180C',X'001000000000',C'     ',C'9813'     INVLDC        00134200
         DC  X'180C',X'010000000000',C'     ',C'9814'     INVREQ        00134300
         DC  X'180C',X'400000000000',C'     ',C'9815'     RTESOME       00134400
         DC  X'180C',X'200000000000',C'     ',C'9816'     INVERRTERM    00134500
         DC  X'180C',X'800000000000',C'     ',C'9817'     RTEFAIL       00134600
         SPACE 2                                                        00134700
*=*--------------------------------*=*                                  00134800
*=*    R E C E I V E   P A R T N   *=*                                  00134900
*=*--------------------------------*=*                                  00135000
         SPACE 2                                                        00135100
         DC  X'180E',X'000004000000',C'     ',C'9818'     EODS          00135200
         DC  X'180E',X'000008000000',C'     ',C'9819'     EOC           00135300
         DC  X'180E',X'000400000000',C'     ',C'9820'     INVPARTN      00135400
         DC  X'180E',X'010000000000',C'     ',C'9821'     INVREQ        00135500
         DC  X'180E',X'E10000000000',C'     ',C'9822'     LENGERR       00135600
         SPACE 2                                                        00135700
*=*--------------------------------*=*                                  00135800
*=*    S E N D   P A R T N S E T   *=*                                  00135900
*=*--------------------------------*=*                                  00136000
         SPACE 2                                                        00136100
         DC  X'1810',X'000800000000',C'     ',C'9823'     INVPARTNSET   00136200
         DC  X'1810',X'010000000000',C'     ',C'9824'     INVREQ        00136300
         SPACE 2                                                        00136400
*=*-----------------------------*=*                                     00136500
*=*    S E N D   C O N T R O L  *=*                                     00136600
*=*-----------------------------*=*                                     00136700
         SPACE 2                                                        00136800
         DC  X'1812',X'000010000000',C'     ',C'9825'     IGREQID       00136900
         DC  X'1812',X'000400000000',C'     ',C'9826'     INVPARTN      00137000
         DC  X'1812',X'001000000000',C'     ',C'9827'     INVLDC        00137100
         DC  X'1812',X'008000000000',C'     ',C'9828'     TSIOERR       00137200
         DC  X'1812',X'004000000000',C'     ',C'9829'     IGREQCD       00137300
         DC  X'1812',X'010000000000',C'     ',C'9830'     INVREQ        00137400
         DC  X'1812',X'020000000000',C'     ',C'9831'     RETPAGE       00137500
         DC  X'1812',X'E30000000000',C'     ',C'9832'     WRBRK         00137600
         SPACE 2                                                        00137700
*=*------------------------------*=*                                    00137800
*=*    T R A C E   O N / O F F   *=*                                    00137900
*=*------------------------------*=*                                    00138000
         SPACE 2                                                        00138100
         DC  X'1A02',X'E00000000000',C'     ',C'9833'     INVREQ        00138200
         SPACE 2                                                        00138300
*=*----------------*=*                                                  00138400
*=*    E N T E R   *=*                                                  00138500
*=*----------------*=*                                                  00138600
         SPACE 2                                                        00138700
         DC  X'1A04',X'E00000000000',C'     ',C'9834'     INVREQ        00138800
         SPACE 2                                                        00138900
*=*--------------*=*                                                    00139000
*=*    D U M P   *=*                                                    00139100
*=*--------------*=*                                                    00139200
         SPACE 2                                                        00139300
         DC  X'1C02',X'FFFFFFFFFFFF',C'     ',C'9835'                   00139400
         SPACE 2                                                        00139500
*=*----------------------*=*                                            00139600
*=*   I S S U E   A D D  *=*                                            00139700
*=*----------------------*=*                                            00139800
         SPACE 2                                                        00139900
         DC  X'1E02',X'080000000000',C'     ',C'9836'     FUNCERR       00140000
         DC  X'1E02',X'0C0000000000',C'     ',C'9837'     SELNERR       00140100
         DC  X'1E02',X'100000000000',C'     ',C'9838'     UNEXPIN       00140200
         SPACE 2                                                        00140300
*=*---------------------------*=*                                       00140400
*=*   I S S U E   E R A S E   *=*                                       00140500
*=*---------------------------*=*                                       00140600
         SPACE 2                                                        00140700
         DC  X'1E04',X'080000000000',C'     ',C'9839'     FUNCERR       00140800
         DC  X'1E04',X'0C0000000000',C'     ',C'9840'     SELNERR       00140900
         DC  X'1E04',X'100000000000',C'     ',C'9841'     UNEXPIN       00141000
         SPACE 2                                                        00141100
*=*-------------------------------*=*                                   00141200
*=*   I S S U E   R E P L A C E   *=*                                   00141300
*=*-------------------------------*=*                                   00141400
         SPACE 2                                                        00141500
         DC  X'1E06',X'080000000000',C'     ',C'9842'     FUNCERR       00141600
         DC  X'1E06',X'0C0000000000',C'     ',C'9843'     SELNERR       00141700
         DC  X'1E06',X'100000000000',C'     ',C'9844'     UNEXPIN       00141800
         SPACE 2                                                        00141900
*=*---------------------------*=*                                       00142000
*=*   I S S U E   A B O R T   *=*                                       00142100
*=*---------------------------*=*                                       00142200
         SPACE 2                                                        00142300
         DC  X'1E08',X'080000000000',C'     ',C'9845'     FUNCERR       00142400
         DC  X'1E08',X'0C0000000000',C'     ',C'9846'     SELNERR       00142500
         DC  X'1E08',X'100000000000',C'     ',C'9847'     UNEXPIN       00142600
         SPACE 2                                                        00142700
*=*---------------------------*=*                                       00142800
*=*   I S S U E   Q U E R Y   *=*                                       00142900
*=*---------------------------*=*                                       00143000
         SPACE 2                                                        00143100
         DC  X'1E0A',X'080000000000',C'     ',C'9848'     FUNCERR       00143200
         DC  X'1E0A',X'0C0000000000',C'     ',C'9849'     SELNERR       00143300
         DC  X'1E0A',X'100000000000',C'     ',C'9850'     UNEXPIN       00143400
         SPACE 2                                                        00143500
*=*-----------------------*=*                                           00143600
*=*   I S S U E   E N D   *=*                                           00143700
*=*-----------------------*=*                                           00143800
         SPACE 2                                                        00143900
         DC  X'1E0C',X'080000000000',C'     ',C'9851'     FUNCERR       00144000
         DC  X'1E0C',X'0C0000000000',C'     ',C'9852'     SELNERR       00144100
         DC  X'1E0C',X'100000000000',C'     ',C'9853'     UNEXPIN       00144200
         SPACE 2                                                        00144300
*=*-------------------------------*=*                                   00144400
*=*   I S S U E   R E C E I V E   *=*                                   00144500
*=*-------------------------------*=*                                   00144600
         SPACE 2                                                        00144700
         DC  X'1E0E',X'001100000000',C'     ',C'9854'     EODS          00144800
         DC  X'1E0E',X'040000000000',C'     ',C'9855'     DSSTAT        00144900
         DC  X'1E0E',X'100000000000',C'     ',C'9856'     UNEXPIN       00145000
         DC  X'1E0E',X'E10000000000',C'     ',C'9857'     LENGERR       00145100
         SPACE 2                                                        00145200
*=*-------------------------*=*                                         00145300
*=*   I S S U E   N O T E   *=*                                         00145400
*=*-------------------------*=*                                         00145500
         SPACE 2                                                        00145600
         DC  X'1E10',X'080000000000',C'     ',C'9858'     FUNCERR       00145700
         DC  X'1E10',X'0C0000000000',C'     ',C'9859'     SELNERR       00145800
         DC  X'1E10',X'100000000000',C'     ',C'9860'     UNEXPIN       00145900
         SPACE 2                                                        00146000
*=*-------------------------*=*                                         00146100
*=*   I S S U E   W A I T   *=*                                         00146200
*=*-------------------------*=*                                         00146300
         SPACE 2                                                        00146400
         DC  X'1E12',X'080000000000',C'     ',C'9861'     FUNCERR       00146500
         DC  X'1E12',X'0C0000000000',C'     ',C'9862'     SELNERR       00146600
         DC  X'1E12',X'100000000000',C'     ',C'9863'     UNEXPIN       00146700
         SPACE 2                                                        00146800
*=*-------------------------*=*                                         00146900
*=*   I S S U E   S E N D   *=*                                         00147000
*=*-------------------------*=*                                         00147100
         SPACE 2                                                        00147200
         DC  X'1E14',X'080000000000',C'     ',C'9864'     FUNCERR       00147300
         DC  X'1E14',X'0C0000000000',C'     ',C'9865'     SELNERR       00147400
         DC  X'1E14',X'100000000000',C'     ',C'9866'     UNEXPIN       00147500
         DC  X'1E14',X'2B0000000000',C'     ',C'9867'     IGREQCD       00147600
         SPACE 2                                                        00147700
*=*---------------------------*=*                                       00147800
*=*    B I F    D E E D I T   *=*                                       00147900
*=*---------------------------*=*                                       00148000
         SPACE 2                                                        00148100
         DC  X'2002',X'FFFFFFFFFFFF',C'     ',C'9868'                   00148200
         DC  X'FFFF'                                                    00148300