*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
         MACRO                                                          00000100
&N       TSTS9EP &TYPE=,&WR1=,&WR2=,&PW=,&EPW=                          00000200
         AIF   ('&TYPE' EQ 'MACRO').MCRO                                00000300
&N.PKDW  DS    D                                                        00000400
&N.WK4   DS    CL4                                                      00000500
&N.WK11  DS    CL11                                                     00000600
&N.REG1  DS    F                                                        00000700
&N.REG2  DS    F                                                        00000800
.MCRO    ANOP                                                           00000900
         AIF   ('&TYPE' EQ 'STRG').STRG                                 00001000
         ST    &WR1,&N.REG1                                             00001100
         ST    &WR2,&N.REG2                                             00001200
         MVC   &N.WK11,&PW                                              00001300
         LA    &WR1,&N.WK11                                             00001400
         LA    &WR2,11                                                  00001500
         SPACE                                                          00001600
EPNILP00 EQU   *                                                        00001700
         CLI   0(&WR1),C' '                                             00001800
         BE    EPNILP10                                                 00001900
         NI    0(&WR1),X'3F'                                            00002000
         SPACE                                                          00002100
EPNILP10 EQU   *                                                        00002200
         LA    &WR1,1(&WR1)                                             00002300
         BCT   &WR2,EPNILP00                                            00002400
         SPACE                                                          00002500
         MVC   &N.WK4,&N.WK11                                           00002600
         SR    &WR1,&WR1                                                00002700
         L     &WR2,&N.WK4                                              00002800
         SLDL  &WR1,4                                                   00002900
         STM   &WR1,&WR2,&N.PKDW                                        00003000
         OI    &N.PKDW+7,X'0C'                                          00003100
         CVB   &WR1,&N.PKDW                                             00003200
         ST    &WR1,&N.WK4                                              00003300
         MVC   &EPW.(4),&N.WK4                                          00003400
         SPACE                                                          00003500
         MVC   &N.WK4,&N.WK11+4                                         00003600
         SR    &WR1,&WR1                                                00003700
         L     &WR2,&N.WK4                                              00003800
         SLDL  &WR1,4                                                   00003900
         STM   &WR1,&WR2,&N.PKDW                                        00004000
         OI    &N.PKDW+7,X'0C'                                          00004100
         CVB   &WR1,&N.PKDW                                             00004200
         ST    &WR1,&N.WK4                                              00004300
         MVC   &EPW+4(4),&N.WK4                                         00004400
         SPACE                                                          00004500
         MVI   &N.WK4,X'00'                                             00004600
         MVC   &N.WK4+1(3),&N.WK11+8                                    00004700
         SR    &WR1,&WR1                                                00004800
         L     &WR2,&N.WK4                                              00004900
         SLDL  &WR1,4                                                   00005000
         STM   &WR1,&WR2,&N.PKDW                                        00005100
         OI    &N.PKDW+7,X'0C'                                          00005200
         CVB   &WR1,&N.PKDW                                             00005300
         ST    &WR1,&N.WK4                                              00005400
         MVC   &EPW+8(3),&N.WK4+1                                       00005500
         L     &WR1,&N.REG1                                             00005600
         L     &WR2,&N.REG2                                             00005700
         SPACE                                                          00005800
.STRG    ANOP                                                           00005900
         MEND                                                           00006000