*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
**********************************************************************  00000001
*--------------------------------------------------------------------*  00000002
*                  ** HISTORY OF REVISIONS **                        *  00000003
*                                                                    *  00000004
* DATE     DESCRIPTION                                        CHNGID *  00000005
* ________ _________________________________________________  _______*  00000006
*                                                                    *  00000007
* 01/17/95 EXPAND TS MONETARY FIELDS                          2602603*  00000098
**********************************************************************  00000099
*********************************************************************** 00000100
*                                                                     * 00000200
*                   TSTS2S33 --  SYSTEM TRANSACTION                   * 00000300
*                           WIRE TRANSFER                             * 00000400
*                                                                     * 00000500
*********************************************************************** 00000600
         SPACE 2                                                        00000700
TS33     DS    0CL84                 TRANSACTION AREA         2602603   00000800
TS33ACCT DS    CL36                  ACCOUNT NUMBER                     00000900
TS33TRNC DS    CL4                   TRAN CODE                          00001000
*                    VALUE : TS33 - WIRE TRANSFER                       00001100
TS33AMT  DS    0CL17                 TRANSACTION AMOUNT       2602603   00001200
TS33AMT1 DS    CL15                    DOLLARS                2602603   00001300
TS33AMT2 DS    CL2                     CENTS                            00001400
TS33FEE  DS    0CL17                 TRANSFER FEE             2602603   00001500
TS33FEE1 DS    CL15                    DOLLARS                2602603   00001600
TS33FEE2 DS    CL2                     CENTS                            00001700
TS33ABA  DS    CL10                  ABA NUMBER                         00001800