*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
**********************************************************************  00000001
*--------------------------------------------------------------------*  00000002
*                  ** HISTORY OF REVISIONS **                        *  00000003
*                                                                    *  00000004
* DATE     DESCRIPTION                                        CHNGID *  00000005
* ________ _________________________________________________  _______*  00000006
*                                                                    *  00000007
* 01/17/95 EXPAND TS MONETARY FIELDS                          2602603*  00000098
**********************************************************************  00000099
*********************************************************************** 00000100
*                                                                     * 00000200
*                   TSTS2S32 --  SYSTEM TRANSACTION                   * 00000300
*                      MISCELLANEOUS DEBIT/CREDIT                     * 00000400
*                                                                     * 00000500
*********************************************************************** 00000600
         SPACE 2                                                        00000700
TS32     DS    0CL80                 TRANSACTION AREA                   00000800
TS32ACCT DS    CL36                  ACCOUNT NUMBER                     00000900
TS32TRNC DS    CL4                   TRANSACTION CODE                   00001000
*                    VALUE  : TS32 - MISCELLANEOUS DEBIT/CREDIT         00001100
TS32AMT  DS    0CL17                 TRANSACTION AMOUNT       2602603   00001200
TS32AMT1 DS    CL15                    DOLLARS                2602603   00001300
TS32AMT2 DS    CL2                     CENTS                            00001400
TS32CODE DS    C                     DEBIT/CREDIT CODE                  00001500
*                    VALUES : 0 - DEBIT                                 00001600
*                             1 - CREDIT                                00001700
TS32APPL DS    CL2                   APPLICATION                        00001800
TS32BOND DS    C                     BOND INDICATOR                     00001900
*                    VALUES : 0 - NOT A BOND                            00002000
*                             1 - BOND SOLD                             00002100
*                             2 - BOND BOUGHT                           00002200
TS32TIN  DS    CL10                  TAX IDENTIFICATION NUMBER          00002300
TS32HOST DS    CL4                   HOST TRANSACTION CODE              00002400
         DS    CL5                   FILLER                   2602603   00002500