*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*---------------------------------------------------------------------* 00000001
*                  ** COPYBOOK DESCRIPTION **                         * 00000002
*                                                                     * 00000003
*                             TSTS2EID                                * 00000004
*                        TRANSACTION SYSTEM                           * 00000005
*                    EOR ITR DEFAULT MODEL RECORD                     * 00000006
*                                                                     * 00000007
*---------------------------------------------------------------------* 00000008
*                  ** HISTORY OF REVISIONS **                         * 00000009
* DESCRIPTION                                                 CHGID   * 00000011
* __________________________________________________________  _______ * 00000012
*                                                                     * 00000696
* 10/06/00 NEW COPYBOOK                                       2024239 * 00000697
*---------------------------------------------------------------------* 00000698
*                                                                       00000699
TSTSEID  DSECT                                                          00000700
EIDKEY   DS    0CL8         EID KEY                                     00000800
EIDEMP   DS    CL8             EID EMPLOYEE ID                          00000900
EIDMODEL DS    CL4          EID DEFAULT ITR MODEL                       00001000
EIDEORMP DS    CL8          EID DEFAULT EOR MODEL                       00001100
         DS    CL20         FILLER                                      00001200
*                                                                       00001300
EIDEND   EQU   *            SYMBOLIC END OF EID                         00001400
EIDLEN   EQU   *-TSTSEID    SYMBOLIC LENGTH OF EID                      00001500