*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
ORRREC   DS    0C                      / ONLINE REPORT RECORD         / 00000100
ORRCTLS  DS    0XL12                   / ORR CONTROLS FOR REGULAR REPS/ 00000200
ORRCTL1  DS    CL2                     / ORR CONTROL 1                / 00000300
ORRCTL2  DS    CL3                     / ORR CONTROL 2                / 00000400
ORRCTL3  DS    CL3                     / ORR CONTROL 3                / 00000500
ORRCLT4  DS    CL4                     / ORR CONTROL 4                / 00000600
         ORG   ORRCTLS                 / REDEFINE REG CONTROLS        / 00000700
ORRFMCTL DS    0CL12                   / ORR CONTROLS FOR FMS 0833482 / 00000800
ORRCUST  DS    XL2                     / ORR FMS CUSTOMER NUMBER      / 00000900
ORRRC    DS    CL10                    / ORR FMS INTERNALRC   0833482 / 00001000
ORRREPT  DS    0CL8                    / ORR REPORT NAME              / 00001200
ORRAPPL  DS    CL2                     / ORR REPORT APPLICATION       / 00001300
ORRPRGID DS    CL2                     / ORR REPORT PROGRAM ID        / 00001400
ORRPH12  DS    CL2                     / ORR REPORT PHASE 1 - 2       / 00001500
ORRPH34  DS    CL2                     / ORR REPORT PHASE 3 - 4       / 00001600
ORRDATE  DS    XL3                     / ORR REPORT DATE              / 00001700
ORRPGNUM DS    XL3                     / ORR REPORT PAGE NUMBER       / 00001800
ORRLNNUM DS    XL2                     / ORR REPORT LINE NUMBER       / 00001900
ORRLINE  DS    0XL133                  / ORR REPORT LINE AREA         / 00002000
ORRREPCC DS    XL1                     / ORR REPORT CONTROL CHARACTER / 00002100
ORRREPLN DS    XL132                   / ORR REPORT LINE              / 00002200
         DS    XL9                     /                              / 00002300