*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************** 00001000
*  TSTS2PEA - THIS COPYBOOK HAS THE WORKING STORAGE FIELDS USED       * 00002000
*             BY TSTS4PEA FOR CALLING SIPCCDIO TO GET SASIOPTE.       * 00003000
*---------------------------------------------------------------------* 00004000
*                    ** HISTORY OF REVISIONS **                       * 00005000
*                                                                     * 00006000
* DESCRIPTION                                                 CHNGID  * 00007000
* __________________________________________________________  _______ * 00008000
* 12/16/16 INITIAL DISTRIBUTION                                GN7046 * 00009000
*********************************************************************** 00010000
SVREGR9  DS    F                     SAVE R7                            00011000
SVCBOPEA DS    F                     SAVE SACBOPEA                      00012000
WSGSTADR DS    F                     GETSTOR ACQUIRED ADDRESS           00013000
WSGSTRLN DS    F                     GETSTOR REQUEST LENGTH             00014000
WSGSTALN DS    F                     GETSTOR ACQUIRED LENGTH            00015000
WSSACBAD DS    F                     SAVED SACB ADDRESS                 00016000
WSRKAREA DS    40F                   SASERV WORK AREA                   00017000
SAS9FUN2 DS    CL12                  SASERV WORK AREA                   00018000
PARMLIS2 DS    20F                   PARAMETER LIST LINK                00019000
SVOPEDB2 DS    CL1                   DB2 FLAG ON SASIOPTE               00020000