*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************** 00000100
*                                                                     * 00000200
*           TSTS2BKR - BUNKER RAMO BANKTRAN MESSAGE FORMAT            * 00000300
*                                                                     * 00000400
*           THIS COPYBOOK IS USED IN THE FOLLOWING PROGRAMS:          * 00000500
*                                                                     * 00000600
*           TSTSITL3                                                  * 00000700
*                                                                     * 00000800
*********************************************************************** 00000900
         SPACE 2                                                        00001000
*********************************************************************** 00001100
*           BUNKER RAMO BANKTRAN INPUT MESSAGE FORMAT                 * 00001200
*********************************************************************** 00001300
BKRMSG   DS    0CL256                TELLER INPUT MESSAGE               00001400
BCICSID  DS    CL4                   CICS TRANSACTION CODE 'TSBT'       00001500
BSTRNCD  DS    CL4                   START TRANSACTION CODE             00001600
BTELID   DS    CL4                   TELLER ID                          00001700
BSEQNUM  DS    CL4                   TRANSACTION SEQUENCE NUMBER        00001800
BIND1    DS    XL1                   FIRST  STATUS BYTE                 00001900
BIND2    DS    XL1                   SECOND STATUS BYTE                 00002000
BTIME    DS    CL6                   TRANSACTION TIME 'HHMMSS'          00002100
BHDRLNG  EQU   *-BKRMSG              LENGTH OF HEADER                   00002200
         DS    CL232                 REST OF TELLER TRANSMISSION        00002300