*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************** 00001000
*                                                                     * 00002000
*        TSTS2XTC - THIS HEADER WILL OPTIONALLY PRECEDE MESSAGES      * 00003000
*                   THAT ARE CREATED BY XES WHEN A TRANSMISSION       * 00004000
*                   VERSION NUMBER IS PROVIDED IN THE 50 BYTE RPC     * 00005000
*                   HEADER. THE VERSION NUMBER IN THE RPC HEADER      * 00006000
*                   WILL CORRESPOND TO A PREDEFINED XTC LAYOUT.       * 00007000
*                                                                     * 00008000
*********************************************************************** 00009000
*---------------------------------------------------------------------* 00010000
*                  ** HISTORY OF REVISIONS **                         * 00011000
*                                                                     * 00012000
* DESCRIPTION                                                 CHNGID  * 00013000
* __________________________________________________________  _______ * 00014000
*08/09/06 INITIAL RELEASE GN5563                            *           00015000
*---------------------------------------------------------------------* 00016000
TSTSXTC  DSECT                                                          00017000
XTC      DS    0CL40                                                    00018000
XTCEYEC  DS    CL8         EYECATCHER '**XTC***'                        00019000
XTCVERSN DS    CL1         VERSION 1                                    00020000
XTCHDRLN DS    CL3         HEADER LENGTH, V1 = 040                      00021000
XTCCOMPR DS    CL1         COMPRESSION FLAG Y/N                         00022000
XTCUNCMP DS    CL6         UNCOMPRESSED DATA LENGTH                     00023000
         DS    CL21        FILLER                                       00024000
XTCLEN   EQU   *-XTC       LENGTH OF HEADER                             00025000