*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*****************************************************************       00000100
*                                                               *       00000200
*                TRANSACTION SYSTEM                             *       00000300
*    CHANGE CONTROLS COMMUNICATIONS AREA COPYBOOK               *       00000400
*                                                               *       00000500
*****************************************************************       00000600
* 04/01/00  SER CLASS FROM TSTSVCM1                           2021255   00000650
VCMCA    DSECT                                                          00000700
VCMVCSER DS    CL10                    SER ADDRESS            2021255   00000750
VCMITRAD DS    XL4                     ITR ADDRESS                      00000800
VCMQSIAD DS    XL4                     QSI ADDRESS                      00000900
VCMLGH   DS    XL2                     CA LENGTH                        00001000
VCMPRCD  DS    CL1                     PROCESS CODE                     00001100
*                                        0 - NO LOOKUP NEEDED           00001200
*                                        1 - AOR LOOKUP REQUIRED        00001300
*                                        2 - VCR LOOKUP REQUIRED        00001400
VCMVCRCL DS    CL10                    VCR CLASS                        00001500
VCMRCO   DS    CL1                     RETURN CODE                      00001600
*                                        0 - GOOD RETURN                00001700
*                                        1 - INVALID CONTROLS           00001800
*                                        2 - NO APPL MATCH, GOOD RETURN 00001900
*                                        3 - AOR RECORD NOT FOUND       00002000
*                                        4 - NO. OF CONTROLS ZERO       00002100
*                                        5 - TS QUEUE NOT FOUND - TSEJ  00002200
*                                        6 - INCORE LOAD - TSEJ         00002300
*                                        7 - CICS ERROR - TSEJ          00002400
VCMCCNM  DS    XL2                     NUMBER OF CONTROL ENTRIES        00002500
         DS    CL2                     FILLER                           00002600
VCMAPLDT DS    CL6840                  120 APPL OCCURENCES    2501474   00002700
*                                      DATA - DESCRIBED BY VCMAPLDS     00002800
VCMEND   EQU   *                       SYMBOLIC END OF VCM              00002900
VCMLEN   EQU   *-VCMITRAD              SYMBOLIC LENGTH OF VCM           00003000
         SPACE                                                          00003100
*****************************************************************       00003200
*          ONE OCCURRENCE OF APPLIATION DATA                    *       00003300
*****************************************************************       00003400
         SPACE                                                          00003500
VCMAPLDS DSECT                                                          00003600
VCMAORAD DS    XL4                     RETURNED AOR ADDRESS             00003700
VCMAPPL  DS    CL2                     APPLICATION                      00003800
VCMAPACT DS    CL50                    NEW CONTROLS                     00003900
VCMRC    DS    CL1                     RETURN CODE                      00004100
*                                        0 - GOOD RETURN                00004200
*                                        1 - INVALID CONTROLS           00004300
*                                        2 - NO APPL MATCH, GOOD RETURN 00004400
*                                        3 - AOR RECORD NOT FOUND       00004500
VCMAPLG  EQU   *-VCMAORAD              SYMBOLIC LENGTH OF OCCURRENCE    00004700