*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
         MACRO                                                          00000100
         TSTS9PK &WRK9=,&WRK17=                                         00000200
.*********************************************************************  00000300
.*        PACK 17 BYTE FIELD INTO A 9 BYTE FIELD                     *  00000400
.*********************************************************************  00000500
.*                                                                   *  00000600
.*        WRK9  =  9 BYTE PACKED AREA                                *  00000700
.*        WRK17 =  17 BYTE AREA UNPACKED                             *  00000800
.*                                                                   *  00000900
.*********************************************************************  00001000
         PACK  &WRK9+7(2),&WRK17.(2)    PACK HIGHER ORDER 2 BYTES       00001100
         MVO   &WRK9.(2),&WRK9+7(2)     MOVE HIGH ORDER 2 BYTES         00001200
         PACK  &WRK9+1(8),&WRK17+2(15)   PACK LOWER ORDER 15 BYTES      00001300
         DS    0H                                                       00001400
         SPACE                                                          00001500
         MEND                                                           00001600