*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*****************************************************************       00000100
*                                                               *       00000200
*                            TSTS2WAI                         0803371   00000300
*                       TRANSACTION SYSTEM                    0803371   00000400
*              FUNCTION KEY TRANSLATE TABLE COPYBOOK          0803371   00000500
*****************************************************************       00000600
FKTAB    DS    0CL180              FUNCTION KEY TRANSLATE TABLE         00000700
FKTABEN  DS    0CL6                FUNCTION KEY TABLE ENTRY             00000800
FKTABHX  DC    X'7D'               FUNCTION KEY HEX VALUE               00000900
FKTABDE  DC    C'ENTER'            FUNCTION KEY DESCRIPTION             00001000
         DC    X'6D',C'CLEAR'                                           00001100
         DC    X'6C',C'PA1  '                                           00001200
         DC    X'6E',C'PA2  '                                           00001300
         DC    X'6B',C'PA3  '                                           00001400
         DC    X'F1',C'PF1  '                                           00001500
         DC    X'F2',C'PF2  '                                           00001600
         DC    X'F3',C'PF3  '                                           00001700
         DC    X'F4',C'PF4  '                                           00001800
         DC    X'F5',C'PF5  '                                           00001900
         DC    X'F6',C'PF6  '                                           00002000
         DC    X'F7',C'PF7  '                                           00002100
         DC    X'F8',C'PF8  '                                           00002200
         DC    X'F9',C'PF9  '                                           00002300
         DC    X'7A',C'PF10 '                                           00002400
         DC    X'7B',C'PF11 '                                           00002500
         DC    X'7C',C'PF12 '                                           00002600
         DC    X'C1',C'PF13 '                                           00002700
         DC    X'C2',C'PF14 '                                           00002800
         DC    X'C3',C'PF15 '                                           00002900
         DC    X'C4',C'PF16 '                                           00003000
         DC    X'C5',C'PF17 '                                           00003100
         DC    X'C6',C'PF18 '                                           00003200
         DC    X'C7',C'PF19 '                                           00003300
         DC    X'C8',C'PF20 '                                           00003400
         DC    X'C9',C'PF21 '                                           00003500
         DC    X'4A',C'PF22 '                                           00003600
         DC    X'4B',C'PF23 '                                           00003700
         DC    X'4C',C'PF24 '                                           00003800
         DC    X'FF'                                                    00003900