*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*****************************************************************       00000100
*  THIS COPYBOOK CONTAINS THE INSTITUTION'S DEFAULT ATTRIBUTES  *       00000200
*  FOR SCREEN PAINTING AND MAINTAINANCE.  IT ALSO CONTAINS THE  *       00000300
*  SYMBOL USED TO DENOTE A KEYABLE FIELD.                       *       00000400
*****************************************************************       00000500
ATRDEFAT DS   0CL16                                                     00000600
ATRKEYFS DC    X'E0'                   KEYABLE FIELD SYMBOL(BACKSLASH)  00000700
ATRLITFS DC    X'C0'                   LITERAL FIELD SYMBOL(LEFT BRACE) 00000800
ATRDSPFS DC    X'4C'                   DISPLAY FIELD SYMBOL(LESS THAN)  00000900
ATRFLCHR DC    X'79'                   SCREEN FILL CHARACTER (ACCENT)   00001000
ATRPLITR DC    C'0'                    PROT LITERAL FIELD ATTR          00001100
ATRPLCLR DC    X'00'                   PROT LITERAL EXT COLOR ATTR      00001200
ATRPLHIL DC    X'00'                   PROT LITERAL EXT HILIGHT ATR     00001300
ATRPDSPY DC    C'8'                    PROT DISPLAY FIELD ATTR          00001400
ATRPDCLR DC    X'00'                   PROT DISPLAY EXT COLOR ATTR      00001500
ATRPDHIL DC    X'00'                   PROT DISPLAY EXT HILIGHT ATR     00001600
ATRUALPH DC    C'H'                    UNPROT ALPHANUM FIELD ATTR       00001700
ATRUACLR DC    X'00'                   UNPROT ALPHANUM EXT COLOR ATTR   00001800
ATRUAHIL DC    X'00'                   UNPROT ALPHANUM EXT HILIGHT ATR  00001900
ATRUNUMR DC    C'Q'                    UNPROT NUMERIC FIELD ATTR        00002000
ATRUNCLR DC    X'00'                   UNPROT NUMERIC EXT COLOR ATTR    00002100
ATRUNHIL DC    X'00'                   UNPROT NUMERIC EXT HILIGHT ATR   00002200