*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*---------------------------------------------------------------------* 00000100
*  04/01/88, 15:00                                                    * 00000200
*                            TSTS2CEC                                 * 00000300
*                       TRANSACTION SYSTEM                            * 00000400
*                  ERROR LOOKUP REQUEST BLOCK                         * 00000500
*---------------------------------------------------------------------* 00000600
         SPACE 2                                                        00000700
CER      EQU   *                                                        00000800
CEREIBFN DS    CL2                   FUNCTION CODE FROM EIB             00000900
CEREIBRC DS    CL6                   RESPONSE CODE FROM EIB             00001000
CERERMSG DS    CL37                  MESSAGE FORMATTED BY TSTSCER1      00001100
         DS    CL25                  FILLER                             00001200
CERLEN   EQU   *-CER                 SYMBOLIC LENGTH OF REQUEST BLOCK   00001300