*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
******************************************************************      00000100
*                                                                *      00000200
*                    TRANSACTION SYSTEM                       0803037   00000300
*                                                                *      00000400
*               SET BUFFER ADDRESS WORK COPYBOOK              0803037   00000500
*                                                                *      00000600
******************************************************************      00000700
SBATAB   DC    X'40C1C2C3C4C5C6C7C8C9'                                  00000800
         DC    X'4A4B4C4D4E4F50D1D2D3'                                  00000900
         DC    X'D4D5D6D7D8D95A5B5C5D'                                  00001000
         DC    X'5E5F6061E2E3E4E5E6E7'                                  00001100
         DC    X'E8E96A6B6C6D6E6FF0F1'                                  00001200
         DC    X'F2F3F4F5F6F7F8F97A7B'                                  00001300
         DC    X'7C7D7E7F'                                              00001400