*     * 802262 12/11/20 PROYECTO UPGRADE GN172 EDVR
*********************************************************************** 00000100
*                                                                     * 00000200
*                      TRANSACTION SYSTEM                             * 00000300
* THE FOLLOWING STATEMENT(S) MODIFIED BY                      0324492   00000399
*                 USER OPTION SHORT VERSION ONLINE RECORD LAYOUT      * 00000400
*                                                                     * 00000402
*********************************************************************** 00000404
*                       *** HISTORY REVISION ***                      * 00000406
*  09/03/02   ADD COMMENTS & BREAK OUT TABLE ENTRIES          0324492 * 00000484
*********************************************************************** 00000486
*                                                                     * 00000488
*   THIS COPYBOOK IS THE SHORT VERSION OF TSWSUBTB.  IT IS USED       * 00000490
*   BY TSUOADDR, FOR BACKWARD COMPATIBILITY.  ONLY MODULES THAT       * 00000492
*   ACCESSED TSUOADDR PRIOR TO THE EXPANDED LAYOUT SHOULD             * 00000494
*   USE THIS COPYBOOK.  ALL NEW DEVELOPEMENT SHOULD  BE DONE          * 00000496
*   USING TSUO2TBE, THE EXPANDED VERSION.                             * 00000498
*                                                                     * 00000500
*********************************************************************** 00000600
TSUOTB   DSECT                                                          00000700
UOTB     DS    0CL1014                 USER OPTION TABLE                00000800
UOTBKEY  DS    0CL14                   APPLICATION & CONTROLS KEY       00000900
UOTBAPPL DS    XL2                       APPLICATION                    00001000
UOTBCTL1 DS    XL4                       CONTROL 1                      00001100
UOTBCTL2 DS    XL4                       CONTROL 2                      00001200
UOTBCTL3 DS    XL4                       CONTROL 3                      00001300
UOTBFLGS DS   0XL1000                   USER OPTION FLAGS     0324492   00001400
UOTBFLG  DS    CL1                       USER OPTION FLAG     0324492   00001410
UOTBOCCL EQU   *-UOTBFLG              SYMBOLIC END OF OCCURS  0324492   00001420
UOTBREST DS    CL999                  REST OF OCCURRENCES     0324492   00001430
UOTBEND  EQU   *                        SYMBOLIC END OF UO TABLE        00001500
UOTBLEN  EQU   *-UOTB                   LENGTH OF UO TABLE              00001600