         MACRO                                                          00000100
&LABEL   ZZMACA4 &RC=0                                                  00000200
&LABEL   L     13,4(0,13)                                               00000300
         RETURN (14,12)                                                 00000400
         MEND                                                           00000500